mu 408
n 292
ku 275
nga 225
ne 193
nti 189
ng 126
e 99
abantu 93
era 82
bwe 79
y 69
akawuka 58
wa 58
buli 52
ate 51
ssente 47
ya 45
siriimu 43
naye 39
bw 37
yagambye 37
kino 36
kyokka 36
be 34
gye 34
pulezidenti 34
kubanga 33
bobi 32
w 32
eddagala 31
eno 31
omu 31
yabadde 31
ye 31
000 30
ba 30
gw 30
olw 30
alina 29
ky 29
poliisi 28
oba 27
abadde 26
bino 26
kya 26
gavumenti 25
gy 25
museveni 25
okukola 25
iran 24
we 24
abalina 23
balina 23
bantu 23
g 23
kye 23
za 23
uganda 22
emyaka 21
essigiri 21
ka 21
omuntu 21
ono 21
1 20
by 20
disitulikiti 20
ez 20
okuva 20
agamba 19
lya 19
wadde 19
wine 19
2 18
amasasi 18
gwe 18
muntu 18
nnyo 18
olwo 18
omwana 18
abalala 17
abamu 17
amaanyi 17
bagenda 17
bangi 17
bonna 17
ebintu 17
enguzi 17
gwa 17
kyagulanyi 17
nrm 17
okufuna 17
oluvannyuma 17
wabula 17
wakati 17
ze 17
dr 16
kano 16
kuba 16
yategeezezza 16
aba 15
kayunga 15
omuwendo 15
abakulembeze 14
akulira 14
bali 14
ebirala 14
emmotoka 14
enjawulo 14
ggwanga 14
lwa 14
mmotoka 14
obulwadde 14
z 14
abaserikale 13
bukedde 13
bya 13
eby 13
embeera 13
emu 13
lw 13
maaso 13
okutuuka 13
abavubuka 12
bwa 12
ddwaaliro 12
eky 12
ekya 12
ensonga 12
eri 12
guno 12
janista 12
kawuka 12
kw 12
kwe 12
ly 12
ngeri 12
nsonga 12
obulamu 12
obulungi 12
waliwo 12
100 11
agenda 11
akalulu 11
akatale 11
bbomu 11
bitundu 11
k 11
kampala 11
kati 11
kyotera 11
lwaki 11
naddala 11
okuli 11
okusinziira 11
ssigiri 11
yali 11
30 10
500 10
ab 10
abasajja 10
akakiiko 10
ali 10
b 10
ekyuma 10
ga 10
kampeyini 10
minisita 10
okukuba 10
okunoonyereza 10
oyo 10
pallisa 10
tulina 10
20 9
5 9
abasawo 9
abasuubuzi 9
akola 9
amasannyalaze 9
bye 9
central 9
ddala 9
ebyuma 9
eggwanga 9
ekibiina 9
emirimu 9
engeri 9
enjuba 9
nabo 9
okuba 9
okumanya 9
okusinga 9
oyinza 9
zonna 9
4 8
abakyala 8
abalwadde 8
abawagizi 8
abawala 8
amateeka 8
and 8
baagala 8
bakola 8
corona 8
erya 8
gano 8
jjajja 8
kcca 8
kkampuni 8
kusasula 8
malwaliro 8
masaka 8
mbayo 8
nakalema 8
nukiriya 8
okukwatibwa 8
omuliro 8
owa 8
wamu 8
yonna 8
abakozi 7
abayizi 7
bagamba 7
bano 7
bulungi 7
ebinyeebwa 7
ebitundu 7
ebyokulonda 7
effujjo 7
ekitundu 7
enkola 7
ensi 7
eziri 7
ge 7
hajati 7
jinja 7
kiseera 7
kitegeeza 7
kkooti 7
kwekalakaasa 7
lukwago 7
lwe 7
minisitule 7
musoba 7
mwe 7
ntebe 7
ofiisi 7
okwongera 7
omubaka 7
omugenzi 7
omukyala 7
omulala 7
omulambo 7
omuli 7
omulimu 7
osobola 7
ow 7
ppaaka 7
si 7
ssinga 7
ttiyaggaasi 7
wansi 7
zaabwe 7
3 6
abaana 6
abagenda 6
abali 6
abangi 6
abatemu 6
abeera 6
agambye 6
akaleeta 6
asabye 6
ategeeza 6
ayogera 6
baabadde 6
bamaze 6
banne 6
bifo 6
bungi 6
ebibiina 6
ebigezo 6
ebitongole 6
egenda 6
ekitongole 6
emmundu 6
endala 6
eya 6
eyali 6
eyo 6
kifo 6
lunaku 6
maka 6
mawanda 6
mohsen 6
mulimu 6
mutabani 6
myaka 6
na 6
nkola 6
ntobazzi 6
of 6
okubeera 6
okulwanyisa 6
okumira 6
okusiiga 6
okutandika 6
okutuusa 6
okwekalakaasa 6
omuceere 6
omutindo 6
robert 6
siirimu 6
ssaabasumba 6
ssentebe 6
tewali 6
ttakisi 6
wiiki 6
yisirayiri 6
10 5
2021 5
6 5
aana 5
abakuumi 5
abalenzi 5
ajja 5
aka 5
akoze 5
anti-corruption 5
azze 5
baali 5
babadde 5
babeera 5
baddereeva 5
bebe 5
buikwe 5
bulijjo 5
buno 5
busia 5
byabwe 5
byonna 5
cool 5
ebiri 5
ebiso 5
ebyokwerinda 5
ekifo 5
ekiseera 5
ekyo 5
emabega 5
embaawo 5
ennaku 5
essimu 5
john 5
kakiiko 5
katale 5
kato 5
katonda 5
kigambibwa 5
kitundu 5
kizibu 5
kkiro 5
kulwanyisa 5
kuno 5
kwa 5
kyabadde 5
kyabwe 5
leero 5
liigi 5
maanyi 5
mangu 5
market 5
mukenenya 5
munaana 5
muwendo 5
myezi 5
nakyo 5
nalukenge 5
nnyina 5
nsi 5
nup 5
obujjanjabi 5
obujulizi 5
obukadde 5
obulala 5
okuddamu 5
okufa 5
okukebera 5
okukozesa 5
okuliyirira 5
okumuloopera 5
okusasula 5
okwetooloola 5
olukungaana 5
omulundi 5
omuvubuka 5
omwaka 5
ssekukkulu 5
talina 5
wange 5
zigenda 5
zino 5
2020 4
24 4
7 4
abaabadde 4
abakazi 4
abasaabaze 4
abasinga 4
abattakisi 4
abeebyokwerinda 4
abo 4
afrika 4
ag 4
aids 4
akyali 4
amagulu 4
amanda 4
amanyiddwa 4
amaze 4
asaba 4
awo 4
baba 4
bakolagana 4
bana 4
bannaddiini 4
basaba 4
bavubuka 4
bayimiridde 4
bayinza 4
bbeeyi 4
bizinensi 4
bo 4
bp 4
budde 4
buganda 4
bulamu 4
bulwadde 4
coalition 4
ddereeva 4
december 4
ebikozesebwa 4
ebikwata 4
ebimu 4
ebirwanyisa 4
ebyenfuna 4
ebyokulwanyisa 4
ekipooli 4
ekyoto 4
emirundi 4
emmere 4
endagaano 4
enkoko 4
enkulaakulana 4
ennyo 4
ensimbi 4
entegeka 4
ey 4
eyabadde 4
eyongera 4
ezo 4
fakhrizadeh 4
famire 4
gabula 4
gganda 4
gya 4
hajji 4
international 4
kale 4
katikkiro 4
ke 4
keebase 4
kibuga 4
kiddiridde 4
kikyamu 4
kubeera 4
kuliko 4
kulya 4
kusiiga 4
luno 4
lwanga 4
maama 4
magic 4
march 4
mary 4
mayambala 4
mbeera 4
mossad 4
mukono 4
mukwano 4
mulamu 4
munnassaayansi 4
musaayi 4
mwaka 4
namaato 4
nantongo 4
ndowooza 4
nnyumba 4
obeera 4
obutale 4
obuwumbi 4
obuzibu 4
obwapulezidenti 4
ogw 4
okudda 4
okukomya 4
okukwata 4
okulaba 4
okunoonya 4
okusoomoozebwa 4
okutta 4
okuyita 4
okuzimba 4
okwekebeza 4
okwewala 4
okwogera 4
olukung 4
olukwe 4
omumyuka 4
omupiira 4
omusumba 4
omwezi 4
omwogezi 4
pamiti 4
singa 4
south 4
ssaako 4
ssekikubo 4
standard 4
tewakyali 4
tusobola 4
twagala 4
weeriri 4
yakubiddwa 4
yasabye 4
yasse 4
12 3
200 3
2030 3
31 3
35 3
50 3
8 3
9 3
95 3
abaabwe 3
abaafiirwa 3
abaagalana 3
abalamu 3
abattiddwa 3
abatuuze 3
abbo 3
abeekalakaasa 3
action 3
addamu 3
aga 3
agenze 3
akabanga 3
akawungeezi 3
akozesa 3
amagezi 3
amangu 3
amasomero 3
amawanga 3
amayinja 3
amazzi 3
amerika 3
amira 3
april 3
atandikirawo 3
awamu 3
aweesa 3
ayagala 3
baasabye 3
baasoose 3
babasaba 3
babiri 3
bafuna 3
bakasitoma 3
bakungu 3
bannaabwe 3
bannayuganda 3
banyirira 3
basse 3
batandika 3
batwala 3
bazudde 3
beesimbyewo 3
bendera 3
bubiri 3
bunyoro 3
butanwa 3
buvuddeko 3
bwangu 3
dan 3
daniel 3
ddembe 3
ebadde 3
ebbanga 3
ebirungi 3
ebitanda 3
ebyabwe 3
ebyetaagisa 3
ebyobulamu 3
eddala 3
eddoboozi 3
eggulo 3
ekibalo 3
ekibuga 3
ekiwujjo 3
ekiyinza 3
ekkubo 3
embaga 3
emimwa 3
emipiira 3
emiti 3
empaka 3
enguudo 3
enjazi 3
enteekateeka 3
erimu 3
eriweweeza 3
esobola 3
essasi 3
essaza 3
ewedde 3
eyeesimbyewo 3
eziva 3
ffenna 3
figure 3
full 3
ggwe 3
gombe 3
gumu 3
gwabwe 3
gwazuuliddwa 3
health 3
hiriga 3
iii 3
isma 3
kafulu 3
kaseera 3
kasita 3
katabi 3
kazibwe 3
kiba 3
kibeera 3
kibuku 3
kimu 3
kintu 3
kisaawe 3
kisoboka 3
kitongole 3
kiva 3
kiyinza 3
kukola 3
kulaba 3
kutandika 3
kuteekawo 3
kyali 3
lewis 3
lino 3
lubaga 3
luguudo 3
lukiiko 3
lumu 3
luvannyuma 3
lwokuna 3
lwokutaano 3
lye 3
lyonna 3
makya 3
manda 3
mbaawo 3
mega 3
mingi 3
mirembe 3
mpeke 3
mubiri 3
mulago 3
mulala 3
munne 3
musajja 3
mutendera 3
mutima 3
muwala 3
mw 3
mwezi 3
nairobi 3
nalufenya 3
nelson 3
newankubadde 3
nfeete 3
nguudo 3
nnyingi 3
november 3
nsozi 3
ntinda 3
nze 3
obubaka 3
obungi 3
obutatya 3
obuwunga 3
obuyambi 3
ojja 3
oku 3
okugula 3
okugwa 3
okukakasa 3
okukekkereza 3
okukolebwa 3
okukuma 3
okulima 3
okulinnya 3
okulonda 3
okumpi 3
okunoonyeza 3
okusaasaana 3
okutambula 3
okutemula 3
okutuukiriza 3
okutya 3
okuvaayo 3
okwenyigira 3
okwetaba 3
okwetangira 3
olaba 3
oli 3
olunaku 3
olwa 3
omukisa 3
omukwano 3
omulembe 3
omusaayi 3
omuserikale 3
omusomesa 3
omutima 3
ssekandi 3
ssessanga 3
ssetwalo 3
sudan 3
supermarket 3
the 3
ttiimu 3
ubf 3
uneb 3
university 3
weesanga 3
yakola 3
yakubye 3
yalabudde 3
yavudde 3
yayogedde 3
zaake 3
zokka 3
105 2
13 2
15 2
2015 2
26 2
3-1 2
34 2
54 2
70 2
886 2
abaakeberwa 2
abaako 2
abaakosebwa 2
ababikulira 2
abafiiriddwa 2
abakessi 2
abakola 2
abakugu 2
abakungu 2
abakungubazi 2
abaliko 2
abalimi 2
abalumba 2
abalya 2
abanene 2
abasaanyawo 2
abasukka 2
abavubi 2
abazadde 2
abeenyigira 2
abine 2
abuuza 2
abuze 2
adduka 2
afa 2
african 2
afunayo 2
afunye 2
agaaniddwa 2
agattako 2
agency 2
aggalirwe 2
aid 2
akalwanyisa 2
akazibu 2
ako 2
akuba 2
akubiriza 2
alinga 2
amaaso 2
amagye 2
amakolero 2
amalwaliro 2
amanya 2
amasekkati 2
amayonjo 2
amber 2
amukuba 2
annyonnyola 2
ant 2
arvs 2
asobola 2
assa 2
atambula 2
atandika 2
atuula 2
atuuse 2
atwala 2
avuddeyo 2
avumiridde 2
awaka 2
awalala 2
awatali 2
awera 2
ayimiridde 2
ayita 2
baabwe 2
baafunye 2
baakakasizza 2
baakebedde 2
baakubye 2
baamanya 2
baamugaanyi 2
baamunaaza 2
baanukudde 2
baasanze 2
baasimbibwa 2
baategeezezza 2
baatuuzizza 2
baazikkiriziganyaako 2
babba 2
babeerawo 2
babitundira 2
babu 2
baddemu 2
bagenze 2
bajja 2
bakimanye 2
bakimanyi 2
bakomye 2
bakuba 2
bakyala 2
balaba 2
balala 2
bamanyi 2
bamira 2
bamubuulire 2
bamuloopera 2
bamusindika 2
banene 2
bannakampala 2
banoonyereza 2
baptist 2
basabye 2
baserikale 2
basobola 2
basobole 2
batakikola 2
bateekeddwa 2
batemu 2
batwalibwa 2
batya 2
bavuga 2
bawa 2
bayita 2
bayitamu 2
bayizi 2
bbaatule 2
bbaatuule 2
bbula 2
bbulooka 2
beekalakaasa 2
beeyita 2
bikola 2
bikolwa 2
bikozesebwa 2
bimu 2
bingi 2
bintu 2
biseera 2
bongera 2
boxing 2
bubonero 2
buggya 2
bukedi 2
bulaaya 2
buseere 2
bwabadde 2
bwaise 2
bwapulezidenti 2
bwati 2
bweyongera 2
bwongera 2
byabadde 2
byekwaso 2
byeyambisibwa 2
byuma 2
cecafa 2
charles 2
chart 2
christopher 2
col 2
commission 2
comprehensive 2
convetion 2
courts 2
dashboard 2
ddaala 2
ddagala 2
ddamulira 2
ddiguli 2
dduyiro 2
development 2
ebbula 2
ebibanja 2
ebifo 2
ebigambo 2
ebikessi 2
ebikolwa 2
ebikonde 2
ebiruubirirwa 2
ebisinga 2
ebiteekebwa 2
ebweru 2
ebya 2
ebyabadde 2
ebyafaayo 2
ebyenguudo 2
ebyenjawulo 2
ebyo 2
ebyoto 2
edith 2
egamba 2
eggombolola 2
eggye 2
egikwatagana 2
eka 2
ekiddako 2
ekigatta 2
ekika 2
ekikola 2
ekikula 2
ekintu 2
ekipande 2
ekirooto 2
ekirwadde 2
ekitegeeza 2
ekiwundu 2
ekiwunya 2
ekizibu 2
eklezia 2
ekoze 2
ekwata 2
ekyalo 2
embi 2
emikono 2
emirembe 2
emisanvu 2
emisuwa 2
empewo 2
empya 2
emusaasaanyizaako 2
endabirwamu 2
enduulu 2
engineering 2
enkugaana 2
ennamba 2
ennene 2
ennono 2
ensaano 2
ensaasaanya 2
entambula 2
entandikwa 2
entuufu 2
eraga 2
eriwo 2
esatu 2
esibiddeko 2
essaawa 2
ewa 2
exposure 2
eyakubiddwa 2
eyamuweebwa 2
eyookusatu 2
ezeebitundu 2
ezigenda 2
ezikoleddwa 2
ezimu 2
ezisinga 2
fayinolo 2
fayiro 2
ffe 2
for 2
fr 2
francis 2
gakola 2
gali 2
gayamba 2
gen 2
gender 2
ggoolo 2
godfrey 2
gwabadde 2
gyabwe 2
hamilton 2
hippos 2
hiv 2
hospital 2
i 2
ii 2
in 2
index 2
janat 2
january 2
jennifer 2
jesus 2
jjiimu 2
joe 2
june 2
kaabwe 2
kaadi 2
kaba 2
kabale 2
kabuga 2
kafeero 2
kaggwa 2
kakooza 2
kalangala 2
kalimu 2
kalonda 2
kalule 2
kalulu 2
kalungu 2
kamu 2
kasese 2
katumba 2
kaweefube 2
kayondo 2
kazannyo 2
kazigo 2
kenya 2
kibaate 2
kibadde 2
kibi 2
kibiina 2
kigungu 2
kika 2
kikopo 2
kiraga 2
kireetedde 2
kiri 2
kiro 2
kisaana 2
kisenyi 2
kisipi 2
kitebe 2
kitebi 2
kivudde 2
kiwanda 2
kiwanuka 2
kkava 2
kkomera 2
kkono 2
kkubo 2
klezia 2
kuddamu 2
kugende 2
kukolebwa 2
kumusasula 2
kumusobyako 2
kunoonyereza 2
kusabira 2
kuwangula 2
kwegatta 2
kwerabira 2
kwokya 2
kwongera 2
kwonoona 2
kwossa 2
kyakusatu 2
kyalo 2
kyazike 2
kyetaaga 2
kyonna 2
liiso 2
lipoota 2
loodi 2
lt 2
lugazi 2
lutaaya 2
luuka 2
lwanoga 2
lwategekeddwa 2
lwere 2
lyabwe 2
lyaffe 2
lyantonde 2
lyebasa 2
makerere 2
margaret 2
masannyalaze 2
masasi 2
masiki 2
masomero 2
mateeka 2
matembe 2
mawanga 2
mayinja 2
mbagirawo 2
mbarara 2
mbi 2
mikka 2
miria 2
mityana 2
mmande 2
moses 2
mpaka 2
mpigi 2
mpozzi 2
mpulira 2
mudiope 2
muhangi 2
mukaaga 2
mukolo 2
mukomye 2
mukozi 2
muliraano 2
mulwadde 2
munisipaali 2
mupiira 2
mupya 2
musa 2
musooba 2
mustafa 2
muto 2
mutto 2
muzigo 2
mwana 2
nabadde 2
naggalama 2
nago 2
nakato 2
nakiwogo 2
namuyangu 2
nange 2
nansana 2
nansubuga 2
national 2
nayo 2
ndeeba 2
nema 2
nkutte 2
nnazaala 2
noolwekyo 2
nsimbi 2
nsubuga 2
number 2
obama 2
obiguza 2
obisabika 2
obudde 2
obupiira 2
obutakkaanya 2
obutebenkevu 2
obutemu 2
obuwagizi 2
obuweereza 2
obuwuka 2
obwa 2
obwannakyewa 2
obwavu 2
ogenda 2
oggyeeko 2
ogwategekeddwa 2
ogwatuumiddwa 2
ogwokubiri 2
okola 2
okolamu 2
okozesa 2
okubaawo 2
okubakolera 2
okubeerawo 2
okubifunamu 2
okubisekula 2
okubutukabutuka 2
okugaba 2
okugenda 2
okugifuula 2
okukendeeza 2
okukubagiza 2
okukubwa 2
okukulunga 2
okukuza 2
okuliwa 2
okuloopa 2
okulumya 2
okumala 2
okumugaana 2
okunenya 2
okunnyonnyola 2
okunywa 2
okusajjula 2
okusala 2
okusobola 2
okusoma 2
okussa 2
okutaasa 2
okutegeera 2
okutereka 2
okutongoza 2
okutu 2
okutuukirira 2
okutuula 2
okuwandiisa 2
okuwangaala 2
okuweesa 2
okuwona 2
okuyamba 2
okuyingiza 2
okuziweesa 2
okuziyiza 2
okuzuula 2
okwa 2
okwambala 2
okwegatta 2
okwekozesa 2
okwekwasa 2
okwemugulunya 2
okweyongera 2
okwonoona 2
olina 2
oluggi 2
olukoba 2
olukuhhaana 2
oluusi 2
oluvuganya 2
oluyimba 2
olwetabiddwaamu 2
omanyi 2
omubeezi 2
omuggalo 2
omukazi 2
omukozi 2
omukuumi 2
omupya 2
omusajja 2
omusenyu 2
omusolo 2
omutawaana 2
omutemu 2
omuwagizi 2
omuwala 2
omwabadde 2
omwami 2
osanga 2
otunda 2
otunuulira 2
otya 2
ova 2
owookusatu 2
oyerwot 2
ozuulibwa 2
p7 2
palamenti 2
patrick 2
peter 2
polof 2
primary 2
prophylaxis 2
pulojekiti 2
rakai 2
reporting 2
revolutionary 2
rose 2
route 2
s 2
s4 2
s6 2
sayizi 2
school 2
sheikh 2
so 2
ssande 2
ssemateeka 2
ssembabule 2
ssempala 2
ssimu 2
ssomero 2
tanzania 2
tasobola 2
tebalina 2
teekawo 2
tekabakwatako 2
tekinologiya 2
tesosola 2
test 2
tetusobola 2
tolina 2
tosobola 2
transparency 2
treat 2
trump 2
ttaka 2
ttendekero 2
ttuleera 2
tuba 2
tubadde 2
tubamanyi 2
tuddayo 2
tugakozesa 2
tugitunda 2
tusobole 2
tuyita 2
tuzimba 2
twafuna 2
twasoma 2
twogera 2
ugachick 2
utrada 2
waakiri 2
waffe 2
wakiso 2
wandegeya 2
wano 2
weetaaga 2
wines 2
wooteeri 2
yabakwata 2
yaffe 2
yafuna 2
yagasseeko 2
yagenda 2
yaliko 2
yasoose 2
yateekawo 2
yategese 2
yeebazizza 2
yeegasse 2
yeetondedde 2
yeeweredde 2
yenna 2
yo 2
yokka 2
yoweri 2
yunivasite 2
zaali 2
ziri 2
