num 974
maliza 445
mu 422
yesu 361
yali 349
nga 329
ne 300
nti 262
era 246
na 222
kkumi 199
ku 197
bwe 153
okuba 118
abiri 105
laazaalo 105
emu 100
maliyamu 85
naye 76
baali 75
ye 71
ennyo 69
okukkiriza 69
nnya 67
bye 66
bya 65
bo 64
no 64
bayibuli 62
ssatu 61
ttaano 61
bbiri 60
olwa 60
ennaku 59
nnyo 58
ebya 56
amaanyi 55
ekyo 51
kya 51
ebintu 50
oku 50
ki 48
gye 46
mwannyina 45
ateekwa 44
katonda 44
mukaaga 44
yakuwa 44
ya 43
aba 42
musanvu 42
we 42
kye 40
lwaki 40
yok 40
wa 39
yakola 39
munaana 38
abantu 37
ebyo 37
bingi 36
atyo 35
maka 35
mwannyinaabwe 35
okukola 35
yalina 35
gwe 34
omu 34
mwenda 32
awo 31
ba 31
e 30
ebigambo 30
kiki 30
kuzuukira 30
yalaba 30
ekijjulo 29
ga 29
omwana 29
nge 28
bonna 27
eya 27
omwoyo 27
agenda 25
bulungi 25
lwe 25
mukama 25
atya 24
ayagala 24
byonna 24
kwe 24
lukumi 24
akola 23
ana 23
kubanga 22
abaali 20
abakazi 20
abalala 20
ajja 20
bangi 20
bessaniya 20
gaabwe 20
lwa 20
muganda 20
okuzuukira 20
abagenyi 19
ate 19
ebyaliwo 19
kristo 19
mutima 19
yagamba 19
yawulira 19
ataano 18
ekya 18
eno 18
oba 18
alina 17
amakulu 17
ekitiibwa 17
eyo 17
okuyigiriza 17
bino 16
lye 16
obo 16
si 16
a 15
abaaliwo 15
agamba 15
amaze 15
azuukizibwa 15
baagala 15
basuubira 15
bwa 15
bwali 15
ddala 15
ebingi 15
ebiri 15
ekiseera 15
eryo 15
eyali 15
gwa 15
kirabika 15
kiseera 15
kyokka 15
lunaku 15
maaso 15
mikwano 15
mukwano 15
nsi 15
nsonga 15
obulwadde 15
okubaako 15
okubakubagiza 15
okufa 15
okwogera 15
oluvannyuma 15
singa 15
somayokaana 15
tannatuuka 15
wange 15
yamugamba 15
yasalawo 15
yayogera 15
akimanyi 14
buli 14
kukola 14
leero 14
obukulu 14
okulya 14
okunyweza 14
waaliwo 14
be 13
kintu 13
okusembeza 13
kamu 12
kikumi 12
mitwalo 12
ngo 12
olwo 12
yamala 12
ebirungi 11
kino 11
kukkiriza 11
abafu 10
abalinga 10
abo 10
abooleka 10
abuulira 10
afa 10
afudde 10
ago 10
alwadde 10
amangu 10
asobola 10
atandise 10
awa 10
awaka 10
awulira 10
baalina 10
bagenyi 10
bantu 10
batadde 10
bibiina 10
biraga 10
biseera 10
bombi 10
bonsatule 10
bunkenke 10
date 10
egyo 10
ekinene 10
ekyali 10
emabegako 10
empuku 10
emwogerako 10
emyezi 10
esembayo 10
ggwe 10
gu 10
gwali 10
gya 10
ka 10
kijjulo 10
kwa 10
kwaffe 10
kwamuyamba 10
magezi 10
mirimu 10
mmanyi 10
mukozi 10
mulimu 10
mulwadde 10
mwe 10
nedda 10
nnyonnyola 10
obulamu 10
obuyinza 10
ojja 10
okufiirwa 10
okukkiririza 10
okukolera 10
okulinga 10
okumutegekera 10
okumwogerako 10
okutubuulira 10
okutuuka 10
okuwabulwa 10
okuzuukiza 10
okuzziŋŋanamu 10
okwa 10
olugendo 10
omulambo 10
oyo 10
ssuubi 10
teyandifudde 10
tusobola 10
waabwe 10
wadde 10
waffe 10
wayiseewo 10
yabakyalira 10
yabuuza 10
yagenda 10
yajja 10
yamuddamu 10
yeebuuza 10
yerusaalemi 10
yonna 10
abagoberezi 9
abikola 9
alonze 9
amazima 9
amugamba 9
bukkakkamu 9
ekintu 9
ekisinga 9
engeri 9
ensi 9
kukikkiriza 9
kyonna 9
mulungi 9
obulungi 9
okulaba 9
okusinga 9
okuyiga 9
tayinza 9
yawabula 9
byandibadde 8
kweraliikirira 8
ntandikwa 8
tetusaanidde 8
bannyina 7
bwakabaka 7
ebikwata 7
gano 7
kati 7
mwana 7
ogu 7
okuva 7
omuntu 7
simooni 7
ayigiriza 6
baganda 6
bukadde 6
ebitabo 6
ebyawandiikibwa 6
empya 6
enkyusa 6
intaneeti 6
kitundu 6
labaawanny 6
univ/art 6
univ_sqr_xl 6
url 6
abaabanga 5
abaafa 5
abaattottola 5
abafumbo 5
abagabi 5
abagabula 5
abajulirwa 5
abakakafu 5
abakristaayo 5
abakulu 5
abakyalidde 5
abakyalira 5
abalalaweereza 5
abalina 5
abamu 5
abasaddukaayo 5
abasoma 5
abaweereza 5
abikuwa 5
abimalidde 5
afuluma 5
aga 5
agambi 5
agende 5
akaloosa 5
akiraba 5
akkiririza 5
akkiriza 5
ako 5
akolawo 5
akolera 5
akulukusa 5
akyabijjukira 5
akyali 5
akyaliko 5
akyalina 5
akyusaamu 5
alagira 5
ali 5
alizuukira 5
alowooza 5
amadiini 5
amafuta 5
amannya 5
amawulire 5
amaziga 5
amuddamu 5
amufumbidde 5
amunenya 5
andese 5
anti 5
asatu 5
asinga 5
asobole 5
atawaana 5
ateekateeka 5
ategeeza 5
attibwe 5
atudde 5
atwalibwa 5
awali 5
awamu 5
awatali 5
aweereza 5
awuliriza 5
ayiga 5
ayinza 5
ayogera 5
ayolekedde 5
azuukizzaayo 5
baabeeranga 5
baakolera 5
baakungubagira 5
baalaba 5
baaliko 5
baamunywegeranga 5
baamusindikira 5
baamuwanga 5
baamuziyiza 5
baani 5
baasalawo 5
baasinganga 5
baasobola 5
baawambaatira 5
baayitibwa 5
baayogerako 5
babakyalidde 5
bafudde—wadde 5
bagenda 5
baggyewo 5
bajja 5
bajjanga 5
bakakafu 5
bakimanyi 5
bakristaayo 5
bakulembeze 5
balowooza 5
bamuggyamu 5
bamujjanjaba 5
bamunaaza 5
bamusibye 5
bamusiiga 5
bandiba 5
bannabbi 5
bannaffe 5
bannanfuusi 5
basaanidde 5
basse 5
batwala 5
batya 5
batyo 5
baweereza 5
bayinza 5
bayiseemu 5
bayitibwa 5
bazze 5
bbanga 5
bigambo 5
bikwata 5
biriraanyeewo 5
bisobola 5
bitulaga 5
bituyamba 5
bugamba 5
bugonzezza 5
bukya 5
bulamu 5
bulooto 5
buyudaaya 5
bweyongera 5
bweyongezi 5
bwonna 5
byakulya 5
byaliwo 5
byamuyamba 5
byawandiikibwa 5
dda 5
ddi 5
ddoboozi 5
eba 5
ebbanga 5
ebibuuzo 5
ebigere 5
ebirala 5
ebirowoozo 5
ebitono 5
ebitukuvumatayo 5
ebitundu 5
ebizibu 5
ebizzaamu 5
ebula 5
ebulayo 5
ebyali 5
ebyanyweza 5
eddiini 5
egamba 5
egiwerako 5
egya 5
ejjinja 5
ekibuuzo 5
ekirungi 5
ekisoboka 5
ekiwanvuko 5
ekiyudaaya 5
ekizibu 5
ekyabaawo 5
ekyasooka 5
ekyokulabirako 5
ekyukako 5
emabega 5
embeera 5
emirembe 5
emirimu 5
endabika 5
engatto 5
engoye 5
enjigiriza 5
enkomerero 5
enkulu 5
ennya 5
ensonga 5
erambikiddwa 5
eri 5
eriko 5
erya 5
erye 5
esemberayo 5
esooka 5
esookera 5
essanyu 5
essuubi 5
essuula 5
eteekwa 5
etubuulirako 5
ewuwe 5
eyaliko 5
eyogera 5
eyonoonekedde 5
ffenna 5
fuluma 5
gamenyebwa 5
ge 5
gonna 5
gumaze 5
gumu 5
gutandise 5
guteekwa 5
gyonna 5
isira 5
jpg 5
kaakano 5
kaseera 5
keetalo 5
kiba 5
kibe 5
kibi 5
kikulu 5
kimu 5
kimuleetera 5
kirina 5
kirooto 5
kisanyusa 5
kisinga 5
kisingako 5
kiteekwa 5
kkubo 5
kubaawo 5
kubuusabuusa 5
kufuna 5
kugisobola 5
kujja 5
kukigumiikiriza 5
kukyalako 5
kulaba 5
kulemwa 5
kuliko 5
kumanya 5
kumpi 5
kumuggibwako 5
kutegekera 5
kutuuka 5
kutya 5
kuyambako 5
kuyigirizibwa 5
kwaleetera 5
kwali 5
kwandimuyambye 5
kwawukanya 5
kwawulawo 5
kwogera 5
kyabali 5
kyaddaaki 5
kyali 5
kyaliwo 5
kyamuleetera 5
kyamwewuunyisa 5
kyasa 5
kyatuuka 5
kyennyini 5
kyewuunyisa 5
kyeyava 5
kyeyoleka 5
laazaaloebirungi 5
libula 5
litera 5
luganda 5
lugandasoma 5
luk 5
lumu 5
lup 5
lusegere 5
lya 5
lyonna 5
maliza—abavumu 5
masiya 5
matayo 5
mayiro 5
mbale 5
mitono 5
mpuku 5
mukazi 5
mukulu 5
mukyala 5
mulamu 5
muli 5
mulyango 5
mumuleke 5
mumusumulule 5
muntu 5
museenene 5
mutwe 5
muyokaana 5
mwannyinaze 5
mwannyoko 5
naawe 5
nabyo 5
nfiirabulago 5
ngeri 5
njigiriza 5
nkolagana 5
nkomerero 5
nnaku 5
ntaana 5
nze 5
nzekka 5
nzikiriza 5
obanga 5
oboolyawo 5
obubaka 5
obukakafu 5
obunafu 5
obutafaananako 5
obuzibu 5
ogwo 5
ojje 5
okikkiriza 5
okubakyalira 5
okubalabako 5
okubatta 5
okubaziikirako 5
okubeera 5
okufumba 5
okugamba 5
okugatta 5
okugenda 5
okuguma 5
okugumiikiriza 5
okujja 5
okukozesa 5
okukukolera 5
okukulembera 5
okukwasa 5
okukyaza 5
okulowooza 5
okulwala 5
okumujjanjaba 5
okumutta 5
okumuwabula 5
okumuziika 5
okunywa 5
okunywevu 5
okusisinkana 5
okussuuka 5
okusula 5
okutawaana 5
okutegeeza 5
okutta 5
okutuukira 5
okutuula 5
okuwunya 5
okuyamba 5
okuzuukizibwa 5
okwagala 5
okwamuweebwa 5
okwaŋŋanga 5
okweraliikirira 5
okwoleka 5
okwolekagana 5
olaba 5
oluusi 5
olwekyo 5
omubiri 5
omufumbo 5
omugenge 5
omugenyi 5
omukisa 5
omulala 5
omulundi 5
omutume 5
omwanguka 5
onokkiriza 5
onooyoleka 5
osaanidde 5
osaba 5
otadde 5
otawaana 5
owa 5
oyagala 5
saakugambye 5
somaabaruumi 5
somalukka 5
ssaza 5
tagamba 5
tajja 5
takyasobola 5
talaba 5
tamanyi 5
tamunenya 5
tanenya 5
tannafa 5
tannazuukizaayo 5
tasobola 5
tebakkiririza 5
tekijja 5
tekyanditwewuunyisizza 5
terina 5
tetumanyi 5
tetuyinza 5
tewali 5
teyanyiigira 5
tofaayo 5
tuba 5
tukyalidde 5
tukyazizza 5
tulabe 5
tumanya 5
tusobya 5
tutya 5
tuyinza 5
twalabye 5
twekenneenye 5
twetaaga 5
waali 5
waba 5
wabula 5
wajja 5
wali 5
wamma 5
wano 5
weeraliikirira 5
wiiki 5
yabayigirizanga 5
yabeeranga 5
yaddamu 5
yafa 5
yafangayo 5
yafuna 5
yagattako 5
yaggwawo 5
yajjukiranga 5
yakkiriza 5
yakolera 5
yakyala 5
yakyoleka 5
yalabiriranga 5
yalinga 5
yaliwo 5
yaliyo 5
yalwala 5
yamulaba 5
yamulowoozangako 5
yamunenya 5
yamuwa 5
yamuwulira 5
yamuyita 5
yamweyongera 5
yandiba 5
yanyiiga 5
yasigala 5
yasinziiranga 5
yasitukirawo 5
yasooka 5
yasulanga 5
yatandika 5
yateekateeka 5
yategeera 5
yatunulanga 5
yatunuulira 5
yatuteerawo 5
yatuukanga 5
yavaayo 5
yawa 5
yawuliranga 5
yawuliriza 5
yayamba 5
yayawukana 5
yayigirizanga 5
yayimuka 5
yayoleka 5
yayolekagana 5
yeerabira 5
yeeraliikirira 5
yeetisse 5
yeeyongera 5
yesuyamuddamu 5
yokaana 5
ze 5
abagamba 4
abisubwa 4
agambe 4
agezaako 4
akyalidde 4
alekere 4
amaaso 4
amubuulirira 4
babifunamu 4
bikulu 4
bimala 4
bimuyamba 4
bintu 4
bituyigiriza 4
bwaffe 4
bwetaavu 4
byali 4
ddembe 4
ebisinga 4
ebitonotono 4
emirundi 4
endowooza 4
erinnya 4
ewaabwe 4
kale 4
kirungi 4
kukimuggyako 4
kutawaana 4
kutulemesa 4
kwetawaanya 4
mat 4
okubayigiriza 4
okukkakkanya 4
okumusaba 4
okumuwuliriza 4
okutereeza 4
ono 4
tagenda 4
tasaanidde 4
tubuusa 4
tutuuka 4
yaggya 4
yalaga 4
yasiima 4
yayita 4
eŋŋaano 3
kika 3
kitabo 3
kiyinza 3
muddo 3
nnannyini 3
nteekateeka 3
obutwa 3
ogufaanana 3
okuvvuunulwa 3
pulintaweereza 3
sindika 3
weereza 3
ababi 2
ababuuza 2
aggya 2
amagezi 2
assibwamu 2
atandika 2
ava 2
ayigirizibwa 2
bagaana 2
bagamba 2
balibasuula 2
balikaabira 2
baluma 2
balyawula 2
bamalayika 2
bamugamba 2
batuukirivu 2
bawuniikirira 2
byamagero 2
ebikadde 2
ebipya 2
ebyamagero 2
engero 2
ennyumba 2
enteekateeka 2
ezo 2
ggulu 2
kiriba 2
kityo 2
kkuŋŋaaniro 2
kyokero 2
lyabwe 2
maama 2
mafundikira 2
mutegedde 2
naffe 2
nnabbi 2
nnyumba 2
obugigi 2
obusobozi 2
obwa 2
ogubumbujja 2
okubagerera 2
okuggyako 2
okumukkiririzaamu 2
omubazzi 2
omuli 2
omuliro 2
omusajja 2
tebaalina 2
tebali 2
teyakolerayo 2
tterekero 2
tubitegedde 2
wamu 2
yakobo 2
yatuuka 2
yuda 2
yusufu 2
