mu 398
ku 321
nga 264
n 252
ne 158
nti 151
e 139
ng 136
abantu 84
era 75
bwe 74
y 64
w 59
kino 57
kya 57
abadde 51
kyokka 43
gye 42
olw 40
ya 40
abamu 36
ate 36
ekirwadde 36
wa 36
kampala 35
covid 34
eno 34
we 33
bw 32
19 31
kula 31
agamba 30
ba 30
pulezidenti 30
corona 29
ky 29
poliisi 29
okuva 28
ye 28
be 27
eggwanga 27
lw 27
bano 26
kubanga 26
abasuubuzi 25
b 25
gy 25
oluvannyuma 25
yagambye 25
by 24
ddwaaliro 24
ebiragiro 24
embeera 24
naye 24
omuggalo 24
akulira 23
namutebi 23
eby 22
ono 22
ssentebe 22
buli 21
covid-19 21
ez 21
gw 21
yabadde 21
z 21
ab 20
kiseera 20
yategeezezza 20
abalala 19
kye 19
nnyo 19
ssente 19
aba 18
abasawo 18
bali 18
bino 18
eri 18
omu 18
wabula 18
abaana 17
amateeka 17
bantu 17
bwa 17
disitulikiti 17
emirimu 17
gavumenti 17
kkanisa 17
museveni 17
obulamu 17
omusumba 17
00 16
abalwadde 16
dn 16
ebintu 16
lwa 16
omugenzi 16
uganda 16
afudde 15
enjawulo 15
kuba 15
rdc 15
balina 14
emmotoka 14
kibuga 14
masaka 14
bya 13
express 13
gwe 13
ly 13
okuli 13
palamenti 13
ssaawa 13
ttiimu 13
wakati 13
wiiki 13
abaserikale 12
abatuuze 12
bba 12
engeri 12
ga 12
gwa 12
kati 12
kifo 12
kwe 12
lubaga 12
naddala 12
okulaba 12
ssande 12
za 12
bonna 11
boodabooda 11
bulungi 11
dr 11
ekitongole 11
emu 11
ensonga 11
jinja 11
obulwadde 11
si 11
abakozi 10
agenda 10
ali 10
alina 10
bye 10
ekibuga 10
fr 10
g 10
kw 10
lagu 10
liigi 10
okufa 10
omubaka 10
sheikh 10
wadde 10
waliwo 10
ategeezezza 9
baabadde 9
bagenda 9
bangi 9
ekitundu 9
eky 9
guno 9
kaweefube 9
lugala 9
luguudo 9
makya 9
masiki 9
mbeera 9
na 9
okuba 9
okudda 9
parish 9
puleesa 9
yali 9
20 8
2021 8
abakulembeze 8
abasumba 8
abo 8
amaduuka 8
ayagala 8
babadde 8
bbiri 8
buno 8
ddwaliro 8
emmanuel 8
ennyo 8
entambula 8
eyali 8
june 8
kalungu 8
maka 8
mmotoka 8
nsonga 8
obubonero 8
obujjanjabi 8
okugenda 8
okukola 8
okukuuma 8
olwo 8
omukulembeze 8
sam 8
ssinga 8
ura 8
yo 8
zino 8
100 7
4 7
abali 7
abalina 7
afunye 7
agambye 7
ambyulensi 7
asabye 7
bizinensi 7
bombo 7
busega 7
butale 7
ebirala 7
ekkanisa 7
ekya 7
ka 7
kaunda 7
kigambibwa 7
leero 7
liberty 7
lwe 7
lwokuna 7
makindye 7
minisitule 7
mukono 7
muntu 7
nabo 7
nsimbi 7
oba 7
oku 7
okumala 7
okwogera 7
olwaleero 7
omuli 7
oxygen 7
paasita 7
so 7
villa 7
vision 7
waabwe 7
wakiso 7
wano 7
yagenda 7
ze 7
zooni 7
abakyala 6
amagezi 6
ayogera 6
bakola 6
baleme 6
balwadde 6
biragiro 6
bwabwe 6
ebyobulamu 6
eddwaaliro 6
ekiragiro 6
ekiro 6
ennaku 6
ensi 6
ery 6
ettaka 6
ewa 6
ey 6
group 6
gyange 6
kayunga 6
kwa 6
lino 6
lwokusatu 6
lya 6
malwaliro 6
mayanja 6
minisita 6
muggalo 6
mulimu 6
mupiira 6
mwe 6
nalumansi 6
obwedda 6
okubeera 6
okufuna 6
okutangira 6
okutuusa 6
okuwa 6
olukiiko 6
olwa 6
omumyuka 6
owa 6
sc 6
tukaikiriza 6
vipers 6
wamu 6
worship 6
1 5
3 5
5 5
abagoberezi 5
abapoliisi 5
africa 5
akakiiko 5
akatale 5
akola 5
amagye 5
amaka 5
asaba 5
ategeeza 5
awaka 5
baabwe 5
bagamba 5
bamweyana 5
banneekolera 5
basobeddwa 5
bingi 5
bitundu 5
bizibu 5
byuma 5
charles 5
ebadde 5
ebifo 5
ebitongole 5
ebitundu 5
egenda 5
ekibiina 5
ekiseera 5
ekizibu 5
ekwata 5
ekyuma 5
emmere 5
enteekateeka 5
essimu 5
ezimu 5
freedom 5
fufa 5
gaabwe 5
ggwanga 5
gya 5
imelda 5
joseph 5
kano 5
kansala 5
katale 5
kawempe 5
kcca 5
kirwadde 5
kisaawe 5
kitalo 5
kiwanuka 5
kkampuni 5
kyalo 5
lawrence 5
lubowa 5
luno 5
lutaaya 5
lyomoki 5
maaso 5
malunda 5
mayengo 5
mmeeya 5
mugulusi 5
muhindo 5
mukama 5
myaka 5
nateete 5
ndisaba 5
ngeri 5
njeru 5
nkola 5
nteekateeka 5
nze 5
obudde 5
obutonde 5
obuyinza 5
okujja 5
okulangirira 5
okusinziira 5
okutaasa 5
okutandika 5
okutuuka 5
okuyingira 5
okwewala 5
okweyongerayo 5
olukale 5
omubiri 5
omwaka 5
onduparaka 5
pastor 5
paul 5
peter 5
pr 5
s 5
siteegi 5
tebalina 5
yafiiridde 5
zaabwe 5
10 4
9 4
ababadde 4
abasaba 4
abasinga 4
abazannyi 4
afiiridde 4
afuna 4
alagira 4
amaanyi 4
amaze 4
amazzi 4
annyonnyodde 4
avunaanyizibwa 4
awamu 4
aziikiddwa 4
bannannyini 4
bannayuganda 4
banne 4
batandise 4
booda 4
bubi 4
budde 4
burora 4
busoga 4
center 4
dsc 4
ebbaluwa 4
ebifaananyi 4
ebipya 4
ebiri 4
egy 4
ekikopo 4
ekyalo 4
ente 4
ewedde 4
eya 4
gano 4
ggoolo 4
godfrey 4
gyabwe 4
hospital 4
img 4
ivan 4
kafiyu 4
kaleerwe 4
kalusu 4
kaseera 4
kibadde 4
kiddiridde 4
kitongole 4
kiyongobero 4
kugenda 4
kuliko 4
kuno 4
lc 4
lwokutaano 4
makubo 4
mmande 4
muganda 4
mukyala 4
mulago 4
muwala 4
nabbosa 4
ngalo 4
nguudo 4
obulambuzi 4
obuwanguzi 4
obuyambi 4
ofiisi 4
ogw 4
ogwasooka 4
okufiirwa 4
okukozesa 4
okulwanyisa 4
okusinga 4
okussa 4
okutambula 4
okuwona 4
oluva 4
omukisa 4
omuntu 4
omupiira 4
omwana 4
ow 4
pius 4
singa 4
sizoni 4
south 4
sserwadda 4
ssi 4
ssimu 4
tugenda 4
tuli 4
wamala 4
wansi 4
yafudde 4
yafuna 4
yasabye 4
yasooka 4
yenna 4
000 3
16 3
2 3
20210616 3
22 3
3-0 3
36 3
abaabadde 3
abasirikale 3
abatendesi 3
abatunda 3
abawera 3
abazadde 3
akabenje 3
akolera 3
akyali 3
alabula 3
aliko 3
alipoota 3
amaaso 3
amabanga 3
amasomero 3
amawulire 3
amuwe 3
amya 3
asobola 3
atambula 3
atandika 3
atula 3
ava 3
ayinza 3
baagala 3
baali 3
baayo 3
babaka 3
bainamani 3
bajeti 3
bakasitoma 3
bakira 3
bakozesa 3
bakuba 3
bakunda 3
balabiddwaako 3
balaga 3
balaze 3
baliko 3
balinda 3
bamaze 3
bannaddiini 3
basula 3
batabani 3
batambula 3
batono 3
bayitamu 3
bokka 3
brian 3
bubadde 3
buganda 3
bulamu 3
bulijjo 3
bulwadde 3
buvuddeko 3
bwanamukulu 3
bwangu 3
byalo 3
caleb 3
ddala 3
ddyo 3
ebif 3
ebirwadde 3
ebiwandiiko 3
ebizibu 3
ebyenfuna 3
ebyenjigiriza 3
ebyokwerinda 3
eddagala 3
eggulo 3
ejja 3
ekikola 3
ekinnansi 3
ekintu 3
ekivundu 3
ekiwandiiko 3
ekizimbe 3
ekkulu 3
eklezia 3
embalirira 3
embuto 3
emisana 3
emisanvu 3
emiwendo 3
emizannyo 3
engulu 3
enkolagana 3
ensigo 3
ensiike 3
ensimbi 3
enviiri 3
essuubi 3
evelyn 3
eyabadde 3
famire 3
fc 3
fdc 3
gaganga 3
general 3
ggeeti 3
hadijah 3
international 3
jimmy 3
john 3
kajoba 3
kalantiini 3
kasibante 3
kazimba 3
kenneth 3
kibuye 3
kiraabu 3
kitundu 3
kituufu 3
kizito 3
kkula 3
kufa 3
kugoberera 3
kukola 3
kulowooza 3
kusaba 3
kusala 3
kutya 3
kuziika 3
kyamuliibwa 3
kyengera 3
kyonna 3
lubuto 3
lukiiko 3
lusaka 3
lutikko 3
lwamukaaga 3
lwomukaaga 3
lyange 3
lye 3
maama 3
madoi 3
maria 3
monaco 3
mpagi 3
mpigi 3
msgr 3
mubangizi 3
musinzi 3
nakanyike 3
namwandu 3
nnamba 3
nsamba 3
nsambya 3
ntale 3
obore 3
obungi 3
obusosodooti 3
obuzibu 3
obw 3
obwa 3
obwetaavu 3
of 3
oguwedde 3
ogwa 3
okubadde 3
okubagoba 3
okufaayo 3
okugoberera 3
okugondera 3
okukendeeza 3
okukomya 3
okukwatibwa 3
okulondoola 3
okumusabira 3
okumuwa 3
okunyweza 3
okusaasaana 3
okusaba 3
okusasula 3
okusobola 3
okusunsulamu 3
okuweereza 3
okuyimiriza 3
okuzzaawo 3
okwambala 3
okwegemesa 3
okwetangira 3
okwongera 3
olunaku 3
omukwano 3
omukyala 3
omulanga 3
omulimu 3
omusawo 3
omuvubuka 3
omuwala 3
patrick 3
pikipiki 3
rwanda 3
rweza 3
saul 3
ssaza 3
ssebalu 3
ssebuggwawo 3
ssimbwa 3
tom 3
turkey 3
waayo 3
wange 3
woofiisi 3
yaabwe 3
yagenze 3
yakubirizza 3
yamala 3
yayongeddeko 3
zakah 3
zirina 3
zonna 3
13 2
14 2
26 2
42 2
56 2
57 2
58 2
8 2
ababaka 2
abafuna 2
abagoba 2
abajja 2
abakolera 2
abakristu 2
abakugu 2
abakungu 2
abalagira 2
abalambuzi 2
abamujjanjaba 2
abasaabaze 2
abasabye 2
abasing 2
abasiraamu 2
abasuubirwa 2
abatali 2
abavunaanyizibwa 2
abayingira 2
abebyokwerinda 2
abel 2
abenjawulo 2
abooluganda 2
achilles 2
adumwe 2
afrika 2
ag 2
agasinga 2
agezaako 2
ajarova 2
ajja 2
ajjanjabirwa 2
aka 2
akasunsula 2
akawungeezi 2
akeedi 2
alaba 2
alaga 2
alinze 2
aludde 2
amabaluwa 2
amangu 2
amawugwe 2
anaakwatibwa 2
antegeeza 2
asiimye 2
asp 2
atali 2
atandise 2
atawaanyizibwa 2
atayinza 2
atuuse 2
atwala 2
aveeyo 2
avudde 2
awaayo 2
awadde 2
aweereza 2
ayambe 2
ayimiriza 2
ayongera 2
ayub 2
baakebera 2
baakedde 2
baasazeewo 2
baasoose 2
baategeezezza 2
babatangira 2
babawa 2
babeera 2
baddukidde 2
bafuna 2
bagambye 2
baganda 2
bagezezzaako 2
bagobagana 2
bagondedde 2
bakateyamba 2
bakebera 2
bakulembeddwa 2
bakutte 2
bakwatibwa 2
bakwatiridde 2
balabe 2
balowooza 2
bamaliriza 2
baminisita 2
bammemba 2
bamuddusa 2
bamukebera 2
bamulekwa 2
bamusalako 2
bamussa 2
bamwogeddeko 2
bannabyabufuzi 2
bannakalungu 2
basawo 2
basazeewo 2
basobola 2
basobole 2
bassentebe 2
basumba 2
basuubuzi 2
batalina 2
batandisi 2
bateekeddwa 2
bategeezezza 2
batisse 2
batuuse 2
batya 2
bavuga 2
bawandiika 2
baweddemu 2
bawulirize 2
bayita 2
baziimudde 2
bazikukusa 2
bazze 2
bbaala 2
bbiiru 2
bibi 2
bidduka 2
bigere 2
biggaddwa 2
bijjidde 2
bikyali 2
biwandiiko 2
bo 2
board 2
boda 2
bodaboda 2
bruno 2
bubonero 2
bufalansa 2
bugembe 2
bukedde 2
bunkenke 2
busuulwa 2
buwanguzi 2
buzibu 2
bwaise 2
byo 2
byonna 2
centre 2
chris 2
christopher 2
city 2
council 2
cranes 2
david 2
ddagala 2
dduyiro 2
death 2
denis 2
derrick 2
dollar 2
dpc 2
ebbanga 2
ebimu 2
ebiraga 2
ebirowoozo 2
ebisaawe 2
ebitu 2
ebituli 2
ebiwoobe 2
ebyalo 2
ebyamaguzi 2
ebyamawulire 2
ebyassibwawo 2
ebyemizannyo 2
ebyenjawulo 2
ebyokulya 2
eddakiika 2
eddembe 2
eddene 2
eddiini 2
efuna 2
egibadde 2
egoba 2
egudde 2
ekibadde 2
ekibina 2
ekif 2
ekifaananyi 2
ekifo 2
ekigatta 2
ekigo 2
ekiri 2
ekisse 2
ekitabuse 2
ekulembedde 2
ekyo 2
emboozi 2
emigugu 2
emikwano 2
emingi 2
emipiira 2
emirambo 2
emirembe 2
emisolo 2
emiwaatwa 2
emyaka 2
endala 2
endwadde 2
enguudo 2
ennene 2
ennungi 2
ennyanja 2
ennyumba 2
entobazi 2
enzibu 2
erimu 2
erina 2
essaawa 2
essaza 2
estate 2
etaano 2
ettoffaali 2
etwala 2
eyafudde 2
eyakiikiridde 2
eyavuddeko 2
eyinza 2
eyo 2
eza 2
eziwerako 2
ezze 2
fenna 2
force 2
francis 2
fred 2
gaali 2
gaggwaawo 2
gattako 2
ge 2
ggaayi 2
ggombolola 2
giants 2
giyimiriziddwa 2
gonna 2
gugenda 2
gumu 2
gyonna 2
husband 2
isa 2
james 2
jkl 2
jolly 2
k 2
kakooza 2
kakuuto 2
kanyanya 2
kasasiro 2
kasavu 2
kasenge 2
kato 2
katonda 2
katuuti 2
kayanja 2
kijja 2
kikola 2
kikopo 2
kikwatako 2
kinnya 2
kirina 2
kisekka 2
kitaabwe 2
kitaawe 2
kitebe 2
kiyinza 2
kizibu 2
kkono 2
kkwiini 2
kubayamba 2
kubeera 2
kukozesa 2
kukwasisa 2
kulayishi 2
kumpi 2
kumu 2
kusooka 2
kutaasa 2
kutambula 2
kutangira 2
kuuma 2
kuva 2
kwesasuliza 2
kwogerako 2
kyakoleddwa 2
kyali 2
kyange 2
laavu 2
lady 2
league 2
lufula 2
lukalala 2
lumira 2
lwera 2
lwokubiri 2
lyali 2
m 2
mabira 2
maduuka 2
maggale 2
maneja 2
martin 2
mary 2
mayinja 2
mayumba 2
mbale 2
mbi 2
migugu 2
mingi 2
mini 2
ministry 2
mipiira 2
miranga 2
mirimu 2
misango 2
misanvu 2
misolo 2
missa 2
mmengo 2
mmere 2
mozambique 2
mpaka 2
mpola 2
mukozi 2
mukulembeze 2
mukulu 2
mukutu 2
mukwano 2
mulembe 2
mulwadde 2
munne 2
muno 2
musanyufu 2
musisi 2
mutabani 2
mutebi 2
mutimbagano 2
mutuuze 2
muze 2
mw 2
naba 2
nabulime 2
naffe 2
nakazibwe 2
nakiwu 2
namirembe 2
nanteza 2
nasalawo 2
national 2
ndejje 2
ndi 2
nfeete 2
nnali 2
nnamwandu 2
nnannyini 2
nrm 2
nsi 2
nsisinkano 2
nssf 2
ntambula 2
ntebe 2
nyende 2
nyombi 2
obubaka 2
obugaali 2
obukadde 2
obukulembeze 2
obulabe 2
obulungi 2
obumanyirivu 2
obusiraamu 2
obuto 2
obuyonjo 2
obwavu 2
okubaako 2
okubasakira 2
okubayamba 2
okubuulira 2
okuddayo 2
okudduukirira 2
okufulumya 2
okugaana 2
okuggala 2
okukolera 2
okukwasisa 2
okulagira 2
okulowooza 2
okumukolako 2
okumwekengera 2
okunaaba 2
okusaasaanya 2
okusabira 2
okusala 2
okusiga 2
okusooka 2
okusula 2
okutambuza 2
okutandikawo 2
okuteeka 2
okutendekebwa 2
okutumbula 2
okutunda 2
okutunuulira 2
okutya 2
okuvaayo 2
okuwangula 2
okuweebwa 2
okuwummula 2
okuzannyira 2
okuzimba 2
okwegayirira 2
okwemulugunya 2
okwetaba 2
okwewa 2
okweyoteza 2
okwongerayo 2
olubatu 2
olufuzi 2
olukalala 2
olwekyo 2
omubeezi 2
omukuumi 2
omulambo 2
omulundi 2
omusaala 2
omusaayi 2
omusajja 2
omusango 2
omusuubuzi 2
omuwendo 2
omuze 2
omwami 2
omwogezi 2
opio 2
oyo 2
paaka 2
pator 2
price 2
rev 2
robert 2
robinah 2
rose 2
rwakara 2
said 2
sanitayiza 2
songa 2
sr 2
ssatu 2
ssemakula 2
ssemwogerere 2
ssentongo 2
sserunjogi 2
ssewungu 2
ssirinda 2
ssomero 2
star 2
stephen 2
tamanyi 2
task 2
tebakyakola 2
tebannaba 2
tebasobodde 2
tekyetaaga 2
thomas 2
times 2
town 2
toyambadde 2
ttivvi 2
tugaineyo 2
tv 2
twitter 2
united 2
urbra 2
vincent 2
waggulu 2
waisswa 2
waka 2
wankulukuku 2
wokulira 2
yabaddemu 2
yalaba 2
yalabudde 2
yalagidde 2
yalambise 2
yalayira 2
yasemba 2
yasinzidde 2
yategezezza 2
yatenderezza 2
yawona 2
yayamba 2
yeebazizza 2
yeegasse 2
yeetaaga 2
yeetabiddwamu 2
yeeyama 2
yonna 2
yusu 2
zambia 2
zikola 2
zzo 2
