num 620
mu 295
nti 199
yesu 197
na 170
nga 156
ne 151
ku 142
era 104
bwe 101
yali 99
kkumi 92
katonda 89
abantu 88
naye 80
ekyo 78
no 67
abiri 63
yakuwa 63
nnyo 60
emu 57
baali 52
kye 49
kya 42
okuba 42
bbiri 40
bo 40
nnya 40
be 38
lwaki 38
olwekyo 38
ttaano 38
abo 37
okukola 37
ba 36
oba 36
abalala 34
omu 34
wa 34
gye 33
oyo 33
peetero 33
yagamba 33
date 32
ssatu 32
omuntu 31
ebintu 30
musanvu 30
kiki 29
mwenda 29
omanyi 27
ye 27
yokaana 27
mukaaga 26
bayibuli 25
ka 25
kino 25
olwa 25
abayigirizwa 24
ayagala 24
bye 24
ebyo 24
olowooza 24
ya 24
abamu 23
kabaka 23
abaali 22
ani 22
eri 22
eyo 22
kubanga 22
abatume 21
ngo 21
oluvannyuma 21
si 21
singa 21
abasajja 20
asatu 20
awo 20
e 20
ekintu 20
ki 20
endiga 19
okuva 19
ebya 18
kirungi 18
omukulu 18
sitaani 18
ssente 18
tusaanidde 18
gwe 17
kati 17
munaana 17
nge 17
omusajja 17
owa 17
yee 17
agamba 16
ebibi 16
engeri 16
ga 16
kifo 16
matayo 16
okusinza 16
aba 15
abaana 15
ajja 15
amaanyi 15
ekya 15
eya 15
maaso 15
omuyigiriza 15
we 15
baagala 14
bya 14
ddala 14
egamba 14
eyali 14
gavumenti 14
kerode 14
kiba 14
kyali 14
yakola 14
ana 13
bonna 13
buli 13
ebikwata 13
kiri 13
lumu 13
ngeri 13
omusolo 13
pawulo 13
yerusaalemi 13
ananiya 12
ayinza 12
bangi 12
ennyo 12
ensi 12
kyokka 12
lwa 12
omusumba 12
oyinza 12
sawulo 12
asobola 11
ebirungi 11
okwogera 11
omuyaga 11
waliwo 11
ali 10
amazima 10
ataano 10
ensonga 10
gya 10
lukka 10
mbaga 10
nnyumba 10
omuliro 10
yenna 10
atya 9
atyo 9
bagenda 9
bali 9
bantu 9
bayinza 9
bingi 9
ekibi 9
ekifaananyi 9
ekyokulabirako 9
ennyanja 9
ggulu 9
ggwe 9
nze 9
oluusi 9
omubbi 9
tuyinza 9
yalaba 9
ze 9
agenda 8
bakatonda 8
bino 8
ebikolwa 8
ekirungi 8
kayisaali 8
kituufu 8
kyonna 8
okubeera 8
okugondera 8
okusaba 8
okusinga 8
okusobola 8
olwo 8
ono 8
suteefano 8
tulabe 8
waggulu 8
wamu 8
abayudaaya 7
abeduneego 7
akola 7
akoze 7
akugamba 7
ate 7
bazadde 7
bulungi 7
dawudi 7
ekirala 7
ekitiibwa 7
emirundi 7
emmunyeenye 7
eno 7
eryato 7
kuba 7
kyokero 7
maama 7
mesaki 7
mubbi 7
muntu 7
nedda 7
okubaawo 7
okumanya 7
okumpi 7
okutta 7
okwagala 7
omufalisaayo 7
osobola 7
saddulaaki 7
tujja 7
wadde 7
yagenda 7
yakobo 7
yayogera 7
yekka 7
za 7
abafalisaayo 6
abakkolinso 6
abalaguzisa 6
akimanyi 6
asinga 6
bajja 6
bayigirizwa 6
bulijjo 6
eddiini 6
ekiseera 6
ekyali 6
engero 6
enjawulo 6
kabona 6
katono 6
kayaafa 6
kikyamu 6
kiseera 6
kitaawe 6
kitundu 6
kizibu 6
lyato 6
naawe 6
nsi 6
obulungi 6
okugamba 6
okugenda 6
okukikola 6
okulaba 6
omulyolyomi 6
omusolooza 6
omuwala 6
omwana 6
oyagala 6
safira 6
tebaagala 6
tewali 6
tukola 6
wabula 6
wali 6
wandyagadde 6
watya 6
yafuuka 6
yuda 6
zonna 6
abalamuzi 5
abaruumi 5
abaweereza 5
akanyonyi 5
alinga 5
amayengo 5
amazaalibwa 5
ategeeza 5
ayitibwa 5
baatya 5
balowooza 5
bannaabwe 5
ekijjulo 5
ekitabo 5
emirembe 5
eyasannyalala 5
ge 5
isaaya 5
kijjulo 5
kitegeeza 5
kukola 5
kusinza 5
leero 5
malayika 5
mukama 5
mussuula 5
obukulu 5
obuyinza 5
okubba 5
okusooka 5
okutuula 5
okutya 5
okuweereza 5
okwewala 5
olaba 5
omubi 5
omuddu 5
omulundi 5
osaanidde 5
ssomero 5
tasobola 5
tebasobola 5
tuli 5
tusobola 5
twayiga 5
waffe 5
wansi 5
yaabwe 5
yabagamba 5
yaddamu 5
yamugamba 5
abagamba 4
abakazi 4
abasirikale 4
akaseera 4
ako 4
akyali 4
amangu 4
amateeka 4
amaze 4
asaanidde 4
ayigiriza 4
baalina 4
baba 4
bakola 4
balunabba 4
bano 4
basinza 4
batunula 4
besirekemu 4
bintu 4
bokka 4
butuufu 4
bwakabaka 4
ebifo 4
ebigambo 4
ebiraga 4
ebiri 4
ebizibu 4
ebuze 4
ebyawandiikibwa 4
ekibumbujja 4
ekibuuzo 4
ekifo 4
ekiyinza 4
emabega 4
embaga 4
erya 4
ezo 4
ffenna 4
gu 4
kabi 4
kibaawo 4
kibi 4
kibuga 4
kigenda 4
kisobola 4
kiyinza 4
kkuŋŋaaniro 4
kyandibadde 4
lugero 4
lusozi 4
lya 4
maanyi 4
makko 4
museenene 4
musolo 4
nabo 4
nnimiro 4
obulimba 4
obuvumu 4
obwana 4
ogu 4
okukaayana 4
okukunta 4
okulwana 4
okuwulira 4
okuyingira 4
olulala 4
oluyi 4
omufuzi 4
omulala 4
omuyigirizwa 4
rooma 4
so 4
soma 4
tayagala 4
waabwe 4
waali 4
wandikoze 4
wayiseewo 4
wo 4
yafuna 4
yalagira 4
yasanyuka 4
yatonda 4
yeekaalu 4
abaddu 3
abagenyi 3
abaisira 3
abakola 3
abakulembeze 3
abamuweereza 3
abasamaliya 3
abato 3
abusaalomu 3
afuga 3
ai 3
akabi 3
alagira 3
aleka 3
alimba 3
alowooza 3
amanyi 3
amayinja 3
amazzi 3
asaba 3
baagamba 3
baakwata 3
baalaba 3
baaleeta 3
badduka 3
bagende 3
balina 3
bamalaaya 3
bamanyi 3
bamaze 3
basaanidde 3
basobola 3
batandika 3
batya 3
bbaasi 3
beewuunya 3
bifo 3
bitundu 3
bwa 3
bwako 3
byonna 3
ddyo 3
ebifaananyi 3
ebirala 3
ebisanyusa 3
ebweru 3
ebyaliwo 3
ekibuga 3
ekigambo 3
ekisembayo 3
ekituufu 3
ekiyudaaya 3
enkulu 3
ennaku 3
ennimiro 3
esatu 3
essuula 3
etteeka 3
ffe 3
ggaliraaya 3
gwali 3
gyonna 3
kaseera 3
kibiina 3
kifaananyi 3
kimu 3
kintu 3
kiro 3
kituyigiriza 3
kitya 3
kityo 3
kkomera 3
kkono 3
kusasula 3
kutya 3
kwa 3
kyabwe 3
kyangu 3
kyetaagisa 3
kyo 3
lowooza 3
ludda 3
lunaku 3
lye 3
maka 3
mayinja 3
mayiro 3
mazima 3
misiri 3
mufalisaayo 3
mulyango 3
muto 3
nazaaleesi 3
ndiga 3
nkaaga 3
nnyingi 3
nsonga 3
obubaga 3
obudde 3
obukuumi 3
okitwala 3
okubeesasuza 3
okufuna 3
okufuuka 3
okuggyako 3
okukkiriza 3
okukuba 3
okukwata 3
okusasula 3
okusigala 3
okutegeera 3
okutuuka 3
okutuyamba 3
okwebuuza 3
okwegomba 3
oli 3
olina 3
olubereberye 3
olugero 3
omukazi 3
omulenzi 3
omulwadde 3
omusomesa 3
omutume 3
omuvumu 3
omuweereza 3
otegedde 3
otera 3
otya 3
poliisi 3
saalome 3
samwiri 3
taata 3
tamanyi 3
tayinza 3
tetusaanidde 3
teyali 3
tulina 3
tusomere 3
twagala 3
wala 3
wano 3
wayinza 3
yagezaako 3
yajja 3
yalaga 3
yaleetera 3
yalina 3
yamubuuza 3
yawa 3
yawulira 3
yeewaana 3
yusufu 3
zabbuli 3
zzaabu 3
abaabayita 2
abaagala 2
abaasoloozanga 2
ababa 2
ababi 2
ababiri 2
abafuzi 2
abagoberezi 2
abakulu 2
abalungi 2
abalwana 2
abasinga 2
abataali 2
abatali 2
abavubuka 2
abebbulaniya 2
abeetegefu 2
adamu 2
afuuka 2
aga 2
agaali 2
agezesa 2
agwa 2
agwanidde 2
akaali 2
akabanga 2
akatono 2
akkiriza 2
akukuba 2
akulaba 2
akuuma 2
akwatiddwa 2
alaga 2
alina 2
amanya 2
asingayo 2
asolooza 2
attibwa 2
atufaako 2
atugamba 2
atuuka 2
awa 2
awaali 2
awali 2
awamu 2
awonya 2
ayogera 2
ayogerwako 2
azaalibwa 2
azudde 2
baabwe 2
baagaana 2
baagenda 2
baagezaako 2
baakola 2
baakuba 2
baalinnya 2
baamutwala 2
baatandika 2
baatunda 2
baayagala 2
bafa 2
bafalisaayo 2
bafu 2
bafuuse 2
bagamba 2
bagambe 2
bakabona 2
bakoze 2
balala 2
balekayo 2
balwala 2
balwana 2
balwanira 2
bamuddamu 2
bamugamba 2
bamutuusa 2
bamutwala 2
bana 2
bange 2
banne 2
basobole 2
bassa 2
batambulira 2
bba 2
beeroboza 2
beesigwa 2
beeyongera 2
bendera 2
bigere 2
biseera 2
bisobola 2
bubi 2
buto 2
buzibu 2
bwaffe 2
bwali 2
byawandiikibwa 2
byuma 2
ebbiri 2
ebigezo 2
ebirabo 2
ebisingawo 2
ebisingayo 2
ebisooka 2
eddoboozi 2
egimu 2
ekikristaayo 2
ekikulu 2
ekimu 2
ekinene 2
ekiraga 2
ekiragiro 2
ekisingako 2
ekisingayo 2
ekisooka 2
ekitali 2
ekiwaawaatiro 2
ekkumi 2
ekyaliwo 2
ekyatuuka 2
ekyawandiikibwa 2
emmere 2
emyaka 2
endala 2
ennyumba 2
enteekateeka 2
erinnya 2
essanyu 2
ewaabwe 2
eweza 2
eyabula 2
eyagala 2
eyaliko 2
eyalina 2
eyeetwala 2
eyinza 2
eyogera 2
eza 2
gaabwe 2
genda 2
gesusemane 2
gumu 2
guno 2
gwa 2
gwalekera 2
gwatandika 2
isukalyoti 2
jjukira 2
kaawa 2
kajja 2
kakuuma 2
kano 2
kasambula 2
kasolya 2
katanda 2
katya 2
kerodiya 2
kibeerenga 2
kijja 2
kikulu 2
kikusanyusa 2
kikye 2
kikyo 2
kinaaba 2
kiraga 2
kirituuka 2
kirooto 2
kitabo 2
kituuse 2
kkooti 2
kkubo 2
kugamba 2
kukikola 2
kukuyamba 2
kulaba 2
kumpi 2
kusobola 2
kusooka 2
kusuulibwa 2
kutambula 2
kutta 2
kyaleetera 2
kyaliwo 2
kyasoboka 2
kyatuuka 2
kyenda 2
laba 2
lubalama 2
maliyamu 2
mangu 2
mazzi 2
mikono 2
miti 2
mmwe 2
mubiwe 2
mugonderenga 2
mukono 2
mukwano 2
mulala 2
muliro 2
munno 2
munoonya 2
musumba 2
mutunda 2
mutuukirivu 2
muwere 2
muyizi 2
mwaka 2
mwe 2
mwo 2
nako 2
nebukadduneeza 2
newakubadde 2
ngoye 2
nja 2
nkubuulire 2
nkusinga 2
nnyanja 2
nsanvu 2
nsiko 2
nsobi 2
ntenvu 2
obanga 2
obo 2
oboolyawo 2
obubi 2
obulamu 2
obungi 2
ogenda 2
ogwa 2
ojja 2
okubaako 2
okubikkulirwa 2
okubonaabona 2
okubuulira 2
okuddayo 2
okufa 2
okufaananako 2
okujja 2
okukakasa 2
okukimanya 2
okukutuusaako 2
okukuuma 2
okukyuka 2
okulimba 2
okulwala 2
okulya 2
okumukwasa 2
okunoonya 2
okusinzibwa 2
okutambulira 2
okuttibwa 2
okutukuuma 2
okuvaamu 2
okuvunnama 2
okuvunnamira 2
okuyamba 2
okuyiga 2
okuyisa 2
okuyitako 2
okuzaalibwa 2
okwewaana 2
okyakijjukira 2
oluggi 2
olukiiko 2
olukulu 2
olukwe 2
olunyiriri 2
omubatiza 2
omuggazi 2
omulamu 2
omumanyi 2
otwalidde 2
owaddeyo 2
siri 2
ssekukkulu 2
ssuula 2
takyali 2
tebakkiriza 2
tebalowooza 2
tebayinza 2
tekiba 2
tekyali 2
tekyandibadde 2
tetwagala 2
timoseewo 2
ttama 2
tuba 2
tube 2
tugambe 2
tugende 2
tulaga 2
tusoma 2
tuteekwa 2
tutya 2
tuweereza 2
twazaalibwa 2
twetegereze 2
uliya 2
waabwo 2
wandisazeewo 2
wange 2
yababuuza 2
yabaddamu 2
yabadde 2
yabawa 2
yabeerera 2
yaddayo 2
yakolanga 2
yakolera 2
yakuuma 2
yalowooza 2
yandyagadde 2
yasanyukira 2
yasonyiwa 2
yasooka 2
yasunguwala 2
yatandika 2
yatta 2
yatya 2
yayagala 2
yayita 2
yeegomba 2
yeenenya 2
yeremiya 2
yo 2
yokka 2
yonna 2
zino 2
zisobola 2
zo 2
