mu 510
abantu 233
nga 187
ku 163
e 160
okukuuma 158
buganda 151
ba 148
nti 123
ne 119
akubirizza 113
obwakabaka 105
za 96
wa 91
era 89
lwa 83
minisita 81
kya 75
abavubuka 71
aba 70
ya 69
no 68
abaami 67
mayiga 67
olukiiko 65
na 64
nteekateeka 60
abasabye 57
gwa 56
kabaka 56
ttaano 56
okutumbula 54
ekitiibwa 53
obuyonjo 53
olunaku 53
wamala 53
beene 52
anthony 51
bayita 51
bulungibwansi 51
ebibakwatako 51
masaka 51
mayanja 51
obutondebwensi 51
abakulira 50
abasomaali 50
kaggo 50
okuwandiika 50
okwenyigira 50
omukululo 50
akabenje 49
akunze 49
atuuzizza 49
awanaakwatirwa 49
baana 49
balaajanye 49
basabiddwa 49
ekifo 49
emiruka 49
katuze 49
kitalo 49
lulambudde 49
magandaazi 49
muwendo 49
ogweyongedde 49
olutegesi 49
soroti 49
asabye 44
katikkiro 44
bo 33
enjawulo 33
obumu 33
empaka 32
zino 32
mengo 31
ebweru 30
olwa 30
aga 29
ebyemizzanyo 28
kakomo 28
agafa 27
buli 27
bwe 27
ebisanyusa 27
emboozi 27
endowooza 27
nnyo 27
okunnyweza 27
eno 26
ate 25
emirimu 25
guno 24
kino 24
uganda 24
be 22
bya 22
gya 22
abataka 21
enteekateeka 21
ngo 21
ebya 19
gavumenti 19
lya 19
agamba 18
airtel 18
eza 18
okwongera 18
ono 18
bantu 17
gye 17
amasaza 16
ye 16
kubanga 15
kyokka 15
mpaka 15
owa 15
serwanga 15
wano 15
bonna 14
endwadde 14
gu 14
naye 14
yebazizza 14
ategeezezza 13
bbiri 13
bwakabaka 13
ekika 13
naddala 13
nsonga 13
omukago 13
omusaayi 13
asinzidde 12
awamu 12
bye 12
ebika 12
eri 12
kiseera 12
okuwagira 12
omubaka 12
robert 12
bano 11
ebitone 11
emmwanyi 11
ensonga 11
eya 11
okubeera 11
okukola 11
okulaba 11
olwo 11
omupiira 11
abaana 10
abakulembeze 10
abasawo 10
agambye 10
bwa 10
ekitongole 10
embeera 10
emizannyo 10
obulungi 10
okusobola 10
okuva 10
sipiika 10
ssentebe 10
wamu 10
abiri 9
alaze 9
ddala 9
ekyo 9
emyaka 9
ga 9
maaso 9
muntu 9
nsibirwa 9
okuli 9
ssaabasajja 9
ssenyonyi 9
abalimi 8
ategeezeza 8
bazzukulu 8
bino 8
charles 8
ebyo 8
ekya 8
endala 8
ennono 8
essiga 8
kika 8
kye 8
nge 8
nkumi 8
okufuna 8
omulimu 8
omumyuka 8
omutaka 8
peter 8
ssenkulu 8
wabula 8
wakati 8
ze 8
abadde 7
abakulu 7
abawagizi 7
africa 7
amazzi 7
bajja 7
balina 7
bulange 7
bulungi 7
buweereza 7
byabwe 7
ebyobulamu 7
embuga 7
engeri 7
ensimbi 7
kkumi 7
luno 7
nakate 7
nnono 7
oba 7
obukulu 7
obulamu 7
obuwangwa 7
okuba 7
omuk 7
omuli 7
omwaka 7
ababaka 6
abaganda 6
abo 6
akalulu 6
alina 6
amaanyi 6
among 6
bangi 6
bbo 6
biseera 6
bucadef 6
buddu 6
ebitongole 6
ebyenjawulo 6
eggwanga 6
empisa 6
emu 6
eyo 6
ggwanga 6
gwe 6
joel 6
joseph 6
mukenenya 6
nnamulondo 6
ntikko 6
obuganda 6
obuyinza 6
okugaba 6
okunyweza 6
okwagala 6
omukubiriza 6
omuntu 6
singa 6
ssaza 6
ttiimu 6
we 6
abamu 5
abazzukulu 5
akatale 5
akulira 5
asaba 5
baganda 5
baleme 5
bannayuganda 5
bika 5
bokka 5
butale 5
cafe 5
disitulikiti 5
dr 5
enkolagana 5
ettaka 5
ffe 5
gino 5
gomba 5
kati 5
kaweefube 5
ki 5
kwe 5
lino 5
lukiiko 5
lwe 5
maka 5
mmamba 5
nati 5
nsi 5
obubaka 5
obujjanjabi 5
obukugu 5
obukulembeze 5
obwetaavu 5
ogu 5
okulabirako 5
okutuusa 5
oluvannyuma 5
omutindo 5
onal 5
palamenti 5
uwasnet 5
wansi 5
yonna 5
abaagala 4
abakungu 4
abalala 4
abazira 4
aka 4
amasiga 4
amayonjo 4
asatu 4
ayagala 4
baabwe 4
bakola 4
bannassingo 4
bavubuka 4
bitongole 4
bungi 4
bwabwe 4
byonna 4
ddwaaliro 4
ebitundu 4
egya 4
ejja 4
ekibiina 4
ekubye 4
emiggo 4
emipiira 4
emirala 4
emisomo 4
enkulaakulana 4
ennyo 4
ensi 4
essaza 4
essira 4
ezo 4
ggwangamujje 4
gyonna 4
henry 4
hon 4
ii 4
kawuki 4
kisaawe 4
kyabwe 4
kyagulanyi 4
lye 4
mmengo 4
mukaaga 4
mulundi 4
munaana 4
mutebi 4
mwaka 4
nabo 4
ngeri 4
nkola 4
nnya 4
nsisinkano 4
obo 4
oku 4
okubunyisa 4
okufaayo 4
okugenda 4
okukozesa 4
okukuza 4
okuyita 4
okuzzaawo 4
omukulu 4
omuwandiisi 4
omuwanika 4
owookubiri 4
platform 4
poliisi 4
pulezidenti 4
ssatu 4
unity 4
wadde 4
waggwa 4
waliwo 4
wampona 4
zaabwe 4
zonna 4
abakugu 3
abavujjirizi 3
abazannyi 3
abazze 3
abeera 3
agenda 3
ajjukizza 3
ali 3
amateeka 3
annyonnyola 3
annyonyodde 3
asiimye 3
asomesezza 3
atalina 3
awadde 3
awatali 3
azzeemu 3
baagala 3
baba 3
bagenda 3
bamaze 3
bannamawulire 3
bannamukago 3
bbs 3
bendera 3
bifo 3
bimu 3
bongere 3
boogera 3
bubaka 3
bugoba 3
bulamu 3
butaka 3
buvunanyizibwa 3
bwatyo 3
bwebaba 3
choltilda 3
ebadde 3
ebbeeyi 3
ebigambo 3
ebikolwa 3
ebikukwatako 3
ebyobulimi 3
eddwaaliro 3
ekifaananyi 3
ekituufu 3
embalirira 3
emirembe 3
emirundi 3
engoma 3
ennyingo 3
ensobi 3
essanyu 3
ettaano 3
ettofaali 3
eyawakati 3
fi 3
fufa 3
gabunga 3
gonna 3
ka 3
kaawaase 3
kamalabyonna 3
katale 3
kato 3
kintu 3
kirime 3
kuba 3
kulaga 3
kwongera 3
kyaddondo 3
leero 3
luggya 3
lwaki 3
lyabwe 3
mariam 3
mbalirira 3
mbeera 3
mulamwa 3
musanvu 3
mutendera 3
mutumba 3
ndawula 3
ndugwa 3
newankubadde 3
nkalubo 3
nnyinimu 3
obuggya 3
obutava 3
obuvunaanyizibwa 3
obuyiiya 3
obwapulezidenti 3
ogubalagala 3
okudda 3
okugatta 3
okugoberera 3
okujjumbira 3
okukuba 3
okukula 3
okulaga 3
okulambika 3
okulwanyisa 3
okumanya 3
okussa 3
okutambuza 3
okutemula 3
okutuuka 3
okuvuganya 3
okuzza 3
oludda 3
olusiisira 3
olwekyo 3
omu 3
omukisa 3
omukka 3
omulembe 3
omuteregga 3
omutongole 3
omuwendo 3
omwami 3
omwogezi 3
ona 3
oyo 3
patrick 3
rev 3
sizoni 3
ssemasonga 3
ssempijja 3
ssi 3
tulina 3
wakiso 3
yategeeza 3
zombi 3
abagenda 2
abaggya 2
abajjukiza 2
abajjukizza 2
abakiise 2
abakolera 2
abakubirizza 2
abakuumaddembe 2
abalabe 2
abalabi 2
abali 2
abasajja 2
abatali 2
abategesi 2
abatendekeddwa 2
abatendesi 2
abava 2
abe 2
abeetaba 2
abeetabye 2
afuna 2
aggulawo 2
ajjukiza 2
akaseera 2
akikaatiriza 2
akkaatiriza 2
akomyewo 2
akulembera 2
algeria 2
alipoota 2
aloopedde 2
amagezi 2
amagye 2
amaka 2
amasasi 2
amasiro 2
amatendekero 2
amatwale 2
america 2
ana 2
annet 2
anokoddeyo 2
anyonnyodde 2
asooka 2
asuubiza 2
ataano 2
ategeeza 2
atyo 2
augustine 2
ayogerako 2
baali 2
baami 2
bafuna 2
bagamba 2
bakiise 2
bakuume 2
balaba 2
balamu 2
bali 2
balowooza 2
bamalirivu 2
baminisita 2
bannaabwe 2
bannabyabufuzi 2
bannaddiini 2
bannakibiina 2
basawo 2
basigaza 2
basomeseddwa 2
bataka 2
batunuulidde 2
batyo 2
bavuddeyo 2
bawangaalira 2
bazze 2
bbeeyi 2
bboodi 2
biragiro 2
bisaawe 2
bisatu 2
bitundu 2
boston 2
buddawo 2
budde 2
bukulembeze 2
buno 2
butambala 2
buzaale 2
bwaffe 2
bwami 2
bwanika 2
bwekityo 2
byayi 2
centenary 2
cup 2
côte 2
dda 2
ddiifiri 2
di 2
ebbula 2
ebifo 2
ebikwata 2
ebimu 2
ebirowoozo 2
ebiseera 2
ebyemizannyo 2
ebyogerwa 2
eddoboozi 2
eddwaliro 2
effujjo 2
efunye 2
eggulo 2
egudde 2
egyo 2
ekiseera 2
ekubiddwa 2
embavu 2
emikisa 2
emmwaanyi 2
empya 2
england 2
enguzi 2
enkampa 2
enkizo 2
enkola 2
ennaku 2
enneeyisa 2
ennungi 2
ensiisira 2
erinnya 2
eriwo 2
eryo 2
essaawa 2
essuubi 2
eyagala 2
eyali 2
ezitasiigibwa 2
eziva 2
eziyindira 2
eziyinza 2
ge 2
ggoolo 2
gibeere 2
gumu 2
gyabwe 2
hajjat 2
ivoire 2
kafeero 2
kaggwa 2
kajubi 2
kale 2
kalinda 2
kasirye 2
kasita 2
kateregga 2
kbbiri 2
kifo 2
kigendererwa 2
kijja 2
kikugu 2
kikumi 2
kimu 2
kirina 2
kisakye 2
kitebe 2
kituufu 2
kiyimba 2
kkampuni 2
kubaagala 2
kuggulawo 2
kujjanjaba 2
kulaba 2
kumpi 2
kuno 2
kuteekebwa 2
kutumbula 2
ligenda 2
likolebwa 2
ludda 2
lukumi 2
lukwago 2
luwaga 2
lwenda 2
lwokubiri 2
lwokusatu 2
lwomukaaga 2
masaza 2
masiga 2
masomero 2
mateeka 2
mayonjo 2
mingi 2
morocco 2
mpola 2
mugisha 2
mugumbule 2
mukago 2
mukiibi 2
mukolo 2
mupiira 2
musango 2
museveni 2
musoke 2
mwe 2
mwova 2
myaka 2
namboole 2
namibia 2
nattabi 2
ndagaano 2
ndagala 2
new 2
nfuna 2
njuyi 2
nkyukakyuka 2
nnaku 2
noah 2
obuli 2
obulwadde 2
obuweereza 2
obwetaagisa 2
obwo 2
of 2
ogwa 2
okoma 2
okubaako 2
okubaawo 2
okubiri 2
okufulumya 2
okugamba 2
okugayaala 2
okuggusa 2
okujaguza 2
okukiika 2
okukomya 2
okukubaganya 2
okukubiriza 2
okulamaga 2
okulemesa 2
okulinnya 2
okulonda 2
okuluka 2
okununula 2
okusiba 2
okusinziira 2
okusitula 2
okutaasa 2
okutandika 2
okutegeeza 2
okutta 2
okutuukiriza 2
okutwaliza 2
okuvaayo 2
okuwa 2
okuwandiisa 2
okuwangaala 2
okuwangula 2
okuweebwa 2
okuweereza 2
okuyambako 2
okwanika 2
okwawula 2
okwegendereza 2
okwegiriisa 2
okwekebeza 2
okwetaba 2
okwewala 2
okwolesa 2
olulimi 2
oluvuganya 2
oluwalo 2
omuganda 2
omukungu 2
omuky 2
omuzannyo 2
omwali 2
paalamenti 2
rexba 2
rugby 2
sarah 2
scheme 2
senegal 2
sports 2
ssaabataka 2
ssejjengo 2
ssekabaka 2
ssente 2
ssiga 2
sulaiman 2
tekiba 2
tekinologiya 2
tewali 2
ttaka 2
tubeera 2
tubeere 2
tujja 2
tutya 2
twagala 2
wabaddewo 2
waggulu 2
wankulukuku 2
weyisaamu 2
yakwongera 2
yebaza 2
yeebazizza 2
yekokkodde 2
yenna 2
yetabye 2
zigenda 2
zijja 2
zimbabwe 2
zongere 2
