mu 402
ku 281
nga 261
n 243
nti 164
ne 163
e 118
ng 98
era 88
wa 77
y 77
abantu 74
w 51
bwe 46
kya 46
kino 40
uganda 40
z 40
bw 39
abaana 38
olw 37
ya 35
ky 33
ate 31
buli 31
lw 29
agamba 27
eno 27
by 26
we 26
ye 26
za 26
be 25
gw 25
gye 25
2 24
ba 24
zino 24
bino 23
poliisi 23
wakati 23
kuba 22
kyokka 22
wabula 22
000 21
eby 21
gavumenti 21
guno 21
ssente 21
abayizi 20
b 20
bbomu 20
bwa 20
nnyo 20
bano 19
ssentebe 19
1 18
abamu 18
eri 18
katonda 18
okuli 18
omu 18
omusumba 18
yagambye 18
kisige 17
naye 17
yunivasite 17
ab 16
eddagala 16
essaza 16
ey 16
gwe 16
kati 16
kubanga 16
okuva 16
abakulembeze 15
africa 15
agambye 15
ekya 15
gy 15
john 15
ka 15
kampala 15
kye 15
oba 15
oluvannyuma 15
olwo 15
ono 15
ssande 15
abatuuze 14
eggwanga 14
kifo 14
kw 14
lubaga 14
malawi 14
mpaka 14
okugema 14
omubaka 14
wiiki 14
yategeezezza 14
abadde 13
abavubuka 13
ggoolo 13
gwa 13
leero 13
okufuna 13
ssinga 13
wamu 13
ekibiina 12
empaka 12
emyaka 12
ensonga 12
ethiopia 12
ez 12
fr 12
g 12
ghetto 12
ly 12
lya 12
minisita 12
nrm 12
nsonga 12
okulaba 12
omwaka 12
ow 12
yabadde 12
yiga 12
yonna 12
3 11
abadiventi 11
abalala 11
alina 11
amawanga 11
asabye 11
ategeeza 11
bantu 11
bonna 11
eky 11
embeera 11
emu 11
enkola 11
kiseera 11
makindye 11
na 11
november 11
okwongera 11
owa 11
2021 10
amaanyi 10
baabwe 10
bagamba 10
bya 10
covid-19 10
covid19 10
ddwaaliro 10
disitulikiti 10
ekirwadde 10
katikkiro 10
kcca 10
namibia 10
osobola 10
pulezidenti 10
ttiimu 10
wadde 10
4 9
6 9
aba 9
ababadde 9
abazadde 9
baabadde 9
bakulembeddwamu 9
bye 9
djibouti 9
ebimu 9
ekifo 9
ennyo 9
jjumba 9
kkiro 9
luzira 9
mukono 9
ngeri 9
obulungi 9
obulwadde 9
okubeera 9
okusoma 9
olunaku 9
omukyala 9
wano 9
zonna 9
5 8
abagenda 8
akawuka 8
ali 8
asaba 8
bulungi 8
burundi 8
ddala 8
ebisolo 8
emirimu 8
emyooga 8
engeri 8
enjawulo 8
eya 8
ga 8
joseph 8
kkooti 8
kwe 8
lwa 8
maaso 8
masaka 8
mukaaga 8
myaka 8
nabbanja 8
nsi 8
obukadde 8
obulamu 8
omwezi 8
paapa 8
peter 8
s 8
sheikh 8
siriimu 8
tanzania 8
yaabwe 8
zambia 8
10 7
8 7
abagenzi 7
abakristu 7
abali 7
abaserikale 7
abazannyi 7
akola 7
ategeezezza 7
bangi 7
bo 7
buganda 7
bwonna 7
byabwe 7
byonna 7
cranes 7
dda 7
ekitundu 7
emyoga 7
ensimbi 7
eritrea 7
ettaka 7
express 7
eyali 7
faaza 7
gaabwe 7
ggwanga 7
kapeti 7
kuno 7
kwa 7
kyalo 7
lutikko 7
maka 7
mmande 7
mulinde 7
mwe 7
naddala 7
obeera 7
october 7
okugula 7
okukola 7
okusinziira 7
okwerinda 7
omuntu 7
omupiira 7
omuzannyo 7
omwogezi 7
pent 7
series 7
she 7
south 7
20 6
30 6
abakadde 6
abakyala 6
akatale 6
akulira 6
alabudde 6
amateeka 6
ayagala 6
bali 6
bba 6
byalo 6
cecafa 6
center 6
covid 6
ebintu 6
ebirabo 6
ebiri 6
ebyalo 6
ebyapa 6
emmaali 6
enkoko 6
ge 6
gumu 6
kisaawe 6
kkono 6
kuliko 6
lubyayi 6
lugazi 6
mayiga 6
mukyala 6
muntu 6
musaala 6
mwaka 6
najjemba 6
nakkazi 6
ogwa 6
okuba 6
okufa 6
okutuuka 6
okwekulaakulanya 6
olwa 6
omusaayi 6
palamenti 6
si 6
turinawe 6
waliwo 6
yasabye 6
400 5
7 5
9 5
abasawo 5
abo 5
amalala 5
anthony 5
asinzidde 5
awamu 5
babadde 5
babalanda 5
bakyali 5
balina 5
balowooza 5
bannayuganda 5
baptist 5
basaba 5
bayinginiya 5
bbo 5
bodaboda 5
bukomansimbi 5
bwabwe 5
bwatyo 5
championship 5
church 5
dr 5
ebbanga 5
ebifo 5
ebizibu 5
ebya 5
ebyokwerinda 5
eggulo 5
ekitongole 5
emmwaanyi 5
enkoofiira 5
enteekateeka 5
eyo 5
kakande 5
kase 5
khalifa 5
kibiina 5
kibuga 5
kigozi 5
kikenwa 5
kiyingi 5
kizito 5
kkojjaawe 5
kyambogo 5
lwe 5
mawanga 5
mbeera 5
mmisa 5
mmotoka 5
mukolo 5
munisipaali 5
mwezi 5
nabo 5
nnyina 5
offiisi 5
okuddamu 5
okukebera 5
okusaba 5
okusinga 5
okwewala 5
okwogera 5
omulangira 5
omuli 5
omulundi 5
omumyuka 5
ossa 5
sacco 5
so 5
sosegi 5
ssaako 5
takisi 5
vipers 5
waabwe 5
wansi 5
yali 5
yokka 5
11 4
13 4
200 4
abasatu 4
abasuubuzi 4
abatujju 4
abawala 4
abazze 4
amagezi 4
amazzi 4
asobola 4
avunaanyizibwa 4
baali 4
baana 4
bafunye 4
bagenda 4
bakkansala 4
bannaddiini 4
bannamawulire 4
basazeewo 4
basobola 4
bassentebe 4
bayizi 4
bazze 4
bbiri 4
bintu 4
biseera 4
bp 4
bulabe 4
bulijjo 4
charles 4
ddwaliro 4
demokulaasiya 4
ebikolwa 4
ebirala 4
ebisode 4
ebitongole 4
effu 4
egy 4
ejja 4
ekika 4
ekirungi 4
eklezia 4
ekyo 4
emipiira 4
emmotoka 4
empooza 4
endwadde 4
enkulu 4
ennaku 4
ennyama 4
ensi 4
ente 4
essanyu 4
ewedde 4
eyawummula 4
federation 4
gano 4
ggombolola 4
gideon 4
gya 4
james 4
kaadi 4
kalulu 4
kamu 4
katale 4
kayunga 4
ke 4
kibooko 4
kigo 4
kitaawe 4
kitundu 4
kituufu 4
kkampuni 4
kyabwe 4
lino 4
lubuto 4
mary 4
mateeka 4
minaani 4
muky 4
mulimu 4
munne 4
mutuuzo 4
netball 4
north 4
obubonero 4
obukoko 4
obulabe 4
obuwanguzi 4
obuyinza 4
obuzibu 4
ofiisi 4
ogenda 4
ogujja 4
ogw 4
okubadde 4
okubaka 4
okudda 4
okufaayo 4
okugaba 4
okukakasa 4
okukolera 4
okuluka 4
okumala 4
okumanya 4
okutandika 4
okutta 4
okutuusa 4
okuvaayo 4
okuwa 4
okuwangula 4
okuweereza 4
okuyambako 4
okuziika 4
okwekebeza 4
omugenzi 4
omuggalo 4
omukaaga 4
omukulu 4
omulala 4
omulimu 4
omusawo 4
omutendesi 4
omwala 4
omwana 4
paul 4
police 4
ppaaka 4
rev 4
serubuulwa 4
ssaabalabirizi 4
ssemogerere 4
st 4
stella 4
supreme 4
u20 4
usafi 4
wamala 4
windhoek 4
women 4
yasinzidde 4
yeebazizza 4
ze 4
zimbabwe 4
13-0 3
14 3
15 3
16 3
19 3
50 3
abaabadde 3
abaakubiddwa 3
abagoba 3
abakazi 3
abalimi 3
abasaba 3
abasinga 3
abatalina 3
abawagizi 3
abdunoor 3
abeera 3
abeetabye 3
abenjawulo 3
abooluganda 3
abu 3
abyogeredde 3
agenze 3
akaleeta 3
akwasizza 3
aliko 3
alimu 3
amawulire 3
ategezezza 3
augustine 3
ava 3
awatali 3
ayogera 3
baagala 3
babeera 3
babiri 3
bagambye 3
bajeti 3
bakola 3
balumiriza 3
bamulekwa 3
banayuganda 3
basabye 3
batudde 3
bawa 3
bayinza 3
beetabye 3
bennyamidde 3
bingi 3
biri 3
bubonero 3
buikwe 3
bukedde 3
bulamu 3
busabaga 3
busoga 3
buwanguzi 3
byennyanja 3
byuma 3
championships 3
cross 3
deus 3
ebifaananyi 3
ebitaliimu 3
ebitundu 3
ebyettaka 3
ecamudde 3
eddwaaliro 3
eggombolola 3
ekigendererwa 3
ekikopo 3
ekintu 3
ekitiibwa 3
ekkanisa 3
ekola 3
ekwata 3
emisumaali 3
emulago 3
enju 3
enkuba 3
ensambaggere 3
eriiso 3
erina 3
erya 3
esatu 3
essaala 3
eyaliko 3
fc 3
ffamire 3
fufa 3
gaayo 3
ggwe 3
guli 3
heavy 3
holy 3
jaamu 3
k 3
kakiiko 3
kanisa 3
kapiteeni 3
kasujja 3
kawumbi 3
kenya 3
kigambibwa 3
kijja 3
kimu 3
kiro 3
kitegeeza 3
kkanisa 3
kkeesi 3
kukuza 3
kusaba 3
kuzimba 3
kwetabiddwako 3
kyagulanyi 3
kyangu 3
kyonna 3
kyuma 3
life 3
ludo 3
lumu 3
lunaku 3
luno 3
lwokutaano 3
lwomukaaga 3
maama 3
makerere 3
masiga 3
mayumba 3
mubiru 3
mukasa 3
mukenenya 3
mukiibi 3
munsi 3
museveni 3
musomo 3
muwala 3
muyingo 3
mwala 3
mwana 3
nabyo 3
najjanankumbi 3
nakaseke 3
nakibinge 3
nasaba 3
ndeeba 3
nguudo 3
njeru 3
nsambya 3
nsisinkano 3
nsobya 3
nsubuga 3
nteekateeka 3
ntono 3
nup 3
obbo 3
obudde 3
obugagga 3
obukuumi 3
obuserikale 3
obutujju 3
obuyambi 3
obw 3
ofuna 3
okola 3
okubaako 3
okugezesa 3
okujjumbira 3
okukkiriza 3
okukwatibwa 3
okulonda 3
okulunda 3
okulwanyisa 3
okusigala 3
okusobola 3
okusomera 3
okutandikira 3
okutega 3
okutendeka 3
okutunda 3
okutwala 3
okuyita 3
okuyitamu 3
okw 3
okwetaba 3
olina 3
olubuto 3
olwaleero 3
omukisa 3
omulambo 3
omulwadde 3
omusajja 3
omutindo 3
omutujju 3
omuzannyi 3
omwami 3
oyella 3
patrick 3
puleesa 3
regina 3
robinah 3
sam 3
samuel 3
singa 3
sipiika 3
sizoni 3
ssaabasumba 3
ssomero 3
tamanyi 3
tebiriyo 3
technical 3
teyasoma 3
tournament 3
ttaka 3
ucu 3
waggulu 3
wakiso 3
wetaaga 3
yafiiridde 3
yasoose 3
yawangula 3
youth 3
zokka 3
1-0 2
100 2
12 2
2022 2
24 2
25 2
26 2
5-1 2
55 2
60 2
76-22 2
aana 2
abaawangudde 2
ababeera 2
abaddukanya 2
abagaana 2
abagamba 2
abagenyi 2
abakolera 2
abakugu 2
abaleeta 2
abalina 2
abalunzi 2
abangi 2
abasaabaze 2
abasajja 2
abasiraamu 2
abasumba 2
abatali 2
abatasussa 2
abategesi 2
abatembeeyi 2
abawagira 2
abawanguzi 2
abawawaabirwa 2
abeegattira 2
aduumira 2
adventist 2
afa 2
afudde 2
agamu 2
agifuna 2
agwa 2
ak 2
akawungeezi 2
akubiriza 2
akwagala 2
alaga 2
aliwal 2
allah 2
aloysius 2
alwala 2
amafuukuule 2
amahare 2
amaka 2
amakulu 2
amala 2
amaliri 2
amangu 2
amannya 2
amazima 2
amizza 2
amusaba 2
amya 2
and 2
annet 2
annyonnyola 2
annyuse 2
asekeredde 2
asinga 2
asirisizza 2
asizza 2
asobole 2
atakyukakyuka 2
atendeka 2
atimnedi 2
atunze 2
atyo 2
authority 2
avumiridde 2
awa 2
awadde 2
awaka 2
awangudde 2
aweza 2
awona 2
ayambibwako 2
ayingira 2
ayitibwa 2
ayogerako 2
ayub 2
aziraawa 2
baafuna 2
baasoose 2
baatuuka 2
baaziikiddwa 2
babawa 2
babbulooka 2
badiventi 2
bafa 2
baffamire 2
bagaanye 2
bagabanye 2
bajjumbidde 2
bakung 2
bakutte 2
bakyuse 2
balonda 2
balumba 2
bamaze 2
bammemba 2
bamulumiriza 2
bamusabide 2
bamusabira 2
bamuwonga 2
bamwogerako 2
banabyabufuzi 2
bannabyamizannyo 2
bannaddini 2
banywezezza 2
baperesona 2
basabidde 2
basibuddwa 2
basiimye 2
basobole 2
basooke 2
bataano 2
batandika 2
bateebwa 2
bateeseteese 2
bategeezezza 2
batunda 2
batuusa 2
batuuze 2
batyo 2
baweebwe 2
baweeredwa 2
bayita 2
bazannya 2
bbanga 2
bbanka 2
bbosa 2
beebaza 2
beebazizza 2
beebijambiya 2
beetaaga 2
bekebezza 2
bibeera 2
bibiina 2
bifo 2
big 2
bigenda 2
bigere 2
bikolwa 2
birmingham 2
birungi 2
bisobole 2
bituuse 2
boda 2
brian 2
budaaki 2
buddu 2
bul 2
bumativu 2
bunamwaya 2
bungereza 2
bungi 2
buno 2
business 2
busunju 2
buvunaanyizibwa 2
buweereza 2
buzibu 2
buzito 2
bwakabaka 2
bwenkanya 2
byafaayo 2
byafuna 2
byamugisha 2
byapa 2
byatondebwawo 2
c 2
catholic 2
central 2
city 2
collins 2
conference 2
cr 2
daawa 2
ddakiika 2
ddene 2
ddiini 2
dduwa 2
dennis 2
di 2
djibout 2
dodovikosl 2
dp 2
dubai 2
ebayambe 2
ebibanja 2
ebibuuzo 2
ebigambo 2
ebikolebwa 2
ebikolobero 2
ebikuumibwa 2
ebikuumirwa 2
ebikwekweto 2
ebimenya 2
ebiragiro 2
ebirungi 2
ebyatondebwawo 2
ebyayita 2
ebyennyanja 2
ebyobugagga 2
ebyobulamu 2
ebyogerwako 2
eddala 2
eddembe 2
eddiini 2
egamba 2
egigenda 2
egula 2
ejjoogi 2
ekiddugavu 2
ekigo 2
ekimwennyamiza 2
ekirabo 2
ekirala 2
ekiramba 2
ekiseera 2
ekisomesa 2
ekitegeeza 2
ekitera 2
ekiyumba 2
ekkubo 2
ekkulu 2
ekyabasalibwa 2
emabega 2
emakubo 2
emiriraano 2
emisomo 2
emmanuel 2
ena 2
enene 2
engoye 2
enkulaakulana 2
enkya 2
ennyana 2
ennyanja 2
ensawo 2
entebbe 2
entekateeka 2
erimu 2
eryamuviirako 2
etambula 2
etandise 2
etonnya 2
etuuse 2
eyabise 2
eyafuna 2
eyagala 2
eyakubibwa 2
eyaweebwanga 2
eza 2
ezannya 2
ezikwatagana 2
ezitandika 2
eziwera 2
family 2
fiiti 2
friends 2
fu 2
gaakirozako 2
gamba 2
golola 2
gwabadde 2
gwabwe 2
gyalimu 2
hadijah 2
hajji 2
hk 2
hussien 2
imperial 2
inf 2
international 2
is 2
island 2
jip 2
jjajja 2
joshua 2
jude 2
kabowa 2
kafeero 2
kajja 2
kakadde 2
kakembo 2
kalidinaali 2
kalule 2
kalumba 2
kamoga 2
kasajja 2
kasooli 2
katushabe 2
kawolo 2
kazimba 2
keita 2
kibeera 2
kibuyaga 2
kiconco 2
kigenda 2
kijja-omanyi 2
kinaabiro 2
kinconco 2
kitabo 2
kitaka 2
kitiibwa 2
kitintale 2
kiwalaata 2
kiyinji 2
kizinga 2
kkubo 2
klezia 2
kuddyo 2
kugenda 2
kulaga 2
kulonda 2
kusoomoozebwa 2
kusuubirwa 2
kutandika 2
kuzannya 2
kuzikozesa 2
kwabade 2
kwategekeddwa 2
kwerabira 2
kwo 2
kwogera 2
kyabakubye 2
kyakukwatibwa 2
kyakulwanyisa 2
kyambalo 2
kyandiba 2
kyengera 2
kyeyo 2
kyongera 2
lc 2
light 2
liigi 2
livingstone 2
ltd 2
lubowa 2
lukung 2
lutalo 2
lwaki 2
lwanga 2
lyabwe 2
lye 2
magezi 2
mannya 2
margaret 2
matovu 2
mayuge 2
media 2
medical 2
memba 2
miguwa 2
ministries 2
mipiira 2
mizannyo 2
mmeeya 2
mmengo 2
mpeewo 2
mufti 2
mugerwa 2
muggalo 2
mukwemulugunya 2
mulago 2
mulamba 2
mulondo 2
mungeri 2
munna 2
mupiira 2
mutabani 2
mutendera 2
mutungo 2
mutuukirivu 2
mutuuze 2
mutwe 2
muzannyo 2
mw 2
mwandha 2
mwasirizi 2
mwenda 2
mwesige 2
mwoyo 2
my 2
nagwo 2
nakalyango 2
nakulabye 2
nalugya 2
namasuba 2
namuddu 2
namuju 2
nandago 2
nange 2
national 2
ndagire 2
new 2
ngamba 2
nkoko 2
nnyumba 2
nsengeka 2
nsiike 2
nsobi 2
ntekateeka 2
nze 2
obonyo 2
obubaka 2
obujanjabi 2
obukulembeze 2
obulagajjavu 2
obulenzi 2
obusoosorodooti 2
obutali 2
obutuufu 2
obuvunaanyizibwa 2
obwa 2
obwamaanyi 2
obwaminisita 2
obwegendereza 2
ogugamba 2
ogusooka 2
oguwedde 2
okubawa 2
okubikka 2
okubutuukako 2
okuddukiriranga 2
okudduukirira 2
okugaana 2
okugenda 2
okugoba 2
okujja 2
okukka 2
okukkakkanya 2
okukozesa 2
okukuza 2
okulabirira 2
okulondebwa 2
okulondoola 2
okulwanira 2
okulya 2
okumusabira 2
okumusunsula 2
okunnyikiza 2
okunnyonnyola 2
okunoonyereza 2
okununula 2
okusaasaana 2
okusiima 2
okusomesa 2
okusooka 2
okusookera 2
okusoomoozebwa 2
okusuula 2
okutandikawo 2
okuteeka 2
okuterekayo 2
okuweebwa 2
okuyamba 2
okuyingira 2
okwabadde 2
okwambalwa 2
okwekengera 2
okwekobaana 2
okwenyweza 2
okwetooloola 2
olobo 2
olowooza 2
olulwana 2
olutalo 2
oluusi 2
oluvanyuma 2
olwekyo 2
omubadde 2
omubeezi 2
omugenyi 2
omukazi 2
omulabirizi 2
omulimi 2
omusango 2
omusanvu 2
omutima 2
omuyizi 2
omuzadde 2
omuze 2
omweezi 2
omwoyo 2
one 2
osobole 2
otunda 2
ovuga 2
oyagala 2
paalamenti 2
patri 2
ppule 2
primary 2
pulaani 2
qa 2
racheal 2
robert 2
royale 2
savings 2
scheme 2
serverus 2
services 2
shamirah 2
sipiidi 2
sops 2
sports 2
ssaabakristu 2
ssaabaminista 2
ssaawa 2
ssabagabo 2
ssabakristu 2
ssaza 2
sseguku 2
ssekiwunga 2
ssemaganda 2
ssendege 2
ssendyose 2
ssuubi 2
stephen 2
taekwondo 2
tagenda 2
tebafuna 2
tebamanyi 2
tewali 2
title 2
tr 2
ttaano 2
tugume 2
twagala 2
twinomujuni 2
updf 2
waabaddewo 2
waakubeererawo 2
waka 2
wala 2
wali 2
wasinzidde 2
wasswa 2
weetaaga 2
wiikendi 2
wiini 2
wild 2
willy 2
wooteeri 2
wuzzi 2
yaakamala 2
yabasiimye 2
yabyogeredde 2
yafudde 2
yakakasizza 2
yakalondebwa 2
yakubirizza 2
yakukkulumidde 2
yamusobezesa 2
yamuyamba 2
yasiimye 2
yateereddeko 2
yategezezza 2
yawadde 2
yeeyamye 2
yenna 2
yesu 2
yig 2
yintaneeti 2
yo 2
zabwe 2
zisobola 2
zitabudde 2
ziwedde 2
zoo 2
