mu 172
ku 106
nga 74
nti 63
era 51
na 50
ne 47
abantu 41
bwe 39
ono 37
bano 32
no 32
kino 29
ye 28
ya 23
bwa 22
e 21
wa 21
ba 19
kyagulanyi 19
naye 19
agamba 17
kye 16
museveni 16
bino 14
kya 14
naddala 14
poliisi 14
wamu 14
akalulu 13
bya 13
nge 13
be 12
buganda 12
eno 12
mbu 12
buli 11
enjawulo 11
guno 11
kuba 11
lwe 11
olwe 11
oweekitiibwa 11
za 11
ensonga 10
gye 10
lwa 10
aba 9
abadde 9
amaanyi 9
balina 9
lye 9
obwakabaka 9
okulaba 9
palamenti 9
yali 9
abamu 8
ategeezezza 8
baabwe 8
bagenda 8
bannayuganda 8
bmk 8
bo 8
ebyo 8
gavumenti 8
kano 8
kuliko 8
kyaggwe 8
mayiga 8
okukola 8
olunaku 8
olwo 8
omuntu 8
pulezidenti 8
wano 8
yategeezezza 8
abalala 7
bantu 7
ebintu 7
emu 7
kimu 7
leero 7
mirembe 7
nati 7
nnyo 7
okuli 7
oluvannyuma 7
omubaka 7
onal 7
singa 7
sipiika 7
ssemujju 7
ababaka 6
akatabo 6
alina 6
amagye 6
amazzi 6
asaba 6
ate 6
bitundu 6
bobi 6
dokita 6
emmwanyi 6
ennyo 6
eri 6
ggwanga 6
kabaka 6
lino 6
ngeri 6
okusinziira 6
okwekalakaasa 6
oluvuganya 6
platform 6
unity 6
ze 6
zino 6
abaana 5
akulira 5
amagezi 5
asabye 5
avuddeyo 5
ayagala 5
baabadde 5
bali 5
bangi 5
bonna 5
buno 5
bye 5
disitulikiti 5
ebitundu 5
eddembe 5
ekibiina 5
engeri 5
enteekateeka 5
essaza 5
gwa 5
gya 5
kati 5
katikkiro 5
kkumi 5
kubaddeko 5
kyokka 5
nsonga 5
oba 5
ochom 5
okusobola 5
okwerinda 5
okwongera 5
oludda 5
owa 5
wine 5
yabadde 5
yasabye 5
abaduumizi 4
abakungu 4
abalunzi 4
abo 4
agambye 4
amanyiddwa 4
ataano 4
baagala 4
baali 4
bakola 4
byo 4
ebiseera 4
ebitongole 4
ebyobufuzi 4
eggulo 4
eggwanga 4
ekitundu 4
ekyo 4
ensi 4
eze 4
fred 4
ga 4
ge 4
hajji 4
kampala 4
katonda 4
kifo 4
kikumi 4
kkooti 4
kukikola 4
kuno 4
kwa 4
lwo 4
minisita 4
mmande 4
munaana 4
muno 4
nayo 4
ngo 4
obulamu 4
okufuna 4
okulayira 4
okulemesa 4
okusooka 4
okuzza 4
owe 4
ssente 4
uganda 4
wabula 4
wadde 4
yo 4
zo 4
abakyala 3
abali 3
abeera 3
ajja 3
akakiiko 3
alangiridde 3
amakumi 3
asatu 3
awamu 3
ayogerako 3
baba 3
bajja 3
bakikole 3
bannabyabufuzi 3
bannamawulire 3
basobola 3
basobole 3
bibuga 3
bulange 3
butongole 3
byaliwo 3
corona 3
ddoozi 3
ebadde 3
ebye 3
ebyenjawulo 3
ebyokulonda 3
egye 3
ekibinja 3
ekirime 3
ekirwadde 3
ekisobola 3
ekya 3
emalidde 3
emirimu 3
emyezi 3
enkoko 3
ggoolo 3
gumu 3
kadaga 3
kamwokya 3
kannyonnyola 3
ke 3
kibuga 3
kikolebweko 3
kkampuni 3
kubeera 3
kyabwe 3
kyakubiri 3
kyalo 3
lukiiko 3
lukumi 3
lwaki 3
lwenda 3
lya 3
maaso 3
mukolo 3
mukono 3
musanvu 3
myaka 3
namirembe 3
nannyunja 3
nteekateeka 3
obubonero 3
obutonde 3
obuwanguzi 3
obwenkanya 3
okubeera 3
okuddamu 3
okukozesa 3
okutandika 3
okutumbula 3
okuva 3
olugendo 3
omukago 3
omuli 3
si 3
ssaza 3
ssennyiga 3
tugenda 3
waliwo 3
we 3
abaami 2
abaduumira 2
abakessi 2
abakulira 2
abalonde 2
abalonzi 2
abasabye 2
abasawo 2
abato 2
abatuuze 2
abavubuka 2
abawagizi 2
abe 2
abiri 2
addamu 2
africana 2
afuuka 2
agasseeko 2
agenda 2
agenze 2
akakasa 2
akakasizza 2
akkiriza 2
alabudde 2
alaga 2
ali 2
aliko 2
amasannyalaze 2
amasaza 2
amazima 2
amyuka 2
annyonnyodde 2
asobodde 2
atyo 2
awadde 2
awo 2
babadde 2
babanja 2
baffe 2
bafune 2
bakolera 2
bakozesa 2
bakyala 2
balagiddwa 2
balima 2
bamaze 2
baminisita 2
bannaabwe 2
bannabuddu 2
bannakibiina 2
basabiddwa 2
basawo 2
basisinkanye 2
bataano 2
batandika 2
bategeka 2
bavubuka 2
bawagizi 2
bawambibwa 2
bayiga 2
bazudde 2
bazze 2
bbiri 2
beene 2
beetaaga 2
bibadde 2
bintu 2
biraga 2
biseera 2
bucadef 2
budde 2
bugerere 2
bulamu 2
bulijjo 2
busatu 2
busiro 2
buyinza 2
bwabwe 2
bwanika 2
bwavu 2
bwengula 2
byabwe 2
byalo 2
byenfuna 2
byogeddwa 2
byonna 2
dda 2
ddoola 2
ddwaliro 2
dpc 2
dr 2
ebbaluwa 2
ebibiina 2
ebigambibwa 2
ebikolwa 2
ebiri 2
ebyava 2
ebyobulamu 2
ebyobulimi 2
ebyokwerinda 2
eddagala 2
egyo 2
ekimu 2
ekintu 2
ekiseera 2
ekitiibwa 2
ekitongole 2
ekizibu 2
embeera 2
embuga 2
embuto 2
emmere 2
empaka 2
enanga 2
enda 2
enkulaakulana 2
enkya 2
erina 2
esomye 2
essaawa 2
eya 2
ezisoba 2
ffe 2
ggombolola 2
guli 2
gwe 2
gwo 2
ibrahim 2
japan 2
kaguta 2
kakomo 2
kalulu 2
kalungu 2
kibirige 2
kikyamu 2
kinaana 2
kiri 2
kisaawe 2
kiseera 2
kitundu 2
kityo 2
kizimbe 2
kuddamu 2
kufuna 2
kugema 2
kukozesa 2
kulonda 2
kutabangula 2
kuyambibwa 2
ludda 2
lulume 2
luno 2
lwokubiri 2
lyabwe 2
lyo 2
maka 2
makumi 2
mateeka 2
minisitule 2
mitendera 2
mmengo 2
mulimu 2
mwe 2
mwenda 2
nabbosa 2
namayumba 2
ndi 2
nganda 2
nkola 2
nkumi 2
nnina 2
nnya 2
nrm 2
nsi 2
ntikko 2
obubaka 2
obukadde 2
obukodyo 2
obulabirizi 2
obulungi 2
obuntu 2
obusumba 2
obutagezaako 2
obuwagizi 2
obuzibu 2
obwedda 2
ogwe 2
okubayamba 2
okubbibwa 2
okufaayo 2
okufufuggaza 2
okufuuka 2
okukosa 2
okukwatibwa 2
okumalawo 2
okunnyikiza 2
okusinga 2
okutta 2
okutwala 2
okutya 2
okuwa 2
okuzifunamu 2
okuzzaawo 2
okwerandiza 2
okwetegereza 2
okwettanira 2
olukwe 2
olwa 2
omu 2
omubbi 2
omubeezi 2
omukolo 2
omulunzi 2
omutendera 2
omuvubuka 2
omwogezi 2
omwoleso 2
oyagala 2
rebecca 2
robert 2
rpc 2
south 2
ssatu 2
ssebuggwawo 2
ssekiboobo 2
ssekimpi 2
ssemateeka 2
ssembabule 2
ssenkulu 2
ssentamu 2
ssentongo 2
terimba 2
tosobola 2
ttiimu 2
tuli 2
vvaawompitewo 2
wakati 2
wali 2
wo 2
wooteeri 2
yagamba 2
yalaga 2
yamaze 2
yannyonnyodde 2
yasinzidde 2
yeegasse 2
yenna 2
yoweri 2
zaali 2
zigenda 2
