mu 559
nga 228
ku 220
no 137
ya 136
era 112
abantu 109
ne 103
bo 74
wamu 70
bwe 60
embeera 58
ba 56
nti 56
na 54
gu 52
awamu 50
ddala 47
kya 46
za 46
amaanyi 44
ebyo 44
buli 42
eno 42
bya 41
obusobozi 40
eza 39
emirimu 38
eya 38
maaso 37
abeemikwano 36
mbeera 36
abo 35
abalala 34
omwoyo 34
oba 32
kaweefube 31
okuva 31
ennyo 30
wa 30
ekya 29
enteekateeka 29
lwa 29
oku 29
okukola 29
omuntu 29
ga 28
kitundu 28
engeri 27
enkola 27
enkulaakulana 27
ensi 26
obulamu 26
omulimu 26
aba 24
bantu 24
ekitundu 24
kibiina 24
kino 24
bah 23
ebirowoozo 23
gya 23
naye 23
omu 23
ebya 22
eri 22
kye 22
obungi 22
abali 21
ate 21
gye 21
olwa 21
kiseera 20
nnyo 20
abavubuka 19
bwabwe 19
ekibiina 19
obo 19
obulungi 19
okugenda 19
enzikiriza 18
ngeri 18
bibiina 17
enjawulo 17
kwe 17
mutendera 17
bye 16
ogu 16
okubeera 16
owa 16
baháu 15
ebibiina 15
ebitundu 15
egenda 15
ekitongole 15
kati 15
lláh 15
mwe 15
obuweereza 15
okutegeera 15
abaana 14
abakkiriza 14
abato 14
bitundu 14
ekigendererwa 14
obumanyirivu 14
zino 14
amagezi 13
bwa 13
emikono 13
nkola 13
nno 13
nteekateeka 13
obukulu 13
bulamu 12
ebikolebwa 12
guno 12
okugaziya 12
okunyweza 12
omutendera 12
be 11
bonna 11
bulijjo 11
ebitongole 11
enkiiko 11
eryo 11
katonda 11
nsonga 11
okuyamba 11
okuzimba 11
okwenyigira 11
yonna 11
abasomesa 10
baba 10
beeyongera 10
bifo 10
byabwe 10
byonna 10
empya 10
mulimu 10
obuyambi 10
okulaba 10
okulonda 10
okumanya 10
okuyiga 10
olukiiko 10
we 10
bingi 9
egya 9
ekibanguzi 9
ekiseera 9
ekyo 9
gyaffe 9
kkubo 9
mirimu 9
obuvunaanyizibwa 9
olwo 9
tutambulira 9
wonna 9
ababah 8
abagoberezi 8
abalina 8
abangi 8
akozesa 8
amatabi 8
balina 8
bayinza 8
ebintu 8
emboozi 8
emu 8
entegeka 8
eyo 8
ezo 8
ka 8
kubanga 8
lya 8
okufuna 8
okusobola 8
okutuuka 8
oluvannyuma 8
omuli 8
oyo 8
si 8
ababeera 7
aga 7
akakiiko 7
bagenda 7
bannaabwe 7
basobola 7
bino 7
buno 7
ebirala 7
ekimu 7
emirundi 7
enkolagana 7
enkungaana 7
entuufu 7
etaano 7
gwe 7
kiri 7
maanyi 7
masomo 7
mazima 7
mw 7
nkumi 7
ntandikwa 7
ntegeka 7
obubonero 7
okukkiriza 7
okusoma 7
okwefumiitiriza 7
omugaso 7
omutindo 7
omuwendo 7
scott 7
singa 7
wadde 7
waggulu 7
wammanga 7
yeeyongera 7
abamu 6
abayizi 6
ayinza 6
bali 6
batandika 6
biseera 6
bugenda 6
butuufu 6
buvunaanyizibwa 6
ebiyinza 6
ebyenjigiriza 6
ebyetaagisa 6
ekkubo 6
emikwano 6
emyaka 6
enkumi 6
enteeketeeka 6
erimu 6
kimu 6
kubeera 6
kukola 6
kuno 6
kyonna 6
mboozi 6
mpola 6
naddala 6
nkungaana 6
okukubaganya 6
okukulaakulana 6
okulaga 6
okumala 6
okuviira 6
okuwaayo 6
okwetaba 6
okwongera 6
oluusi 6
omubiri 6
omukwano 6
ono 6
ssanyu 6
waabwe 6
ababa 5
amaka 5
amakubo 5
amazima 5
anyigiriza 5
bakola 5
bamaze 5
bano 5
basobole 5
bibinja 5
bimu 5
ddaala 5
ebikulu 5
ebiri 5
ebiseera 5
eggwanga 5
ekifaananyi 5
ekintu 5
ekitangaala 5
ekitono 5
empisa 5
endowooza 5
enjigiriza 5
enkyukakyuka 5
eringi 5
essira 5
ezikwata 5
gaabwe 5
gyabwe 5
kukubaganya 5
kulonda 5
kwa 5
kwabwe 5
kyabwe 5
lugendo 5
lwe 5
maka 5
munda 5
muno 5
nabo 5
njigiriza 5
nkomerero 5
noolwekyo 5
obulaga 5
obumalirivu 5
obwegendereza 5
okukolera 5
okukozesa 5
okuteekateeka 5
okwegomba 5
omulugube 5
omutima 5
tusobola 5
wakati 5
waliwo 5
ye 5
zaabwe 5
abagenda 4
abasukka 4
abavuka 4
abaweereza 4
abayambi 4
abeera 4
abiri 4
agagenda 4
aka 4
alina 4
amakulu 4
amawanga 4
asobola 4
awatali 4
bafuna 4
banoonya 4
basaana 4
bbiri 4
biri 4
birina 4
bubonero 4
bukulu 4
buweereza 4
bwangu 4
bwekityo 4
bweyongera 4
ddi 4
eba 4
ebibinja 4
ebifo 4
ebigazi 4
ebigenda 4
ebigere 4
ebingi 4
ebirungi 4
effendi 4
egiyise 4
ejja 4
ekitiibwa 4
endala 4
entukuvu 4
eriwo 4
essanyu 4
gamba 4
gano 4
kifo 4
kituufu 4
kiyinza 4
kujja 4
lino 4
mikwano 4
mingi 4
mujja 4
muli 4
muntu 4
nabwo 4
nakyo 4
nate 4
nge 4
obugenda 4
obumu 4
obuwanguzi 4
obuyinza 4
obwa 4
obwetaagisa 4
obwetaavu 4
okubaawo 4
okubeerangana 4
okubeerawo 4
okubunyisa 4
okukolebwa 4
okukyalira 4
okukyusibwa 4
okulabirako 4
okuleetawo 4
okulinnya 4
okungi 4
okusingawo 4
okusinza 4
okutumbula 4
okutuukiriza 4
okuwanirirwa 4
okuyimusa 4
okwanirizibwa 4
okwetooloola 4
okwewaayo 4
okweyongera 4
olowooza 4
olugendo 4
omukono 4
omukulu 4
omunda 4
shoghi 4
wansi 4
yeemu 4
abaagalwa 3
abagyenyigiramu 3
abakubiriza 3
abamaze 3
abatuuze 3
abeetaba 3
abeeyongera 3
afuna 3
agaddiringana 3
agamba 3
ago 3
amangu 3
amasomo 3
amina 3
ayita 3
baagala 3
balaga 3
bateekwa 3
baweereze 3
bayamba 3
bayiga 3
bayita 3
bbanga 3
bennyini 3
bikolwa 3
biraga 3
bugagga 3
bulambulukufu 3
bungi 3
bwalyo 3
bwayo 3
ebiddiringana 3
ebigendererwa 3
ebikumi 3
ebimu 3
ebinene 3
ebiraga 3
ebiruubirirwa 3
ebisookerwako 3
ebitali 3
ebiva 3
ebiwandiiko 3
ebyetaago 3
eddembe 3
egizimba 3
ekibinja 3
ekikulu 3
ekikumi 3
ekirala 3
ekirooto 3
ekisinga 3
ekyalo 3
ekyetaagisa 3
emirandira 3
emitendera 3
engatto 3
ennaku 3
ennambika 3
ennungamu 3
ennyingi 3
ennywevu 3
ensibuko 3
entegeera 3
enzirukanya 3
erina 3
essuubi 3
ezigenda 3
ezimu 3
gaabyo 3
ge 3
gugenda 3
kabonero 3
kaseera 3
ki 3
kibeera 3
kigambo 3
kinnoomu 3
kinoomu 3
kintu 3
kkumi 3
kugenda 3
kuweereza 3
kuzuula 3
kwaniriza 3
kyandibadde 3
kyekubiira 3
ludda 3
misomo 3
mitendera 3
mwaka 3
myezi 3
ndala 3
nnyingi 3
nteeketeeka 3
nzikiriza 3
obugagga 3
obukakafu 3
obukugu 3
obuli 3
obuvumu 3
obuwagizi 3
obwakabaka 3
obwannalukalala 3
obweteefuteefu 3
obwo 3
ogusiima 3
okubikkulirwa 3
okudda 3
okugaziyizibwa 3
okukakasibwa 3
okukula 3
okukulaakulanya 3
okulafuubana 3
okulongoosa 3
okumatira 3
okunene 3
okunyigiriza 3
okunyigirizibwa 3
okusalawo 3
okusikiriza 3
okusinziira 3
okussaawo 3
okutandika 3
okutuukirira 3
okutuukirizibwa 3
okuwagira 3
okuwandiika 3
okuweebwa 3
okuweereza 3
okuyita 3
okwa 3
okwewala 3
okweyerula 3
omukkiriza 3
omulonzi 3
tuli 3
wabula 3
wano 3
yenna 3
ze 3
zeero 3
zeeyongera 3
a 2
abagunjuzi 2
abakazi 2
abakulembeze 2
abakulu 2
abakwanaganya 2
abanywanyi 2
abapya 2
abasajja 2
abasinga 2
abasobola 2
abasookerwako 2
abatandika 2
abaweerereza 2
abawerako 2
abazadde 2
abeenyigira 2
afaayo 2
agenda 2
agula 2
ajja 2
akabondo 2
akabonero 2
akalaga 2
akamu 2
alaba 2
alowooza 2
amaaso 2
amakumi 2
amaze 2
amwenyaamu 2
asoma 2
auxilliary 2
baabwe 2
babeera 2
bagaba 2
bagabana 2
bajja 2
bakole 2
bakozesa 2
balala 2
baliraanwa 2
balondamu 2
balyoke 2
bammwe 2
bangi 2
bannakibiina 2
basinga 2
batuuze 2
bavaayo 2
bavubuka 2
bawaayo 2
baweebwa 2
bayambagana 2
bayizi 2
bazuula 2
beesunga 2
beetaaga 2
biba 2
bikolebwa 2
bikozesebwa 2
bikwata 2
bitingole 2
bivudde 2
biwa 2
board 2
buba 2
bubaka 2
bujja 2
bukula 2
bulaga 2
bumu 2
busobozi 2
buteekwa 2
butereevu 2
buufu 2
buyambi 2
buyinza 2
bwaffe 2
bwannalukalala 2
bwetaavu 2
byalo 2
byammwe 2
byayo 2
ddene 2
ebbanga 2
ebigereke 2
ebijja 2
ebikolwa 2
ebisaanyizo 2
ebisinga 2
ebitone 2
ebituukiddwako 2
ebivudde 2
ebweru 2
ebyasa 2
ebyetoolodde 2
efuna 2
egitali 2
egyo 2
ekibeera 2
ekigere 2
ekigereke 2
ekika 2
ekinene 2
ekireetawo 2
ekirowoozo 2
ekirungi 2
ekisa 2
ekisookerwako 2
ekituufu 2
ekizibu 2
ekkumi 2
ekyasa 2
ekyokubiri 2
ekyokulabirako 2
emigigi 2
emikisa 2
emikugu 2
emikulu 2
emingi 2
emirala 2
emitima 2
emito 2
emiwendo 2
eneekomekkerezebwa 2
enfunda 2
enganda 2
engoye 2
enjawukana 2
enjegere 2
enkalubo 2
enkizo 2
enkukunala 2
enkulu 2
ennambulukufu 2
ennungi 2
ensenvula 2
ensulo 2
entujjo 2
enziringana 2
erabikira 2
eraga 2
erya 2
erye 2
esaanidde 2
esingako 2
ettaka 2
evaayo 2
eyaniriza 2
eyeetaagisa 2
eyinza 2
eyita 2
ezaasooka 2
ezenjawulo 2
ezikwatagana 2
ezirina 2
ezitali 2
eziwerako 2
franco 2
gaba 2
gagenda 2
gayinza 2
geeyongera 2
gimu 2
gino 2
giveemu 2
gonna 2
guba 2
gukolebwa 2
gumu 2
gwa 2
gwako 2
gwayo 2
gwonna 2
gyabyo 2
kaakano 2
kakola 2
kale 2
kano 2
ke 2
kibuuzo 2
kifaananyi 2
kigenda 2
kigendererwa 2
kijja 2
kikolebwa 2
kinene 2
kiraga 2
kisaawe 2
kitegeeza 2
kitiibwa 2
kituukiddwako 2
kubangawo 2
kubeerawo 2
kubikkulirwa 2
kubuusabuusa 2
kufuna 2
kugaba 2
kukkiriza 2
kukolebwa 2
kukolera 2
kulaba 2
kulabirirwa 2
kulafuubana 2
kulinnyisibwa 2
kunywezebwa 2
kusaba 2
kusoma 2
kussa 2
kutandikawo 2
kutegeera 2
kutendeka 2
kutumbula 2
kutuuka 2
kutuukibwako 2
kuva 2
kuwa 2
kuyiga 2
kuzimba 2
kwegayirira 2
kwenyigira 2
kwetaagisa 2
kwewaayo 2
kweyongera 2
kwongera 2
kyalo 2
kyokka 2
lukiiko 2
lunaku 2
lyonna 2
miriraano 2
mmemba 2
mpolampola 2
mugaso 2
mukkiriza 2
mukwano 2
munene 2
musingi 2
muwandiike 2
mwoyo 2
myaka 2
naffe 2
nakwo 2
nammwe 2
nazo 2
newaakubadde 2
ngatto 2
ngo 2
nnalukalala 2
nnamaddala 2
nsi 2
nsuubira 2
obuba 2
obubaka 2
obudde 2
obugunjufu 2
obumala 2
obunafu 2
obunyiikaavu 2
obunyiikivu 2
obutafaayo 2
obutaweera 2
obutitimbe 2
obutonde 2
obutono 2
obuva 2
obwenkanya 2
oguba 2
ogugenda 2
ogumu 2
ogusooka 2
ogwo 2
okuba 2
okubimalawo 2
okuddamu 2
okufaananako 2
okufuuka 2
okugabana 2
okugobererwa 2
okugonjoola 2
okugula 2
okukubiriza 2
okukuuma 2
okukuza 2
okukwatira 2
okukyusa 2
okulabirira 2
okulamuzaganya 2
okulinnyisa 2
okuluŋŋamya 2
okumalawo 2
okumpi 2
okumuwa 2
okungulu 2
okunoonya 2
okunywezebwa 2
okusanyukira 2
okusinga 2
okusobozesa 2
okusomesa 2
okussa 2
okusukka 2
okusukkawo 2
okusumulula 2
okutambulira 2
okutandikibwawo 2
okutasalako 2
okutegeerera 2
okutojjera 2
okutondawo 2
okutondebwawo 2
okutukuvu 2
okutuukako 2
okutuukibwako 2
okutuukira 2
okutwala 2
okuwanirira 2
okuyaayaanira 2
okuyambamu 2
okuyigibwa 2
okuyigiriza 2
okuyimirizaawo 2
okuyimukiramu 2
okuyingira 2
okuyitibwa 2
okuyungibwa 2
okuzuula 2
okwagala 2
okwamaanyi 2
okwaniriza 2
okwaŋŋanga 2
olubatu 2
olukuŋŋaana 2
olumu 2
olunaku 2
oluyambi 2
omugabi 2
omukisa 2
omukitundu 2
omukolerwa 2
omukululo 2
omukuumi 2
omulembe 2
omusawo 2
omusiizi 2
omusingi 2
omutunzi 2
omuvubuka 2
omuyambi 2
omuzinzi 2
omwali 2
omwenda 2
ridván 2
salawo 2
so 2
tebeetaaga 2
tekitegeeza 2
ttaano 2
tugaba 2
tukiraba 2
tulaba 2
tulabisa 2
tulwanyisa 2
tumanyidde 2
tusaana 2
tutukuza 2
tuwuliriza 2
tuyimirira 2
twogera 2
wantu 2
wiiki 2
yaalwo 2
yaayo 2
yadde 2
yennyini 2
zaakyo 2
zikwata 2
ziva 2
zonna 2
