mu 462
ku 319
nga 296
n 271
nti 204
ne 172
e 120
ng 114
abantu 94
era 87
bwe 68
w 67
y 66
kino 59
wa 58
kya 51
poliisi 51
kyokka 47
bw 43
gavumenti 42
ba 40
eno 40
yagambye 40
ate 37
ono 37
z 37
ky 36
ssentebe 36
agamba 35
olw 35
ya 35
ye 35
aba 34
b 34
naye 34
buli 32
ssente 31
gye 30
okuva 30
we 30
covid 29
ekirwadde 29
abadde 28
by 28
katale 27
bano 25
wabula 25
ez 24
okufuna 24
ttiimu 24
abamu 23
bagenda 23
eby 23
abalwadde 22
nabo 22
uganda 22
zino 22
be 21
bino 21
kampala 21
kuba 21
lwa 21
pulezidenti 21
ab 20
yategeezezza 20
abaana 19
abasuubuzi 19
kibuga 19
nnyo 19
omu 19
19 18
bantu 18
ebyobulamu 18
guno 18
okulaba 18
rdc 18
wakiso 18
2 17
bwa 17
kcca 17
oluvannyuma 17
za 17
bali 16
ebiragiro 16
gw 16
kano 16
lya 16
obukadde 16
omwana 16
ze 16
akatale 15
bagamba 15
bitundu 15
ddwaaliro 15
ekibiina 15
embeera 15
kye 15
lw 15
nsonga 15
obulwadde 15
okuli 15
omuntu 15
2021 14
alina 14
balina 14
buno 14
bya 14
bye 14
disitulikiti 14
ka 14
mpigi 14
ssaako 14
ababadde 13
abalala 13
agambye 13
ali 13
amateeka 13
ategeezezza 13
ensonga 13
eri 13
ettaka 13
gwa 13
gwe 13
kiseera 13
kitundu 13
kubanga 13
naddala 13
nrm 13
omuzannyi 13
yabadde 13
5 12
abasajja 12
abasawo 12
akulira 12
corona 12
ebintu 12
ekitongole 12
ekitundu 12
enkola 12
kati 12
lino 12
minisitule 12
omugenzi 12
omusajja 12
ssinga 12
abatuuze 11
abo 11
amyuka 11
bonna 11
covid-19 11
eddagala 11
emu 11
enjawulo 11
enteekateeka 11
ey 11
ggwanga 11
masaka 11
oba 11
obulamu 11
offiisi 11
okukola 11
omuggalo 11
zaabwe 11
3 10
abakulembeze 10
ayagala 10
eggwanga 10
ekya 10
emmotoka 10
engeri 10
gy 10
kifo 10
kkampuni 10
mmotoka 10
muggalo 10
owa 10
rcc 10
sserunjogi 10
wamu 10
yonna 10
1 9
abavubuka 9
ddoozi 9
dr 9
ekikwekweto 9
k 9
kabagenyi 9
kawempe 9
maaso 9
mpaka 9
ofiisi 9
okugema 9
okugenda 9
okutya 9
omwaka 9
omwogezi 9
ramos 9
si 9
yali 9
zooni 9
4 8
abali 8
abalina 8
abasirikale 8
abeera 8
amaanyi 8
amaka 8
bangi 8
ebikozesebwa 8
ebirala 8
endwadde 8
eya 8
july 8
kaleerwe 8
kaweefube 8
ly 8
mbeera 8
morocco 8
na 8
ndisaba 8
nguudo 8
okuba 8
okutambula 8
oluusi 8
olwo 8
omusolo 8
pikipiki 8
wadde 8
wakati 8
waliwo 8
wiiki 8
9 7
abagenda 7
abaserikale 7
arsenal 7
awaka 7
babadde 7
bakoze 7
bamwine 7
boodabooda 7
covid19 7
eddwaaliro 7
ekimu 7
empaka 7
ge 7
gyabwe 7
ke 7
kuliko 7
kusooka 7
kyonna 7
landiroodi 7
lc 7
leero 7
liigi 7
mukono 7
muntu 7
museveni 7
musoke 7
nkola 7
obubonero 7
okulya 7
okusunsulamu 7
okutuusa 7
omubaka 7
omulala 7
omwenge 7
ow 7
road 7
rwanda 7
sizoni 7
ssaawa 7
waabwe 7
yagasseeko 7
yo 7
zonna 7
000 6
12 6
8 6
abaabadde 6
abazannyi 6
afrika 6
afrobasket 6
among 6
asaba 6
awamu 6
baabadde 6
bafuna 6
bodaboda 6
bulijjo 6
dda 6
ddwaliro 6
ekifo 6
emirimu 6
emmwaanyi 6
emyaka 6
ensimbi 6
esangibwa 6
ewa 6
ewedde 6
kaabuyonjo 6
kayunga 6
kyalo 6
ltd 6
lunaku 6
lwe 6
lwokubiri 6
maka 6
masiki 6
nabatenga 6
nakawa 6
ngeri 6
obukiiko 6
obwedda 6
okulwanyisa 6
okuyambako 6
okwewala 6
omuli 6
omusawo 6
oxygen 6
palamenti 6
ppuulu 6
singa 6
south 6
ssengendo 6
tebalina 6
tewali 6
vaccination 6
yaabwe 6
10 5
6 5
ababaka 5
abakazi 5
abakyala 5
abapangisa 5
afudde 5
afuna 5
alabudde 5
ambyulensi 5
annyonnyola 5
asula 5
atadde 5
baagala 5
bakira 5
basuubuzi 5
batandise 5
bba 5
biragiro 5
bo 5
byalo 5
byonna 5
cranes 5
ebbanga 5
ebifo 5
ebikwekweto 5
ebizigo 5
ebizimbe 5
egombolola 5
ejja 5
eky 5
ekyalo 5
emiriraano 5
emmere 5
endagaano 5
engoye 5
ennyo 5
fiba 5
june 5
kajjubi 5
kamuli 5
kasasiro 5
kigambibwa 5
kikankane 5
kuva 5
kw 5
kwe 5
lwengo 5
malwaliro 5
mukiibi 5
mukyala 5
mulago 5
mwe 5
nabuganda 5
obutimba 5
obuuma 5
okusinziira 5
okutandika 5
okutangira 5
okutuuka 5
okuwa 5
okwetaba 5
okweyongera 5
olwa 5
omusango 5
real 5
so 5
ttaka 5
wange 5
wano 5
wansi 5
yadde 5
yagenze 5
yalaze 5
yayongeddeko 5
yinsuwa 5
100 4
14 4
abakulu 4
abakungu 4
abasinga 4
abasomesa 4
abasula 4
abazadde 4
abazirakisa 4
agenze 4
asabye 4
ayogera 4
baali 4
babeera 4
babiri 4
badda 4
bakozesa 4
bakulembeddwamu 4
banna 4
bannannyini 4
banne 4
basabye 4
basawo 4
bayinza 4
bbiri 4
bigere 4
bokka 4
bp 4
buganda 4
bukadde 4
bunkenke 4
burora 4
byabwe 4
cross 4
ddala 4
east 4
ebidduka 4
ebimu 4
ekisoboka 4
ekiyinza 4
emmaali 4
emmali 4
emmanuel 4
ensi 4
enziku 4
esobola 4
ewaka 4
eyali 4
eyookubiri 4
eza 4
famire 4
g 4
ga 4
gaabwe 4
hajji 4
kagolo 4
kajubi 4
kakiiko 4
kansala 4
kasubi 4
katwe 4
kiba 4
kibuye 4
kiddiridde 4
kiro 4
kirwadde 4
kisaawe 4
kitanda 4
kituufu 4
kololo 4
kubaggalawo 4
kuno 4
kwa 4
kyabwe 4
kyanja 4
lubaga 4
luguudo 4
lwaki 4
maama 4
manu 4
may 4
mmande 4
mmwaanyi 4
motoka 4
muluka 4
mutabani 4
muzannyi 4
namukisa 4
nasser 4
nteekateeka 4
obujjanjabi 4
okol 4
okubawa 4
okubeera 4
okukwata 4
okumala 4
okumpi 4
okunoonyereza 4
okusiiyibwa 4
okuvaayo 4
okuyita 4
okuzuula 4
okwagala 4
okwerinda 4
omukazi 4
omukisa 4
omulimu 4
omulwadde 4
omumyuka 4
omunda 4
omuserikale 4
omutuuze 4
qualifiers 4
red 4
silverbacks 4
sipiika 4
ssimu 4
teririna 4
updf 4
wabaawo 4
walubi 4
yaaya 4
yabula 4
yeetaaga 4
zimu 4
ziri 4
00 3
15 3
17 3
18 3
23 3
29 3
42 3
aana 3
abaalondeddwa 3
abajja 3
abakedde 3
abakola 3
abaneetaba 3
abawala 3
abazze 3
agambibwa 3
agenda 3
agende 3
agnes 3
akakiiko 3
akalulu 3
akawale 3
akeedi 3
alaze 3
aliko 3
amaduuka 3
amafuta 3
amagezi 3
amanyi 3
anderlecht 3
arabia 3
asisinkanye 3
asp 3
atendeka 3
azze 3
bagagga 3
bagenze 3
bagezaako 3
bakola 3
bakyali 3
balamu 3
balinda 3
baliraanwa 3
bamanyi 3
bamativu 3
bamaze 3
bannamawulire 3
bapangisa 3
basobola 3
basobole 3
bassentebe 3
batambulira 3
batunda 3
batuuka 3
batuuze 3
batwala 3
bayern 3
bbanga 3
bbo 3
beetegekera 3
bifo 3
biryahwawo 3
bitanda 3
bizimbe 3
boda 3
bucaafu 3
budde 3
bugenda 3
bulamu 3
buliri 3
busingye 3
cecafa 3
centre 3
city 3
council 3
czech 3
drone 3
ebadde 3
ebisumuluzo 3
ebitanda 3
ebizibu 3
ebweru 3
ebya 3
ebyalo 3
ebyassibwawo 3
ebyuma 3
edda 3
egamba 3
ekibanja 3
ekibuga 3
ekika 3
ekikopo 3
ekikula 3
ekintu 3
ekiro 3
ekirungo 3
ekizibu 3
ekyama 3
emabega 3
emisanvu 3
emitwalo 3
emizannyo 3
endala 3
enkizo 3
ennaku 3
ennungi 3
ensiri 3
essimu 3
essuubi 3
etadde 3
eyabula 3
eyakoleddwa 3
ezeetaaga 3
ezibadde 3
ezimu 3
ezisoba 3
fi 3
fred 3
gazelles 3
ggombolola 3
gya 3
icu 3
iganga 3
iii 3
james 3
jinja 3
jjingo 3
john 3
kabagambe 3
kabootongo 3
kafiyu 3
kalwaliro 3
kenya 3
ki 3
kib 3
kibirige 3
kimu 3
kira 3
kitandise 3
kitunzi 3
kiwanuka 3
kkooti 3
kugula 3
kukola 3
kusaba 3
kusigala 3
kuyambako 3
kwegatta 3
kwossa 3
kyangu 3
kyengera 3
kyeyo 3
layisinsi 3
ldu 3
league 3
li 3
luke 3
lukiiko 3
lukusa 3
lumumba 3
luno 3
lwokutaano 3
lye 3
makubo 3
media 3
mengo 3
ministule 3
misiri 3
mmeemba 3
moses 3
mpale 3
mpi 3
mubiru 3
mukisa 3
mukwala 3
munda 3
munisipaali 3
mutendera 3
mw 3
myaka 3
namubiru 3
namukose 3
nayo 3
nju 3
nkambi 3
nsaba 3
nup 3
nze 3
o 3
obubi 3
obudde 3
obulabe 3
obungi 3
obuvune 3
obuwale 3
obuyambi 3
obuzibu 3
obwavu 3
ofudde 3
oguwedde 3
ogw 3
okubaako 3
okubayamba 3
okudda 3
okudduukirira 3
okufa 3
okufaayo 3
okugoberera 3
okugondera 3
okugula 3
okukwatibwa 3
okulondoola 3
okumenya 3
okusaba 3
okusooka 3
okutambuza 3
okutumbula 3
okutwala 3
okuvuganya 3
okuzannya 3
okwegemesa 3
okwogera 3
okwongera 3
olususu 3
omukyala 3
omulambo 3
ott 3
owoyesigyire 3
pawundi 3
pi 3
ppikippiki 3
psg 3
rennes 3
robert 3
saudi 3
sentebbe 3
ssabawandiisi 3
ssatu 3
ssebuguzi 3
ssejjemba 3
ssenkungu 3
sudan 3
tanzania 3
tebajja 3
teddy 3
teri 3
town 3
tunisia 3
waayo 3
wabweru 3
wiini 3
yakubirizza 3
yatandise 3
yenna 3
yiika 3
yogati 3
yokka 3
zikwatiddwa 3
zokka 3
20 2
2011 2
2018 2
21 2
35 2
36 2
50 2
500 2
5700 2
7 2
abaagemebwa 2
abaami 2
abaddiremu 2
abaddiza 2
abagagga 2
abajaasi 2
abakoleera 2
abakozi 2
abakulembezze 2
abakwabuzi 2
abakwasisa 2
abakyamu 2
abalimi 2
abamanyi 2
abanene 2
abanywera 2
abatalina 2
abatendekeddwa 2
abatono 2
abatunda 2
abavuzi 2
abaza 2
abazira 2
abeeyita 2
adda 2
aerate 2
afaanana 2
afaayo 2
agattako 2
agency 2
agezaako 2
agimaze 2
agudde 2
agunywere 2
agwa 2
ajja 2
akamu 2
akayiso 2
ako 2
akola 2
akolagana 2
akoleera 2
akolera 2
akulembedde 2
akulowoozese 2
akuuma 2
akyali 2
alya 2
amangu 2
amasannyalaze 2
amasomero 2
amawanga 2
amawulire 2
amayitire 2
amaze 2
amos 2
anaazannyira 2
annet 2
annyonnyole 2
anthony 2
arteta 2
arua 2
asooke 2
ategeeza 2
atunda 2
atwala 2
atwijukire 2
august 2
avumiridde 2
awaddeyo 2
awatali 2
awera 2
awo 2
ayinza 2
azannya 2
baabawadde 2
baabwe 2
baafuna 2
baagenze 2
baaguloopa 2
baakedde 2
baamukuba 2
baamukutte 2
baazo 2
baba 2
babasonyiwe 2
babinywera 2
baddereeva 2
baddukira 2
badduse 2
baduka 2
bafulumya 2
bafunye 2
bafuuyire 2
bagaana 2
bagende 2
baggye 2
bagidduukirire 2
bagoberera 2
bagule 2
bajja 2
bakansala 2
bakimanyi 2
bakonkomalidde 2
bakozi 2
bakulembeze 2
bakyusa 2
balabiddwako 2
baleeta 2
balimba 2
balwadde 2
balyoka 2
bamu 2
bamututte 2
bamutwala 2
bannaabwe 2
bannayuganda 2
basaba 2
basanze 2
basazeewo 2
basigala 2
basitukidde 2
basulamu 2
bataano 2
batambuza 2
batayambibwa 2
bateekwa 2
batongozza 2
batulabye 2
batuyambe 2
batyo 2
bawuniikiridde 2
bazadde 2
bazannya 2
bazuula 2
bazze 2
bbaala 2
bbooda 2
beebuuza 2
beerabidde 2
beeraliikirivu 2
beesanga 2
belgium 2
ben 2
benfica 2
betty 2
bi 2
bibadde 2
bidduka 2
bigirwa 2
bill 2
bina 2
bingi 2
bintu 2
biyigo 2
bombo 2
bubiri 2
bukenya 2
bukomansimbi 2
bukya 2
bulungi 2
bulungibwansi 2
bumenyi 2
bunamwaya 2
bungereza 2
bunnambiro 2
burundi 2
butaala 2
butale 2
bwassentebe 2
bwebalabye 2
bwereere 2
bypass 2
ca 2
cairo 2
cameroon 2
center 2
champions 2
charles 2
copy 2
cox 2
cps 2
dat 2
data 2
ddembe 2
ddiiru 2
ddoola 2
ddwaa-liro 2
dokasi 2
duncan 2
ebbaluwa 2
ebbugumu 2
ebigere 2
ebikakali 2
ebikolebwa 2
ebikuuma 2
ebipapula 2
ebipya 2
ebirowoozo 2
ebisago 2
ebitundu 2
ebyenfuna 2
ebyenjawulo 2
ebyokwerinda 2
eddembe 2
eddwaliro 2
eggulo 2
eggwaako 2
egy 2
ekibaggalawo 2
ekikuubo 2
ekiragiro 2
ekirala 2
ekirowoozo 2
ekiruubirirwa 2
ekisooka 2
ekitali 2
ekiteeso 2
ekiviirako 2
ekiyamba 2
ekkulu 2
ekola 2
ekyo 2
embi 2
embula 2
embuto 2
emikono 2
emipiira 2
emisolo 2
emmundu 2
empiso 2
emyezi 2
ena 2
enabongera 2
eneemuwa 2
enkolagana 2
enkya 2
ennya 2
ennyanja 2
ennyumba 2
entambula 2
entandikwa 2
eranga 2
erinnya 2
eriri 2
eriwera 2
eriwo 2
ery 2
erya 2
eryanyi 2
essaawa 2
etandise 2
etategerekeka 2
eteekwa 2
ethiopia 2
etisseeko 2
etuukako 2
evudde 2
ewaabwe 2
express 2
eyagala 2
eyakubye 2
eyamwokya 2
eyasooka 2
eyawangulira 2
eyetaagisa 2
eyo 2
ezeekuusa 2
ezikola 2
ezitalina 2
eziva 2
falawo 2
family 2
ffamire 2
gawa 2
geoffrey 2
ggoolo 2
ggwe 2
gumu 2
gusasulibwa 2
gyayo 2
henry 2
herbert 2
hoima 2
hudu 2
igoye 2
imf 2
industrial 2
jackson 2
jafaali 2
jimmy 2
joseph 2
jowero 2
kabaka 2
kabuyonjo 2
kafumbe 2
kalittunsi 2
kalonda 2
kampalamukadde 2
kasule 2
katabi 2
katebe 2
katono 2
kayinza 2
kepher 2
keti 2
kibiina 2
kidduka 2
kiiza 2
kikambi 2
kikendeera 2
kikopo 2
kikuubo 2
kirabika 2
kirala 2
kiri 2
kisa 2
kisaasi 2
kitegeeza 2
kitenda 2
kitiibwa 2
kiwandiiko 2
kiyigo 2
kizza 2
kkubo 2
kkumi 2
kojja 2
kubaako 2
kugaana 2
kugatta 2
kugema 2
kuggalawo 2
kugunywera 2
kuguwa 2
kukyusa 2
kulonzalonza 2
kumala 2
kumudduka 2
kunywa 2
kusalawo 2
kusindika 2
kutaasa 2
kutambula 2
kutegeka 2
kuzannya 2
kuzannyira 2
kwayo 2
kwazo 2
kwekuuma 2
kyagulanyi 2
kyambadde 2
kyetaagisa 2
kyomuhendo 2
kyuma 2
lady 2
lawrence 2
limaze 2
lipooti 2
lirina 2
lockdown 2
lukalala 2
luwummula 2
lwakubiri 2
lwamukaaga 2
lwokuna 2
lydia 2
lyonna 2
madrid 2
maduuka 2
makerere 2
man 2
mariam 2
martin 2
mary 2
masannyalaze 2
mateeka 2
mavi 2
mayambala 2
mayitire 2
maziga 2
mbale 2
mbawadde 2
midaala 2
mirimu 2
misango 2
mmere 2
monastir 2
mubaka 2
mubanga 2
mubigere 2
mubiri 2
mugalu 2
mugambwa 2
muhwezi 2
mukasa 2
mukulonda 2
mukulu 2
mukutangira 2
mulamu 2
muli 2
mulinsiima 2
muliraanwa 2
mulumba 2
mulungi 2
mulwadde 2
mungeri 2
musawo 2
muserikale 2
musobole 2
mustafa 2
mutuuze 2
muwala 2
muwonge 2
muyiggo 2
muzireka 2
mwana 2
mwenge 2
nabwo 2
nabyo 2
nagawa 2
naigaga 2
nakaggwa 2
nakiyingi 2
nalugwa 2
nambooze 2
namudope 2
namung 2
namungoona 2
nansana 2
nasaba 2
nateete 2
nayigaga 2
nazo 2
nazze 2
ndiri 2
ngalo 2
ngoye 2
nja 2
njuki 2
nkaayana 2
nkulagirire 2
nkwatiriremu 2
nnaku 2
nnamba 2
nnannyini 2
nninga 2
nnyumba 2
nsambya 2
nsanga 2
ntekateka 2
ntenjeru 2
obeera 2
obukodyo 2
obuna 2
obupangisa 2
obwa 2
obwenkanya 2
obwo 2
oc 2
ofa 2
ogubadde 2
ogwokubiri 2
okola 2
oku 2
okubadduukirira 2
okubyalo 2
okuddamu 2
okufiirayo 2
okufuba 2
okufuluma 2
okufulumya 2
okugabana 2
okugemebwa 2
okugemwa 2
okuggala 2
okugogola 2
okukendeeza 2
okukomya 2
okukosebwa 2
okukozesa 2
okukuba 2
okulabirira 2
okumakya 2
okumalako 2
okumanya 2
okunaaba 2
okunywa 2
okusigala 2
okusiika 2
okusitula 2
okusobola 2
okusoma 2
okusonda 2
okusoomoozebwa 2
okussa 2
okutaataaganyizibwa 2
okuteeka 2
okuteekawo 2
okutegeka 2
okutemya 2
okuttunka 2
okutunda 2
okutuukiriza 2
okutwalibwa 2
okutyoboola 2
okuwanduka 2
okuyamba 2
okuzannyibwa 2
okuziyiza 2
okwekuuma 2
okwesogga 2
okwesokoola 2
okwetakula 2
okwetangira 2
okweyiwa 2
okwokya 2
oludda 2
olukiiko 2
olukya 2
olunaku 2
oluvuganya 2
olwatudde 2
olwokuba 2
omugagga 2
omulundi 2
omusirikale 2
omusuubuzi 2
omutendesi 2
omuwala 2
omuwendo 2
oona 2
oulanyah 2
oyinza 2
oyo 2
patrick 2
pfizer 2
pookino 2
rakai 2
recruitment 2
republic 2
richard 2
ronald 2
rose 2
sd 2
sembwa 2
september 2
sibagaana 2
sijja 2
simaanyi 2
sitiika 2
sitoowa 2
ssande 2
ssawa 2
ssebina 2
ssekiwu 2
ssemakula 2
ssemogerere 2
ssempala 2
ssempebwa 2
ssenga 2
ssenkubuge 2
ssennono 2
ssewajje 2
ssi 2
ta 2
talina 2
tasobola 2
tayagala 2
tebafunye 2
tebagoberera 2
tebakkiriza 2
tebamaanyiko 2
tebambadde 2
tebannaba 2
tebasobola 2
tekyagenda 2
temulina 2
tennawaayo 2
tetukyalina 2
tezigenda 2
todwong 2
ttakisi 2
tukola 2
tusanze 2
tw 2
ura 2
vipers 2
waggulu 2
wakyaliwo 2
west 2
woodi 2
world 2
yaabaddeko 2
yababulako 2
yabwe 2
yafudde 2
yaggalawo 2
yakkirizza 2
yakoze 2
yakutidde 2
yalangirira 2
yasabye 2
yasanga 2
yasanze 2
yatuuse 2
yatwalibwa 2
yawadde 2
yeegasse 2
yeegayirira 2
yeesanga 2
yintanenti 2
zaawaddeyo 2
zitwala 2
