num 663
mu 272
na 186
nti 169
nga 168
yesu 164
ku 147
ne 129
katonda 120
era 113
kkumi 112
yali 106
bwe 104
no 84
abantu 79
naye 79
kye 71
emu 63
okuba 59
kya 57
nnyo 56
bbiri 55
abiri 54
bo 54
oba 53
be 48
abalala 47
ebintu 46
ekyo 45
ssatu 45
okukola 44
oyo 42
wa 42
ba 41
makko 40
nnya 40
kiki 39
olwekyo 39
omuntu 39
omusajja 39
ye 39
bamalayika 38
ayagala 36
baali 36
olwa 36
asatu 35
bya 34
badayimooni 31
ngo 31
yakuwa 31
musanvu 29
ekintu 28
si 28
ttaano 28
gye 26
kino 26
kubanga 26
munaana 26
abayigirizwa 25
mukaaga 25
abo 24
lwaki 24
omukulu 24
ebyo 23
ka 23
oluvannyuma 23
omu 23
omuddu 23
singa 23
e 22
ki 22
mwenda 22
nge 22
peetero 22
sitaani 22
ya 22
omanyi 21
omuyigiriza 21
tulina 21
tusaanidde 21
waliwo 21
eri 20
balunabba 19
buli 19
nsi 19
olowooza 19
ani 18
bayibuli 18
kabaka 18
omulyolyomi 18
pawulo 18
yagamba 18
atuyigiriza 17
bonna 17
kiri 17
abaana 16
bingi 16
bye 16
ebya 16
lwa 16
ssente 16
aba 15
amaanyi 15
ekya 15
ggwe 15
okubeera 15
yee 15
amanyi 14
date 14
ebikolwa 14
ebirungi 14
ekiseera 14
ennyo 14
ga 14
oyinza 14
wo 14
abagoberezi 13
agamba 13
bangi 13
bano 13
ddala 13
ensonga 13
ggulu 13
lukka 13
okusinga 13
omugagga 13
omwana 13
we 13
abamu 12
ana 12
ate 12
baagala 12
bayinza 12
bokka 12
ebikwata 12
kiba 12
munne 12
ngeri 12
okusobola 12
yokaana 12
bulungi 11
eyali 11
gya 11
kati 11
kikumi 11
kiseera 11
kyokka 11
malayika 11
matayo 11
muntu 11
nedda 11
okufuna 11
okusaba 11
olwo 11
omusamaliya 11
osobola 11
owa 11
tuba 11
waggulu 11
bajja 10
basobola 10
bubiri 10
ebibi 10
egamba 10
ekisa 10
emmere 10
emyaka 10
gwe 10
kityo 10
lukumi 10
lumu 10
maaso 10
naawe 10
nkumi 10
obukulu 10
obulamu 10
okuweereza 10
sawulo 10
tusobola 10
abaali 9
ababi 9
bayigirizwa 9
byonna 9
ekyokulabirako 9
kirungi 9
kisa 9
kyali 9
muyigiriza 9
naffe 9
okuva 9
olina 9
tuli 9
yakola 9
adamu 8
akimanyi 8
alina 8
bagamba 8
bakola 8
bantu 8
eya 8
eyo 8
kaawa 8
kabona 8
kitegeeza 8
kkomera 8
kukola 8
ludda 8
maama 8
obukadde 8
okulaga 8
okwebaza 8
omugenge 8
oyagala 8
wadde 8
yenna 8
yerusaalemi 8
abagenge 7
abasajja 7
atyo 7
baba 7
ebigere 7
ebirala 7
gu 7
kikyamu 7
kiyinza 7
kuba 7
kyonna 7
langi 7
nassanayiri 7
ogu 7
ojja 7
okumanya 7
omulala 7
omuyigirizwa 7
omwoyo 7
onookola 7
ozannyisa 7
tujja 7
tulabe 7
ajja 6
ali 6
amannya 6
asinga 6
atambula 6
atugamba 6
atya 6
awo 6
ayinza 6
bagenda 6
bali 6
bazadde 6
bigere 6
c 6
eddinaali 6
ekibi 6
ekirala 6
ekituufu 6
ensi 6
ezo 6
kikulu 6
kkubo 6
maliyamu 6
muddu 6
nze 6
obulwadde 6
okubuulira 6
okwegatta 6
omukuluyesu 6
omuwulize 6
ono 6
osaanidde 6
otya 6
wabula 6
wayise 6
yafuuka 6
yakobo 6
yalaba 6
yamala 6
za 6
ze 6
abakazi 5
abakulu 5
abalungi 5
abanja 5
abappya 5
abasinga 5
abeera 5
addayo 5
agenda 5
alowooza 5
amugamba 5
bukadde 5
bulamu 5
butuufu 5
ebizibu 5
ekibuuzo 5
ekiro 5
engeri 5
engero 5
eno 5
ewaabwe 5
firipo 5
gyonna 5
jpg 5
kabi 5
kituufu 5
mikwano 5
nabo 5
okugamba 5
okukikola 5
okuleetera 5
okumala 5
okusonyiwa 5
okwagala 5
okwogera 5
oli 5
olugero 5
omukazi 5
omulimu 5
omulungi 5
omuwendo 5
ssomero 5
tewali 5
univ/art 5
univ_sqr_xl 5
url 5
waaliwo 5
wandikoze 5
wansi 5
yabagamba 5
yajja 5
yamugamba 5
yatonda 5
yayigiriza 5
abalalaweereza 4
abato 4
abatume 4
abaweereza 4
amataba 4
asobola 4
atubanja 4
ayitibwa 4
baagenda 4
baakola 4
babeera 4
bakkiriza 4
balala 4
baleme 4
balina 4
bateekwa 4
beegatta 4
bintu 4
boogera 4
bwa 4
bwabwe 4
byabwe 4
ebigenge 4
ebitundu 4
ekikulu 4
ekikumi 4
ekirungi 4
ekisinga 4
ekitiibwa 4
ekyatuuka 4
emirembe 4
endowooza 4
engoye 4
enjawulo 4
enkolagana 4
gaabwe 4
katono 4
kibuga 4
kifo 4
kikolwa 4
kitya 4
kizibu 4
kubeera 4
kulaba 4
leero 4
lunaku 4
lye 4
maanyi 4
mingi 4
mubi 4
nkaaga 4
nnyingi 4
oboolyawo 4
obungi 4
okimanyi 4
okubaawo 4
okubikkulirwa 4
okuddamu 4
okugondera 4
okujeemera 4
okukolera 4
okukozesa 4
okulya 4
okusabalugandayesu 4
okusinza 4
okuyamba 4
okweyisa 4
olulimi 4
omulenzi 4
omuto 4
soma 4
tetusaanidde 4
tetusobola 4
timoseewo 4
twagala 4
waffe 4
wali 4
watya 4
yabaleka 4
yalina 4
yaliwo 4
yandibadde 4
yigira 4
zonna 4
abaafuuka 3
abaasooka 3
abaddu 3
abagamba 3
abakkolosaayi 3
abali 3
abaruumi 3
abawagguufu 3
agezaako 3
akola 3
amaze 3
amubuuza 3
asobole 3
ataano 3
ataasonyiwa 3
awamu 3
ayogera 3
baafuuka 3
baani 3
babeere 3
babulooni 3
bakakafu 3
bakkiririza 3
basajja 3
batusinga 3
bino 3
birungi 3
bukya 3
bwonna 3
ddinaali 3
ebimu 3
ebiwundu 3
eggwanga 3
ekikyamu 3
ekkubo 3
ekyali 3
emeka 3
emibiri 3
emirundi 3
enjala 3
erinnya 3
eyogera 3
eza 3
ffenna 3
gamba 3
ggaliraaya 3
kibadde 3
kibe 3
kifaananyi 3
kijja 3
kimu 3
kintu 3
kitaawe 3
kizibwe 3
konna 3
kujjukira 3
kusanyusa 3
kusasula 3
kutuyamba 3
kwe 3
kyandibadde 3
kyangu 3
lowooza 3
luguudo 3
lwatu 3
maka 3
malyamu 3
mazima 3
mbuulira 3
mugagga 3
mugulansigo 3
mukama 3
mulabe 3
mumatayo 3
munno 3
mwana 3
nja 3
njawulo 3
nsonga 3
obukambwe 3
obulungi 3
obwakabaka 3
obwo 3
ogwo 3
okuddayo 3
okufuuka 3
okugulumiza 3
okujjukira 3
okukkiriza 3
okusabayigira 3
okutuleetera 3
okutusinga 3
okutuusa 3
okuwuliriza 3
okuyiga 3
okuyigira 3
okweyisiza 3
okwongera 3
olaba 3
olubereberye 3
olugoye 3
oluusi 3
omubiri 3
omubuulizi 3
omufuzi 3
omulamu 3
omusirusiru 3
omusomesa 3
omuyudaaya 3
omwenda 3
oteekwa 3
otyo 3
pentekoote 3
so 3
taata 3
tasobola 3
tebeebaza 3
tetwagala 3
tube 3
tukimanyi 3
tukola 3
tutyo 3
tuweereza 3
tuyiga 3
twayiga 3
wakati 3
wamu 3
weebali 3
weereza 3
yagenda 3
yagezaako 3
yandiba 3
yasaba 3
yawandiika 3
yekka 3
yiyo 3
yonna 3
yuda 3
zaali 3
abaddewo 2
abafu 2
abafumbo 2
abaggalatiya 2
abagoberera 2
abakkolinso 2
abakoledde 2
abalabika 2
abaminsani 2
abassessalonika 2
abatukola 2
agende 2
ago 2
agudde 2
agwa 2
akabenje 2
akabi 2
akaseera 2
akoma 2
akoze 2
akugamba 2
akukola 2
akukoledde 2
akusaba 2
akusendasenda 2
akwata 2
akyali 2
alabikira 2
alonda 2
amanene 2
amangu 2
amwegayirira 2
andereya 2
asuubiza 2
atandise 2
atusinga 2
atusonyiwa 2
atuusiddwako 2
ava 2
awa 2
awatali 2
azaalibwa 2
azannyisa 2
baakaddiwa 2
baakolanga 2
baakomawo 2
baaleka 2
baalina 2
baalondebwa 2
baamukuba 2
baateekateeka 2
baayawukana 2
baayogerera 2
baazaala 2
babe 2
babi 2
babuulidde 2
bafa 2
baibuli 2
bakoma 2
bakyalire 2
baleetera 2
balinga 2
balowooza 2
balungi 2
bammwe 2
bannaabwe 2
banne 2
batagondera 2
battottola 2
beetegefu 2
bibi 2
bigenge 2
bimu 2
birina 2
biruvuddemu 2
biseera 2
bitundu 2
bubi 2
bulijjo 2
buyinza 2
buyisi 2
bwo 2
byanakuwaza 2
danyeri 2
ebifaananyi 2
ebikemo 2
ebiragiro 2
ebisingawo 2
ebitonotono 2
ebyaddirira 2
ebyali 2
ebyaliwo 2
ebyawandiikibwa 2
ebyogerwa 2
egyo 2
ekiruumi 2
ekitabo 2
ekitambaala 2
ekiyinza 2
ekizibu 2
ekkumi 2
ekufuuwa 2
ekyama 2
ekyavaamu 2
empewo 2
emuluma 2
emyezi 2
endala 2
enfuufu 2
enkyamu 2
ennaku 2
ennyanja 2
entegeka 2
erye 2
eryo 2
esatu 2
esobola 2
essaala 2
etemanyiddwa 2
etteeka 2
ewa 2
eyayanjula 2
eyayitibwa 2
eyeerabira 2
eyeeterekera 2
firimu 2
gabulyeri 2
gavumenti 2
ggwanga 2
gufukibwa 2
gwabwe 2
gwo 2
gwonna 2
gyo 2
jjajja 2
jjukira 2
kabuga 2
kale 2
kayisaali 2
kibasanyusa 2
kijjukire 2
kikolebwa 2
kirabika 2
kiringa 2
kisanyusa 2
kisobola 2
kitange 2
kituuse 2
kristo 2
kufa 2
kufuna 2
kukkiriza 2
kukolera 2
kulaga 2
kumutegeera 2
kunaaza 2
kupulo 2
kusaba 2
kusosola 2
kutukuuma 2
kuyiga 2
kwegatta 2
kyakolebwanga 2
kyanyiiza 2
lubuto 2
lugendo 2
lulwo 2
lusegere 2
lusuku 2
lwabwe 2
lwe 2
lwo 2
lyato 2
mabbali 2
magezi 2
mataba 2
mirundi 2
mpaayo 2
muganda 2
mugonderenga 2
musajja 2
musome 2
mussuula 2
mutima 2
mutuufu 2
muyigirizwa 2
mwawufu 2
mwoyo 2
ndala 2
ndi 2
nelukka 2
nkubuulire 2
nkubuuze 2
nnamaddala 2
nnyanja 2
nnyumba 2
nsolo 2
obeera 2
obubi 2
obubiriiti 2
obugagga 2
obutimba 2
obuvubi 2
ogenda 2
ogondera 2
ojjukira 2
okolera 2
okubaako 2
okubatizibwa 2
okubawonya 2
okugiryaako 2
okukijjukira 2
okukkiririza 2
okukoppa 2
okukugamba 2
okukusinga 2
okukyalira 2
okulaba 2
okulowooza 2
okulusegere 2
okumukema 2
okumulaba 2
okumusonyiwa 2
okumuyamba 2
okumwebaza 2
okungulu 2
okusisinkana 2
okusoma 2
okusoowagana 2
okutubuzaabuza 2
okutuuka 2
okutwala 2
okuwa 2
okuwakana 2
okuyita 2
okwambala 2
olumu 2
olutali 2
omulundi 2
omusonyiwe 2
omuti 2
omutima 2
omutukuvu 2
omutume 2
onoobeera 2
osoma 2
owulidde 2
owulira 2
pulintaweereza 2
siira 2
sindika 2
somazabbuli 2
taluso 2
tayagala 2
tebakikola 2
tebasobola 2
tebatuukiridde 2
tekiba 2
tekimala 2
teyabuusa 2
teyaggwamu 2
teyakisiima 2
teyali 2
tonnaba 2
tosobola 2
tubeere 2
tufuna 2
tugondera 2
tukemeddwa 2
tulaba 2
tulaga 2
tutasobola 2
tutya 2
tuyambe 2
tuyinza 2
waayita 2
wajjawo 2
waliyo 2
wandyagadde 2
wayinza 2
wayiseewo 2
yabatizibwa 2
yabayigiriza 2
yabuuza 2
yaddamu 2
yaffe 2
yafukamira 2
yafundikira 2
yajjukira 2
yakiraga 2
yakomawo 2
yalaga 2
yalinanga 2
yalya 2
yandisobodde 2
yasindikibwa 2
yatandika 2
yatwala 2
yaweereza 2
yawerekera 2
yayogera 2
yeekaalu 2
yeewuunya 2
yeeyisanga 2
yennyini 2
yusufu 2
zaabwe 2
zabbuli 2
