mu 533
ku 371
n 267
nga 232
ne 213
nti 206
e 169
ng 120
era 108
wa 77
y 74
bwe 69
ate 63
w 56
ye 52
kkooti 51
poliisi 51
abantu 50
ya 45
kya 43
nup 42
okulonda 41
agamba 39
abayizi 38
yagambye 38
bw 37
gavumenti 37
ba 36
bwa 36
by 36
owa 36
kino 34
nrm 34
we 34
abalala 33
buli 33
wabula 33
be 32
museveni 31
aba 30
corona 30
ky 30
kyokka 30
ono 29
uganda 29
lukwago 25
lya 25
naye 25
olw 25
ssentebe 25
z 25
abamu 24
b 24
gye 24
mbabazi 24
akakiiko 23
bya 23
oluvannyuma 23
eno 22
k 22
kubanga 22
obululu 22
yategeezezza 22
omu 21
pulezidenti 21
kyagulanyi 20
akulira 19
eby 19
kampala 19
lwa 19
makerere 19
yunivasite 19
abadde 18
akalulu 18
amasomero 18
bannamateeka 18
bantu 18
gw 18
mmotoka 18
okuva 18
omusango 18
yali 18
za 18
000 17
bano 17
gy 17
kati 17
kifo 17
lw 17
maaso 17
okugenda 17
3 16
bagenda 16
ebyokulonda 16
gwe 16
lino 16
mukono 16
ab 15
abaana 15
bangi 15
dp 15
ebitundu 15
ettaka 15
gwa 15
kiseera 15
kulonda 15
wakati 15
yafunye 15
advocates 14
agenda 14
alondedde 14
bino 14
bulungi 14
ekibiina 14
enjawulo 14
kkampuni 14
munnamateeka 14
okuli 14
ssente 14
ssomero 14
walukagga 14
2 13
abalonzi 13
ayagala 13
baabadde 13
baali 13
bonna 13
embeera 13
g 13
ggwanga 13
kuliko 13
kwe 13
nnyo 13
obuwanguzi 13
okulaba 13
omulamuzi 13
ow 13
waliwo 13
10 12
amateeka 12
azze 12
bye 12
eggwanga 12
eri 12
ey 12
eyali 12
kcca 12
ke 12
munisipaali 12
nyanzi 12
oba 12
robert 12
town 12
yabadde 12
yonna 12
ze 12
1 11
alina 11
baagala 11
babadde 11
bifo 11
bitundu 11
council 11
emisango 11
emyaka 11
ensi 11
minisita 11
mutabani 11
okuba 11
okutuusa 11
st 11
abakulembeze 10
abaserikale 10
abasinga 10
ali 10
avuganya 10
bajja 10
david 10
ddala 10
ebintu 10
eddagala 10
ekitongole 10
eky 10
eya 10
ggombolola 10
ggoolo 10
kiwanuka 10
kkomera 10
kuba 10
kw 10
lampard 10
manu 10
moze 10
musango 10
nabo 10
okubeera 10
omuzannyo 10
omwogezi 10
volleyball 10
abaabadde 9
abasuubuzi 9
agambye 9
and 9
awangudde 9
baabwe 9
bbiri 9
buno 9
byabwe 9
can 9
city 9
ebifo 9
ekifo 9
ekkubo 9
ekya 9
emmyuufu 9
guno 9
kalungu 9
ly 9
of 9
okukuba 9
olwo 9
omubaka 9
wamu 9
100 8
18 8
2016 8
a 8
abasomesa 8
abavubuka 8
amaanyi 8
amagezi 8
bannayuganda 8
bibiina 8
bobi 8
disitulikiti 8
divizoni 8
dr 8
ebyobulamu 8
emmotoka 8
ensukkulumu 8
ga 8
james 8
kawempe 8
kigambibwa 8
kimu 8
kyambogo 8
kye 8
lwe 8
meeya 8
minisitule 8
misango 8
mmeeya 8
muntu 8
nsonga 8
obulwadde 8
ogw 8
okukola 8
omugenzi 8
omwaka 8
rally 8
ssaawa 8
ttiimu 8
wadde 8
zino 8
16 7
2021 7
9-0 7
abazannyi 7
akabenje 7
aliko 7
bali 7
ddwaaliro 7
ebikozesebwa 7
ebirala 7
ebyenjigiriza 7
ekirwadde 7
george 7
hajji 7
janet 7
kaadi 7
kalulu 7
katabi 7
kibiina 7
kiggundu 7
kitundu 7
kwa 7
kyengera 7
lwaki 7
maama 7
maka 7
mateeka 7
mathias 7
nekusa 7
nsangi 7
obujulizi 7
obukadde 7
okufuna 7
putin 7
ronald 7
wameri 7
32 6
5 6
abalwadde 6
abawagizi 6
amagye 6
arsenal 6
baakola 6
bagamba 6
bintu 6
chelsea 6
co 6
ddiifiri 6
ddiiru 6
eggulo 6
ekikwekweto 6
emirimu 6
ensonga 6
erya 6
essiga 6
eyabadde 6
ez 6
fdc 6
february 6
for 6
frank 6
gen 6
gya 6
hakim 6
international 6
ka 6
kenya 6
kkubo 6
kuno 6
luguudo 6
lwokubiri 6
munna 6
naddala 6
nambooze 6
navalny 6
neville 6
ngeri 6
nguudo 6
obwa 6
okudda 6
okuddamu 6
okuggulawo 6
okunoonyereza 6
okutuuka 6
oludda 6
omusajja 6
osombe 6
p7 6
paul 6
rdc 6
road 6
s4 6
si 6
sitatimenti 6
southampton 6
the 6
ttaano 6
ttaka 6
wakiso 6
wine 6
13 5
14 5
2020 5
80 5
abakozi 5
abatembeeyi 5
abayimbi 5
abeesimbyewo 5
abo 5
agnes 5
akola 5
akwatiddwa 5
amangu 5
asaba 5
association 5
ategeezezza 5
awera 5
bakkansala 5
balina 5
balooya 5
buganda 5
byenkya 5
charles 5
dda 5
ebikwekweto 5
ebisago 5
egy 5
ekika 5
embiranye 5
ensimbu 5
ge 5
gerald 5
jinja 5
john 5
kabaale 5
kakiiko 5
kanisa 5
karim 5
katwe 5
kibanja 5
kigenda 5
kuddayo 5
kusooka 5
kutandise 5
kwekalakaasa 5
kyambadde 5
lukaya 5
lwanga 5
maapu 5
makya 5
maya 5
mingi 5
mpaka 5
musenze 5
mwe 5
myezi 5
nsi 5
obulamu 5
odoi 5
ofiisi 5
okukuuma 5
okumala 5
okuvuganya 5
okwabadde 5
okwewala 5
omugagga 5
omumyuka 5
omutendesi 5
omutuuze 5
omuwandiisi 5
palamenti 5
polof 5
rev 5
richard 5
tasobola 5
ttivvi 5
wano 5
yaabwe 5
yakwatibwa 5
yawangudde 5
11 4
17 4
1996 4
2019 4
25 4
4 4
40 4
6 4
abaafudde 4
ababadde 4
abagenda 4
abakola 4
abakuutidde 4
abali 4
abawawaabirwa 4
africa 4
african 4
akwatibwa 4
amaka 4
amama 4
amawulire 4
amayinja 4
amazima 4
amyuka 4
anthony 4
ategeeza 4
ava 4
awakanya 4
babiri 4
bakasitoma 4
bakola 4
bakomawo 4
balonzi 4
bamu 4
bamwezo 4
basula 4
bawangula 4
bayizi 4
bingi 4
biseera 4
bisulo 4
bukedde 4
bukulembeze 4
byabakama 4
central 4
company 4
ebbanga 4
ebigezo 4
ebikolwa 4
ebimu 4
ebisulo 4
ebitongole 4
ebyamaanyi 4
ekiseera 4
ekitabo 4
ekyuma 4
emiriraano 4
emirundi 4
emivuyo 4
empaka 4
empapula 4
emu 4
enkoofiira 4
ensimbi 4
erina 4
eyafunye 4
hall 4
hasenhuttl 4
january 4
jose 4
kabineti 4
kajjansi 4
kansala 4
kanusu 4
kasese 4
kibuli 4
kidaga 4
kiddu 4
kihika 4
kirabo 4
kiro 4
kisaawe 4
kisobola 4
kkaadi 4
kkanisa 4
kubaako 4
kugenda 4
kukola 4
kwambala 4
lc 4
leero 4
loole 4
luke 4
lye 4
makindye 4
march 4
masiki 4
masomero 4
mbayo 4
mbeera 4
mipiira 4
moses 4
mulimu 4
munne 4
mupiira 4
mutendera 4
mwebesa 4
na 4
nakisunga 4
nali 4
namayuba 4
nnannyini 4
november 4
nteekateeka 4
oguwedde 4
okot 4
oku 4
okugoberera 4
okukakasa 4
okuleeta 4
okusinziira 4
okusoma 4
okutunda 4
okuwulira 4
okuyita 4
okuzuula 4
okwaliwo 4
okwongera 4
oluvanyuma 4
oluwaabi 4
olwaleero 4
olympics 4
omulala 4
omulimu 4
omuwendo 4
omuyimbi 4
pallisa 4
pearl 4
ppaaka 4
radio 4
rugumayo 4
samuel 4
ss 4
ssebagala 4
station 4
tebalina 4
tewali 4
toyota 4
wamala 4
weasel 4
wolves 4
yawadde 4
zaabwe 4
19 3
200 3
2000 3
2013 3
22 3
30 3
34 3
60 3
64 3
7 3
85 3
9 3
aana 3
abaakwatibwa 3
abaddukanya 3
abakugu 3
abalamuzi 3
abalina 3
abatuuze 3
abavuganya 3
abazadde 3
abeebyokwerinda 3
abeera 3
abubakar 3
abubaker 3
adduse 3
afrika 3
aka 3
alumiriza 3
asibwe 3
asp 3
attunka 3
avuga 3
awaga 3
awo 3
ayita 3
baasimattuse 3
baffe 3
bakole 3
bakwata 3
bakwatiddwa 3
baleme 3
bana 3
bannamawulire 3
banne 3
basoma 3
basomera 3
bassentebe 3
bataano 3
bateekwa 3
batwalibwa 3
baweereddwa 3
bednarek 3
beemulugunya 3
ben 3
beti 3
bikozesebwa 3
biwagu 3
bubwe 3
bugembe 3
bukya 3
buyondo 3
bwangu 3
bwapulezidenti 3
bwassentebe 3
bwatyo 3
bwonna 3
catherine 3
center 3
committee 3
ddwaliro 3
dean 3
east 3
ebadde 3
ebbula 3
ebibiina 3
ebifaananyi 3
ebikwata 3
ebiragiro 3
ebiri 3
ebiwundu 3
ebyobufuzi 3
ebyokwerinda 3
eddembe 3
eggombolola 3
ekibuga 3
ekigatta 3
ekikolwa 3
ekirala 3
ekisanja 3
ekisinga 3
ekiteeso 3
ekitundu 3
ekituufu 3
ekola 3
ekwata 3
ekyapa 3
ekyo 3
emitima 3
emmaali 3
endala 3
engeri 3
enkadde 3
enkola 3
ennyo 3
ennyumba 3
ente 3
esatu 3
essimu 3
essuubi 3
ewa 3
eyeesimbyewo 3
eyookubiri 3
eza 3
ezimu 3
fred 3
gajja 3
galina 3
gano 3
ggunga 3
gonna 3
gumu 3
haji 3
hhenda 3
hirji 3
ind 3
ismail 3
jimmy 3
jude 3
kabanda 3
kabangali 3
kakembo 3
kampeyini 3
kamya 3
kasagga 3
kasangati 3
kasolo 3
katuuso 3
kawanda 3
ki 3
kikumi 3
kireka 3
kirungi 3
kisenyi 3
kitebe 3
kitongole 3
kivejinja 3
kiyimba 3
kizza 3
konteyina 3
kulambula 3
kuli 3
kulwanyisa 3
kutandika 3
kwabadde 3
kyalo 3
kyamuliibwa 3
law 3
liigi 3
lt 3
ludda 3
luiz 3
lukiiko 3
lulwe 3
lumumba 3
lutaaya 3
lwabwe 3
lwokaano 3
lwomukaaga 3
maj 3
martial 3
mary 3
mctominay 3
mminzaani 3
mukasa 3
mukwano 3
muliraanwa 3
munda 3
munnamawulire 3
muyizi 3
mw 3
naggalama 3
nakawa 3
nasiwu 3
national 3
nkokonjeru 3
nkola 3
nkulaakulana 3
nnaku 3
nnasale 3
nnyingi 3
noolwekyo 3
north 3
nsimbi 3
nsubuga 3
ntebe 3
obubonero 3
obulungi 3
obutono 3
obwannannyini 3
obwapulezidenti 3
okocha 3
okubadde 3
okuddayo 3
okugobwa 3
okukwata 3
okulwanyisa 3
okumanyisa 3
okusaba 3
okusinga 3
okusomesa 3
okusooka 3
okutambula 3
okutambuza 3
okutwala 3
okuviira 3
okuwangula 3
okuyingira 3
okwa 3
okwali 3
okwogera 3
olumaze 3
olwa 3
omukazi 3
omuliro 3
omulonde 3
omuntu 3
omupiira 3
omusirikale 3
omutima 3
omwezi 3
patrick 3
peneti 3
polling 3
poloti 3
premier 3
russia 3
sadik 3
sayizi 3
school 3
singa 3
spice 3
ssaalongo 3
ssatu 3
ssenfuka 3
ssentongo 3
ssinga 3
sulaiman 3
tamale 3
tirigaya 3
tugenda 3
tukamushabe 3
turwomwe 3
updf 3
wabaddewo 3
waggulu 3
waka 3
wooteeri 3
yasabye 3
yasooka 3
yavudde 3
yenna 3
zombi 3
zooni 3
00 2
037 2
12 2
15 2
190 2
1989 2
1992 2
1993 2
1994 2
1995 2
2-1 2
20 2
2001 2
2002 2
2009 2
2011 2
2015 2
2017 2
2018 2
28 2
298 2
31 2
33 2
35 2
42 2
44 2
45 2
475 2
530 2
58 2
75 2
83 2
851 2
90 2
abaali 2
abaasimattuse 2
ababaka 2
ababasosola 2
ababiri 2
abajaasi 2
abakubiriza 2
abakulira 2
abalondebwa 2
abalwade 2
abato 2
abatunuulizi 2
abatwala 2
abavujjirizi 2
abavuzi 2
abawera 2
abdul 2
abramovich 2
addirirwa 2
afuna 2
ag 2
agaana 2
agambibwa 2
agassibwawo 2
agatta 2
agende 2
ago 2
agugumbudde 2
ajja 2
ajjidde 2
akabonero 2
akakyankalano 2
akalambira 2
akavuyo 2
akawungeezi 2
akoledde 2
akoze 2
akuba 2
akwatidde 2
alambudde 2
alangirira 2
alekawo 2
alex 2
alonda 2
alunga 2
amagombolola 2
amala 2
amalilizza 2
amannya 2
amasasi 2
amasimu 2
amatendekero 2
amaze 2
amutwala 2
amuvuganya 2
andrew 2
ant 2
apooca 2
april 2
asangiddwa 2
ashiraf 2
asikira 2
asio 2
associated 2
asula 2
atajja 2
atalina 2
atamanyi 2
ategeezeza 2
ategezeeza 2
ategezezza 2
atuula 2
avumiridde 2
awabudde 2
awagirwa 2
awaka 2
awamu 2
aweze 2
awoza 2
ayogeddeko 2
baafunye 2
baakwongera 2
baalambudde 2
baamalira 2
baamusomedde 2
baasangibwa 2
baasindikiddwa 2
baatandikawo 2
baategeezezza 2
baatugamba 2
baatwalibwa 2
baayambala 2
baayiye 2
babasaba 2
babeera 2
baddeyo 2
baddukanya 2
bagyegaana 2
bakoze 2
bakutte 2
bakyali 2
balaajana 2
balambudde 2
balonda 2
balonde 2
balwadde 2
bambadde 2
bamukutte 2
bank 2
baptist 2
barnabas 2
basala 2
basobola 2
basome 2
bataayizza 2
batambulira 2
batandise 2
bateekawo 2
batembeeyi 2
batono 2
batuuka 2
batuuse 2
batuuze 2
batwalibwe 2
bava 2
bavudde 2
bayomba 2
bazambadde 2
bbaasi 2
bbulakati 2
beekenneenyezza 2
beekkokkodde 2
beeronze 2
bench 2
bennyamidde 2
betty 2
bimala 2
biragiro 2
birina 2
blick 2
boas 2
boniface 2
bufaransa 2
bukadde 2
bukenya 2
bulabe 2
bulega 2
bulimba 2
bululu 2
bulwadde 2
bumuli 2
bungereza 2
bunnambiro 2
burnley 2
busatu 2
busoga 2
buwembo 2
bwakabuga 2
bwemage 2
byabaddewo 2
byafaayo 2
byakozeeko 2
byaruhanga 2
byekwaso 2
byonna 2
canter 2
cavani 2
celica 2
championships 2
church 2
club 2
covid 2
covid-19 2
daniel 2
ddagala 2
ddakiika 2
ddembe 2
ddene 2
ddereeva 2
ddoola 2
ddoozi 2
ddumba 2
ddyo 2
deo 2
development 2
diana 2
diguli 2
dipu 2
district 2
doreen 2
ebanja 2
ebbali 2
ebibuuzo 2
ebigenda 2
ebigere 2
ebiggya 2
ebimala 2
ebirabo 2
ebisaanyizo 2
ebiso 2
ebitabo 2
ebivudde 2
ebizimbe 2
ebyakamalirizo 2
ebyamafuta 2
ebyava 2
ebyenjawulo 2
edwin 2
egenda 2
egezaako 2
egiyise 2
egyo 2
ejja 2
ekigezo 2
ekiika 2
ekikebera 2
ekintu 2
ekiraga 2
ekiramuzi 2
ekiviriddeko 2
ekkanisa 2
ekulembedde 2
ekulembeddwaamu 2
ekutte 2
ekyakola 2
ekyalira 2
ekyavaako 2
ekyavuddeko 2
ekyokubiri 2
eli 2
elly 2
emabega 2
emipiira 2
emizannyo 2
emmundu 2
emmyufu 2
emutangira 2
endowooza 2
engalo 2
engatto 2
enguudo 2
enjuyi 2
enkofiira 2
enkya 2
ennyange 2
ensigo 2
ensiko 2
ensobi 2
ensonda 2
enteekateeka 2
entunnunsi 2
erigema 2
erigendayo 2
erinnya 2
eriwo 2
esaanide 2
esazeemu 2
esazeewo 2
esinga 2
esingako 2
essaawa 2
esther 2
etaayizza 2
eteeke 2
euro 2
everton 2
eyafa 2
eyaliko 2
eyungudde 2
ezikola 2
ezirina 2
ezzaako 2
farouq 2
fernandes 2
ffamire 2
ffe 2
finance 2
gaabwe 2
gaffe 2
gakola 2
gary 2
geoffrey 2
geoffry 2
godfrey 2
goma 2
gombe 2
gubadde 2
gutti 2
gwaffe 2
gwali 2
gyonna 2
heart 2
home 2
hussein 2
iii 2
initiative 2
institute 2
ioc 2
ivan 2
jamir 2
jankewitz 2
justine 2
kaa 2
kaaya 2
kabaga 2
kabalagala 2
kabineeti 2
kafeero 2
kaguli 2
kalani 2
kalema 2
kanyago 2
karugire 2
kasenge 2
kasitoma 2
kasule 2
kataha 2
katemba 2
katikkiro 2
kato 2
katonda 2
katosi 2
katunguka 2
kawaala 2
kayemba 2
kayondo 2
kayunga 2
kazo 2
kibuga 2
kingo 2
kiraga 2
kiriko 2
kiryowa 2
kituufu 2
kiviiri 2
kivumbi 2
kizimbe 2
kole 2
koona 2
kudda 2
kuddako 2
kufuba 2
kugoberera 2
kugulira 2
kujja 2
kukwata 2
kukyagenda 2
kukyaza 2
kulaga 2
kusoma 2
kussaawo 2
kusunsulamu 2
kuteeka 2
kutunda 2
kuva 2
kuwangula 2
kwabaddeko 2
kwabaddemu 2
kwatandise 2
kwegatta 2
kyabwe 2
kyaddondo 2
kyakubiri 2
kyali 2
kyamugwanira 2
kyamusanvu 2
kyategeerekesse 2
kyekubiira 2
kyeteeba 2
kyobe 2
kyongera 2
kyotera 2
landirodiwe 2
leediyo 2
leicester 2
liri 2
livingstone 2
lubaga 2
lubega 2
lukalala 2
lukululana 2
lukung 2
lukusa 2
lulumiriza 2
lumalirize 2
luno 2
lutengo 2
luuka 2
luvannyuma 2
luweebwe 2
lwokusatu 2
madarasat 2
majera 2
makomera 2
man 2
management 2
margaret 2
masaka 2
maseruka 2
mayanja 2
mbadde 2
mbaziira 2
mbi 2
mbiranye 2
mbulaga 2
medard 2
medi 2
medical 2
micheal 2
mike 2
mirimu 2
miruka 2
mitendera 2
mitima 2
mivuyo 2
mmande 2
mmemba 2
mmyuufu 2
mohammed 2
motooka 2
mugattabantu 2
mugwezi 2
muhangi 2
mukaaga 2
mukalazi 2
mukifo 2
mukulonda 2
mukwata 2
mulumba 2
mulundi 2
mumyuka 2
munnabyamizannyo 2
musa 2
musanvu 2
mutaasa 2
mutimbagano 2
muwendo 2
mwaka 2
myaka 2
nabuyanda 2
nabweru 2
nakabago 2
nakalema 2
nakivubo 2
nakyo 2
namirembe 2
namulanda 2
nankya 2
nanziga 2
nathan 2
nawangwe 2
nazo 2
ndaba 2
neyekkokkola 2
nkofiira 2
nkoona 2
nneegatta 2
nsozi 2
nyamutora 2
nze 2
nzikakkamu 2
obubbi 2
obudde 2
obukola 2
obukugu 2
obukulembeze 2
obukulu 2
obukunkumuka 2
obulimba 2
obungi 2
obutakkaanya 2
obutonde 2
obutwa 2
obwabadde 2
obwameeya 2
obwenkanya 2
obwesige 2
ogujja 2
ogusooka 2
okello 2
okubala 2
okubawa 2
okubba 2
okubirongoosa 2
okubowa 2
okubuzaabuza 2
okuddaabiriza 2
okufa 2
okugiwangulira 2
okugula 2
okukoma 2
okukomya 2
okukwatibwa 2
okukyusa 2
okulangirira 2
okulondoola 2
okumugaana 2
okumuggyayo 2
okumukaka 2
okumwegattako 2
okunonyereza 2
okunoonyeza 2
okusasula 2
okusenda 2
okusigala 2
okusobola 2
okusunsulamu 2
okusuula 2
okutaasa 2
okuteeba 2
okutomera 2
okutumbula 2
okutuula 2
okuvaako 2
okuwakanya 2
okuwangulwa 2
okuyamba 2
okuzza 2
okw 2
okwambala 2
okwambalibwa 2
okwebuuza 2
okwejjanjaba 2
okwekalakaasa 2
okwemanyiiza 2
okwerinda 2
okwesimbawo 2
okwetegeka 2
okwewola 2
okweyongera 2
olubatu 2
olujji 2
olukuηηaana 2
olunaku 2
olutalo 2
oluvuganya 2
omubbi 2
omuguwa 2
omujjuvu 2
omukisa 2
omukono 2
omukubi 2
omukulu 2
omukululo 2
omulanga 2
omusuubuzi 2
omutaka 2
omutembeeyi 2
omuwaabi 2
omuyizi 2
omwabadde 2
omwali 2
omwana 2
omwoyo 2
opoka 2
opondo 2
organisation 2
osanga 2
owesigyire 2
owoyesigyire 2
oyo 2
p/s 2
p1 2
p5 2
p6 2
peter 2
petroleum 2
purple 2
ramathan 2
rashford 2
remand 2
rigaya 2
robinah 2
ruparelia 2
rwakishaya 2
rwenzori 2
s1 2
s2 2
s5 2
s6 2
safari 2
salim 2
sam 2
semakula 2
semi 2
sentebe 2
september 2
simon 2
siniya 2
society 2
soda 2
sooda 2
ssaabasumba 2
ssaako 2
ssali 2
sseggona 2
ssemanda 2
ssemujju 2
ssennyiga 2
ssentamu 2
sseryazi 2
ssesaazi 2
ssimu 2
stella 2
stuart 2
talina 2
tanga 2
tebagenda 2
tebasobola 2
teri 2
tetugenda 2
tezimanyi 2
tom 2
tuchel 2
tulina 2
uau 2
uay 2
umeme 2
university 2
waabaddewo 2
waabwe 2
wabaawo 2
wabweru 2
wagwa 2
wan-bissaka 2
wandulu 2
wange 2
william 2
winnie 2
yadduse 2
yaffe 2
yafuna 2
yagasseeko 2
yagenze 2
yakakasizza 2
yakikkaatirizza 2
yakkaatirizza 2
yakubye 2
yakukkulumidde 2
yalagidde 2
yamukwata 2
yamulanze 2
yasoma 2
yasomedde 2
yataddeyo 2
yateebedde 2
yateekawo 2
yatuukiriddwa 2
yavunaaniddwa 2
yaweebwa 2
yayogedde 2
yayongeddeko 2
yeegatta 2
yenkanya 2
yensonga 2
yetisse 2
young 2
zaateebeddwa 2
zaayo 2
zeeteseteeseemu 2
zibasomeseza 2
zimu 2
zirimu 2
zzooni 2
