mu 660
n 494
ku 446
nga 377
nti 325
ne 224
e 215
ng 167
era 157
y 140
abantu 124
wa 117
w 73
bw 67
eby 66
ye 63
2 61
kino 61
bwe 60
ate 59
olw 58
by 57
buli 56
gavumenti 54
kya 54
ya 52
ba 49
gw 48
eno 47
amazzi 46
naye 45
z 45
bano 44
kyokka 44
lw 43
sheikh 43
agamba 41
okuva 41
abadde 40
kuba 39
uganda 39
ky 37
ssentebe 37
kabaka 35
akulira 34
kubanga 34
yagambye 34
b 33
disitulikiti 33
kayunga 33
poliisi 33
we 32
abalala 31
ow 31
agambye 30
eri 30
guno 30
gye 30
lwa 30
nnyo 30
gy 29
ono 29
abakulembeze 28
oluvannyuma 28
omu 28
buganda 27
ssente 27
aba 26
enjawulo 26
okuli 26
wabula 26
1 25
8 25
eggwanga 25
bagamba 24
be 24
bino 23
bwa 23
emirimu 23
ga 23
lino 23
lya 23
minisita 23
3 22
balina 22
maama 22
minisitule 22
owa 22
abatuuze 21
za 21
ab 20
abamu 20
asaba 20
eky 20
ez 20
ggwanga 20
gwa 20
omubaka 20
abaana 19
dr 19
ekitongole 19
kampala 19
katikkiro 19
ly 19
mayiga 19
omumyuka 19
ssenyonga 19
amawulire 18
asabye 18
baabwe 18
ebintu 18
ekifo 18
ettaka 18
gano 18
katale 18
kyalo 18
kye 18
okufuna 18
wadde 18
10 17
9 17
alina 17
amaanyi 17
bonna 17
ebirime 17
ekya 17
emyaka 17
k 17
kiseera 17
maaso 17
na 17
naddala 17
omuntu 17
wamu 17
wano 17
abasiraamu 16
ategeezezza 16
bya 16
bye 16
ddala 16
embeera 16
ensi 16
ey 16
fr 16
katonda 16
masaka 16
nup 16
obwakabaka 16
okwongera 16
bangi 15
ebirala 15
gomba 15
kifo 15
kwe 15
nsonga 15
okulonda 15
omusumba 15
5 14
6 14
7 14
abasuubuzi 14
abavubuka 14
amasannyalaze 14
babadde 14
bantu 14
charles 14
ebitundu 14
ensimbi 14
kati 14
kyadondo 14
leero 14
muwonge 14
obulamu 14
obutonde 14
okulaba 14
olwo 14
omwana 14
rev 14
yabadde 14
yasabye 14
4 13
abaami 13
awamu 13
bulungi 13
gya 13
ka 13
kw 13
nabo 13
oba 13
obuzibu 13
okukola 13
olunaku 13
omuli 13
omwaka 13
supreme 13
tebandeke 13
wiiki 13
yali 13
zino 13
abasawo 12
abayizi 12
avunaanyizibwa 12
bitundu 12
buno 12
byabwe 12
council 12
ebikozesebwa 12
emmotoka 12
kalungu 12
kitundu 12
kkanisa 12
maka 12
ngeri 12
okubeera 12
omutindo 12
19 11
abakozi 11
africa 11
agenda 11
amasomero 11
emisinde 11
empaka 11
ensonga 11
fiina 11
g 11
gwe 11
kibuli 11
kuno 11
luguudo 11
lwe 11
mmotoka 11
mufti 11
nakawa 11
nassali 11
nrm 11
obululu 11
okusobola 11
opio 11
wakati 11
2021 10
bali 10
bwabwe 10
covid 10
december 10
ebidduka 10
ggombolola 10
kigozi 10
luweero 10
mawuledi 10
mbeera 10
muntu 10
nagaya 10
obukadde 10
obuwanguzi 10
ofiisi 10
omukyala 10
omutaka 10
peter 10
ssekindi 10
ttaka 10
yategeezezza 10
yunivasite 10
abali 9
abalimi 9
abasomesa 9
ag 9
akalulu 9
amasaza 9
bannayuganda 9
bp 9
budde 9
bukulula 9
ebyo 9
eddiini 9
emu 9
enteekateeka 9
galabuzi 9
john 9
kabula 9
kampeyini 9
kibuga 9
kwa 9
mazzi 9
mukolo 9
munne 9
mupiira 9
nakweede 9
nandutu 9
obulungi 9
ogw 9
okukozesa 9
okusaba 9
okutuusa 9
palamenti 9
singa 9
ssaako 9
ssi 9
town 9
zaabwe 9
000 8
16 8
abagenda 8
abakungu 8
abasajja 8
abazadde 8
akola 8
amazaalibwa 8
asiimye 8
asinzidde 8
ategeeza 8
baana 8
bakola 8
basabye 8
bbiri 8
bintu 8
buluuli 8
buvuma 8
egenda 8
ekibiina 8
ekika 8
ekintu 8
ekirwadde 8
ekiseera 8
ekitabo 8
ekitundu 8
ekkanisa 8
endala 8
essaza 8
kcca 8
kisaawe 8
kitebe 8
kyabwe 8
lukaya 8
makindye 8
masomero 8
mmisa 8
mpaka 8
muhammad 8
njeru 8
obusiraamu 8
obw 8
okugenda 8
okutuuka 8
olukiiko 8
oluvanyuma 8
omugenzi 8
omwami 8
paul 8
ssekukkulu 8
tamale 8
ttiimu 8
yuniti 8
100 7
17 7
18 7
abakiise 7
abasodokisi 7
abo 7
ali 7
atwala 7
avunanyizibwa 7
babiri 7
bannamawulire 7
banne 7
bingi 7
ebya 7
eddagala 7
egy 7
enkola 7
entambula 7
eryato 7
eya 7
faaza 7
kano 7
ke 7
kiggundu 7
lcv 7
luno 7
lwokutaano 7
makerere 7
mukaaga 7
mukono 7
nguudo 7
obujulizi 7
obulabirizi 7
obuwangwa 7
obwedda 7
okuba 7
okukuuma 7
okumpi 7
omubeezi 7
omukisa 7
omukolo 7
omulembe 7
pulezidenti 7
ronald 7
ssande 7
ssewungu 7
waliwo 7
walusimbi 7
wasajja 7
yaabwe 7
yesu 7
yonna 7
11 6
20 6
abasumba 6
akabenje 6
akakiiko 6
akatale 6
amalwaliro 6
amyuka 6
asooka 6
ategezezza 6
baabadde 6
baali 6
bajja 6
bakoze 6
basobole 6
bbeeyi 6
board 6
bududa 6
bwatyo 6
byalo 6
east 6
ebbanga 6
ebikolwa 6
ebyuma 6
eddwaliro 6
eggulo 6
ekizibu 6
ekyo 6
enjigiriza 6
ennyo 6
ery 6
eyali 6
gyabwe 6
gyonna 6
harriet 6
hn 6
joseph 6
k2 6
kato 6
kavuma 6
khadh 6
kibuuka 6
kulwanyisa 6
kyonna 6
land 6
lubaga 6
lubega 6
luwemba 6
masaza 6
mateeka 6
meeya 6
min 6
mmengo 6
mwanje 6
nakwedde 6
obudde 6
obukulu 6
of 6
ojulong 6
okubiri 6
okufa 6
okulya 6
okutumbula 6
okuvaayo 6
okuyiga 6
okwegemesa 6
okwerinda 6
okwogera 6
oluguudo 6
olwa 6
omukazi 6
omukungu 6
omulimu 6
patrick 6
pulojekiti 6
rdc 6
ssemogerere 6
ssingo 6
vipers 6
waabwe 6
yategezezza 6
yenna 6
13 5
50 5
abaawule 5
ababaka 5
ababeera 5
abasaba 5
ajja 5
akakasizza 5
akubiriza 5
alaze 5
amafuta 5
amakolero 5
andrew 5
avumiridde 5
ayagala 5
baagala 5
bakansala 5
bakulembeddwamu 5
bannabyabufuzi 5
bategeezezza 5
bavubuka 5
bawannyondo 5
bbo 5
bo 5
bug 5
bulamu 5
bulange 5
bulijjo 5
bwabadde 5
byonna 5
can 5
centre 5
covid-19 5
dda 5
district 5
ebadde 5
ebiri 5
ebisale 5
ebyenjigiriza 5
ebyobulimi 5
eddongooserezo 5
eggombolola 5
ekiro 5
ekkubo 5
emikolo 5
eng 5
ennyumba 5
essuubi 5
ettamiiro 5
eyo 5
eza 5
francis 5
fred 5
george 5
ht 5
ja 5
james 5
kabangali 5
kaboogere 5
kansala 5
kanso 5
kasumba 5
kaweefube 5
kibaate 5
kibiina 5
kiruuta 5
klesia 5
kristo 5
kuliko 5
kulonda 5
lukiiko 5
lunaku 5
lwabwe 5
lwomukaaga 5
male 5
maria 5
misinde 5
moses 5
mukasa 5
musajja 5
mwe 5
mwezi 5
ndwadde 5
nkola 5
nnyanja 5
nyanzi 5
obubonero 5
obusooka 5
obutujju 5
ogwa 5
okukuba 5
okulwanyisa 5
okumala 5
okusatu 5
okusoma 5
okutambula 5
okutambulira 5
okutangira 5
okuvuganya 5
okuwa 5
okwagala 5
okwewala 5
omulabirizi 5
omulangira 5
omulimo 5
omulundi 5
omusomo 5
omwogezi 5
robert 5
ronnie 5
rup 5
school 5
ssabasumba 5
ssaza 5
ssomero 5
teri 5
wansi 5
wasungui 5
yafa 5
ze 5
zonna 5
00 4
30 4
60 4
81 4
ababadde 4
abakadde 4
abakyala 4
abalina 4
abalonzi 4
abasinga 4
abatujju 4
abeera 4
airtel 4
ak 4
amagezi 4
amaguzi 4
amaka 4
amateeka 4
amawanga 4
amaze 4
association 4
atandika 4
awadde 4
ayambibwako 4
babeera 4
bafuna 4
bagende 4
bakadde 4
bannannyini 4
bannanyini 4
basajja 4
basatu 4
batuuze 4
bibadde 4
bifo 4
bigere 4
bodaboda 4
bokka 4
brother 4
bubi 4
bugingo 4
bukedde 4
busaana 4
buwanguzi 4
bweyabadde 4
david 4
dduyiro 4
ddwaliiro 4
deacon 4
ebifo 4
ebigenda 4
ebimu 4
ebirungi 4
ebweru 4
ebyokulonda 4
ekidyeri 4
emabega 4
embi 4
emikutu 4
emipiira 4
engeri 4
engule 4
ennono 4
ennyimba 4
ensozi 4
entalo 4
eric 4
erya 4
ewedde 4
eye 4
gav 4
group 4
gwetabiddwako 4
hotel 4
house 4
ii 4
japan 4
jude 4
kabyanga 4
kafiyu 4
kakande 4
kamooti 4
kamulegeya 4
kayongo 4
ki 4
kibinja 4
kibirango 4
kigo 4
kimu 4
kitaawe 4
kkaadi 4
kkampuni 4
kkiro 4
kusaba 4
kutandise 4
kyebando 4
l 4
liigi 4
lubowa 4
lugoloobi 4
lutikko 4
lwaki 4
lye 4
makula 4
mawanga 4
mirembe 4
mirimu 4
mityana 4
mpuuga 4
mubiru 4
mukenenya 4
mulimu 4
munene 4
musa 4
museveni 4
mutebi 4
mutindo 4
mwalo 4
nampungu 4
nateete 4
national 4
nayo 4
nazigo 4
newankubadde 4
njagala 4
nnamba 4
nsi 4
nsimbi 4
nsubuga 4
ntandikwa 4
ntebe 4
nteekateeka 4
ntenjeru 4
obukulembeze 4
obulabe 4
obulimi 4
obusobozi 4
ogujja 4
oku 4
okubadde 4
okubunyisa 4
okudda 4
okujjuza 4
okukolera 4
okukomya 4
okulinnya 4
okumalawo 4
okumuwa 4
okunoonyereza 4
okusinga 4
okusomesa 4
okusomoozebwa 4
okutuukiriza 4
okuyisa 4
okuyita 4
okuyiwa 4
okwettanira 4
okweyambisa 4
olukindo 4
oluswayiri 4
olwaleero 4
olwekyo 4
omubiri 4
omuggalo 4
omukulembeze 4
omukutu 4
omulamwa 4
omupiira 4
omusajja 4
omusango 4
omuze 4
omuzikiti 4
omwezi 4
owe 4
pikipiki 4
rameck 4
rashid 4
ruparelia 4
s 4
samuel 4
sawa 4
sekyewa 4
si 4
sipiika 4
sizoni 4
so 4
ssaawa 4
ssabasajja 4
ssekalema 4
ssekidde 4
ssimu 4
t 4
takisi 4
tebalina 4
tewali 4
to 4
wakiso 4
wange 4
waya 4
wu 4
zubair 4
14 3
21 3
24 3
a 3
ababiri 3
abakozesa 3
abakristaayo 3
abakristu 3
abakugu 3
abakulu 3
abakyusa 3
abalenzi 3
abalwadde 3
abamyuka 3
abasaale 3
abaserikale 3
abatalina 3
abatambuza 3
abavubi 3
abawala 3
abazungu 3
abyogeredde 3
addala 3
agattako 3
agnes 3
aisha 3
akawungeezi 3
akkiriza 3
akolanga 3
akolera 3
akozesezza 3
akubirizza 3
akutte 3
akuutidde 3
alagidde 3
amaato 3
amanene 3
amanyi 3
amayonjo 3
amazina 3
and 3
anthony 3
asanga 3
asobola 3
asobole 3
ateeka 3
atuuziddwa 3
awa 3
ayogera 3
ayogerako 3
ayongeddeko 3
babirye 3
badduse 3
badiru 3
bafuluma 3
bagambye 3
bagenda 3
bakubiriziddwa 3
bakulembeze 3
bakyala 3
balaze 3
baleese 3
baleme 3
bamaze 3
basanga 3
basanze 3
basazeewo 3
basooka 3
bassentebe 3
batandika 3
bazadde 3
bbanga 3
beene 3
beetabye 3
beeyongedde 3
birime 3
bubonero 3
buikwe 3
bukyali 3
bulemeezi 3
busiro 3
buvuddeko 3
buvunaanyizibwa 3
bwereere 3
bwo 3
bwonna 3
byakatonda 3
central 3
church 3
companies 3
copper 3
ddaala 3
destiny 3
ebbugumo 3
ebbula 3
ebigere 3
ebitongole 3
ebyama 3
ebyokwerinda 3
ekif 3
ekigendererwa 3
ekikolwa 3
ekikula 3
ekisuubizo 3
ekivunaanyizibwa 3
ekkulu 3
ekwata 3
ekyetaagisa 3
ekyeya 3
emiti 3
emmere 3
empisa 3
emyezi 3
endwadde 3
enkulaakulana 3
enkulakulana 3
ennaku 3
ennimi 3
ensangi 3
ensonyi 3
entebe 3
erinnya 3
esatu 3
essatu 3
essira 3
ettunka 3
ewa 3
eyita 3
flower 3
foundation 3
gaabwe 3
ganjaala 3
ggiya 3
ggoolo 3
git 3
godfrey 3
gugenda 3
gumu 3
gwabwe 3
gwonna 3
hajj 3
imaam 3
isaac 3
jaamu 3
jajja 3
january 3
kakalu 3
kaleerwe 3
kalifani 3
kalulu 3
kambugu 3
kamisona 3
kamuli 3
kasse 3
katabi 3
kb 3
kiddiridde 3
kitayimbwa 3
kitende 3
kitiibwa 3
kitongole 3
kiyindi 3
kkansala 3
kkooti 3
kkubo 3
kooti 3
kp 3
kubba 3
kufuna 3
kukola 3
kulaga 3
kusasulanga 3
kutumbula 3
kuva 3
kuzimba 3
kwogera 3
kyotera 3
kz 3
lc 3
linnya 3
lujjudde 3
lunaanoba 3
luwero 3
lwanga 3
lwokubiri 3
lwokuna 3
lyamazzi 3
lyonna 3
maggombolola 3
masannyalaze 3
masengere 3
matugga 3
mawanda 3
meeting 3
metropolitan 3
mik 3
mikutu 3
mikwano 3
milton 3
mingi 3
misomo 3
moslem 3
mr 3
muggalo 3
mukwano 3
mukyala 3
muliranwa 3
mumanyi 3
munisipaali 3
munisipali 3
munnamawulire 3
musaazi 3
musawo 3
musomo 3
mutabani 3
muzikiti 3
myezi 3
nabyo 3
najjuma 3
nak 3
nakaseke 3
nakibinge 3
namuli 3
nassaza 3
nategeeza 3
ngo 3
nkulaakulana 3
nninga 3
nnyingi 3
north 3
november 3
nsanja 3
nsozi 3
nyina 3
obubaka 3
obuggya 3
obulago 3
obulala 3
obulimba 3
obungi 3
obutale 3
obuwumbi 3
obuyambi 3
october 3
okubeeramu 3
okuddamu 3
okugatta 3
okuggulwawo 3
okugula 3
okukolagana 3
okukwata 3
okulaga 3
okulangirira 3
okulayira 3
okuleeta 3
okulondebwa 3
okusunsula 3
okutandika 3
okutereka 3
okutuula 3
okuwandiika 3
okuwangula 3
okuyingira 3
okw 3
okwebikka 3
okweyongera 3
olubuto 3
oludda 3
oluganda 3
oluusi 3
oluwalo 3
omukulu 3
omulala 3
omulungi 3
omupya 3
omusirisa 3
omusuubuzi 3
omutwe 3
omuwendo 3
omwalo 3
ossa 3
owookubiri 3
oxygen 3
police 3
primary 3
pulogulaamu 3
region 3
road 3
saalongo 3
sam 3
sasakawa 3
saul 3
sharia 3
she 3
simon 3
siniya 3
south 3
ssaalongo 3
ssemujju 3
ssemwanga 3
suubi 3
tak 3
talina 3
twesigye 3
ucu 3
villa 3
waakiri 3
waggulu 3
wasswa 3
wazira 3
wi 3
wokulira 3
yabyogeredde 3
yagasseeko 3
yasin 3
yawadde 3
yebazizza 3
yekka 3
yiga 3
zibadde 3
zombi 3
12 2
130 2
15 2
150 2
2004 2
2009 2
2015 2
2017 2
22 2
40 2
41 2
412 2
59 2
747 2
80 2
aana 2
aanya 2
abaakulembeddwa 2
abaakwatibwa 2
abaamawulire 2
abafumbo 2
abagenzi 2
abagoberezi 2
abakolera 2
abakubirizza 2
abakulembeddwamu 2
abakulirwa 2
abalamuzi 2
abaliddukanya 2
abalima 2
abalimu 2
abangi 2
abapya 2
abasabidde 2
abasabye 2
abasirikale 2
abasobozese 2
abasula 2
abato 2
abawagizi 2
abaweereddwa 2
abaweereza 2
abawuzi 2
abayingira 2
abazaalisa 2
abazannyi 2
abe 2
abebidduka 2
abeere 2
abeerimbika 2
abeetabye 2
abegattira 2
adnan 2
african 2
afumbe 2
afunamu 2
agaana 2
agafuga 2
agakwata 2
agali 2
agalina 2
aganjaala 2
agezaako 2
aggulawo 2
agira 2
ago 2
ahmed 2
akaatiriza 2
akalondoola 2
akambe 2
akaseera 2
akiikirira 2
akissa 2
akozesa 2
akubidde 2
akulembeddemu 2
akulemberemu 2
akuuma 2
akwasibwa 2
akwasiddwa 2
akwata 2
akyaza 2
alaga 2
aleero 2
aliko 2
aliwo 2
alowooza 2
aludde 2
amagombolola 2
amagye 2
amangu 2
amasimu 2
amayinja 2
amizza 2
amuwa 2
ana 2
andoa 2
ani 2
annyonnyola 2
anoonya 2
april 2
asasula 2
asatu 2
ategeezeza 2
atomeredde 2
atwalibwa 2
avudde 2
awabudde 2
awabula 2
awards 2
awatali 2
ayambiddwako 2
ayimbye 2
ayogerera 2
azitandikidde 2
azze 2
baagenze 2
baalonda 2
baamusomesa 2
baasinzidde 2
baasoose 2
baatudde 2
baavunaaniddwa 2
baayita 2
babawadde 2
baddemu 2
badduukiridde 2
bafanaganya 2
bafube 2
bafune 2
bafunye 2
bagenze 2
bagiddukidde 2
bajjukidde 2
bakawe 2
bakira 2
bakkiriza 2
bakole 2
bakozi 2
bakulembeddwa 2
bakwataganye 2
balaajana 2
balaba 2
balamu 2
baleka 2
balimi 2
balimwezo 2
balinda 2
balonzi 2
balumiriza 2
bam 2
bamasheikh 2
bambega 2
bamutwala 2
bamuzaala 2
bamuzaata 2
bana 2
banaamulonda 2
bandikubi 2
bank 2
bannabwe 2
bannakayunga 2
banywa 2
basanyufu 2
bateekwa 2
batendekeddwa 2
batongoza 2
batongozza 2
batono 2
batuuse 2
batuuzizza 2
batya 2
bava 2
bavudde 2
bawakanya 2
bawangula 2
bayambibwako 2
bayibuli 2
bayinginiya 2
bayita 2
bazze 2
bazzukulu 2
bba 2
bbaale 2
bboodi 2
bbula 2
beekandazze 2
beesanga 2
beetaaga 2
beetaba 2
beeyamye 2
benson 2
betty 2
bibiina 2
bibiri 2
bigambibwa 2
bijja 2
bikola 2
bikolebwa 2
bikulu 2
birthday 2
bisatu 2
biseera 2
bizinga 2
bobosi 2
bombo 2
bongere 2
boniface 2
brenda 2
breweries 2
bridget 2
bubadde 2
buduuda 2
bugerere 2
bukomansimbi 2
bulange-mmengo 2
bulungibwansi 2
businze 2
busiraamu 2
butaka 2
butale 2
buto 2
butonde 2
butuze 2
buyembe 2
buzibu 2
bwategeezeza 2
bwebagenda 2
bwebiri 2
bwensi 2
bweri 2
byenfuna 2
byogeddwa 2
byokwerinda 2
c 2
championships 2
choir 2
christine 2
cranes 2
daniel 2
dayirekita 2
ddwaliro 2
diguli 2
diocese 2
dis 2
dominic 2
dt 2
ebbali 2
ebbeeyi 2
ebbugumu 2
ebibira 2
ebibuuzo 2
ebidiba 2
ebigenderako 2
ebika 2
ebikwatagana 2
ebiragiro 2
ebirimwa 2
ebiruubirirwa 2
ebisala 2
ebisinga 2
ebisobola 2
ebisolo 2
ebitafuuyiddwa 2
ebitakosa 2
ebitamiiza 2
ebitone 2
ebitono 2
ebitooke 2
ebivvulu 2
ebizimbe 2
ebyalo 2
ebyenda 2
ebyenguudo 2
ebyennyanja 2
ebyobulamu 2
ebyobusuubuzi 2
eggaaali 2
ekanisa 2
ekiddiridde 2
ekigenda 2
ekigezo 2
ekikopo 2
ekimu 2
ekirala 2
ekirungi 2
ekisangibwa 2
ekisinga 2
ekisoboka 2
ekitiibwa 2
ekivuddemu 2
ekivunanyizibwa 2
ekiyitibwa 2
ekizimbe 2
ekulemberwa 2
ekyenda 2
elderly 2
elweru 2
embaga 2
embalirira 2
embugo 2
emibiri 2
emigga 2
emikisa 2
emikono 2
emingi 2
emirembe 2
emirundi 2
emisana 2
emisango 2
emisomo 2
emitima 2
emivuyo 2
emmaali 2
emmundu 2
emmwaanyi 2
empapula 2
empya 2
ena 2
endagaano 2
enduulu 2
enkiiko 2
enkokola 2
enkolagana 2
enkozesa 2
enkuba 2
enkya 2
enkyukakyuka 2
ennungi 2
ennyaanya 2
ennyanga 2
ensaalwa 2
ensalo 2
entandikwa 2
ente 2
entekateeka 2
entuufu 2
enzikkiriza 2
erasto 2
erina 2
eriri 2
erwana 2
esembayo 2
esooka 2
essanyu 2
essengejjero 2
estate 2
etegekeddwa 2
etutte 2
ewalala 2
eyagala 2
eyakoze 2
eyalondeddwa 2
eyawandiika 2
ezenjawulo 2
ezimu 2
ezisoba 2
ezisobola 2
eziyingira 2
felix 2
festo 2
ffayiro 2
ffumbe 2
fk 2
for 2
fufa 2
fuuti 2
fy 2
gagootaanyizza 2
gat 2
ge 2
gef 2
gerald 2
gguluggulu 2
gino 2
go 2
gubadde 2
guli 2
gutuuse 2
gwabadde 2
gwayabika 2
gyeyawangudde 2
hafiz 2
hajati 2
harrier 2
hellen 2
hut 2
ibrahim 2
iii 2
img 2
information 2
iom 2
iuiu 2
jackson 2
jane 2
janzi 2
jinja 2
jjumba 2
joel 2
julius 2
kabaga 2
kabalagala 2
kabonero 2
kabushenga 2
kabuye 2
kabuzi 2
kaggo 2
kagiga 2
kakiiko 2
kako 2
kakungulu 2
kalyango 2
kaminsona 2
kampalamukadde 2
kamuwunga 2
kamwokya 2
karangwa 2
kasana 2
kasooli 2
kasule 2
katabaazi 2
kateregga 2
katwe 2
kawanda 2
kaweesi 2
kawuki 2
kawundo 2
kayiira 2
kayungirizi 2
keeki 2
keita 2
keith 2
kiba 2
kibasobozese 2
kibayambe 2
kibeera 2
kibi 2
kibirige 2
kidyeri 2
kigaleeta 2
kigambibwa 2
kigongo 2
kijja 2
kika 2
kikula 2
kilomita 2
kintu 2
kip 2
kiromiita 2
kirongo 2
kirya 2
kisakye 2
kisimbula 2
kisobozese 2
kisusse 2
kit 2
kituufu 2
kiyambeko 2
kizibu 2
kkanso 2
kkono 2
kkoona 2
kkumi 2
kkwaya 2
klezia 2
ko 2
kololo 2
kondomu 2
kristu 2
kubeera 2
kuddamu 2
kugaana 2
kugula 2
kukikola 2
kukkirizibwa 2
kukolera 2
kulondoola 2
kunoonya 2
kusigala 2
kusoma 2
kusomesa 2
kutandika 2
kutebenta 2
kutta 2
kuwa 2
kuyamba 2
kuyambako 2
kuyingira 2
kwebakoze 2
kyakubiri 2
kyasigala 2
kyekimu 2
kyekulidde 2
lawrence 2
life 2
likodi 2
loole 2
lubinga 2
luboga 2
ludda 2
lugolobi 2
lukung 2
luminary 2
lumu 2
lun 2
lusanja 2
luswayiri 2
luvannyuma 2
lweza 2
lwo 2
lyeyongedde 2
maanyi 2
magidu 2
magyezi 2
makabai 2
makya 2
malamu 2
mambo 2
mambule 2
margaret 2
masasi 2
masinzizo 2
masjid 2
mayinja 2
mazinga 2
mbaziira 2
mengo 2
mi 2
michael 2
migadde 2
migga 2
mikolo 2
mikono 2
missa 2
mitendera 2
mituba 2
mmande 2
mmeeya 2
mpeereza 2
mubaka 2
mugambe 2
mugenzi 2
mugerere 2
mukiibi 2
mukoko 2
mulala 2
mulamwa 2
mulundi 2
mulwadde 2
mumyuka 2
munaana 2
murushid 2
musinguzi 2
musolo 2
musomesa 2
muteesasira 2
mutuba 2
mutwe 2
muwala 2
muwenda 2
muwulize 2
muzaata 2
mw 2
mwambu 2
my 2
myaka 2
naabulawo 2
naalongo 2
naamusala 2
nabbanja 2
nago 2
nakabugo 2
nakakawa 2
nakayenga 2
nakazibwe 2
nakibirige 2
nakigudde 2
nakisunga 2
nakulabye 2
nakwero 2
nakyo 2
nambooze 2
namirembe 2
namungoona 2
nankabirwa 2
nankindu 2
nassaazi 2
ndagala 2
ndala 2
ndeeba 2
ndi 2
nebeerabira 2
network 2
nile 2
nk 2
nkokola 2
nkulakulana 2
nkulungo 2
nnima 2
nsibirwa 2
nsiike 2
nsooba 2
ntaana 2
ntambuza 2
ntebereza 2
nuhu 2
nya 2
nze 2
nzikkiriza 2
obufuzi 2
obujanjabi 2
obujjanjabi 2
obukodyo 2
obukubagano 2
obulambuzi 2
obulwadde 2
obulwade 2
obusambattuko 2
obutabaako 2
obutabanguko 2
obutaggwa 2
obuvunaanyizibwa 2
obuyigirize 2
obwakoleddwa 2
obwannanyini 2
obwetaaga 2
obwetaavu 2
oc 2
odhiambo 2
ogusangibwa 2
oguyinza 2
ogwagguddewo 2
ogwanga 2
okubaguyaguya 2
okubaka 2
okubakolera 2
okubanga 2
okudduka 2
okudduukirira 2
okufefetta 2
okufuba 2
okufuluma 2
okufulumya 2
okufuuka 2
okugasasulira 2
okugayitamu 2
okugezesa 2
okuggulawo 2
okugoberera 2
okugukka 2
okugulira 2
okujja 2
okujjukira 2
okukakana 2
okukakasa 2
okukendeeza 2
okukkiriza 2
okukuma 2
okukung 2
okukunga 2
okukyafuwala 2
okukyawa 2
okulaama 2
okulabikako 2
okulabirako 2
okulera 2
okulina 2
okulondoola 2
okulongoosa 2
okulongoosebwa 2
okumaliriza 2
okumanyisa 2
okumukwata 2
okumuteeka 2
okumwebaza 2
okunoonyeza 2
okunywa 2
okunywerera 2
okusaanyizibwawo 2
okusigala 2
okusisinkana 2
okusoomoozebwa 2
okussa 2
okutambuza 2
okutangaaza 2
okutereeza 2
okutulugunya 2
okutuuza 2
okutuuzibwa 2
okutwala 2
okutya 2
okuvaamu 2
okuvumirira 2
okuwagira 2
okuwanduka 2
okuweebwa 2
okuweerereza 2
okuwuga 2
okuwummula 2
okuzeeyambisa 2
okuzimba 2
okuzza 2
okuzzaamu 2
okwagalana 2
okwagazisa 2
okwanjaala 2
okwegatta 2
okwekolera 2
okwekuba 2
okwekuumira 2
okwenyigira 2
okwesimbawo 2
okwetangira 2
okwetegekera 2
okwetoloola 2
okweyigiriza 2
okweyisa 2
okwogerwa 2
okwonooneka 2
olulimi 2
olumu 2
olungereza 2
olunnaku 2
oluyimba 2
olwamazzi 2
olwatudde 2
omuggya 2
omujjuvu 2
omukaaga 2
omukubiriza 2
omukuumi 2
omulambo 2
omulamuzi 2
omuliro 2
omulonde 2
omunda 2
omusana 2
omuserikale 2
omusolo 2
omusubuzi 2
omutendesi 2
omutuba 2
omutuufu 2
omuwala 2
omuwandiisi 2
omuwanika 2
omuyizi 2
omwasi 2
omwoyo 2
others 2
owabodaboda 2
paalamenti 2
paasita 2
pastor 2
post 2
puleesa 2
ra 2
ramadhan 2
real 2
rebecca 2
ruk 2
run 2
rut 2
ry 2
saako 2
sab 2
sarah 2
sauna 2
savage 2
seed 2
senkungu 2
sentebe 2
shalia 2
siriimu 2
sitampu 2
sowed 2
ssaabasajja 2
ssabaminisita 2
ssali 2
ssalongo 2
ssekabaka 2
ssemondo 2
ssempa 2
ssemuju 2
ssentamu 2
ssentongo 2
ssinabulya 2
ssirimu 2
steven 2
swagiah 2
sweden 2
swimming 2
tanzania 2
tasobola 2
taxi 2
tebamanyi 2
tebayinza 2
tebesigwa 2
tegatambula 2
tekinologiya 2
telecom 2
tfk 2
timothy 2
tom 2
ttiyaggaasi 2
tugenda 2
tukaikiriza 2
twaagala 2
twaweza 2
umsc 2
unesco 2
university 2
ven 2
vidiyo 2
wabweru 2
waddimba 2
waggwa 2
wasagali 2
wassajja 2
wasula 2
west 2
weyonje 2
william 2
work 2
yabasabye 2
yadde 2
yafuna 2
yakoze 2
yalangiridde 2
yalaze 2
yalondeddwa 2
yannyonnyodde 2
yasinzidde 2
yateegezezza 2
yatuuse 2
yava 2
yawe 2
yezu 2
yinginiya 2
yo 2
yokka 2
yoweri 2
ziraba 2
