num 957
mu 476
ku 303
yakuwa 177
bwe 151
nja 130
bayibuli 122
ne 118
abagole 111
ba 110
nga 107
na 97
mbaga 92
o 92
katonda 90
era 88
zaabwe 88
emu 87
no 84
ompuliriza 80
abajulirwa 79
bbiri 79
ebya 76
nze 76
gya 74
gye 74
byonna 69
nti 66
obukyayi 65
okuba 65
abalala 63
abiri 61
ttaano 60
ssatu 57
gu 56
kikumi 56
asatu 55
oba 53
mwenda 50
emirembe 49
engeri 49
omunaala 49
kye 48
munaana 48
okweggyamu 48
olwa 47
wa 47
abantu 46
be 46
ngo 46
omukuumi 46
bya 44
musanvu 44
mukaaga 43
abo 40
kkumi 40
aba 39
kya 39
lwa 39
nnya 39
basalawo 38
bubiri 38
embaga 37
entalo 37
mingi 37
ebirabo 36
ebisobola 36
ekyo 36
ennyimba 36
obulwadde 36
oluvannyuma 35
bayinza 34
nnyo 34
obukosa 34
za 34
buweerero 33
enjawulo 33
kukweyabizanga 33
nfuno 33
nkubuulira 33
okkusemberera 33
okwogera 33
onfaako 33
yalindirira 33
okutuyamba 32
waliwo 32
baabwe 31
buli 30
chorusnze 30
ebaayo 30
ekintu 30
essanyu 30
kubikugamba 30
kukweyabizanganneeyongere 30
ompa 30
dawudi 29
ekya 29
emikisa 29
okugattibwa 29
bajulirwa 28
nkumi 28
abagenyi 27
baba 27
ngeri 27
nsi 27
okunywa 26
wabaayo 26
bo 25
ekitiibwa 25
hall 25
busiriivu 24
okusaba 24
okwagala 24
url 24
bakola 23
ddala 23
lwe 22
mukolo 22
ana 21
ensonga 21
gavumenti 21
nuuwa 21
abalalaweereza 20
baafumbiriganwako 20
ebikolebwa 20
egya 20
lwaki 20
naye 20
obufumbo 20
okukkiriza 20
okulya 20
olunaku 20
baani 19
bwabwe 19
ekifo 19
eya 19
kubanga 19
kyokka 19
okukuyamba 19
biki 18
bitaano 18
ensi 18
okuzina 18
wamu 18
ebirowoozo 17
ebirowoozo​—engeri 17
eyinza 17
jpg 17
nkaaga 17
byawandiikibwa 16
ga 16
vidiyo 16
ziriggwaawo 16
abaana 15
amagiraasi 15
bambalamu 15
bayita 15
emikolo 15
eno 15
gibeera 15
ogu 15
okugaba 15
okukoonaganya 15
weereza 15
yali 15
ababa 14
bakuza 14
basobola 14
date 14
ebirayiro 14
ebyo 14
eriyo 14
eweesa 14
kibasanyusa 14
kifo 14
kwogera 14
lg 14
lu/pt/wp_lu 14
ofiisi 14
okuwa 14
okwambala 14
okwesigamiziddwa 14
abamu 13
abaruumi 13
bagattirwa 13
basanyukirako 13
ebimu 13
endala 13
eŋŋanda 13
gyabwe 13
kukingdom 13
kutya 13
laba 13
lukka 13
mateeka 13
media 13
mikwano 13
mutima 13
okuzannya 13
olabye 13
playereremereddwa 13
awamu 12
bagenda 12
birowoozo 12
bokka 12
bukadde 12
kyenda 12
kyonna 12
nedda 12
nsanvu 12
okubaayo 12
okulukuza 12
okuwuliriza 12
omu 12
omubuulizi 12
omwenge 12
osobola 12
wayinza 12
abakwesiga 11
ayinzo 11
baweereza 11
ebikolwa 11
ebintu 11
kkulemeso 11
kuwuliriza 11
mulabe 11
okukola 11
okusinziira 11
ssente 11
wanulako 11
balina 10
bangi 10
bibiri 10
bingi 10
bisatu 10
bizibu 10
bridgeteri 10
ebibuuzo 10
ebinnyiga 10
endingompuliriza 10
essaala 10
kimu 10
kiriwa 10
kkubuulira 10
kungi 10
mba 10
mmanyi 10
ndowoozaako 10
nkugamba 10
nneebuuza 10
obawa 10
obo 10
obubonero 10
okugondera 10
okuli 10
okulondako 10
okutuyambamu 10
oli 10
olupapula 10
ondaga 10
owanula 10
oyagala 10
pulintaweereza 10
sijja 10
sindika 10
wadde 10
zaabo 10
ziddamu 10
budde 9
ebirala 9
eraga 9
eyo 9
gwa 9
kijja 9
kiki 9
kkweyabiza 9
kuddirira 9
kufunango 9
kweyongera 9
nkusaba 9
nkusabe 9
okkusaba 9
watali 9
ababi 8
amaanyi 8
amataba 8
baali 8
byayamba 8
bye 8
content 8
egamba 8
ekiseera 8
ekitangaala 8
embi 8
ezikirizibwa 8
in 8
maaso 8
mukazi 8
mukutu 8
nge 8
okuwonawo 8
omwana 8
omwoyo 8
oyiga 8
abagasse 7
abajja 7
abakazi 7
abakkolinso 7
abatali 7
abeefeso 7
akozesa 7
alangirira 7
ane 7
ataano 7
awe 7
baakubye 7
baanirizibwa 7
babagole 7
babawa 7
babawadde 7
bafuba 7
bafuna 7
bafuuse 7
bagabira 7
bakikola 7
bakuba 7
balala 7
baleme 7
balonda 7
bambala 7
banaabasembereza 7
banaasembeza 7
banaayita 7
bantu 7
basaanidde 7
basinziza 7
baswadde 7
batawaddeeyo 7
bazze 7
birabo 7
birayiro 7
bisomebwa 7
bonna 7
bwa 7
bwaffe 7
e 7
eba 7
ebiri 7
ebisaanira 7
ebiweesa 7
ebyambalo 7
ebyokulabirako 7
eddakiika 7
ekiba 7
ekikulu 7
ekimu 7
ekiyitibwakingdom 7
emirundi 7
empeta 7
enkola 7
ennyangu 7
eryato 7
ezo 7
gakwata 7
gufundikirwa 7
gwo 7
kaana 7
kati 7
ki 7
kiba 7
kijjulo 7
kiri 7
kityo 7
kompyuta 7
koppa 7
kubawa 7
kugattibwa 7
kugenda 7
kuggwa 7
kukoonaganya 7
kusoma 7
kutwala 7
kuweebwa 7
kwambalamu 7
kwe 7
kwesittaza 7
magiraasi 7
mannya 7
matayo 7
mukwano 7
mukyala 7
museenene 7
mwami 7
nabo 7
nnyingi 7
obulimu 7
obutagakoonaganya 7
obuwangaazi 7
obuweereza 7
oggyeko 7
ogwo 7
oku 7
okubaawo 7
okubayamba 7
okubiddamu 7
okubikuba 7
okugatta 7
okugendako 7
okukwata 7
okulaga 7
okuleetera 7
okusalawo 7
okusembeza 7
okuwulira 7
okwo 7
olukusa 7
oluyimba 7
omukisa 7
omukolo 7
omwogezi 7
oyo 7
peetero 7
si 7
tebaakubye 7
tebalina 7
tebannafuna 7
tebasaba 7
tevumirira 7
timoseewo 7
wange 7
weekiri 7
yaakatandika 7
yayitibwa 7
yesu 7
yokaana 7
zabbuli 7
zibaako 7
zikolebwa 7
zisobola 7
ziwa 7
abafumbo 6
abagabi 6
abakkirizibwa 6
abalina 6
aboogerwako 6
akakwate 6
amagezi 6
baagala 6
bakakasa 6
balowooza 6
banaakuza 6
bayiira 6
beerondera 6
beesalirawo 6
beewala 6
bikontana 6
bitundu 6
bujja 6
buwangwa 6
ekirina 6
erimu 6
etukubiriza 6
ezinaakubibwa 6
eziteekebwako 6
format 6
gujja 6
guweebwa 6
hallziba 6
isaaya 6
kibusobozese 6
kigero 6
kirabo 6
kisobola 6
kuba 6
kugabula 6
kuleetera 6
kulya 6
kumalawo 6
kunywa 6
kwabwe 6
mbeera 6
mukingdom 6
muno 6
muntu 6
mwemuli 6
obanga 6
obupapula 6
obusamize 6
okubaako 6
okubaamu 6
okubeegattako 6
okufunayo 6
okugabula 6
okusanyukirako 6
okuva 6
okuwangaala 6
okuyita 6
okwagaliza 6
omuceere 6
omukuumiddala 6
omuzannyodawudi 6
otawaanyizibwa 6
tegivumirira 6
tewabaayo 6
weewale 6
yaabwe 6
zeesigamiziddwa 6
a 5
abbigayiri 5
amateeka 5
ate 5
awadde 5
bagole 5
biyinza 5
boyo 5
bungi 5
ebyoleka 5
eddamu 5
ekigambo 5
essimuekikube 5
gwaffe 5
katondateekako 5
kitundu 5
mpisa 5
obwakabaka 5
okukozesakingdom 5
okwawukanamuko 5
tasaba 5
tebasabibwa 5
univ/art 5
univ_sqr_xl 5
wanula 5
abaatiikirivu 4
abajeemu 4
abawagguufu 4
ago 4
amataba—ddala 4
amazima 4
amugondera 4
atya 4
ayagala 4
azikiriza 4
baawasa 4
baazaala 4
biseera 4
bufumbo 4
bukakafu 4
bwesigamye 4
byabuna 4
byaliyo 4
byo 4
ebingi 4
ebisinga 4
ebitundu 4
ebizibu 4
edda 4
eddungi 4
eggulu 4
ekiro 4
ekitabo 4
entalobayibuli 4
erinnya 4
essuubi 4
ewa 4
gaffe 4
grid 4
gwesigamiziddwa 4
kabaka 4
katonda​—kya 4
kigambo 4
kinaana 4
kitange 4
kitya 4
kuolubereberye 4
kyakirenga 4
kyammwe 4
kyangu 4
kyayoleka 4
lirangirira 4
list 4
londa 4
luganda 4
lumu 4
lusozi 4
lyaffe 4
makungula 4
mmwe 4
mugende 4
mujje 4
mukama 4
mumanyenga 4
njawulo—yali 4
nkola 4
obukambwe 4
obukyayiluganda 4
obulaga 4
obulamu 4
obwalimu 4
obwesige 4
okubikkulibwa 4
okubuulira 4
okukuza 4
okusoma 4
okutambula 4
okutendereza 4
okutuyambamuluganda 4
okuweereza 4
okuyigiriza 4
okuzimba 4
okwenyigira 4
oluganda 4
ompulirizaluganda 4
omubereberye 4
omutima 4
omuweereza 4
owa 4
oweebwe 4
oyinza 4
sawulo 4
show 4
ssa 4
tekyali 4
tendereza 4
tubamanyiiko 4
tuyigira 4
tuyinza 4
vidiyoebya 4
wawaayo 4
we 4
weekolere 4
wo 4
wulira 4
yakozesa 4
yakuwalugandadawudi 4
yakuwamp 4
yakyawa 4
yaleeta 4
yatambula 4
yawonyezebwawo 4
yeeyisa 4
yimba 4
abakoseddwa 3
abasaasira 3
abasajja 3
abe 3
agayamba 3
ajja 3
akugamba 3
alina 3
amaaso 3
asobola 3
ataddewo 3
ategeera 3
atusuubiza 3
atuwa 3
awa 3
bakyawa 3
basobodde 3
bayibulidawudi 3
bikosa 3
bisobola 3
bizziddwa 3
bugagga 3
buggya 3
buleetewo 3
bulungi 3
bumu 3
bwange 3
bwatandikawo 3
bwenkanya 3
bwonna 3
ebibeeraliikiriza 3
ebibi 3
ebikwatagana 3
ebiruubirirwa 3
eddamuabanefuli 3
eddamuebikwata 3
ejja 3
ekibuuzo 3
ekijja 3
ekikweraliikiriza 3
ekisoboka 3
ekisuubizo 3
ekitalo 3
ekizikiza 3
empeera 3
ennyo 3
enteekateeka 3
enzijuvu 3
eri 3
esobola 3
eyambye 3
eziri 3
ezisobola 3
fayiro 3
ggya 3
go 3
gusobola 3
gwaffe™layibulale 3
gwange 3
gwonna 3
kifunire 3
kikuyamba 3
kindeetera 3
kirituuka 3
kiyinza 3
kubaamu 3
kuganyula 3
kuggwaawo 3
kutuuka 3
kuumira 3
kwabweabbigayiri 3
kwabwenuuwa 3
kyaddaaki 3
kyapavidiyowanula 3
layibulale 3
lunaku 3
lya 3
magezi 3
mbeere 3
mpeera 3
mukoppe 3
mulamu 3
mutegeevukiki 3
muwendo 3
mwana 3
nnamaddala 3
nnamba 3
nneeyongere 3
nnyiriri 3
noonyanoonya 3
ntalo 3
nuuwabamalayika 3
obukulu 3
obulumi 3
obusosoze 3
obutali 3
obuteesasuza 3
obwetaavu 3
okubudaabuda 3
okufumiitiriza 3
okuggwaawo 3
okuggya 3
okugoberera 3
okukolera 3
okukulaakulanya 3
okumalirawo 3
okumubudaabuda 3
okusaba—mumukwase 3
okusinga 3
okusosola 3
okutuukako 3
okutuyambamuomunaala 3
okuviira 3
okuyamba 3
okuzimalawo 3
okweteerawo 3
okwetooloola 3
olusuku 3
omuggya 3
omukakafu 3
omulala 3
omuntu 3
omutukuvu 3
omutwe 3
osinziira 3
oyamba 3
sawulolwaki 3
tasosola 3
teekako 3
tewakyaliwo 3
tufuna 3
tuli 3
tutawaanyizibwa 3
tutya 3
waba 3
waffe 3
weerabe 3
weesiga 3
weewuliramu 3
weggyemu 3
ya 3
yenna 3
yoleka 3
zijja 3
zisobole 3
abaakulira 2
abalalakatonda 2
agatuyambalaba 2
akufaakolwaki 2
batera 2
bino 2
bukyayi 2
byoekigambo 2
ebirowoozobo 2
emyaka 2
essimu 2
eza 2
formatshow 2
jpgwp 2
kwamuleetera 2
kyapavidiyo 2
nuuwa—okukkiriza 2
obukyayibayibuli 2
okukosebwa 2
okumalawo 2
okumalibwawoobwakabaka 2
okwesasuzabwe 2
wali 2
wamutuyinza 2
watalibaawo 2
weebuuzizzaako 2
yakuwalayibulale 2
zinodawudi 2
