mu 463
ku 347
n 320
nga 304
nti 200
ne 190
ng 128
e 124
era 106
y 91
bwe 82
wa 65
kkooti 58
ssente 53
ya 49
ye 49
abantu 48
w 47
bw 44
kya 44
kino 43
agamba 41
olw 41
ate 40
okuva 39
abaana 38
gw 38
gye 38
omusango 37
ba 35
guno 35
eby 34
lw 34
eno 33
poliisi 33
wabula 33
by 30
000 29
buli 29
kubanga 29
ky 29
abazadde 28
naye 26
gavumenti 24
omulamuzi 24
ono 24
yagambye 24
z 24
za 24
ategeezezza 23
be 23
uganda 23
yabadde 23
abayizi 22
asabye 22
kyokka 22
okufuna 21
oluvannyuma 21
we 21
2022 20
bano 20
kampala 20
kwe 20
okuli 20
b 19
ga 19
kuba 19
matovu 19
ttiimu 19
2 18
abadde 18
akulira 18
ebintu 18
lwa 18
omu 18
omwana 18
agambye 17
bantu 17
enjawulo 17
eri 17
gwe 17
kabaka 17
kati 17
lya 17
maaso 17
nnyo 17
okukola 17
balina 16
bino 16
emyaka 16
lino 16
aba 15
bagenda 15
embeera 15
gwa 15
oba 15
okubeera 15
okulaba 15
alina 14
amazzi 14
bali 14
bye 14
ey 14
kw 14
lwe 14
yategeezezza 14
abamu 13
dr 13
emirimu 13
emmere 13
eya 13
katonda 13
kifo 13
kye 13
ofiisi 13
okutuuka 13
okutuusa 13
omugenzi 13
omulimu 13
omupiira 13
owa 13
pulezidenti 13
ukraine 13
zino 13
10 12
ab 12
amasomero 12
awaka 12
baabwe 12
bya 12
byonna 12
ekifo 12
eyali 12
liigi 12
obukadde 12
ogw 12
okuzimba 12
olunaku 12
russia 12
ssomero 12
abalala 11
abawagizi 11
baagala 11
bazadde 11
buganda 11
ddala 11
eggwanga 11
emu 11
gy 11
kigambibwa 11
lwomukaaga 11
minisita 11
mmotoka 11
ssinga 11
wamu 11
wano 11
akkiriza 10
ali 10
amaanyi 10
ebirala 10
enkulu 10
ez 10
fc 10
kkomera 10
lubaga 10
ndejje 10
okubba 10
okwongera 10
olukiiko 10
omwogezi 10
wakati 10
5 9
abatuuze 9
baabadde 9
bagamba 9
disitulikiti 9
eky 9
emmundu 9
endala 9
ensonga 9
eza 9
ggwanga 9
kalungi 9
lady 9
luweero 9
luzira 9
musango 9
na 9
ngeri 9
november 9
obulungi 9
october 9
omuli 9
omutendesi 9
rev 9
si 9
ssaabasumba 9
ssewungu 9
ucu 9
university 9
ura 9
waabwe 9
waggulu 9
waliwo 9
yali 9
zaabwe 9
1 8
50 8
7 8
abakristu 8
abazigu 8
asaba 8
ategeeza 8
baana 8
basobole 8
bitundu 8
ebola 8
ekibonerezo 8
ekitongole 8
emisango 8
essimu 8
eyabadde 8
ggoolo 8
gino 8
kitundu 8
ly 8
maka 8
museveni 8
naddala 8
obumyu 8
okukuuma 8
olwo 8
omukisa 8
omukozi 8
omwaka 8
paasipooti 8
school 8
siteegi 8
ttaka 8
villa 8
yonna 8
ze 8
4 7
abagenda 7
abakugu 7
abalamuzi 7
abasajja 7
abaserikale 7
amaka 7
amasannyalaze 7
amasasi 7
baali 7
bangi 7
basaba 7
bibuga 7
bulungi 7
december 7
ebiri 7
ebitundu 7
emmotoka 7
enkola 7
ennyimba 7
ennyo 7
esatu 7
essomero 7
ettaka 7
fr 7
g 7
jinja 7
ka 7
kcca 7
kisaawe 7
league 7
leero 7
luno 7
martyrs 7
mateeka 7
mazzi 7
mipiira 7
moses 7
mpaka 7
mubs 7
nakawa 7
obujulizi 7
okudda 7
okukuba 7
okumala 7
okumanya 7
okusaba 7
okusinziira 7
okutandika 7
okuwulira 7
omukolo 7
omukulu 7
omuntu 7
omuserikale 7
otim 7
ow 7
sc 7
slau 7
ssentamu 7
wadde 7
yasabye 7
100 6
15 6
28 6
30 6
6 6
abaabadde 6
agambibwa 6
akola 6
alaga 6
amagezi 6
ayogera 6
babadde 6
bbeeyi 6
besigye 6
bingi 6
bintu 6
bonna 6
bukedde 6
bwa 6
cardinals 6
ebadde 6
ebibuga 6
ebigambo 6
ebikolwa 6
ebimu 6
ebyo 6
ekibuga 6
ekintu 6
ekitundu 6
emyezi 6
enfuna 6
ensangi 6
ettemu 6
james 6
kakande 6
kkiro 6
kuliko 6
l 6
mbeera 6
mutindo 6
obulamu 6
omumyuka 6
omutindo 6
omuvubuka 6
omwezi 6
putin 6
sikulaapu 6
ssaako 6
ssemambo 6
yunivasite 6
20 5
2018 5
3 5
abafumbo 5
abakungu 5
abasawo 5
abazannyi 5
abwoti 5
agaba 5
agenda 5
alabudde 5
amagye 5
amangu 5
amaze 5
arua 5
baba 5
balabyekkubo 5
bannalulungi 5
bannayuganda 5
bbiri 5
bifo 5
bungi 5
buno 5
buvuddeko 5
byabwe 5
egenda 5
ekigo 5
ekivvulu 5
ekkanisa 5
eklezia 5
emabega 5
emisumaali 5
empisa 5
endagamuntu 5
engule 5
enguzi 5
ennyumba 5
ensawo 5
essanyu 5
giants 5
isabella 5
katikkiro 5
kirya 5
kiseera 5
kitongole 5
kwa 5
kyando 5
lujjudde 5
mbale 5
meeya 5
minisitule 5
mmisa 5
mubende 5
musanvu 5
myaka 5
myezi 5
namara 5
national 5
nnamba 5
nsonga 5
nup 5
obulunzi 5
okuba 5
okukuza 5
okusobola 5
okutta 5
okutumbula 5
okutuula 5
okuwa 5
okwewala 5
omubaka 5
omulala 5
omuzibizi 5
p 5
paul 5
phillip 5
shafik 5
ssande 5
ssentebe 5
united 5
wakiso 5
water 5
wiiki 5
william 5
ying 5
16 4
24 4
29 4
500 4
ababaka 4
abakulu 4
abalunzi 4
abangi 4
afrigo 4
afuna 4
agenze 4
ahumuza 4
akuutidde 4
alagira 4
amyuka 4
and 4
awamu 4
awo 4
ayagala 4
babiri 4
bafuna 4
bakkansala 4
bakozi 4
bakulembeddwaamu 4
basobola 4
bavunaanibwa 4
bbanka 4
bbatule 4
bbomu 4
beetaaga 4
bikolwa 4
black 4
blick 4
botanical 4
bukya 4
busoga 4
bwabye 4
city 4
cranes 4
david 4
dda 4
dj 4
east 4
eba 4
ebbaluwa 4
ebibanja 4
ebibuuzo 4
ebifaananyi 4
ebirowoozo 4
ebisale 4
eddakiika 4
edduuka 4
ekibiina 4
ekifaananyi 4
ekitiibwa 4
ekya 4
emikono 4
emizannyo 4
emmeeri 4
ena 4
enkizo 4
enkoko 4
ennyanja 4
ensi 4
entandikwa 4
erina 4
eyasooka 4
eyateebye 4
ezimu 4
faaza 4
golf 4
gya 4
hannington 4
ibrahim 4
jumia 4
junior 4
kamu 4
kano 4
kasiira 4
kimu 4
kira 4
kitaabwe 4
kkwaya 4
klezia 4
kubeera 4
kuno 4
kusaba 4
kyonna 4
ligyoni 4
limanda 4
lipoota 4
luguudo 4
maama 4
makerere 4
male 4
malwaliro 4
mizayiro 4
mugabi 4
mugambe 4
mukasa 4
mukolo 4
mulundi 4
muluya 4
munnamateeka 4
muntu 4
mwanjuzi 4
mwezi 4
nabaasa 4
namugaya 4
nkola 4
nnyingi 4
nsi 4
nsiike 4
obulambuzi 4
obulumbaganyi 4
obutonde 4
obw 4
obwenzi 4
ogusooka 4
okubaka 4
okujjukira 4
okulabirira 4
okunoonyereza 4
okusabira 4
okusasulira 4
okusinga 4
okutegeka 4
okutuukiriza 4
okutwala 4
okuwangula 4
okuyita 4
oludda 4
olutalo 4
olutindo 4
oluwaabi 4
olwa 4
omusawo 4
omusumba 4
oyo 4
palamenti 4
peter 4
primary 4
rashid 4
ronald 4
rose 4
sente 4
she 4
ssaabalamuzi 4
ssabasajja 4
ssemogerere 4
sserugga 4
st 4
wiini 4
yaleka 4
yasoose 4
zaporizhzhia 4
zoo 4
12 3
13 3
14 3
18 3
2-0 3
25 3
70 3
700 3
80 3
9 3
abaali 3
ababadde 3
abaddukanya 3
abaffamire 3
abakazi 3
abakulira 3
abali 3
abalina 3
africa 3
afrika 3
ag 3
agamuttiddewo 3
akubiriza 3
allah 3
aludde 3
asabira 3
asindikidwa 3
asobola 3
atwalibwa 3
atyo 3
awa 3
awaayo 3
awalala 3
awangudde 3
awatali 3
ayamba 3
azze 3
baakola 3
baayo 3
bajja 3
bakama 3
baleme 3
ball 3
balyoke 3
bampalana 3
bamwine 3
bannaabwe 3
bannannyini 3
banne 3
basuubira 3
batongozza 3
batuuse 3
bazannyi 3
bazze 3
bbanga 3
bbuye 3
beach 3
birina 3
bizimbe 3
bizinensi 3
brian 3
bul 3
bulumbaganyi 3
bungereza 3
busiika 3
bwabwe 3
bwangu 3
bwannamukulu 3
byayogeddwa 3
cherubim 3
christine 3
christopher 3
church 3
corperation 3
daniel 3
ddigi 3
drone 3
dubai 3
ebbanga 3
ebigezo 3
ebijaguzo 3
ebijanjaalo 3
ebika 3
ebikozesebwa 3
ebiragiro 3
ebirimu 3
ebweru 3
ebya 3
eddembe 3
effujjo 3
eggulo 3
egy 3
ejja 3
ekigendererwa 3
ekika 3
ekikulu 3
ekiragiro 3
ekituufu 3
ekwama 3
ekyambalo 3
ekyo 3
embalirira 3
emisomo 3
ennaku 3
ennamba 3
ennansi 3
ennyonyi 3
ensiike 3
entalo 3
erimu 3
ery 3
essaza 3
etaputa 3
evudde 3
ewedde 3
eziyita 3
ezo 3
fayinolo 3
ffamire 3
fiizi 3
gardens 3
girls 3
gujja 3
gumu 3
gwabadde 3
gwabwe 3
gwonna 3
iganga 3
john 3
joint 3
joseph 3
jude 3
julius 3
kabira 3
kadaga 3
kalagala 3
kalanzi 3
kapiteeni 3
kaseera 3
kattu 3
kaweefube 3
kaweesi 3
kawempe 3
kayunga 3
kazimba 3
kibiina 3
kiev 3
kikyamu 3
kimanje 3
kimenya 3
kinene 3
kiri 3
kisenyi 3
kitebe 3
kitegeeza 3
kivvulu 3
kiwalabye 3
kiwandiiko 3
kiyimba 3
kkaadi 3
kkampuni 3
kufuna 3
kugenda 3
kukola 3
kutandika 3
kwabwe 3
kyagulanyi 3
kyalo 3
kyewalabye 3
lukujjukujju 3
lwokutaano 3
lyonna 3
maanyi 3
makomera 3
maria 3
mary 3
masomero 3
mayuge 3
mbaziira 3
mmere 3
mugabe 3
muganzi 3
mugisha 3
mukama 3
mukono 3
mukutu 3
mulamba 3
mupiira 3
mutimbagano 3
mutuuze 3
mwana 3
mwoleso 3
naads 3
nabo 3
naggulu 3
nalulungi 3
nambatya 3
namugongo 3
nayo 3
ngitunda 3
noah 3
ntebe 3
nteekateeka 3
obua 3
obutabanguko 3
obuyambi 3
obwenkanya 3
ogwang 3
okubaako 3
okubawa 3
okubulwa 3
okuddukanya 3
okudduukirira 3
okufa 3
okuggulawo 3
okuguwulira 3
okukkiriza 3
okukozesa 3
okukuma 3
okulimira 3
okulukozesa 3
okulwanyisa 3
okumusabira 3
okusasula 3
okusinzira 3
okusoma 3
okusuula 3
okuteeka 3
okutunda 3
okuyisa 3
okuzannya 3
okwanganga 3
okwegaana 3
okwenyigira 3
okwesasuza 3
old 3
oldies 3
omugagga 3
omukama 3
omukungu 3
omulanga 3
omuliro 3
omulundi 3
omusomo 3
omutendera 3
omuzannyi 3
onduparaka 3
orone 3
owor 3
puleesa 3
rd 3
rdc 3
road 3
sarah 3
sewerage 3
singa 3
sipiika 3
so 3
ssanyu 3
ssebyala 3
ssegawa 3
ssemateeka 3
ssempijja 3
ssimu 3
star 3
tebalina 3
timbe 3
toha 3
ttani 3
turyamusiima 3
tv 3
uwec 3
vipers 3
wasilwa 3
yaabwe 3
yaayo 3
yadde 3
yagenze 3
yakola 3
yakwata 3
yalina 3
yalinnye 3
yasiimye 3
yasinzidde 3
yeebaza 3
yeebazizza 3
yinginiya 3
yuda 3
ziri 3
zonna 3
zooni 3
00 2
11 2
150 2
16-22 2
2-1 2
2015 2
23 2
3-1 2
35 2
350 2
4-1 2
400 2
56 2
78 2
8 2
800 2
90 2
a 2
abaagenze 2
abaakubagana 2
abaatutte 2
abaawambye 2
abaayo 2
ababbye 2
ababuzaabuza 2
abacakaze 2
abadiventi 2
abagagga 2
abagambye 2
abajjukiza 2
abakozi 2
abakulembeze 2
abakyala 2
abalenzi 2
abalimi 2
abalirirwamu 2
abalumiriza 2
abalwadde 2
abasabidde 2
abasabira 2
abasinga 2
abasomesa 2
abasussa 2
abatukuvu 2
abavubuka 2
abawala 2
abayimbi 2
abdul 2
abeera 2
abeetabye 2
abigaba 2
abo 2
abubakar 2
agattako 2
agende 2
aggalawo 2
aggwa 2
agnes 2
ainomugisha 2
ajja 2
ak 2
akakadde 2
akakasa 2
akamalirizo 2
akamu 2
akamyu 2
akaseera 2
akawungeezi 2
akawunti 2
akayimba 2
akulembeddemu 2
akwata 2
akwatiddwa 2
aliko 2
alinawo 2
alysious 2
amanyiddwa 2
amateeka 2
amawulire 2
amukuba 2
amusaba 2
amusindika 2
amuwe 2
ana 2
andereya 2
andrew 2
ano 2
asazizzaamu 2
asimbidwa 2
asobole 2
asoma 2
asooka 2
asuubizza 2
atandise 2
ati 2
atwaliddwa 2
august 2
ava 2
avumiridde 2
avunaanyizibwa 2
awali 2
ayaniriza 2
ayitirako 2
ayogerako 2
ayongeddeko 2
ayongerako 2
baakonkonye 2
baakutalaga 2
baalumba 2
baataddeko 2
baayisizza 2
baayolesezza 2
babaddewo 2
babagololako 2
babanja 2
babawa 2
babayimiridde 2
babirye 2
badding 2
bagenze 2
bagezaako 2
bajeti 2
bakola 2
bakosebwa 2
bakubiriziddwa 2
bakubye 2
bakyayagala 2
balaamirizeeko 2
balabirira 2
baliko 2
balimwezo 2
balinako 2
balinawo 2
bamaze 2
baminisita 2
bamusibye 2
bannaddiini 2
bannamawulire 2
bannansi 2
banoonya 2
basabiddwa 2
basabira 2
basala 2
basatu 2
basazeewo 2
basketball 2
batafaayo 2
batandika 2
bategeezezza 2
batta 2
battunka 2
batuuze 2
bavudde 2
baweereddwa 2
bawummudde 2
bayinza 2
bayite 2
bayosaamu 2
bbaluwa 2
bbookisi 2
bbulooka 2
beekalakase 2
beewuuba 2
bibadde 2
bigezo 2
bisatu 2
blacks 2
bo 2
board 2
boarding 2
bokka 2
brain 2
bright 2
bubaka 2
bubi 2
bubonero 2
budde 2
bugwanjuba 2
bukadde 2
bukuumi 2
bukyanga 2
bulabirizi 2
bulamu 2
busatu 2
busobola 2
butabika 2
butebenkevu 2
buvanjuba 2
buwanguzi 2
bwatyo 2
bweyogerere 2
byafaayo 2
byarugaba 2
byogeddwa 2
byonooneka 2
catda 2
chamber 2
charles 2
chief 2
christian 2
collins 2
covid 2
da 2
ddakiika 2
dduuka 2
ddwaaliro 2
dedan 2
deedan 2
denis 2
division 2
divizoni 2
dnipropetrovsk 2
ebbeeyi 2
ebibasomeseddwa 2
ebigimusa 2
ebikonde 2
ebimasomeseddwa 2
ebipya 2
ebirime 2
ebiseera 2
ebisinga 2
ebitabo 2
ebitongole 2
ebituli 2
ebiwandiiko 2
ebiyumba 2
ebizibu 2
ebizimbisibwa 2
ebyamawulire 2
ebyenfuna 2
ebyeyongedde 2
ebyobulamu 2
ebyokwerinda 2
ebyonooneka 2
ebyuma 2
eddagala 2
eddimu 2
eddy 2
eggye 2
egobye 2
ekibinja 2
ekikyamu 2
ekirala 2
ekiramuzi 2
ekiro 2
ekirwadde 2
ekirwanirira 2
ekisaamusaamu 2
ekisangibwa 2
ekiseera 2
ekiviiriddeko 2
ekizimbe 2
ekozesezza 2
ekyejo 2
emipiira 2
emirambo 2
emirundi 2
emiti 2
emitwalo 2
emiziki 2
empaka 2
empya 2
enda 2
endagaano 2
endwadde 2
engeri 2
enguudo 2
enjiri 2
enkya 2
ennungi 2
ennyaanya 2
erumbye 2
erya 2
esobola 2
essaawa 2
essaaza 2
essuubi 2
etaano 2
etteeka 2
etuntumuka 2
ewa 2
eyabba 2
eyagenze 2
eyaliko 2
ezigambibwa 2
eziri 2
ezitwala 2
ezze 2
faridah 2
fast5 2
fayiro 2
fida 2
fortebet 2
francis 2
fred 2
friday 2
fuuti 2
galaxy 2
gamukuba 2
gano 2
geoffrey 2
ggalagi 2
ggiya 2
ggwanika 2
gigenda 2
gijja 2
gol 2
government 2
gubadde 2
gugenda 2
gusobole 2
gusuubirwa 2
gwetabiddwaako 2
gyali 2
gyombi 2
haabu 2
hamson 2
henry 2
hot 2
hotel 2
ihnat 2
irene 2
j 2
jjokolera 2
joan 2
joel 2
justine 2
k 2
kamulegeya 2
kamwokya 2
kanjuki 2
kareem 2
karim 2
kassanda 2
katebe 2
katongole 2
kawamara 2
ke 2
kharkiv 2
kibuga 2
kibuli 2
kiddiridde 2
kigenda 2
kintu 2
kirabika 2
kireka 2
kirumira 2
kisaka 2
kisugu 2
kitandikibwawo 2
kiti 2
kityo 2
kiyambeko 2
kiyinza 2
kkeeki 2
kololo 2
komuhangi 2
kristo 2
kubayigiriza 2
kugaba 2
kulongoosa 2
kulunda 2
kulungamizibwa 2
kungeri 2
kusooka 2
kutambuza 2
kutunda 2
kutuuka 2
kutuula 2
kutwala 2
kuwagira 2
kuyambako 2
kwongera 2
kyabwe 2
kyetume 2
kyokubiri 2
land 2
ldc 2
limited 2
lubalama 2
lufula 2
luggi 2
lugogo 2
lukiiko 2
lumu 2
lunaku 2
lungujja 2
lusanja 2
lutikko 2
luwedde 2
lviv 2
lyabwe 2
makindye 2
maliri 2
march 2
margret 2
martins 2
mawanga 2
may 2
mayiga 2
mbarara 2
mberaze 2
mengo 2
migongo 2
mikwano 2
misango 2
mitambo 2
miti 2
mitwalo 2
mmeeri 2
mmeeya 2
mpalanyi 2
mpisa 2
mudekereza 2
mufti 2
mugerwa 2
muhammad 2
mukaaga 2
mukazi 2
mukhose 2
mukwano 2
mukwaya 2
mukyala 2
mulamwa 2
mulimu 2
mulumba 2
muluuya 2
munda 2
munisipaali 2
munne 2
musaala 2
musuubuzi 2
mutunzi 2
mutwe 2
muwala 2
mwaka 2
mwe 2
mwewale 2
nabukenya 2
nabweru 2
najjanankumbi 2
nalubaale 2
nampungu 2
nantale 2
ndagamuntu 2
ndwadde 2
new 2
nfuna 2
nin 2
nira 2
njagala 2
nnima 2
norah 2
northern 2
nsala 2
nsiko 2
nyanzi 2
obubbi 2
obubonero 2
obudde 2
obugazi 2
obukono 2
obuli 2
obungi 2
obupya 2
obusomesa 2
obutakkaanya 2
obutali 2
obuti 2
obuvunaanyizibwa 2
obuwanguzi 2
obuwangwa 2
obuweereza 2
obuwumbi 2
obuyinza 2
obuzibu 2
obwakabaka 2
obwamaanyi 2
obwavu 2
ogumu 2
ogumuvunaanibwa 2
ogwa 2
ogwal 2
ogwategekeddwa 2
ogwokubiri 2
okubakolako 2
okubayambira 2
okubongera 2
okuddamu 2
okufiira 2
okugamba 2
okugenda 2
okugoberera 2
okugulira 2
okujaguza 2
okukakasa 2
okukimanya 2
okukkekkerezaamu 2
okukolagana 2
okukomawo 2
okukomya 2
okuleeta 2
okuliisa 2
okuliraana 2
okulondoola 2
okulunda 2
okulwanagana 2
okumaliriza 2
okusasika 2
okusigala 2
okusiima 2
okusindiikiriza 2
okusomoozebwa 2
okusonderako 2
okutaasa 2
okutambula 2
okutambuza 2
okuteekawo 2
okutondawo 2
okuwulirwa 2
okuyambako 2
okuziyiza 2
okwagala 2
okwekwasa 2
okwerinda 2
okwetangira 2
okwetooloola 2
okwewaayo 2
olubadde 2
olubalama 2
oluggi 2
olumu 2
olutuuse 2
oluusi 2
oluva 2
omugenyi 2
omuggalo 2
omujaasi 2
omulabirizi 2
omulambo 2
omulungi 2
omusaayi 2
omusanvu 2
omusingi 2
omusuffu 2
omutuuze 2
omuyimbi 2
omwabadde 2
osobola 2
our 2
p7 2
paapa 2
passport 2
patrick 2
payipu 2
peneti 2
ple 2
premier 2
protection 2
pulojekiti 2
rebecca 2
richard 2
robinah 2
s 2
saako 2
samuel 2
sea 2
semi 2
sheikh 2
simon 2
siniya 2
sitaani 2
sitetimenti 2
social 2
south 2
ssaawa 2
ssaayansi 2
ssebalu 2
ssebuyungo 2
ssekabembe 2
ssekabira 2
ssemanda 2
sso 2
stars 2
startimes 2
steven 2
super 2
tadeo 2
taliiwo 2
tebazibawa 2
tegenda 2
tekiri 2
tesobola 2
track 2
tree 2
ttanka 2
ttivvi 2
tuli 2
u 2
updf 2
uraine 2
urban 2
vinnytsia 2
waakukulemberamu 2
wakyaliwo 2
wandayaka 2
wansi 2
weema 2
wego 2
west 2
yabba 2
yafuna 2
yafunye 2
yaguza 2
yagwegaanyi 2
yajja 2
yakedde 2
yakkiriza 2
yakkirizza 2
yakoze 2
yakubirizza 2
yakubye 2
yakulembeddemu 2
yalabuliddewo 2
yalambudde 2
yamezze 2
yange 2
yasaba 2
yasindise 2
yateekaayo 2
yatwala 2
yawe 2
yayambye 2
yayolesezza 2
yazze 2
yebazizza 2
yeetaaga 2
yeewuunyizza 2
yeeyama 2
yenna 2
yesu 2
yuriy 2
yusuf 2
zabwe 2
zigikuba 2
zimbabwe 2
zokka 2
zombi 2
zzooni 2
