mu 268
nga 196
naye 194
bwe 186
era 171
kubanga 160
ne 153
katonda 148
ku 121
no 90
bo 87
olwa 78
kristo 76
oba 76
na 72
eri 56
kale 52
nti 51
mukama 50
omwoyo 48
aba 46
kya 46
kye 46
si 45
omu 44
wa 44
waffe 44
bonna 42
yesu 42
amateeka 39
obutuukirivu 39
ekibi 38
omubiri 37
ebya 34
abo 33
wabula 32
byonna 31
mmwe 31
omuntu 31
ba 30
buli 29
mubiri 29
ngo 29
ye 29
gwe 28
oyo 28
mateeka 27
nze 26
ga 25
ekitiibwa 24
gye 24
kwe 23
owa 23
kwa 21
okufa 21
oluganda 21
amagezi 20
ekisa 20
ekya 20
gwa 20
okukkiriza 20
bye 19
kaakano 19
muntu 19
omulala 19
omusango 19
kityo 18
mwoyo 18
ya 18
ayogera 17
bwa 17
ggwe 17
gu 17
newakubadde 17
nge 17
so 17
wamu 17
lwa 16
okuba 16
nange 15
nate 15
be 14
bya 14
ennimi 14
ffe 14
nammwe 14
omukazi 14
ebitundu 13
ekkanisa 13
kibi 13
kuba 13
kyawandiikibwa 13
muli 13
abaana 12
butuukirivu 12
ddala 12
ebyo 12
emirembe 12
ndi 12
singa 12
abantu 11
awatali 11
bafu 11
ekigambo 11
ekyo 11
kiki 11
nsi 11
okusinga 11
okwagala 11
abafu 10
ali 10
amaanyi 10
amawanga 10
awamu 10
bange 10
bantu 10
magezi 10
njogera 10
omusajja 10
we 10
yenna 10
ayagala 9
ensi 9
ge 9
gwange 9
kino 9
kufa 9
lya 9
obulamu 9
okubeera 9
tewali 9
waliwo 9
wansi 9
za 9
abamu 8
alina 8
ani 8
bangi 8
bulamu 8
edda 8
ennyo 8
gumu 8
kitalo 8
kitiibwa 8
kukkiriza 8
mutyo 8
obulungi 8
ogu 8
okutuusa 8
omutwe 8
tuli 8
tutya 8
abaddu 7
abangi 7
abeerenga 7
baganda 7
biri 7
biro 7
ebirabo 7
ekirabo 7
fenna 7
ibulayimu 7
kkanisa 7
kwagala 7
kwammwe 7
obusungu 7
okukomolebwa 7
okuyingira 7
omukisa 7
omwana 7
ssaagala 7
tumanyi 7
abakkiriza 6
abuulira 6
alyoke 6
ebibi 6
ekisinga 6
enkomerero 6
eza 6
ggulu 6
guno 6
ki 6
kuli 6
kwonna 6
lunaku 6
lwammwe 6
maanyi 6
maaso 6
musajja 6
mwaweebwa 6
mwenna 6
naffe 6
nkola 6
okuva 6
okwonoona 6
oli 6
omusaayi 6
tunaayogera 6
yekka 6
abali 5
abatukuvu 5
abayudaaya 5
adamu 5
akola 5
alabikira 5
alyoka 5
atyo 5
aweebwa 5
baana 5
bannabbi 5
batyo 5
bba 5
bikolwa 5
byaffe 5
byammwe 5
byokka 5
ebigambo 5
eddembe 5
ekiragiro 5
ekirungi 5
ekitundu 5
endala 5
engeri 5
enviiri 5
etteeka 5
gange 5
isira 5
kifaananyi 5
kifo 5
kikompe 5
kimu 5
kirala 5
kitundu 5
kyokka 5
mulamu 5
musango 5
njagala 5
nneebaza 5
nsonyi 5
oku 5
okubuulira 5
okugumiikiriza 5
okukola 5
okuleeta 5
okuwulira 5
olubereberye 5
olulimi 5
siwali 5
yonna 5
abalala 4
abalamu 4
abalina 4
abatakkiriza 4
abayonaani 4
aga 4
akkiriza 4
amazima 4
amiina 4
baddu 4
bakomole 4
balubaale 4
bigambo 4
bitundu 4
boogera 4
bulungi 4
byabwe 4
ebibala 4
ebigere 4
ebikolwa 4
ebitonde 4
ebyawandiikibwa 4
egya 4
ekifaananyi 4
enjiri 4
ensonyi 4
erinnya 4
ezzadde 4
gusigibwa 4
guzuukizibwa 4
kibeerenga 4
kigambo 4
kugasa 4
kutya 4
kwo 4
kyonna 4
lwe 4
mirembe 4
mubeerenga 4
mugaati 4
mukazi 4
mukolenga 4
mutima 4
muyudaaya 4
mwe 4
ndijja 4
nedda 4
nnyo 4
nnyumba 4
obanga 4
obo 4
obutaggwaawo 4
obutali 4
okubanga 4
okulowooza 4
okusuubira 4
okusuubiza 4
okwambala 4
okwegomba 4
okwogera 4
oluvannyuma 4
omubereberye 4
omuto 4
omuyudaaya 4
pawulo 4
siri 4
tannakomolebwa 4
tebazuukizibwa 4
teyazuukizibwa 4
yali 4
yava 4
yazuukizibwa 4
zonna 4
abakola 3
abakomole 3
abalamusizza 3
abatali 3
abatalina 3
abeebaka 3
afa 3
akabonero 3
akyali 3
aliba 3
alijja 3
aluwa 3
amaaso 3
amagero 3
anenya 3
atuula 3
atya 3
ayinza 3
bakola 3
bamalayika 3
batume 3
batya 3
bayudaaya 3
bikolebwenga 3
bingi 3
birungi 3
bokka 3
bulijjo 3
bwereere 3
byogera 3
ddembe 3
ebifaananyi 3
ebintu 3
ebiriwo 3
ebyama 3
eddoboozi 3
ekikompe 3
ekimu 3
ekyali 3
ekyama 3
emibiri 3
enjawulo 3
eryo 3
ettaka 3
eyazuukiza 3
gino 3
gwonna 3
gya 3
jjajja 3
jjajjaffe 3
kintu 3
kirungi 3
kisa 3
kitya 3
kuleeta 3
kulemenga 3
kumubalirwa 3
kusseekimu 3
kusuubira 3
kwange 3
kwogera 3
kyali 3
kyange 3
lulimi 3
luuyi 3
lwaffe 3
lwaki 3
lyange 3
mazima 3
mbategeeza 3
mpozzi 3
mukono 3
mumanyi 3
musa 3
mwabanga 3
mwaka 3
mwegombenga 3
ntya 3
obukulu 3
obunafu 3
obutavunda 3
ogufa 3
okubuuliranga 3
okufuuka 3
okugenda 3
okujja 3
okukemebwa 3
okulaga 3
okulya 3
okutegeera 3
okutukuzibwa 3
okuweesa 3
okuwonyanga 3
okuzuukira 3
okwenyumiriza 3
okwogeranga 3
olina 3
omugaati 3
ssiba 3
suteefana 3
talina 3
tekyali 3
temumanyi 3
twali 3
twaweebwa 3
yafa 3
yalina 3
yassaawo 3
yennyini 3
abaafa 2
abaayonoonanga 2
ababi 2
abafuga 2
abagezigezi 2
abagoberera 2
abalabe 2
abatatya 2
abaweebwa 2
abayitibwa 2
abeera 2
agamba 2
agatali 2
agiwa 2
ajoboja 2
aka 2
akagombe 2
akolera 2
akomoleddwa 2
akuza 2
aleme 2
alibeera 2
alisalira 2
alya 2
alyenga 2
amangi 2
anywa 2
apolo 2
asaasira 2
asaba 2
asabenga 2
asinga 2
asirikenga 2
aswaza 2
atali 2
atamanyi 2
atategeera 2
ategeeza 2
atuwolereza 2
awa 2
awataba 2
ayita 2
baayonoona 2
babalamusizza 2
babiri 2
baisira 2
bakulu 2
balamu 2
bali 2
balina 2
balyoke 2
basatu 2
basika 2
bataba 2
bayigiriza 2
bibala 2
bino 2
boogerenga 2
buggya 2
bumu 2
bunafu 2
bunnabbi 2
buntu 2
businga 2
busirusiru 2
butavunda 2
buzaaliranwa 2
bwaffe 2
bwokka 2
byali 2
byange 2
byanmwe 2
byawandiikibwa 2
ebbanja 2
ebinafu 2
ebingi 2
ebirungi 2
ebisinga 2
ebitali 2
ebitaliiwo 2
ebizimba 2
ebyonoono 2
efeso 2
eka 2
ekika 2
ekirala 2
ekituula 2
ekyokulabirako 2
emirimu 2
emmere 2
emmunyeenye 2
empeera 2
emu 2
enjala 2
ennungi 2
ennyumba 2
eriiso 2
eryesittalwako 2
ettendo 2
eya 2
eyakomererwa 2
eyo 2
gaabwe 2
gaayo 2
gali 2
gonna 2
googera 2
gufudde 2
gulemenga 2
guli 2
guliba 2
gwabwe 2
gwaffe 2
gwammwe 2
gyabwe 2
gyonna 2
isaaka 2
isaaya 2
ka 2
kaakati 2
kalivuga 2
katono 2
keefa 2
kiba 2
kinnoomu 2
kiri 2
kiryoke 2
kisaana 2
kitaawe 2
kitaffe 2
kiyima 2
kugamba 2
kugumiikiriza 2
kujja 2
kukomolebwa 2
kulya 2
kumpi 2
kuno 2
kutegeera 2
kuyingira 2
kuzuukira 2
kwabaawo 2
kwaffe 2
kwafuga 2
kwandibadde 2
kwaziyizibwa 2
kwonoona 2
kyalaba 2
kyasukkirira 2
kyeyongerenga 2
laba 2
liiso 2
linnya 2
lye 2
lyo 2
makedoni 2
makulu 2
mangu 2
mawanga 2
mba 2
mbabuulira 2
mbeegayirira 2
mitima 2
mmeeza 2
mpisa 2
mubuulirenga 2
muddu 2
mufuuka 2
mukiryanga 2
mukka 2
mukola 2
mukomole 2
mukuŋŋaanira 2
mulabe 2
mulyoke 2
munne 2
munywerenga 2
muto 2
mutwe 2
muyinza 2
muyonaani 2
mwabatizibwa 2
mwekka 2
mwenzi 2
mwesigwa 2
nakyo 2
nantiki 2
ndaba 2
ndikwatirwa 2
ndisaasira 2
ndyoke 2
nfa 2
ngeri 2
njogedde 2
nkikola 2
nnaasabyanga 2
nnaayimbyanga 2
nnabatiza 2
nnaweebwa 2
nnina 2
nno 2
nnukuta 2
nnyanja 2
nsanyukira 2
nsuubira 2
obba 2
obubi 2
obugagga 2
obuggya 2
obulimba 2
obungi 2
obusirusiru 2
obutaba 2
obutafa 2
obuyinza 2
oguvunda 2
ogwa 2
okola 2
okubeeranga 2
okubiri 2
okubonaabona 2
okufuga 2
okufugibwa 2
okuggyawo 2
okukoza 2
okuli 2
okuluma 2
okungulu 2
okunjijukiranga 2
okununulibwa 2
okusalirwa 2
okusatu 2
okusookera 2
okutali 2
okuteesa 2
okutegeeza 2
okutu 2
okuvunda 2
okuweereza 2
okuyita 2
okuzikirira 2
okuzimba 2
okwawukana 2
okwebaza 2
okwo 2
olubuto 2
olwazi 2
olwekyo 2
omukka 2
omulabe 2
omulimu 2
omulundi 2
omunda 2
omusalaba 2
omusobya 2
omutima 2
omutukuvu 2
omutuukirivu 2
saala 2
ssaddaaka 2
ssibatendereza 2
tabeerawo 2
tekubeera 2
tekuliimu 2
temubanga 2
temubuuzizza 2
temuli 2
temuyinza 2
timoseewo 2
tteeka 2
tubeerenga 2
tubuulira 2
tukolenga 2
tukyali 2
tulifuusibwa 2
tulyoke 2
tutyo 2
twabatizibwa 2
twatabaganyizibwa 2
twenyumirizenga 2
wayingira 2
wekka 2
yabawa 2
yafuuka 2
yakobo 2
yakomererwa 2
yalagira 2
yalonda 2
yange 2
yaweebwa 2
yayagala 2
yayita 2
ze 2
zzadde 2
