mu 483
n 282
ku 262
nga 207
ne 182
nti 174
e 164
ng 140
y 81
bwe 78
era 78
wa 73
nup 65
abantu 64
ate 63
nrm 62
ya 61
poliisi 56
bw 50
owa 49
ye 47
ba 42
kya 42
we 39
kino 36
kyokka 36
yagambye 36
by 34
w 33
uganda 32
ky 31
abadde 29
bwa 29
ebintu 29
gavumenti 29
okulonda 29
be 28
kifo 28
okuva 28
obululu 27
agamba 26
kuba 26
oluvannyuma 26
ggwanga 25
mmeeya 25
fdc 24
gye 24
ssente 24
wabula 24
gw 23
olw 23
abamu 22
fc 22
kampala 22
oba 22
abalala 21
bya 21
gwe 21
kyagulanyi 21
z 21
ebirala 20
eno 20
naye 20
okukola 20
yabadde 20
omu 19
wakati 19
aba 18
buli 18
emirimu 18
lugazi 18
museveni 18
abawagizi 17
kubanga 17
lwa 17
mukyala 17
yali 17
bitundu 16
ebinyeebwa 16
gy 16
omwana 16
yategeezezza 16
abazannyi 15
embeera 15
emyaka 15
eri 15
gwa 15
kkooti 15
lw 15
mmotoka 15
ono 15
pulezidenti 15
zooni 15
bano 14
bulungi 14
egenda 14
eggwanga 14
ow 14
zizinga 14
akalulu 13
akulira 13
ali 13
emu 13
ga 13
ka 13
kalulu 13
kati 13
kwe 13
kye 13
lubaga 13
munisipaali 13
nnyo 13
okuli 13
omuntu 13
ttaka 13
ttiimu 13
3 12
alina 12
amateeka 12
council 12
dr 12
ekifo 12
ensonga 12
jinja 12
kawempe 12
ly 12
mulimu 12
nabbosa 12
njeru 12
nsubuga 12
town 12
ab 11
amagye 11
b 11
bifo 11
division 11
january 11
kabowa 11
kyazze 11
okumala 11
omubaka 11
wadde 11
waliwo 11
za 11
abaserikale 10
agambye 10
amaanyi 10
awangudde 10
baabadde 10
baagala 10
baali 10
bino 10
binyeebwa 10
ebirime 10
ebitundu 10
eby 10
enkola 10
ettaka 10
g 10
ind 10
kibiina 10
kwa 10
maka 10
naddala 10
omuwala 10
west 10
ze 10
12 9
5 9
amakolero 9
babadde 9
balina 9
bantu 9
byonna 9
city 9
ebimu 9
eyabadde 9
k 9
kcca 9
liverpool 9
lwe 9
meeya 9
mukono 9
okufuna 9
okuwangula 9
ssentebe 9
wiiki 9
yawangudde 9
10 8
15 8
2 8
abalonzi 8
afunye 8
agenda 8
asea 8
ayagala 8
bagamba 8
bangi 8
banne 8
bonna 8
buganda 8
bye 8
corona 8
ddala 8
ebikolebwa 8
ebweru 8
eddagala 8
enjawulo 8
ennyumba 8
eya 8
eyali 8
guno 8
kiseera 8
kulonda 8
leero 8
makindye 8
masaka 8
mbarara 8
mberaze 8
minisita 8
nabo 8
nkoyoyo 8
nsonga 8
ntebe 8
obwa 8
okutandika 8
olwo 8
omuluka 8
omupiira 8
sizoni 8
ssebuggwawo 8
waabwe 8
waggulu 8
wamu 8
zino 8
1986 7
abaana 7
abalimi 7
abatuuze 7
abavubuka 7
afuna 7
amasasi 7
amawulire 7
arsenal 7
awaka 7
baddiifiri 7
bagenda 7
disitulikiti 7
dp 7
ebyamaguzi 7
ekibiina 7
ekya 7
embwa 7
gya 7
kitundu 7
kuliko 7
kwabadde 7
lampard 7
lya 7
moses 7
mpaka 7
nasser 7
obwedda 7
okuba 7
okugula 7
okunoonyereza 7
okusobola 7
okutuuka 7
okutuusa 7
okuyamba 7
okwongera 7
olina 7
omukka 7
omwogezi 7
palamenti 7
sc 7
si 7
ssaako 7
ssatu 7
sserunjogi 7
tumwesigye 7
wano 7
yafunye 7
000 6
1 6
100 6
6 6
7 6
ababadde 6
abayeekera 6
akakiiko 6
akola 6
alonda 6
and 6
andrew 6
aziz 6
bintu 6
bizinensi 6
bubi 6
bukedde 6
busoga 6
buwanguzi 6
central 6
chelsea 6
don 6
ebisinga 6
ebyokulonda 6
ekiseera 6
ekitundu 6
eky 6
emipiira 6
emmanuel 6
engeri 6
erya 6
essira 6
eyawangudde 6
fred 6
gaabwe 6
hoima 6
john 6
kibirango 6
kibuga 6
kiwanuka 6
kkomera 6
kuno 6
luweero 6
maaso 6
mannya 6
mawanga 6
mbabazi 6
mirembe 6
mukwano 6
mutesi 6
muzeeyi 6
nabatanzi 6
nakidde 6
njuba 6
nze 6
obuwanguzi 6
oku 6
okubala 6
okubeera 6
okudda 6
okuddamu 6
okulaba 6
okutumbula 6
okuvuganya 6
okuzimba 6
olukiiko 6
olutalo 6
omulala 6
omulamuzi 6
omulimu 6
omulundi 6
premier 6
ronald 6
ssemateeka 6
ssempijja 6
ssinga 6
tamale 6
waiswa 6
yonna 6
zella 6
11 5
14 5
18 5
19 5
21 5
30 5
36 5
4 5
9 5
abakulembeze 5
abali 5
addirirwa 5
ag 5
anita 5
aseya 5
ashiraf 5
atalina 5
avuganya 5
bali 5
bbanka 5
bungi 5
ddiifiri 5
ddoola 5
development 5
ebisolo 5
ebitongole 5
ebyenfuna 5
ebyokwerinda 5
edward 5
ekitongole 5
ekkolero 5
enanga 5
enguudo 5
enkuba 5
erimu 5
ewa 5
ey 5
eyavuganyizza 5
ffamire 5
kabulasoke 5
katonda 5
kawuma 5
kisaawe 5
kitalya 5
kiyemba 5
kyalo 5
mityana 5
mulindwa 5
mutabani 5
mwe 5
nakiguli 5
nkola 5
nnamba 5
nra 5
ntale 5
obukadde 5
obulamu 5
obulungi 5
obuzibu 5
okugenda 5
okukakasa 5
okukolera 5
okusinga 5
omukazi 5
omukyala 5
omuli 5
omutindo 5
omuyaga 5
robert 5
st 5
vipers 5
wakiso 5
yakoze 5
yalondedde 5
yasooka 5
yasoose 5
00 4
17 4
20 4
2021 4
26 4
35 4
a 4
abakadde 4
abazibizi 4
abeera 4
abo 4
academy 4
agali 4
aliko 4
amalala 4
amanyiddwa 4
amayumba 4
amerika 4
ashraf 4
awalala 4
azze 4
baabwe 4
baakoze 4
bajja 4
bakansala 4
bamuwadde 4
bange 4
bannamateeka 4
batuuse 4
bawagizi 4
bigenda 4
bosco 4
bufalansa 4
bufumbo 4
buikwe 4
bulijjo 4
byobufuzi 4
charles 4
daniel 4
deo 4
east 4
ebifo 4
ebika 4
ebiri 4
ebyavudde 4
ebyeyambisibwa 4
ebyo 4
eddembe 4
ekigendererwa 4
ekyo 4
emirundi 4
emisango 4
emmotoka 4
emmundu 4
empaka 4
endala 4
ennyo 4
ensimbi 4
etaano 4
ez 4
factory 4
frank 4
ge 4
ggombolola 4
house 4
independent 4
ivan 4
joyce 4
junju 4
kaadi 4
kalagala 4
kano 4
katebe 4
kayemba 4
kimu 4
kitega 4
kkansala 4
klopp 4
kobusigye 4
kyabwe 4
laavu 4
lumbuye 4
lumu 4
luwano 4
lwaki 4
lye 4
magere 4
manvuuli 4
mbale 4
miriam 4
mukama 4
munnaddiini 4
musa 4
musaala 4
mutebi 4
mw 4
mwetegefu 4
myaka 4
nakawa 4
namutebi 4
nantale 4
national 4
ndeeba 4
ngeri 4
nsiko 4
obukulembeze 4
obulwadde 4
obutwa 4
obuweereza 4
obw 4
okufa 4
okukolebwa 4
okukuba 4
okumuwa 4
okunoonya 4
okussa 4
okussaawo 4
omukisa 4
omuserikale 4
omutendesi 4
omuvubuka 4
omwaka 4
patrick 4
samuel 4
sente 4
sipiika 4
soccer 4
south 4
southampton 4
southern 4
ssentongo 4
talina 4
tukasibwe 4
uhuru 4
updf 4
wasswa 4
wayirimo 4
william 4
yagasseeko 4
yagenda 4
yasalawo 4
yasin 4
yatuuse 4
yayongeddeko 4
zigenda 4
22 3
44 3
65 3
8 3
800 3
abaabadde 3
abaali 3
abaawambibwa 3
ababaka 3
abagisu 3
abalina 3
abanene 3
abasawo 3
abasuubuzi 3
abatendesi 3
abawuwuttanyi 3
abesimbyeewo 3
acholi 3
agattako 3
akabenje 3
akuba 3
akutte 3
akwata 3
alcantara 3
aleebya 3
amawanga 3
amayinja 3
amazzi 3
amenya 3
amuddiridde 3
asaba 3
ategeeza 3
ategeezezza 3
awali 3
awalonderwa 3
babeera 3
bagoberera 3
bakifeesi 3
bakola 3
bammeeya 3
bamusigansimbi 3
bannabyabufuzi 3
bannaddiini 3
basanga 3
batandise 3
bavuganya 3
bawala 3
bbanga 3
bbookisi 3
beauty 3
bebe 3
biden 3
big 3
bikolwa 3
biraga 3
bitiibwa 3
bob 3
bobi 3
bukya 3
butongole 3
bwabwe 3
bwakansala 3
bwakkansala 3
byekwaso 3
card 3
cool 3
december 3
ebadde 3
ebbanga 3
ebidduka 3
ebijanjaalo 3
ebinaava 3
ebiragiro 3
ebisanja 3
ebizibu 3
ebya 3
ebyali 3
effujjo 3
eggulo 3
ekika 3
ekintu 3
ekitawuluzi 3
ekivunaanyizibwa 3
emirala 3
emmere 3
enguzi 3
ennaku 3
ennungi 3
ensawo 3
ensi 3
entambula 3
erina 3
etteeka 3
ewedde 3
eyafa 3
eyafunye 3
eyaliko 3
eza 3
francis 3
haji 3
hippos 3
kaggwa 3
kalangala 3
kalungi 3
kansala 3
katale 3
kawolo 3
kayanja 3
ke 3
kibe 3
kigambibwa 3
kigoonya 3
kipya 3
kironde 3
kisenge 3
kizza 3
klezia 3
kuddamu 3
kukkiriza 3
kukola 3
kulaba 3
kulaga 3
kulangirira 3
kulima 3
kuteekebwa 3
kuva 3
kuweereza 3
kw 3
kwongera 3
lukiiko 3
magaziini 3
makerere 3
makolero 3
makubo 3
mamerto 3
maneja 3
mateeka 3
mbeera 3
media 3
michael 3
mmengo 3
muganzi 3
mugerwa 3
mulago 3
mulyannyama 3
munaana 3
municipality 3
munne 3
musoke 3
muwogo 3
muzannyo 3
mwaka 3
mwondha 3
na 3
nama 3
nathan 3
ndi 3
ngalo 3
nsi 3
obubaka 3
obubi 3
obufumbo 3
obulabe 3
obuntu 3
obuwumbi 3
odegaard 3
ogubalagala 3
ogwa 3
okuggyako 3
okujja 3
okukkakkanya 3
okukyusa 3
okulwanyisa 3
okulya 3
okusaasaanya 3
okusaba 3
okusinziira 3
okutendekebwa 3
okutereeza 3
okuttibwa 3
okuyingira 3
okuziika 3
okw 3
okwamaanyi 3
okwenyigira 3
okwogera 3
olunaku 3
olwa 3
olwaleero 3
olwokuba 3
omukwano 3
omulambo 3
omulimi 3
omulonde 3
omuzannyo 3
omwoyo 3
osobola 3
paul 3
puleeti 3
real 3
red 3
richard 3
s 3
salim 3
singa 3
social 3
ssajjalyabeene 3
ssali 3
station 3
steven 3
sukaali 3
tanzania 3
tekitegeeza 3
united 3
wala 3
white 3
wiini 3
yafunyeewo 3
yajja 3
yalina 3
yasabye 3
yatandika 3
yenna 3
yo 3
zuena 3
13 2
147 2
1980 2
1987 2
1991 2
1993 2
200 2
2020/2021 2
25 2
27 2
300 2
38 2
40 2
45 2
46 2
66 2
743 2
78 2
82 2
91 2
abaamulonze 2
abaawanguddwa 2
abaayiseemu 2
ababba 2
ababiri 2
abafaayo 2
abagamba 2
abagambibwa 2
abagula 2
abakola 2
abakozi 2
abakugu 2
abakulira 2
abakyala 2
abalongo 2
abalungi 2
abasajja 2
abasinga 2
abatalina 2
abateebi 2
abattakisi 2
abatuula 2
abawala 2
abazze 2
abbiddwa 2
abdul 2
abeesimbyewo 2
abromovich 2
abuliddwa 2
adduka 2
afudde 2
agenti 2
agenze 2
agezaako 2
agumizza 2
ahmed 2
ajaganya 2
ajja 2
akolera 2
akozesa 2
akubira 2
akwasibwa 2
akyaleebya 2
akyali 2
al 2
alaga 2
alagira 2
alimu 2
alojja 2
amabanga 2
amajaani 2
amanene 2
amasaza 2
amatono 2
amaze 2
amubbako 2
anaaba 2
anite 2
annyonnyola 2
ark 2
asuubiza 2
ateekeddwa 2
ategeera 2
atiak 2
attunka 2
atwalibwa 2
atwalibwe 2
atya 2
aula 2
avunaanibwe 2
awa 2
awangula 2
awangulidde 2
awatali 2
awolerezza 2
ayamba 2
ayinza 2
ayogera 2
ayub 2
aziikibwa 2
baagambye 2
baalonda 2
baana 2
baatandise 2
babba 2
baddamu 2
baddemu 2
badman 2
bagambye 2
bagwefuga 2
bajjumbidde 2
bakimanyi 2
bakozesa 2
bakubwa 2
bakulaakulanye 2
balabe 2
balondera 2
balowooza 2
bamugamba 2
bamulanzeeki 2
bamunanika 2
bamutwala 2
bank 2
bannamawulire 2
bannannyini 2
basaba 2
basabusityuti 2
basabye 2
basatu 2
basinziira 2
basobola 2
basuubirwa 2
bata 2
bataano 2
batuuze 2
batwalibwa 2
bava 2
bayita 2
bazadde 2
bazze 2
bba 2
bbeeyi 2
bbo 2
bboodi 2
beegatta 2
beesimbyewo 2
bendera 2
besigye 2
besweri 2
bibadde 2
bibiri 2
bibuga 2
bimeze 2
bimu 2
bingi 2
biseera 2
bitwala 2
bizibu 2
bogere 2
bombo 2
boro 2
brig 2
brom 2
bubu 2
bududa 2
build 2
bukenya 2
bulaaya 2
bumenyi 2
bumu 2
buno 2
bunyoro 2
busega 2
butuntumula 2
buvanjuba 2
buvuddeko 2
buy 2
buyonjo 2
bwameeya 2
bwammeeya 2
bwannannyini 2
bwatyo 2
bwegugungo 2
byabwe 2
byakava 2
byalaze 2
byalo 2
byarugaba 2
byaruhanga 2
ca 2
china 2
church 2
coffee 2
col 2
david 2
dda 2
ddwaaliro 2
denis 2
derrick 2
district 2
divizoni 2
eba 2
ebbeeyi 2
ebibadde 2
ebibiina 2
ebifaananyi 2
ebikozesebwa 2
ebinnya 2
ebirangiriddwa 2
ebirondebwamu 2
ebirowoozo 2
ebirungi 2
ebisago 2
ebiseera 2
ebitundibwa 2
ebyensimbi 2
ebyobufuzi 2
ebyobulambuzi 2
ebyobulimi 2
ebyokulya 2
ebyuma 2
edda 2
eggaali 2
egimu 2
egwa 2
ejja 2
ekibba 2
ekibuga 2
ekinnya 2
ekirala 2
ekirwadde 2
ekisaawe 2
ekisooka 2
ekyokubiri 2
ekyusa 2
elubu 2
emabega 2
emiriraano 2
emisolo 2
emmese 2
emmwaanyi 2
emyezi 2
endagaano 2
enduulu 2
enfuga 2
enkolagana 2
enkulu 2
ennono 2
ensala 2
ensigo 2
ensiko 2
entalo 2
enteekateeka 2
enyingi 2
erastus 2
eric 2
eriiso 2
eriko 2
esazeewo 2
essimu 2
estate 2
esther 2
etandise 2
ethanol 2
etuuseeko 2
evuya 2
eyeesimbyewo 2
eyinza 2
ezibadde 2
eziri 2
eziwera 2
eziyise 2
fa 2
fabinho 2
fabrice 2
fayinolo 2
ffoomu 2
florence 2
for 2
fotokopi 2
fr 2
gagenda 2
gattako 2
gen 2
gerald 2
gertrude 2
ggwanika 2
ggwe 2
godfrey 2
gwatandika 2
gwo 2
gwokka 2
ham 2
i 2
iii 2
inzhu 2
isaac 2
isabirye 2
james 2
jesca 2
jjuuko 2
joseph 2
july 2
junior 2
kabaddemu 2
kabaka 2
kabenje 2
kaduukulu 2
kakayire 2
kalungu 2
kamira 2
kampeyini 2
kankunda 2
kanoni 2
kasasiro 2
kasirye 2
kasita 2
kasooli 2
katabaazi 2
kataka 2
katikkiro 2
kato 2
kaweefube 2
kayondo 2
kibangirizi 2
kigezi 2
kigongo 2
kigozi 2
kikko 2
kikopo 2
kikyamu 2
kikyusa 2
kira 2
kirabika 2
kiragiro 2
kiremesezza 2
kirina 2
kirumira 2
kirunda 2
kirungi 2
kisobola 2
kitaka 2
kitebe 2
kituufu 2
kituuse 2
kizito 2
kkamera 2
kkubo 2
konkomebbi 2
kubba 2
kufuba 2
kugenda 2
kulwana 2
kusigala 2
kutwalibwa 2
kuzannya 2
kuzimba 2
kwefuga 2
kwewuunya 2
kwongerwamu 2
kyali 2
kyanja 2
kyatandikibwawo 2
kyenvu 2
kyeyune 2
kyoloobi 2
langi 2
li 2
lt 2
ltd 2
lujjudde 2
lukonge 2
lukwago 2
lumonde 2
lutalo 2
lutikko 2
luzira 2
lwayisa 2
lwomukaaga 2
ma 2
maama 2
mabega 2
madrid 2
maduuka 2
makomera 2
makulubita 2
makya 2
maliri 2
march 2
martin 2
masaba 2
masiki 2
mauritania 2
mayinja 2
mazinga 2
mazzi 2
mbwa 2
micheal 2
mikutu 2
mingi 2
misango 2
mmande 2
mohammed 2
mpise 2
mpola 2
mubarak 2
mugambe 2
muhamad 2
mukambwe 2
mukasa 2
mukozi 2
mukulembeze 2
mukwaya 2
muluka 2
mulundi 2
mulungi 2
munnakibiina 2
muno 2
muntu 2
mupiira 2
musaayi 2
musajja 2
musango 2
musanvu 2
mushikori 2
muwagizi 2
muyaga 2
muzafaru 2
mwagala 2
mwesigye 2
namawojjolo 2
newcastle 2
nganda 2
ngoye 2
nguudo 2
nkambi 2
nnannyini 2
nnina 2
nninga 2
nnyina 2
nnyingi 2
noa 2
north 2
nrc 2
nteeko 2
nubian 2
obikoola 2
obudde 2
obufere 2
obujjulizi 2
obulimba 2
obulya 2
obumulumulu 2
obungi 2
obutereevu 2
obutono 2
obuva 2
obwakabaka 2
obwakkansala 2
obwameeya 2
obwesige 2
obwo 2
ogenda 2
ojja 2
okello 2
okubaawo 2
okubadde 2
okubba 2
okubisuubula 2
okufiira 2
okufiirwa 2
okuganza 2
okugonjoola 2
okujaganya 2
okukiteeka 2
okukka 2
okukozesa 2
okukwata 2
okukyuka 2
okulaga 2
okulangirira 2
okulima 2
okulondesa 2
okumanya 2
okumenya 2
okumera 2
okumpi 2
okusangibwa 2
okusibira 2
okusikiriza 2
okusobozesa 2
okutambula 2
okuteekebwa 2
okutunda 2
okutuuza 2
okutya 2
okuwagira 2
okuwangulwa 2
okuweereza 2
okuyambako 2
okuyoola 2
okwabadde 2
okwagala 2
okwebaza 2
okwegatta 2
okwekalakaasa 2
okwesasuza 2
okwettanirwa 2
oli 2
olubuto 2
olugendo 2
oluguudo 2
oluusi 2
oluva 2
olwamaze 2
olympics 2
omubiri 2
omuduumizi 2
omujaasi 2
omukadde 2
omukulu 2
omulabe 2
omulwadde 2
omumyuka 2
omusango 2
omusawo 2
omusumba 2
omututumufu 2
omuwemba 2
omuyimbi 2
omuzannyi 2
onyango 2
origino 2
oweddembe 2
phillip 2
polling 2
proline 2
roman 2
rugby 2
salah 2
semakula 2
semugooma 2
sentebe 2
sentimita 2
serenut14r 2
serenut8r 2
serunjogi 2
simon 2
sir 2
soroti 2
ssaabadinkoni 2
ssaabagabo 2
ssaawa 2
ssande 2
ssasi 2
ssaza 2
ssebina 2
ssebuggwaawo 2
ssekatawa 2
ssekinoomu 2
sso 2
starch 2
steel 2
stephen 2
sugar 2
sylvia 2
taata 2
takyalina 2
tanuulu 2
taxi 2
tebaagala 2
tebalina 2
tebayinza 2
teso 2
tewali 2
teyafunyewo 2
tolina 2
tonnabisimba 2
tonnasimba 2
trump 2
tubadde 2
tuchel 2
tujja 2
tukuleetedde 2
twogera 2
u-20 2
udc 2
umukuuka 2
ura 2
villa 2
waakuvunaanibwa 2
waakuziikibwa 2
wabaddewo 2
walukuba 2
wange 2
wansi 2
wattu 2
wiikendi 2
wine 2
wokorach 2
wooteeri 2
yabbye 2
yabuuziddwa 2
yakubye 2
yalabye 2
yaliko 2
yamuzaalamu 2
yasitudde 2
yategeeza 2
yattunse 2
yavudde 2
yawanguddwa 2
yebazizza 2
yeebaza 2
yeefudde 2
yennyamidde 2
yunifoomu 2
zaffe 2
zimbe 2
zirobwe 2
zziwa 2
