mu 640
n 422
ku 421
nga 401
nti 259
ne 203
e 169
era 148
ng 137
y 109
abantu 104
wa 104
w 81
bwe 77
by 71
ssente 71
olw 68
bw 67
kya 62
ba 55
ye 51
gw 50
ya 50
z 49
abaana 48
eby 46
ate 44
eno 44
gye 44
uganda 44
b 43
gavumenti 43
kkooti 41
omuntu 41
wabula 40
buli 39
guno 39
agamba 37
kino 36
ky 36
kuba 35
okuva 34
bano 33
pulezidenti 33
bino 32
enjawulo 32
kubanga 32
lwa 32
kyokka 31
lya 31
naye 31
omuli 31
abadde 30
okukola 30
za 29
eky 28
yagambye 28
bya 27
gwa 27
gy 27
omugenzi 27
amafuta 26
kye 26
ono 26
abayizi 25
ategeezezza 25
emirimu 25
eri 25
okuli 25
wano 25
akulira 24
be 24
bulungi 24
engeri 24
gwe 24
lw 24
bonna 23
omu 23
oba 22
oluvannyuma 22
abamu 21
bannayuganda 21
bantu 21
g 21
kampala 21
ly 21
nansana 21
obulungi 21
ofiisi 21
poliisi 21
updf 21
bakkansala 20
naddala 20
nnyo 20
okubeera 20
okufuna 20
ow 20
wakiso 20
wamu 20
amasomero 19
ategeeza 19
bitundu 19
kcca 19
museveni 19
ssaako 19
ssentebe 19
yategeezezza 19
amaaso 18
amateeka 18
bangi 18
emyaka 18
ez 18
kati 18
kkampuni 18
maaso 18
obukadde 18
okuba 18
okwebaka 18
okwongera 18
omusango 18
ze 18
zino 18
abakozi 17
abazadde 17
disitulikiti 17
dr 17
ebintu 17
ekitongole 17
enteekateeka 17
vision 17
we 17
abalala 16
akatale 16
asaba 16
asabye 16
balina 16
bye 16
ekya 16
eya 16
minisita 16
ngeri 16
nnamba 16
sipiika 16
waliwo 16
ab 15
alina 15
amaanyi 15
bwa 15
ga 15
ggwanga 15
k 15
omulimu 15
omwaka 15
yonna 15
aba 14
bagenda 14
bigezo 14
buganda 14
ebirala 14
ebyenjigiriza 14
ey 14
kifo 14
nabo 14
omuzikiti 14
omwenge 14
wakati 14
10 13
3 13
ali 13
amagye 13
bakola 13
byonna 13
ddala 13
eggwanga 13
ekitundu 13
enguudo 13
ensi 13
ensimbi 13
ensonga 13
essaawa 13
group 13
katale 13
lubaga 13
mukolo 13
nsonga 13
omumyuka 13
ssaawa 13
yabadde 13
abakyala 12
abasuubuzi 12
byabwe 12
ebitabo 12
ennyo 12
ge 12
kiseera 12
l 12
muntu 12
na 12
obulamu 12
obuwumbi 12
2023 11
abakulembeze 11
abatuuze 11
agambye 11
ebbanga 11
ekibiina 11
embeera 11
emirembe 11
ettaka 11
ka 11
katikkiro 11
kibuga 11
kkanso 11
kwe 11
maka 11
malinga 11
mwaka 11
nnaabagereka 11
nrm 11
obw 11
ogw 11
okusima 11
okusobola 11
okusoma 11
omubiri 11
omwoleso 11
rdc 11
wadde 11
yasabye 11
zaabwe 11
1 10
asinzidde 10
baabwe 10
babadde 10
bannamawulire 10
ddyo 10
ebikozesebwa 10
emisomo 10
emmere 10
enkuba 10
kano 10
kimera 10
lwe 10
mmotoka 10
munisipaali 10
nguudo 10
nsamba 10
of 10
olwa 10
olwo 10
omwana 10
owa 10
uneb 10
wansi 10
yafunye 10
yali 10
yenna 10
2 9
abasiraamu 9
abasomesa 9
abavubuka 9
agenda 9
and 9
ayogera 9
bagamba 9
bali 9
banne 9
budde 9
col 9
ebisolo 9
ebyo 9
egy 9
ekibuga 9
ennungi 9
gen 9
john 9
kanso 9
katonda 9
kuno 9
kyabwe 9
lipooti 9
luno 9
mateeka 9
mayiga 9
nsi 9
obukulembeze 9
obwongo 9
okulaba 9
okutuusa 9
okuzimba 9
okwebakira 9
oludda 9
ukraine 9
abajaasi 8
abeera 8
agamu 8
akakiiko 8
america 8
baali 8
bukedde 8
doola 8
ebigezo 8
ekintu 8
ekitiibwa 8
endwadde 8
ennaku 8
february 8
kasozi 8
kitundu 8
mukono 8
mwoleso 8
nnyina 8
nsubuga 8
ntebe 8
nteekateeka 8
obwa 8
okukozesa 8
olunaku 8
omukolo 8
omuliro 8
omusolo 8
pulojekiti 8
si 8
ssomero 8
ttaka 8
university 8
000 7
11 7
20 7
24 7
6 7
7 7
abagenda 7
abo 7
alipoota 7
amatovu 7
arsenal 7
baagala 7
bingi 7
ekika 7
emmwanyi 7
emu 7
entalo 7
erimu 7
essaza 7
essomero 7
everton 7
hijab 7
kitebe 7
kkomera 7
kw 7
lunaku 7
luweero 7
masomero 7
mmeeya 7
musa 7
mwe 7
myaka 7
new 7
nnamunkanga 7
nssf 7
obudde 7
obutonde 7
ogwa 7
okuggulawo 7
okukomya 7
okukuuma 7
okusinziira 7
okwewala 7
olutalo 7
omubaka 7
omukulu 7
omulamuzi 7
omuwaabi 7
palamenti 7
sheikh 7
singa 7
ssaabasumba 7
yaabwe 7
00 6
12 6
13 6
2022 6
30 6
4 6
5 6
8 6
9 6
abakulu 6
abali 6
abamenyi 6
abaserikale 6
akawungeezi 6
atyo 6
bafana 6
bajja 6
basaba 6
bayita 6
bifo 6
bintu 6
bo 6
boys 6
buno 6
bwabwe 6
city 6
ddwaliro 6
ebirime 6
ebisale 6
ebivvulu 6
ekifo 6
ekitangaala 6
ekyo 6
emirandira 6
emmundu 6
enduulu 6
enkola 6
ganda 6
gyabwe 6
january 6
kalema 6
katende 6
kaweefube 6
kigambibwa 6
kimu 6
kkiraabu 6
kufuna 6
lukwago 6
luzira 6
massomero 6
mbeera 6
mukaaga 6
mulimu 6
mulundi 6
musango 6
muyingo 6
nakibinge 6
national 6
nsiko 6
obubonero 6
obuzibu 6
okulwanyisa 6
okulya 6
okumala 6
okusasula 6
okutumbula 6
okutuuka 6
okuyita 6
okwogera 6
oluguudo 6
oluwaabi 6
omutuuze 6
omuwendo 6
omuze 6
omuzira 6
osobola 6
primary 6
shillingi 6
ssatu 6
tewali 6
waggulu 6
yafuna 6
yalina 6
young 6
31 5
ababadde 5
ababeera 5
abakungu 5
abalamuzi 5
abalimi 5
abategesi 5
abawala 5
abtex 5
ag 5
akola 5
alabudde 5
amyuka 5
authority 5
awamu 5
ayagala 5
baabadde 5
bafunye 5
bakasitoma 5
bakozi 5
bamusigansimbi 5
bank 5
basabye 5
bbanka 5
bobi 5
brig 5
covid-19 5
dda 5
development 5
divizoni 5
dollo 5
ebikoola 5
ebisomesebwa 5
ebyuma 5
eggye 5
ejja 5
ekibonerezo 5
emikono 5
emisango 5
emizannyo 5
emmaali 5
emyezi 5
endala 5
enguzi 5
enkulu 5
eraga 5
erya 5
ggombolola 5
ghetto 5
go 5
hashaka 5
institute 5
joseph 5
kabanda 5
kakumiro 5
kasajja 5
kasasiro 5
kaseera 5
kibuyaga 5
kitaawe 5
kiyamba 5
kkansala 5
kkirommita 5
kuliko 5
kuyamba 5
kwa 5
kyalo 5
lwaki 5
lwanga 5
mafuta 5
makindye 5
masaka 5
minisitule 5
mizannyo 5
mpaka 5
nalubega 5
nkola 5
obeera 5
obubi 5
obugazi 5
obukugu 5
obumu 5
ogenda 5
okubadde 5
okuddamu 5
okulabanga 5
okunoonyereza 5
okusinga 5
okutaasa 5
okutereka 5
okwerinda 5
okwetaba 5
omudumu 5
omukisa 5
omukyala 5
omulambo 5
omusajja 5
omutindo 5
omutwe 5
omuyimbi 5
owookusatu 5
peace 5
russia 5
sacco 5
school 5
the 5
uoc 5
wiiki 5
yo 5
ziza 5
19 4
2021 4
abaagala 4
ababaka 4
abakuumaddembe 4
abaliko 4
abasajja 4
abawawaabirwa 4
africa 4
akubirizza 4
alupo 4
amagezi 4
amawulire 4
april 4
asiima 4
asoose 4
atwebembeire 4
bakole 4
bakoze 4
bakozesa 4
bakulembeze 4
bamaze 4
banna 4
bannaddiini 4
bannamawuliire 4
baryekye 4
basiimye 4
basobola 4
bawa 4
bayizi 4
bbiri 4
booda 4
bubeera 4
bukwo 4
bulamu 4
bulijjo 4
bulungibwansi 4
bungi 4
bunyoro 4
buwembo 4
bwatyo 4
centre 4
cmi 4
ddakiika 4
ebadde 4
ebbaluwa 4
ebbula 4
ebibala 4
ebibuuzo 4
ebifo 4
ebipya 4
ebitongole 4
ebitooke 4
ebyavudde 4
eddembe 4
egenda 4
eggulo 4
ekirabo 4
ekisaakaate 4
ekiseera 4
ekitali 4
ekivvulu 4
emabega 4
embi 4
emmanuel 4
empapula 4
ennyonyi 4
ensingo 4
ensuku 4
ente 4
eyali 4
gino 4
gwabwe 4
gya 4
habib 4
hamza 4
health 4
jjumba 4
kabaka 4
kaputeeni 4
kasagga 4
kasamba 4
kasangati 4
kasubi 4
katabo 4
kenneth 4
kimala 4
kirabira 4
kireega 4
kisaka 4
kiswa 4
kiyimba 4
kkono 4
kukola 4
kwabwe 4
kwebaka 4
kyabakadde 4
kyankwanzi 4
kyonna 4
leero 4
limanda 4
lugendo 4
lyonna 4
maama 4
magye 4
makerere 4
manila 4
mbarara 4
mirimu 4
mitendera 4
mugabe 4
mukazi 4
mutabani 4
muto 4
muwonge 4
mw 4
mwesigwa 4
myezi 4
najja 4
nakawa 4
ntikko 4
obugagga 4
obulemu 4
obuli 4
obulimi 4
obuvunaanyizibwa 4
obwakkondo 4
oku 4
okubawa 4
okufaayo 4
okufuba 4
okugenda 4
okusaba 4
okusitula 4
okusomesa 4
okutandika 4
okutta 4
okutwala 4
okuyamba 4
okwagala 4
oluguddo 4
olumbe 4
oluusi 4
omugenyi 4
omukozi 4
omulangira 4
omulundi 4
omuvubuka 4
omuwawaabirwa 4
omwogezi 4
onywa 4
patrick 4
peter 4
ple 4
ppuleeti 4
putin 4
s 4
saako 4
saleh 4
sawula 4
siniya 4
sitetimenti 4
south 4
ssande 4
ssemambo 4
ssere 4
sserwadda 4
ssinga 4
stephen 4
storm 4
surrey 4
tekinologiya 4
ttiimu 4
turkey 4
uja 4
waabwe 4
yakubirizza 4
yiika 4
yoweri 4
zokka 4
zonna 4
100 3
15 3
40 3
41 3
700 3
a 3
aana 3
abakulira 3
abakwasisa 3
abalina 3
abamasomero 3
abasawo 3
abasoba 3
abatunda 3
abawagizi 3
abawera 3
abayimbi 3
abeetabye 3
abetabye 3
agaba 3
agafuga 3
agumizza 3
ainemukama 3
akaseera 3
alabika 3
alabula 3
alagidde 3
amasannyalaze 3
amawanga 3
amayumba 3
amazzi 3
asisinkanye 3
asobola 3
atandise 3
avunaanibwa 3
avunaanyizibwa 3
awadde 3
ayongeddeko 3
ayota 3
baana 3
baategeezezza 3
baba 3
bafumbya 3
bafuna 3
bafune 3
bakira 3
bakuba 3
bakulembeddwamu 3
bakyala 3
balabuddwa 3
balumiriza 3
baminisita 3
basiima 3
basinzidde 3
basobole 3
basuubira 3
batandika 3
batikkiddwa 3
battalion 3
bayiwa 3
bbanga 3
betty 3
biseera 3
bizibu 3
blick 3
bubi 3
bubiri 3
bungereza 3
butereevu 3
butongole 3
buwanguzi 3
buyinza 3
bwabadde 3
bwakabaka 3
bwavu 3
bwongo 3
bwonna 3
byamaguzi 3
byogeddwa 3
ca 3
cansala 3
charles 3
china 3
cranes 3
dayirekita 3
ddaala 3
ddembe 3
december 3
disituliki 3
don 3
dorothy 3
dyche 3
ebibiina 3
ebigambo 3
ebimu 3
ebiri 3
ebirungi 3
ebitundu 3
ebyokwerinda 3
eddwaliro 3
education 3
efunye 3
ekibinja 3
ekigendererwa 3
ekikulu 3
ekirala 3
ekiro 3
ekisa 3
ekisangibwa 3
ekiyitibwa 3
ekizibu 3
ekizimbe 3
ekkulu 3
eklezia 3
ekutte 3
ekyuma 3
emboozi 3
embuto 3
emikisa 3
emiriimu 3
empewo 3
enfuna 3
engoye 3
enjala 3
enjigiriza 3
enkolagana 3
ennyumba 3
ensisinkano 3
enzizi 3
equatorial 3
esatu 3
essanyu 3
essimu 3
essira 3
essuubi 3
etteeka 3
ewa 3
ewedde 3
eyafudde 3
eyafudembye 3
eyo 3
eza 3
ezireetebwa 3
febraury 3
fr 3
freeman 3
gav 3
geoffrey 3
ggoolo 3
gubeera 3
guinea 3
gujja 3
gumu 3
gutandika 3
gwo 3
hajj 3
house 3
ioc 3
islamic 3
jamia 3
jane 3
jessica 3
jjajja 3
jjinja 3
juice 3
july 3
kalebule 3
kalule 3
kamu 3
kamya 3
kansala 3
kateregga 3
kaweesi 3
kibiina 3
kikulu 3
kikuube 3
kimenya 3
kingfisher 3
kiraabu 3
kirungi 3
kitebi 3
kitiibwa 3
kitintale 3
kubba 3
kugenda 3
kuggalawo 3
kukundakwe 3
kulaba 3
kusoma 3
kutereka 3
kutulugunya 3
kuwedde 3
kwesiga 3
life 3
light 3
lino 3
loole 3
lt 3
ludda 3
lugazi 3
lukiiko 3
lukusa 3
lwokubiri 3
lwokusatu 3
lwokutaano 3
lwomukaaga 3
lyabwe 3
mangu 3
mary 3
masjid 3
mbu 3
meeya 3
mikutu 3
missa 3
miyagi 3
mubiri 3
mugagga 3
mugenzi 3
mulamwa 3
mutimbagano 3
muzira 3
mwana 3
mwandha 3
mwenge 3
mwezi 3
myala 3
nama 3
nayo 3
nira 3
nsimbi 3
o 3
obulabe 3
obulwadde 3
obungi 3
obuntubulamu 3
obutaba 3
obutabanguko 3
obutale 3
obuvune 3
obuwaayiro 3
obuweereza 3
obuyambi 3
obuyonjo 3
obwakabaka 3
obwenkanya 3
october 3
ofumba 3
ofuna 3
ogumaze 3
oguwedde 3
ogwo 3
oil 3
okubaka 3
okubeegattako 3
okugeza 3
okuggya 3
okujja 3
okukendeeza 3
okukuba 3
okukula 3
okukunga 3
okukusa 3
okukuza 3
okukwata 3
okulabirako 3
okulowooza 3
okumanya 3
okusaanyawo 3
okusigala 3
okusiima 3
okussa 3
okutambula 3
okuteesa 3
okutegeka 3
okutuukiriza 3
okuvaayo 3
okuwa 3
okuwummula 3
okuyimba 3
okuyingira 3
okuzza 3
okwambala 3
okweyongera 3
olina 3
olukiiko 3
olukung 3
oluyimba 3
omugongo 3
omukugu 3
omunsiko 3
omusika 3
omutaka 3
omutima 3
omuyizi 3
owulira 3
p7 3
philippines 3
police 3
promotions 3
proscovia 3
pte 3
puleeti 3
rando 3
rev 3
sam 3
samuel 3
she 3
sita 3
skilling 3
ssegirinya 3
ssewanyana 3
ssewava 3
st 3
state 3
t 3
tanzania 3
tebalina 3
twagala 3
uict 3
uthuman 3
vadym 3
wamala 3
weebase 3
wild 3
yagasseeko 3
yaguze 3
yakwasizza 3
yatenderezza 3
yayongeddeko 3
yeebaza 3
zigenda 3
150 2
17 2
18 2
2018 2
2025 2
22 2
23 2
27 2
29 2
360 2
400 2
450 2
800 2
900 2
aanya 2
abaakoseddwa 2
abaakulembeddwa 2
abaali 2
abaamawulire 2
abaami 2
abaayo 2
ababanguddwa 2
ababbi 2
ababeerimbikamu 2
abafuna 2
abagamba 2
abagenzi 2
abakolera 2
abakugu 2
abakwatibwako 2
abasaabaze 2
abasaba 2
abasinga 2
abatalina 2
abatandiika 2
abategeeza 2
abato 2
abawa 2
abazungu 2
abazzukulu 2
abdallah 2
abdul 2
abeeko 2
abenjawulo 2
abireka 2
abisaawa 2
abuulidde 2
abuuza 2
abyogedde 2
abyogeredde 2
african 2
afuna 2
afunye 2
agaana 2
agenjawulo 2
aggulawo 2
ago 2
agudde 2
agumya 2
aka 2
akabaga 2
akabinja 2
akatambi 2
akatundu 2
akavunaanyizibwa 2
akawumbi 2
akiikirira 2
ako 2
akoze 2
akulembeddemu 2
alemesa 2
alex 2
aliko 2
alimu 2
aliyirire 2
amabaluwa 2
amagumba 2
amangu 2
amanyiddwa 2
amasomo 2
amatikkira 2
amatooke 2
amayuuni 2
amazaalibwa 2
amaze 2
amaziga 2
amutusaako 2
amuwadde 2
amya 2
anga 2
ani 2
annyonnyola 2
anthony 2
asala 2
asiimye 2
asobeddwa 2
asoma 2
association 2
asusse 2
asuubirwa 2
atandika 2
atenderezza 2
atonera 2
atongozza 2
ava 2
avudde 2
avunaaniddwa 2
awa 2
awatali 2
awo 2
ayogerako 2
azze 2
baagambye 2
baaguzza 2
baakola 2
baakoze 2
baakufuna 2
baakukola 2
baakuwandiika 2
baakwatibwa 2
baasaayidde 2
baasabye 2
baasanga 2
baasazeewo 2
baasobodde 2
baatandika 2
babakozesa 2
babba 2
babeere 2
babikuba 2
babinywera 2
babuuza 2
babwe 2
bacacanca 2
badda 2
badhikube 2
bafa 2
bafeeyo 2
bafube 2
bagenze 2
bajjo 2
bakansala 2
bakimanyi 2
bakitte 2
bakomye 2
bakozese 2
balaba 2
balabe 2
balabula 2
balaga 2
balangira 2
balaze 2
balimba 2
balooya 2
balowooza 2
balumba 2
bamalirizza 2
bamanye 2
bamusaba 2
banja 2
banking 2
bannaabwe 2
bannamagye 2
bannannyini 2
bannansi 2
barbra 2
barekye 2
basiiba 2
basimbiddwa 2
basomesa 2
basonze 2
basooke 2
basuubizza 2
basuubuzi 2
bata 2
bataddemu 2
batayaayiza 2
bategeeza 2
bategeezezza 2
batenda 2
batendekebwa 2
batenderezza 2
batta 2
batunda 2
batuuse 2
batwaliddwa 2
bavubuka 2
bavunaanibwa 2
baweebwe 2
baweereza 2
bawerennemba 2
bayitiridde 2
bayola 2
bazadde 2
bba 2
bboodi 2
bebamu 2
beemulugunya 2
beeralikirivu 2
beetaaga 2
beewale 2
beeyubudde 2
bibala 2
bibuguma 2
bigambibwa 2
bigirwa 2
bin-afan 2
bina 2
binasaali 2
bishop 2
bisolo 2
bitooke 2
biwandiiko 2
black 2
bodaboda 2
boogere 2
boogerera 2
botey 2
breweries 2
bruno 2
buddo 2
bugenda 2
bukalasa 2
bukola 2
bukulembeze 2
bulemeezi 2
buliri 2
buna 2
busagwa 2
busobola 2
butaano 2
buuza 2
buvuddeko 2
buweereza 2
bwamaanyi 2
bwangu 2
bwensi 2
bweyategezezza 2
byabadde 2
byalo 2
byanfuna 2
byetaaga 2
byuma 2
capt 2
center 2
central 2
chancellor 2
chris 2
club 2
cnooc 2
college 2
committee 2
communications 2
corporation 2
council 2
curriculum 2
dan 2
david 2
ddagala 2
ddwaaliro 2
denis 2
dit 2
div 2
eba 2
ebbali 2
ebibaluma 2
ebidduka 2
ebifaananyi 2
ebigendererwa 2
ebikolwa 2
ebikujjuko 2
ebirabo 2
ebivaako 2
ebivudde 2
ebizibu 2
ebizimbe 2
ebya 2
ebyalo 2
ebyapa 2
ebyava 2
ebyenfuna 2
ebyenguudo 2
ebyenjawulo 2
ebyenkulaakulana 2
ebyettaka 2
ebyokulwanyisa 2
eddamuzi 2
eddie 2
eddoboozi 2
effujjo 2
efujjo 2
eggombolola 2
eggya 2
egiyise 2
egumizza 2
egya 2
egyali 2
egyenjawulo 2
ekibatwala 2
ekifundikwa 2
ekijjukizo 2
ekikolwa 2
ekireeta 2
ekiri 2
ekirungi 2
ekirwadde 2
ekitavvu 2
ekiteeso 2
ekitono 2
ekola 2
ekubirizibwa 2
ekubye 2
ekwata 2
ekyali 2
emalawo 2
embuga 2
embuuzi 2
emidaala 2
emiggo 2
emikolo 2
emirimo 2
emiriraano 2
emirundi 2
emiti 2
emitonotono 2
emize 2
empanvu 2
empya 2
emyala 2
eng 2
engalo 2
enkaayana 2
enkulaakulana 2
ennono 2
ensenke 2
entambula 2
entekateeka 2
enviiri 2
erese 2
eriko 2
erima 2
erinnya 2
erisooka 2
ery 2
eryo 2
esabye 2
esobola 2
essiga 2
etandika 2
etegeezezza 2
ettendekero 2
etuula 2
expo 2
eyakolebwa 2
eyatudde 2
eyinza 2
ezaali 2
ezibadde 2
ezigenda 2
ezikola 2
ezikwata 2
eziva 2
eziwera 2
eziyinza 2
ezo 2
ezze 2
faridah 2
fdc 2
ffamire 2
fiizi 2
financial 2
florence 2
foundation 2
frank 2
fumba 2
gaayo 2
gabeera 2
gakoowa 2
galikwoleka 2
gano 2
genyigira 2
gugenda 2
guli 2
gwetabiddwaako 2
hajji 2
hakim 2
hall 2
ham 2
hassan 2
iii 2
industrial 2
information 2
initiative 2
innocent 2
international 2
iuiu 2
james 2
jamil 2
jc 2
joan 2
juma 2
kaabwe 2
kaasiya 2
kaatundibwa 2
kabowa 2
kaguta 2
kaija 2
kalungu 2
kampeyini 2
kamuli 2
kapeeka 2
karamojja 2
kasese 2
katono 2
katto 2
katyabaga 2
kazo 2
keeki 2
kibba 2
kibeera 2
kibonerezo 2
kibudiya 2
kibuuka 2
kiggundu 2
kika 2
kikoma 2
kimbowa 2
kindergarten 2
kiro 2
kirya 2
kisaawe 2
kisenge 2
kisenyi 2
kitegeeza 2
kitongole 2
kituufu 2
kityo 2
kivaako 2
kololo 2
kubayamba 2
kubeerako 2
kufa 2
kukkiriza 2
kukolebwa 2
kukuba 2
kukyagenda 2
kuli 2
kulumba 2
kulwanyisa 2
kumanya 2
kunywa 2
kusaasaanya 2
kusaba 2
kusabiriza 2
kusooka 2
kussa 2
kutendekebwa 2
kutongoza 2
kuziika 2
kuzimba 2
kwebakira 2
kwekebejja 2
kweyongera 2
kwogera 2
kwosa 2
kyaddondo 2
kyambalo 2
kyewalabye 2
kyokubiri 2
langi 2
laptop 2
layisinsi 2
lee 2
leediyo 2
legamoi 2
liigi 2
liragira 2
loodi 2
looya 2
luba 2
lubadde 2
lugamba 2
lugoye 2
lukaya 2
lukungaana 2
lumonde 2
lutalo 2
maanyi 2
mabindo 2
maj 2
male 2
malia 2
marion 2
market 2
masiro 2
matia 2
matikkira 2
matovu 2
may 2
mbabazi 2
mbale 2
mikwano 2
mingi 2
minsa 2
misomo 2
mitooma 2
mmande 2
moses 2
mpimbaza 2
mpisa 2
mpola 2
mufti 2
mugenyi 2
mukisa 2
mukiseera 2
mukozi 2
mukutu 2
mukwaano 2
mukwano 2
mukyala 2
mulo 2
mulungi 2
mulwadde 2
mungeri 2
munkambi 2
munnamateeka 2
mupiira 2
musajja 2
musana 2
musanvu 2
musanyufu 2
musoke 2
muwala 2
muzaana 2
mwoyogwaggwanga 2
nabasaba 2
nabbanja 2
nabweru 2
nabwo 2
nagginda 2
nagyo 2
nakabugo 2
nakalyango 2
nakaseke 2
nakyeyune 2
nakyo 2
namutebi 2
nasaba 2
nategeeza 2
ndabirira 2
ndeeba 2
ndejje 2
ndisaba 2
nguema 2
nguzi 2
nile 2
nkaayana 2
nkoowe 2
nkya 2
nnongosereza 2
nnono 2
nnyingi 2
nnyumba 2
nsambya 2
ntalo 2
nup 2
nuwahereza 2
nze 2
obiang 2
obongoi 2
obubinja 2
obufuzi 2
obujulizi 2
obukambwe 2
obusuubuzi 2
obuteebalira 2
obutoffaali 2
obuwangwa 2
obwamanyi 2
obwapulezidenti 2
obwesige 2
obwo 2
offisi 2
offshore 2
ogugamba 2
ogutambuza 2
ogwagaliza 2
ogwategekeddwa 2
ojangole 2
okubabuulira 2
okubafunira 2
okubajjukiza 2
okubalongooseza 2
okubasaba 2
okubasiima 2
okubatuukirira 2
okubayisaamu 2
okubikkirira 2
okubudaabuda 2
okudda 2
okuddayo 2
okufa 2
okufiiriza 2
okufulumya 2
okuganyulwa 2
okugatuusa 2
okuggala 2
okujjanjaba 2
okujjukiza 2
okujjumbira 2
okukkakkana 2
okukkiriza 2
okukolagana 2
okukyusa 2
okulabika 2
okulabirira 2
okulaga 2
okulemwa 2
okulima 2
okulonda 2
okulondoola 2
okulongoosa 2
okumpi 2
okumukumu 2
okumutwala 2
okunywa 2
okusabiriza 2
okusindika 2
okusisinkana 2
okusitukiramu 2
okusooka 2
okusoomozebwa 2
okusunsula 2
okuteekawo 2
okuteekebwa 2
okutegekera 2
okutendeka 2
okutuukawo 2
okutwaliza 2
okuviirako 2
okuwabula 2
okuwagira 2
okuwandiisa 2
okuweebwa 2
okuweereza 2
okuwulirwa 2
okuyiga 2
okuyimiriza 2
okuyitira 2
okuzannya 2
okuzuukuka 2
okwabadde 2
okwegatta 2
okweggyamu 2
okwekulaakulanya 2
okwekuumira 2
okwemulugunya 2
okwenyigira 2
okwetandikirawo 2
okwetoloola 2
okwettanira 2
okwokya 2
okwonoona 2
okwonooneka 2
olaba 2
oli 2
olugaayu 2
olugoye 2
olukwe 2
olutuula 2
olympic 2
omubadde 2
omugagga 2
omugejjo 2
omuggalo 2
omujaasi 2
omukazi 2
omukono 2
omukulembeze 2
omukung 2
omulamwa 2
omulembe 2
omulimo 2
omumaaso 2
omupya 2
omusawo 2
omusisita 2
omusumba 2
omuzadde 2
omuziki 2
omwabadde 2
on 2
opendi 2
osasule 2
otulo 2
owookubiri 2
oyinza 2
oyo 2
paddy 2
pascal 2
pass 2
patricia 2
payipu 2
pdm 2
pikipiki 2
prof 2
puleesa 2
pulogulaamu 2
pulomota 2
reginah 2
richard 2
robert 2
rukare 2
rulinda 2
safe 2
salim 2
samula 2
sarah 2
satifikeeti 2
sean 2
sente 2
services 2
shafick 2
shark 2
siteegi 2
sizoni 2
ssabalamuzi 2
ssalongo 2
ssaza 2
sseddaalo 2
ssembuule 2
ssempijja 2
sserunjaabwa 2
ssukaali 2
ssuuna 2
steps 2
super 2
sylivia 2
sylvia 2
taata 2
talina 2
tarehe 2
tasobola 2
tayebwa 2
tebinnafulumizibwa 2
technology 2
teodoro 2
teri 2
terina 2
teyatikkiddwa 2
thomas 2
tonny 2
towers 2
travis 2
ttendekero 2
ttivvi 2
tuli 2
tulo 2
tusiima 2
ubd 2
wagogo 2
wanyama 2
webakuumira 2
weewale 2
wo 2
world 2
xiong 2
yaayo 2
yabalese 2
yabatonedde 2
yabyogeredde 2
yakola 2
yalabudde 2
yasindise 2
yasinzidde 2
yasituse 2
yasoose 2
yatandise 2
yategezezza 2
yavaayo 2
yawaddeyo 2
yayongedde 2
yayozaayozezza 2
yeebakira 2
yeebase 2
yeekubidde 2
yeemu 2
yeetabye 2
yeewuunya 2
yunifoomu 2
yunivaasite 2
zibadde 2
zikozesebwa 2
zimu 2
zisobola 2
ziz 2
zooni 2
zziwa 2
zzooni 2
