num 649
mu 539
nti 297
ku 272
nga 186
ne 183
era 142
kya 137
ekyo 136
bo 130
kye 128
na 127
kkumi 120
oba 97
okukola 93
gya 81
taata 81
abiri 80
bye 73
ngo 73
abalala 70
no 70
oli 70
owa 64
singa 63
ntya 61
bazadde 60
bwe 59
emu 59
oyinza 59
bbiri 56
ttaano 56
engeri 55
leah 53
ssatu 53
we 53
kikumi 51
banno 50
kiki 50
bayibuli 49
gye 49
ebyo 47
naye 47
bya 46
gumu 46
omuntu 46
abavubuka 45
ngeri 44
lwaki 43
bubiri 42
lukumi 42
lunaana 42
mutwalo 42
nkumi 42
mukaaga 41
okuba 40
yo 40
brian 39
kwogera 39
nge 39
ebibuuzo 38
kuba 38
nnyo 37
okwewala 37
yali 37
okupikirizibwa 36
beebuuza 35
nnya 35
okukuyamba 35
agamba 34
ggwe 34
gwe 34
lowooza 34
osobola 34
kituufu 33
ebintu 32
ekyokulabirako 32
obulungi 32
wa 32
egamba 31
ekizibu 30
ki 30
okwagala 30
ensonga 29
olina 29
okumanya 28
olwa 28
omulenzi 28
si 28
wo 28
okuva 27
ya 27
bange 26
kiba 26
musanvu 26
okutwalirizibwa 26
ssigala 26
aba 25
amugamba 25
ensobi 25
eyo 25
ekituufu 24
jessica 24
karen 24
muntu 24
nsaanidde 24
olowooza 24
ani 23
awo 23
okunywerera 23
amagezi 22
ate 22
bakugamba 22
buli 22
mbeera 22
nsobi 22
okwogera 22
bukadde 21
jpg 21
okusalawo 21
otya 21
univ/art 21
univ_sqr_xl 21
url 21
abalalaweereza 20
alina 20
amaanyi 20
ebbaluwa 20
mutima 20
pawulo 20
bayizi 19
kisobola 19
omuwala 19
ayitibwa 18
bino 18
ekiseera 18
endabika 18
eno 18
eya 18
kifo 18
magezi 18
okola 18
bayinza 17
kukola 17
ndabikamu 17
nfaayo 17
nnina 17
nsobezza 17
ojja 17
oluvannyuma 17
wadde 17
wano 17
abakkolinso 16
abantu 16
ali 16
bantu 16
be 16
bisatu 16
ekintu 16
ennungi 16
kino 16
mukwano 16
naawe 16
okukuba 16
omuti 16
tewali 16
weekebere 16
yagamba 16
ebisobola 15
eza 15
nze 15
oyo 15
wandyagadde 15
zo 15
bulungi 14
danyeri 14
ebiseera 14
emmotoka 14
eyogera 14
kijja 14
okuddamu 14
omanyi 14
oyagala 14
wandikoze 14
weereza 14
alaba 13
asooka 13
biki 13
bintu 13
ebirala 13
engero 13
katonda 13
kityo 13
kubanga 13
mwenda 13
omutima 13
vidiyo 13
weekakasa 13
abaasalawo 12
amanyi 12
babuulire 12
ebiruubirirwa 12
ebitundu 12
ebya 12
eccupa 12
ekya 12
etteeka 12
eyinza 12
gwange 12
kukikola 12
lya 12
obadde 12
okuleka 12
okunywa 12
okusobola 12
okusoma 12
omu 12
ze 12
asalawo 11
ayagala 11
bunafu 11
kibuyaga 11
kimu 11
kizibu 11
maaso 11
okkiriza 11
waliwo 11
za 11
akabi 10
awulira 10
bina 10
ennyimirira 10
kiraga 10
kukkiriza 10
kwezza 10
mabega 10
mingi 10
misanvu 10
mwetegefu 10
nkola 10
nnyinza 10
obulamu 10
okubiri 10
okwesalirawo 10
olaga 10
pulintaweereza 10
sindika 10
siyinza 10
tojja 10
yanywerera 10
abamu 9
agambye 9
akkiririzaamu 9
alindirira 9
baagala 9
bajja 9
batya 9
bigambo 9
bumanyirivu 9
ebikwatagana 9
ebiyinza 9
ge 9
kati 9
kiyamba 9
kukibuulirako 9
kwe 9
muto 9
nja 9
offrey 9
ogamba 9
okukitwala 9
olwekyo 9
omalira 9
pakiti 9
tekiba 9
wakola 9
wansi 9
wekka 9
abaali 8
abaruumi 8
abo 8
ajja 8
ayinza 8
baamuwadde 8
bagamba 8
bakola 8
balowooza 8
banne 8
bituufu 8
bukatuuniziyiza 8
byo 8
ebibiri 8
ebizibu 8
eddala 8
emabega 8
emirundi 8
empisa 8
ffenna 8
ka 8
kibi 8
kijjukire 8
kyange 8
lwe 8
mazima 8
muli 8
munaana 8
mwenge 8
mwesigwa 8
okubaawo 8
okusigala 8
okutandika 8
olaba 8
omuvuzi 8
owulira 8
oyogedde 8
teyali 8
ttivi 8
wali 8
wammanga 8
wandiika 8
wandiikawo 8
yobu 8
yusufu 8
akagologoosi 7
baali 7
baba 7
bibuuzo 7
birowoozo 7
emirimu 7
gakola 7
ke 7
musanyufu 7
okulaba 7
okusirika 7
okwogerako 7
omala 7
omuvubuka 7
onywerera 7
peetero 7
abakazi 6
annette 6
atyo 6
baalina 6
babuuzaabavubuka 6
bakujerega 6
banaakutwala 6
bandirowoozezza 6
batuufu 6
bavubuka 6
biddibwamukiki 6
biddibwamulwaki 6
biddibwamunnyinza 6
biddibwamunsaanidde 6
biddibwamunze 6
byammwe 6
ddala 6
ebivaamu 6
ekisukkiridde 6
embeera 6
eminywevu 6
emirandira 6
endala 6
enoabavubuka 6
esawu 6
etaali 6
kayini 6
kikikyewandikoze 6
kiseera 6
kugenda 6
kukulemesa 6
kwalaga 6
mbadde 6
mpulira 6
munda 6
musobola 6
muŋŋamba 6
obagambe 6
ogezaako 6
ogulina 6
ogusobola 6
okinywererako 6
okkiririzaamu 6
okubaddamu 6
okubasanyusa 6
okugeraageranyizibwa 6
okugumira 6
okukikola 6
okukkiriza 6
okukulemesa 6
okukweka 6
okukyusa 6
okulabika 6
okulya 6
okumpi 6
okunoonya 6
okunoonyereza 6
okutambuzaamu 6
okuvaamu 6
okuwuliziganyaamu 6
oluusi 6
omanya 6
omugejjo 6
omulala 6
omusomesa 6
onoosalawo 6
otoyinza 6
sisuubira 6
temunnyingiza 6
togenda 6
toyinza 6
tubaako 6
tusalawo 6
twolekagana 6
wandikyusizza 6
watya 6
weekwasa 6
yeegendereza 6
yenna 6
yesu 6
yuda 6
abangi 5
agenda 5
agwa 5
akaama 5
alabika 5
alaga 5
amukuba 5
amutegeeza 5
amuwandiikira 5
asatu 5
asembeza 5
atalina 5
ateeka 5
ayogerako 5
bafuuwa 5
bakupikiriza 5
batera 5
baviire 5
beeranga 5
beeyongera 5
biddibwamu 5
bikwata 5
bingi 5
biyinza 5
bugenzi 5
bukyali 5
buzibu 5
dawudi 5
ddoboozi 5
eddoboozi 5
egikwata 5
ekibi 5
ekibuuzo 5
ekigezo 5
ekikoola 5
ekikukakasa 5
ekikulu 5
ekikyamu 5
ekimu 5
ekirala 5
ekitwalibwa 5
embuyaga 5
empolampola 5
engoye 5
entuufu 5
erye 5
ggyako 5
gwo 5
kibegabega 5
kikulu 5
kikyamu 5
kiri 5
kubategeerezaawo 5
kuekyo 5
kukimanyaako 5
kukuyamba 5
kuli 5
kupikirizibwa 5
kutendewalirwa 5
kwewala 5
kyo 5
laba 5
leka 5
manya 5
misono 5
mitawaana 5
mitindo 5
mpisa 5
mubeerenga 5
mutiitiizi 5
mwaka 5
nkemeddwa 5
nnaawulira 5
nnali 5
nnawulira 5
obo 5
obulwadde 5
obuyinza 5
obuzibu 5
ofuna 5
ogenda 5
ogugumira 5
ogwo 5
okoma 5
okubagamba 5
okubasoomooza 5
okubi 5
okubuulira 5
okubwetegekera 5
okukimanya 5
okukolera 5
okukusendasenda 5
okulindirira 5
okulwanyisa 5
okulwawo 5
okumatiza 5
okumuyamba 5
okusanyusa 5
okuwulira 5
okuwuliziganya 5
okwaŋŋanga 5
okwegomba 5
okwewalamu 5
okweyongera 5
omalirira 5
omukono 5
omulungi 5
omunda 5
omunwe 5
onyweredde 5
osaanidde 5
osanga 5
osooka 5
oyambako 5
oyimiridde 5
oyogera 5
salawobayibuli 5
samwiri 5
simanyi 5
ssomero 5
tekikwetaagisa 5
tetujja 5
tosobola 5
toyagala 5
wandibadde 5
wandibazzeemu 5
wange 5
weebuuze 5
yandibadde 5
yeekweka 5
yoswa 5
zabbuli 5
zaffe 5
abaako 4
abadde 4
abafiripi 4
abalenzi 4
abamusoomooza 4
abasendasenda 4
abeefeso 4
abutambuzaamu 4
afaananako 4
afuba 4
agenze 4
agezaako 4
aggya 4
aggyeyo 4
agivuge 4
agyetoolooleza 4
akabibayibuli 4
akafaananyi 4
akalaba 4
akikola 4
akiraba 4
akutte 4
akyali 4
akyuka 4
amafuta 4
amakulu 4
amanyiddwa 4
amutwale 4
amuwaako 4
anywa 4
asobola 4
asoma 4
atabuulira 4
atakkiriza 4
atamanyi 4
atasalawo 4
atemya 4
atunudde 4
avuga 4
awatali 4
ayise 4
aŋŋamba 4
baafumiitiriza 4
baapikirizibwa 4
baayagala 4
babiri 4
babuuzandabika 4
babuuzannyinza 4
bagezezzaako 4
bakikola 4
bakkiriza 4
balala 4
balina 4
bangi 4
bannaabwe 4
bazannyisawatya 4
bbanga 4
beesalirawo 4
bikulu 4
binoabavubuka 4
boogeranze 4
bukatuuninnyinza 4
byabwe 4
byange 4
e 4
ebiddako 4
ebimalamu 4
ebimulemesa 4
ebimuwugudde 4
ebiragalalagala 4
ebireeta 4
ebirowoozo 4
ebisatu 4
ebyawandiikibwa 4
eddakiika 4
egyenkana 4
ekinaakuyamba 4
ekisingako 4
ekitone 4
ekituufuokwogerako 4
ekiyinza 4
ekkubo 4
ekyabaddewo 4
emirembe 4
emisanvu 4
emitindo 4
enda 4
enfunda 4
enjawulo 4
erirwanyisa 4
eryo 4
eteraga 4
fumiitirizabayibuli 4
ganaggwaamu 4
gu 4
gugenda 4
gumutyemuka 4
guno 4
gwa 4
gwannumiriza 4
gyange 4
kabaga 4
kabi 4
kalabirwamu 4
kibe 4
kifaananyi 4
kikikyewandikubirizza 4
kikuyamba 4
kimusobozesa 4
kimuyamba 4
kisinga 4
kituukana 4
kiwandiike 4
kkubo 4
kubabuulira 4
kubuusabuusa 4
kukufuga 4
kukyemalira 4
kukyogerako 4
kukyukakyuka 4
kukyusa 4
kulinda 4
kumulemesa 4
kungi 4
kuno 4
kunywerera 4
kusatu 4
kwa 4
kwata 4
kweraba 4
kweyongerayo 4
kyamuyamba 4
kyandibadde 4
leahbwa 4
leero 4
lengera 4
linfuula 4
lugandakiki 4
lugandalwaki 4
lugandannyinza 4
lugandansaanidde 4
lugandanze 4
lugendo 4
luuyi 4
mba 4
mikwano 4
mmwe 4
mpozzi 4
mubiri 4
muddu 4
mulundi 4
mumalirivu 4
munnakyalo 4
muvubuka 4
mwana 4
natali 4
ndaba 4
ndabirwamu 4
ndaga 4
nedda 4
njogera 4
nkaluubirirwa 4
nkugamba 4
nkwanjulire 4
nnakugamba 4
nnawolovu 4
nsanyukira 4
nsawo 4
obaddamu 4
obagamba 4
obaviira 4
obukulu 4
obunafu 4
obuteenyooma 4
obuulira 4
ofaayo 4
okubasalirawo 4
okubituukako 4
okubuulirira 4
okufaananako 4
okugaana 4
okugatta 4
okuginywererako 4
okugondera 4
okukangula 4
okukiwa 4
okukozesa 4
okukubuuza 4
okukwatamu 4
okuli 4
okumanyaki 4
okumugamba 4
okumuleetera 4
okumunywa 4
okumusalirawo 4
okumusendasenda 4
okumuwandiikira 4
okunywako 4
okupangisa 4
okusalawookulekera 4
okusengeka 4
okusiimibwa 4
okussaayo 4
okutegeera 4
okutegeeza 4
okutunula 4
okutuukako 4
okutuukayo 4
okutuusa 4
okuwandiika 4
okwata 4
okwenyooma 4
olulala 4
omusajja 4
omutume 4
omuwawa 4
omwenge 4
omwoyo 4
ono 4
onoonya 4
onyweko 4
osalawo 4
osinziira 4
oyonoona 4
sibeesiga 4
sidduka 4
sikikola 4
sinywa 4
siri 4
sirina 4
so 4
soogedde 4
ssente 4
tayagala 4
tebakusiima 4
tekirina 4
temufaayo 4
teyakkiriza 4
tokkiriza 4
tokyali 4
toli 4
tolina 4
tomanyikya 4
tosaanidde 4
tteeka 4
tukole 4
tuli 4
waayo 4
weerabamu 4
weesanga 4
wekyangu 4
wiiki 4
yaakamalawo 4
yagimanyaako 4
yamalirira 4
yandyagadde 4
yateekawo 4
yeetaaga 4
abakkolosaayi 3
abusaalomu 3
abusalomu 3
afunirawo 3
akawungeezi 3
amaanyibo 3
amalirizza 3
amubuuza 3
amuddamu 3
ana 3
asembera 3
assaako 3
ataano 3
atuula 3
ayimirira 3
bafaayo 3
bakujeregasinga 3
bakujjukirako 3
bakwatibwa 3
batenda 3
bawala 3
bawewuka 3
bazannyisa 3
bazitowa 3
bokka 3
boogeranyinza 3
bowadde 3
bukatuuni 3
bulijjo 3
bungi 3
bwavudde 3
ebbogo 3
ebisooka 3
ebitiibwa 3
eddagala 3
ekisusse 3
emiganyulo 3
emyaka 3
enkula 3
ennaku 3
ennyo 3
eraga 3
etuwa 3
eyali 3
gamba 3
gano 3
gweyongera 3
kabaka 3
kibadde 3
kibaviiriddeko 3
kibuuzo 3
kikuyigiriza 3
kimuleetera 3
kinyiiza 3
kiyinzika 3
kukozesa 3
kusooka 3
kuwummulako 3
lukka 3
lwakusatu 3
malala 3
muganda 3
mulimu 3
mulyango 3
musajja 3
mutabani 3
mwambale 3
ndabika 3
nkwe 3
ntebe 3
obaako 3
obukyayi 3
obuleetera 3
obutayagalibwa 3
obuweerero 3
obuyitibwaanorexia 3
oddemu 3
ogambye 3
oguwedde 3
okkiririzaawo 3
okufa 3
okufuna 3
okukutegeera 3
okukwagala 3
okulala 3
okuleetera 3
okulekayo 3
okulekera 3
okumu 3
okumukuba 3
okumuviirako 3
okunziramu 3
okusatu 3
okusikiriza 3
okusinga 3
okusingawo 3
okuwandiikira 3
okwagalibwa 3
okwekozza 3
olowoozezzaako 3
olunaku 3
omuggya 3
omwaka 3
osaza 3
otyo 3
ozzeemu 3
phylicia 3
saza 3
tebakulaba 3
tekiyamba 3
tekusanyusa 3
tewakkiriza 3
toddangamu 3
wakolawo 3
wandikuttemu 3
wawulira 3
wayigira 3
weeraba 3
weeraliikirira 3
weewale 3
wuliriza 3
yaabwe 3
yalina 3
yee 3
zaabwe 3
zireetera 3
abaana 2
abatali 2
abbigayiri 2
abisaagi 2
afuuka 2
akaso 2
amangu 2
bakulu 2
balabika 2
bamu 2
basajja 2
bassekabaka 2
beetoowaze 2
bigere 2
binobavubuka 2
binovidiyo 2
biro 2
biruubirirwa 2
bitabo 2
butuufu 2
bwo 2
ebbanga 2
ebbiri 2
ebyaliwo 2
eggaali 2
ekiro 2
ekisinga 2
ekyaliwo 2
ekyama 2
empuliziganya 2
eyonooneka 2
ezo 2
ezoogeddwako 2
fumiitiriza 2
funa 2
gumulumiriza 2
kamogo 2
kubeerenga 2
kuddamu 2
kugikola 2
kukuvaako 2
kulemenga 2
kungulu 2
kusoma 2
kuvuga 2
kwammwe 2
kyokka 2
kyokkaabavubuka 2
laakeeri 2
lyonna 2
maasolangi 2
mulala 2
muzadde 2
nfuba 2
njiyigirako 2
nnagikkiririzaawo 2
nnagikweka 2
nnagissa 2
nnamaddala 2
nnatya 2
nneme 2
nzikiririzaamu 2
obubikijjukire 2
obubonero 2
obulaga 2
obuwanvuobuzitoenviirifiga 2
obuyambi 2
obwo 2
ogwa 2
okikola 2
okubaako 2
okufaayo 2
okukusalirawo 2
okusooka 2
okuyigira 2
okwerungiya 2
olabika 2
olabikamu 2
omukakafu 2
omukulu 2
omukwano 2
opikirizibwa 2
saala 2
tewafaayo 2
teyaliiko 2
tukkiriza 2
tulabye 2
tusobya 2
twakazikola 2
vera 2
wakati 2
weesalirawo 2
weesiga 2
weeteeke 2
weeyazika 2
yakobo 2
ye 2
yobo 2
yobwe 2
ziyiza 2
