mu 127
ku 89
nga 82
ne 73
era 46
no 36
na 27
nti 25
ya 24
naye 21
obutondebwensi 21
bwe 20
ate 19
nnyo 19
buli 17
wa 17
yali 17
bo 14
bya 14
ekyo 14
gye 14
kati 14
ngo 14
za 14
abantu 13
ensimbi 13
kya 13
oba 13
lwe 12
kitundu 11
walusansa 11
bye 10
ddala 10
emiti 10
kye 10
okuwandiika 10
olwo 10
bugagga 9
ebintu 9
gya 9
kino 9
nge 9
obugagga 9
okusoma 9
okutuuka 9
okuwuliriza 9
okwogera 9
ye 9
abaguzi 8
ebirala 8
enkuba 8
eno 8
ensonga 8
eya 8
eyo 8
kiseera 8
obulungi 8
omu 8
soma 8
ze 8
bangi 7
e 7
ebya 7
ekitundu 7
embeera 7
lwa 7
makula 7
ngeri 7
obwavu 7
waggulu 7
anti 6
bibinja 6
bwa 6
byonna 6
endala 6
engeri 6
enjawulo 6
kubanga 6
kumi 6
kwe 6
kyokka 6
lya 6
okufuna 6
okugula 6
okukola 6
okukozesa 6
okutaasa 6
okwonooneka 6
oluvannyuma 6
ssaako 6
wammanga 6
we 6
amagoba 5
egyo 5
eryo 5
essomero 5
eza 5
mulimu 5
munywanyi 5
okukolebwa 5
oluyimba 5
olwa 5
omuntu 5
singa 5
ssente 5
wano 5
yafuna 5
abakozi 4
abayizi 4
amakulu 4
amazzi 4
bitundu 4
bizinensi 4
bulungi 4
bwavu 4
byammwe 4
ebbanga 4
ebinyonyi 4
ebitundu 4
ebyo 4
edduuka 4
ekitontome 4
emikolo 4
emirimu 4
emmotoka 4
ennyimba 4
ennyo 4
ennyumba 4
eyali 4
ga 4
gwe 4
luggya 4
lunaku 4
miti 4
muntu 4
nkola 4
nno 4
nnyingi 4
obudde 4
okuba 4
okusinga 4
okusinziira 4
okutunda 4
okuva 4
omuli 4
omulimu 4
omwaka 4
ssebo 4
ssenga 4
ssiniya 4
talina 4
twatandika 4
abalala 3
aga 3
amaaso 3
amaka 3
amakubo 3
amanda 3
atandika 3
ba 3
bayizi 3
bbiri 3
be 3
bingi 3
bino 3
bintu 3
ebikola 3
ebyobugagga 3
eddagala 3
egya 3
ekibira 3
ekintu 3
ekirala 3
ekiyinza 3
ekya 3
emmere 3
emu 3
engoye 3
ennaanansi 3
ennaku 3
ettaka 3
ewa 3
ffenna 3
gino 3
gu 3
gumu 3
kabalagala 3
kibira 3
kifo 3
kiki 3
kyonna 3
loole 3
lumonde 3
maka 3
mbi 3
mboozi 3
mbu 3
mingi 3
mirimu 3
mmaze 3
mukwano 3
muli 3
muwandiike 3
mwe 3
nabyo 3
nalukwago 3
nnali 3
nze 3
obubi 3
obulamu 3
obutonde 3
obuugi 3
ogwo 3
okugaggawala 3
okulima 3
okumalawo 3
okunnyonnyola 3
okutereka 3
okwokya 3
olukwata 3
olwokuba 3
omugagga 3
omukisa 3
omukulu 3
omwavu 3
ssomero 3
ttaka 3
twasalawo 3
uganda 3
wamu 3
yadde 3
yeeyongera 3
yo 3
zaabwe 3
aba 2
abaana 2
abamu 2
abavubuka 2
agavubuka 2
ah 2
akatono 2
akawungeezi 2
amalambulukufu 2
amannya 2
amanyi 2
atya 2
ava 2
awasa 2
awo 2
babeeranga 2
bajajjaffe 2
bakola 2
bakozesa 2
bali 2
bana 2
bannaffe 2
bannange 2
bano 2
bantu 2
bbanga 2
biki 2
bungi 2
butondebwensi 2
buyinza 2
bwabyo 2
bwonna 2
ebibuuzo 2
ebikwata 2
ebimu 2
ebisoko 2
ebitontome 2
ebiyinza 2
ebyali 2
ebyobutonde 2
egiwera 2
ekirabo 2
ekirango 2
ekiri 2
ekirooto 2
ekiseera 2
ekisinga 2
ekivuddeko 2
ekwatagana 2
ekyamazima 2
ekyewuunyisa 2
ekyeya 2
emboozi 2
emirundi 2
emitala 2
empaka 2
emyezi 2
engero 2
enjega 2
enjogera 2
enkeeze 2
ennungi 2
ennyaanya 2
ennyingi 2
ennyonyi 2
ensibuko 2
eri 2
erya 2
essuula 2
ezivaako 2
ffe 2
ggandaalo 2
ggwanga 2
ggwe 2
guli 2
gwa 2
gwange 2
kasasiro 2
kibuga 2
kikulu 2
kimu 2
kinene 2
kiri 2
kisulo 2
kitanda 2
kitange 2
kuba 2
kulya 2
kutuuka 2
kyabwe 2
kyalo 2
laba 2
lumu 2
lwaki 2
lyali 2
lyonna 2
maaso 2
mukasa 2
mukyala 2
mulamwa 2
mulembe 2
mulungi 2
mumanyi 2
mumenye 2
musoke 2
muwulidde 2
muwuliddeko 2
mw 2
mwala 2
mwali 2
mwavu 2
myaka 2
naddala 2
namukadde 2
ndi 2
ndokwa 2
nnyini 2
nsi 2
nsimbi 2
nsonga 2
ntandika 2
obubaka 2
obucupa 2
obugimu 2
obukozesa 2
obungi 2
obutakkaanya 2
ojja 2
okolera 2
okoma 2
okubeera 2
okugeza 2
okukozesebwa 2
okukuba 2
okulengera 2
okumala 2
okumanya 2
okusiga 2
okutegeera 2
okutuusa 2
okuwa 2
okwagala 2
olina 2
olowooza 2
olulala 2
olulimi 2
olunaku 2
olusiriŋŋanyi 2
olweyambisibwa 2
omanyi 2
omuko 2
omusaala 2
omwala 2
omwo 2
ono 2
osobola 2
otuuka 2
owa 2
oyiga 2
oyinza 2
oyo 2
oyongera 2
so 2
ssa 2
ssamba 2
ssekinnoomu 2
teyalwa 2
tukozesa 2
tulina 2
tuyinza 2
twali 2
twogera 2
waffe 2
wali 2
waliwo 2
wandiika 2
wange 2
wo 2
wonna 2
yaffe 2
yalina 2
yatandika 2
yayagala 2
zaali 2
zino 2
