mu 260
bayibuli 194
ku 188
katonda 122
ne 114
ddala 94
nga 72
ki 67
na 66
amannya 50
ya 50
buli 49
abantu 48
wa 43
nti 42
ebya 39
nnyo 39
yakuwa 39
bye 37
bwe 36
bya 36
ebintu 36
era 35
eyogera 34
enjawulo 31
lubu 31
aba 30
oba 30
ba 29
ebikwata 29
ekya 29
ngo 27
kkumi 26
kya 26
ebiri 25
esobola 25
no 25
okuyiga 25
aga 24
amazima 24
gwaffe 24
kitabo 24
mukutu 24
sentence 24
ebibuuzo 23
bo 22
eri 22
bulamu 21
byonna 21
edda 21
kye 21
maliyamu 21
okuba 21
ye 21
kirimu 20
ngeri 20
okuyamba 20
bwa 19
ebyo 19
olwa 19
verb 19
yesu 19
amagezi 18
ebizibu 18
eyigiriza 18
kyo 18
kyokka 18
omu 18
ennyo 17
kwe 17
okunnyamba 17
okutuyamba 17
agali 16
alina 16
bingi 16
ebyokulabirako 16
obwakabaka 16
ssatu 16
erinnya 15
ffe 15
lya 15
maama 15
omutukuvu 15
omwoyo 15
amaka 14
eno 14
enzikiriza 14
kuba 14
luno 14
object 14
okufuna 14
aboogera 13
ebiseera 13
ensi 13
eza 13
ga 13
gano 13
ge 13
manya 13
mulimu 13
owa 13
wammanga 13
abaana 12
abakristaayo 12
amawanga 12
awaayo 12
batera 12
e 12
ebitugatta 12
ebitukwatakone 12
ekirabo 12
ekisinga 12
ekyo 12
ennimi 12
ffenna 12
kiraga 12
kristoera 12
kubwakabaka 12
kwogera 12
kyaffe 12
li 12
nnimi 12
okubeeraabakristaayo 12
okubonaabona 12
okugulumizayakuwa 12
okukoppayesu 12
okutugatta 12
omutonzi 12
soma 12
tufuba 12
tulina 12
tuyitibwaabajulirwa 12
twagala 12
twenyumiriza 12
twogera 12
wekkaanye 12
zaffe 12
baani 11
eddamu 11
ekiseera 11
ennukuta 11
essanyu 11
gye 11
mukaaga 11
okukozesa 11
ssente 11
subject 11
ze 11
amalala 10
bbiri 10
be 10
ebigambo 10
eddamubayibuli 10
embu 10
mwe 10
n 10
nze 10
okuva 10
okwaŋŋanga 10
omuntu 10
waliwo 10
zino 10
abajulirwa 9
biki 9
bulijjo 9
ebikulu 9
emirembe 9
emu 9
eya 9
gaba 9
gino 9
gumu 9
kimu 9
lwa 9
lwe 9
musanvu 9
obwa 9
okutonda 9
omwana 9
wansi 9
za 9
agasobola 8
agava 8
ali 8
bakozesa 8
boolekagana 8
ebadde 8
ebirala 8
ebyafaayo 8
ekibiina 8
ekibuuzo 8
ekitundu 8
enkalakkalira 8
gya 8
kino 8
kompyuta 8
media 8
mitwe 8
muganyulo 8
nge 8
nyiga 8
obeeko 8
oku 8
okuzannya 8
okwebuuza 8
olabye 8
olondako 8
oluganda 8
playereremereddwa 8
timoseewo 8
abasajja 7
agalimu 7
amabanja 7
ate 7
ddi 7
etya 7
gategeeza 7
jjo 7
obulungi 7
olugoye 7
relative 7
vidiyo 7
wanulako 7
abaali 6
abagezigezi 6
abakazi 6
abasatu 6
abeeramu 6
aboogerwako 6
aganene 6
agayitibwa 6
alufa 6
amataba—ddala 6
ani 6
ategeka 6
atuleetera 6
baatereka 6
baaziika 6
bayibuli—biki 6
bifuukafuuka 6
bitegeeza 6
busungu 6
byaliyo 6
byava 6
dayinaso 6
ddembe 6
ebibi 6
egya 6
ekifo 6
ekijja 6
ekikutuukako 6
eneesobola 6
enfuna 6
enkola 6
ennamba 6
ente 6
eriiso 6
eyo 6
gali 6
gasolo 6
kibuga 6
kiki 6
kiseera 6
makulu 6
masiya 6
mwennyamivu 6
nabyo 6
ndi 6
nnamaddala 6
nsibuko 6
nuuwa 6
obulwadde 6
obutawona 6
okubaamu 6
okubayigirako 6
okujja 6
okukuyamba 6
okumanya 6
okwesalirawo 6
olina 6
omega 6
turin 6
tuyinza 6
yakozesa 6
ayinza 5
baggya 5
bantu 5
bikwatagana 5
bukomera 5
buno 5
ekintu 5
ekiyinza 5
empisa 5
engeri 5
ezili 5
gwabwe 5
kitegeererwa 5
lukale 5
lunaku 5
mangi 5
mannya 5
nnukuta 5
nnyingo 5
ogu 5
okubuulira 5
okuddamu 5
okumpi 5
okutuuka 5
olwo 5
omusota 5
ssomero 5
ttaano 5
wamu 5
weetegereze 5
yali 5
yiga 5
ziwandiike 5
a 4
abavubuka 4
akuyambako 4
amalungi 4
amateeka 4
baasobola 4
bajulirwa 4
balina 4
bangi 4
bannassaayansi 4
bazudde 4
bibuuzo 4
bino 4
bonna 4
bulumi 4
bwereere 4
ebigirimu 4
ebinaakuyamba 4
ebinyuma 4
ebirowoozo 4
ebisingawo 4
ebisobola 4
ebiyinza 4
ebyesigamiziddwa 4
ekigendererwa 4
ekiggya 4
ekikwata 4
eneekuganyula 4
enkulu 4
enkya 4
ennungi 4
essimuvidiyoekibiina 4
eyambye 4
ezimu 4
gasobola 4
gawandiike 4
genda 4
kibuuzo 4
kuyiga 4
laba 4
lláh 4
luganda 4
luggya 4
lye 4
maka 4
mukasa 4
mwenda 4
naffe 4
naye 4
nouns 4
obaako 4
obukakafu 4
obulaga 4
obutabo 4
ogeraageranya 4
okudda 4
okufunamu 4
okukkiriza 4
okukola 4
okukolagana 4
okutegeera 4
okuweweeza 4
okuyigiriza 4
okwolekagana 4
omupiira 4
omwami 4
oyiga 4
saba 4
ssaayansi 4
tense 4
uqúqu 4
we 4
weebuuza 4
yeesigika 4
zirina 4
abaanakozesa 3
abaawandiika 3
abavubukamanya 3
akukyaliremukubaganye 3
aleese 3
alimu 3
amagedoni 3
amakaabafumbo 3
amazzi 3
ameka 3
asatu 3
ayagala 3
baagoberera 3
bakatonda 3
balagula 3
basatu 3
bayibulilonda 3
bayibulitandika 3
bayibuliweetegereze 3
bazungu 3
besirekemu 3
birina 3
biseera 3
buganda 3
bukakasa 3
bunaakola 3
buyise 3
bwanyi 3
byakyusibwamuko 3
byawandiikibwa 3
ddiini 3
ebiyamba 3
eddako 3
eddamufuna 3
ekikolo 3
ekikolwa 3
ekirimu 3
ekiriwo 3
ekkumi 3
ekwatagana 3
ekyayise 3
emmeeza 3
emmunyeenye 3
eneezikirizibwa 3
engoye 3
enkoko 3
ennaku 3
ennene 3
ennyumba 3
ensolo 3
essanyubayibuli 3
essimu 3
ezikozesebwa 3
far 3
future 3
galuwa 3
gasangibwa 3
gayingiramu 3
gu 3
kweyagala 3
linnya 3
luli 3
maanyi 3
magudaleena 3
mangu 3
munaana 3
musa 3
museetwe 3
mw 3
naa 3
near 3
nkalala 3
nkole 3
nnalwanga 3
obufumbo 3
obukwata 3
obunnabbi 3
obwengula 3
ogawandiike 3
okusinza 3
olutalo 3
omukulu 3
omulenzi 3
omusamaliya 3
otya 3
oyinza 3
oyo 3
past 3
taata 3
tugamba 3
tukwaniriza 3
wakati 3
wandiika 3
wange 3
wano 3
wazira 3
yange 3
yatandika 3
yawandiika 3
yenna 3
yerusaalemi 3
zonna 3
abaatuyamba 2
abali 2
abo 2
adjective 2
agamanyiddwa 2
agamu 2
agatandika 2
agatatandika 2
agayingira 2
ago 2
aguze 2
akagaali 2
akasittale 2
amat 2
amawulire 2
atasobola 2
b 2
bayibulilaba 2
bbanga 2
biyinza 2
bumu 2
bungi 2
butabo 2
bwaffe 2
bwino 2
byazo 2
byonnaddala 2
byonnakatondabayibuliyesuobwakabaka 2
byonnayakuwa 2
classes 2
common 2
dda 2
dde 2
ebbaluwa 2
ebikkiriziganya 2
ebisukka 2
ebitonde 2
ebituufu 2
eggulo 2
egimu 2
egisinga 2
ek 2
ekibira 2
ekigambo 2
ekikulu 2
ekiro 2
ekitabo 2
ekkiriziganya 2
ekulembera 2
ekyakayita 2
ekyayita 2
embwa 2
emigga 2
emikoloempisa 2
emiti 2
empeerezi 2
endala 2
enkalala 2
ennoni 2
ennyingo 2
ennyonyi 2
ensuwa 2
entuufu 2
essimuvidiyo 2
ewala 2
ezo 2
gakozesa 2
gatandika 2
gatandikibwa 2
gonja 2
gonna 2
gugudde 2
j 2
kampala 2
kasooli 2
katale 2
katondalaba 2
kibe 2
kibiina 2
kinene 2
kisaana 2
kitundu 2
kkubo 2
kubanga 2
kufuuka 2
kyabaddeyo 2
kyoga 2
l 2
liba 2
liri 2
liyingira 2
liyitibwa 2
lukalala 2
lusuku 2
ma 2
mabanga 2
mukama 2
munne 2
nange 2
ndo 2
nnya 2
noun 2
ntono 2
o 2
obikolemu 2
obubonero 2
obudde 2
obumu 2
obungi 2
obusittale 2
obuyambi 2
ofune 2
ofunemu 2
ogenda 2
okozesa 2
okufa 2
okugenda 2
okugissa 2
okugulu 2
okuja 2
okukuba 2
okusoma 2
okutuusa 2
okuwandiika 2
okwatula 2
okwemanyiiza 2
okwoza 2
olonda 2
olubu 2
olug 2
oluggyo 2
olujja 2
omuggo 2
omuk 2
omul 2
omulungi”laba 2
omusenyu 2
omusomesa 2
omusomeso 2
omuti 2
omwoyoobulamu 2
onoomalira 2
osoma 2
oteekwa 2
ozissaako 2
oziwandiika 2
oziwandiike 2
paulo 2
se 2
si 2
ssaawa 2
ssebo 2
t 2
tubuwandiika 2
tuligenda 2
twebaza 2
walusimbi 2
wasswa 2
yalina 2
yekka 2
yonna 2
zifuuka 2
zikulemberwa 2
zirimu 2
