mu 388
n 268
ku 257
nga 228
nti 194
ne 161
e 132
ng 100
era 94
bwe 79
abantu 66
poliisi 64
y 61
wa 57
bw 47
yagambye 44
kyokka 43
ya 40
ate 39
museveni 39
ye 39
buli 38
gye 38
abadde 34
kasooli 34
we 33
kino 32
be 31
pulezidenti 31
w 30
ky 29
kya 29
kye 29
okuva 29
naye 28
nrm 26
ssente 26
agamba 25
ba 25
oluvannyuma 25
disitulikiti 24
yabadde 24
000 23
buganda 23
by 23
oba 23
wabula 23
kuba 22
omuntu 22
z 22
ettaka 21
kubanga 21
mutaasa 20
amuriat 19
balina 19
bwa 19
gw 19
gy 19
gavumenti 18
ka 18
kkiro 18
omubaka 18
owa 18
aba 17
agenda 17
eri 17
ggwanga 17
kiseera 17
nnyo 17
obulwadde 17
abakulembeze 16
abamu 16
lw 16
omu 16
waliwo 16
akalulu 15
bano 15
eby 15
embeera 15
lwa 15
olw 15
yategeezezza 15
b 14
baabadde 14
engeri 14
enjawulo 14
ga 14
kampala 14
kkooti 14
kyagulanyi 14
lye 14
okukola 14
okuli 14
alina 13
bino 13
dr 13
eno 13
ensonga 13
lwe 13
nabo 13
omukambwe 13
ssennyiga 13
1 12
abaserikale 12
bonna 12
bukedde 12
bye 12
corona 12
ekibiina 12
gen 12
kati 12
okubeera 12
okulaba 12
2020 11
ab 11
bannayuganda 11
bulungi 11
ddala 11
december 11
dp 11
ebintu 11
emmere 11
ffamire 11
kigambibwa 11
ly 11
lya 11
mbeera 11
naddala 11
ono 11
ow 11
oyinza 11
ssabbuuni 11
ttaka 11
100 10
abasawo 10
abatuuze 10
bagenda 10
bali 10
byabwe 10
ddwaaliro 10
eggwanga 10
emirimu 10
enkyukakyuka 10
gwe 10
kibiina 10
kirizze 10
mulago 10
nairobi 10
nnamba 10
obululu 10
omulimu 10
omusango 10
sodo 10
uganda 10
wadde 10
yali 10
abalimi 9
akola 9
ali 9
bantu 9
bitangaro 9
bya 9
ez 9
g 9
kyotera 9
masaka 9
matugga 9
minisita 9
muhirwa 9
obukadde 9
okuba 9
ssentebe 9
ssentongo 9
wakati 9
3 8
amagye 8
amasasi 8
amaze 8
bannabyabufuzi 8
col 8
ebirabo 8
ekitundu 8
eky 8
ekya 8
emu 8
enkoko 8
eyali 8
k 8
kifo 8
lino 8
lokech 8
mubende 8
mukono 8
na 8
ngeri 8
oku 8
okutuuka 8
oluguudo 8
omugagga 8
omutindo 8
omwana 8
osobola 8
robert 8
wano 8
wo 8
200 7
4 7
abalala 7
akulira 7
amaka 7
ayagala 7
azze 7
baagala 7
bitundu 7
bubi 7
bwapulezidenti 7
ebirala 7
emiti 7
kiboga 7
kitaawe 7
kwe 7
maaso 7
maj 7
mityana 7
muwala 7
nup 7
obuwanguzi 7
okulya 7
okumanya 7
okusinziira 7
okwongera 7
si 7
talina 7
wiiki 7
ze 7
zino 7
2 6
20 6
30 6
abajaasi 6
abavubuka 6
afuna 6
ak 6
amateeka 6
awo 6
buyinza 6
bwanika 6
byalo 6
dduuka 6
ebiragiro 6
eddagala 6
ekirabo 6
ekirwadde 6
embi 6
emyaka 6
endala 6
ennaku 6
ge 6
guno 6
gwa 6
kalulu 6
kampeyini 6
kano 6
katikkiro 6
katumba 6
kitegeeza 6
kuliko 6
kw 6
kwekalakaasa 6
kyalo 6
ma 6
maka 6
mmotoka 6
mukolo 6
muntu 6
muyingo 6
nnannyini 6
north 6
november 6
nsonga 6
ogw 6
okufuna 6
okulonda 6
olwo 6
omwaka 6
patrick 6
tebalina 6
tewali 6
ttiyaggaasi 6
updf 6
waabwe 6
waakubeera 6
wamu 6
zaabwe 6
50 5
aana 5
abaana 5
abalwadde 5
abasuubuzi 5
abo 5
ajja 5
akakiiko 5
baabwe 5
baali 5
baategeezezza 5
bangi 5
batandika 5
bazadde 5
bingi 5
bo 5
bobi 5
buno 5
charles 5
dda 5
ebitundu 5
ebyobulamu 5
eddwaaliro 5
eggulo 5
ekintu 5
endwadde 5
enkulu 5
ensonda 5
ery 5
eya 5
eyabadde 5
eyo 5
fdc 5
godfrey 5
kabangali 5
kakiiko 5
kampalamukadde 5
kassanda 5
kizibu 5
kulonda 5
kyanda 5
kyegegwa 5
leero 5
luno 5
maama 5
maanyi 5
masiki 5
mukama 5
mulowooza 5
musherure 5
mwe 5
mwesigwa 5
mwijuka 5
nakitto 5
o 5
obulungi 5
okufa 5
okugenda 5
okukakasa 5
okukuba 5
okuleeta 5
okulwanyisa 5
okumala 5
okusaba 5
okwagala 5
olina 5
omuduumizi 5
omukazi 5
omulwadde 5
palamenti 5
road 5
ssaako 5
ssaazi 5
ssekukkulu 5
wakiso 5
wansi 5
wine 5
yasabye 5
yasoose 5
yekka 5
yonna 5
za 5
zaategeezezza 5
10 4
15 4
18 4
19 4
2021 4
5 4
500 4
600 4
ababadde 4
abagamba 4
abali 4
abawagizi 4
akatale 4
akawuka 4
amaanyi 4
amagezi 4
amangu 4
asaba 4
atandika 4
ategeeza 4
atwala 4
avuganya 4
baba 4
babeera 4
bakola 4
barata 4
basatu 4
basobole 4
bbiri 4
biseera 4
bizinensi 4
bokka 4
byekwaso 4
center 4
ebbanga 4
ebigambo 4
ebikwekweto 4
ebyobufuzi 4
ebyokwerinda 4
emmotoka 4
engoye 4
enkola 4
ennyo 4
ennyonyi 4
enteekateeka 4
envuba 4
essanyu 4
essimu 4
ewedde 4
ey 4
fred 4
gumu 4
gya 4
ibanda 4
january 4
kabaka 4
kabenge 4
kafeero 4
kaleerwe 4
kibuga 4
kika 4
kimu 4
kirabo 4
kitebe 4
kitongole 4
kiwana 4
kiwanda 4
kizimbe 4
kkaadi 4
kkampuni 4
kukola 4
kwa 4
kyondho 4
luguudo 4
malwaliro 4
mangu 4
mawogola 4
mbi 4
mmande 4
muto 4
nakasero 4
nakyo 4
nampeera 4
nayo 4
newankubadde 4
nnyanja 4
nsi 4
ntikko 4
nuwabiine 4
obujjanjabi 4
obulamu 4
obwedda 4
obwegugungo 4
okunoonya 4
okunywa 4
okusala 4
okusinga 4
okutabula 4
okutandika 4
okuwa 4
okwewala 4
olumu 4
oluvuganya 4
omugenzi 4
omulala 4
omuli 4
omutima 4
omwogezi 4
rakai 4
robina 4
sacco 4
september 4
ssegawa 4
ssentamu 4
sukaali 4
yabagulira 4
yagasseeko 4
yamaha 4
yannyonnyodde 4
yategeeza 4
yatwalibwa 4
yayongeddeko 4
yeebazizza 4
00 3
16 3
2017 3
21 3
23 3
40 3
7 3
abaabadde 3
abaagala 3
abaakwatiddwa 3
abaali 3
abaayo 3
ababaka 3
abakugu 3
abalina 3
abapangisa 3
abatalina 3
abatwala 3
abavubi 3
abawala 3
abawanguzi 3
abayi 3
abeegattira 3
aduumira 3
afudde 3
ag 3
aga 3
akasawo 3
akawunti 3
alaga 3
alagidde 3
amaato 3
amafuta 3
amagoba 3
amalala 3
amyuka 3
ani 3
anoonya 3
asala 3
asobola 3
asobole 3
awaka 3
baagenze 3
baamaze 3
baasoose 3
babadde 3
babiri 3
bagamba 3
bagenze 3
bajja 3
balowooza 3
bamanyi 3
bamutwala 3
bank 3
bannaabwe 3
bannange 3
banne 3
basobola 3
batandise 3
batuuka 3
bavuganya 3
beebuuza 3
beesimbyewo 3
bikwekweto 3
bintu 3
birungo 3
bujja 3
bulamu 3
bululu 3
bunyoro 3
bushenyi 3
bwabwe 3
byabufuzi 3
byobufuzi 3
byonna 3
ddungu 3
ebirungo 3
ebirwanyisa 3
ebizibu 3
ebyo 3
eccupa 3
eddako 3
egenda 3
ekiragiro 3
ekiseera 3
ekitongole 3
ekkubo 3
emirembe 3
emivuyo 3
emyezi 3
enduulu 3
enkung 3
ensi 3
erina 3
essaawa 3
ezo 3
fayiro 3
flying 3
gabula 3
gano 3
ggombolola 3
gwo 3
hoima 3
irwa 3
iso 3
joseph 3
jude 3
kabanda 3
kali 3
kasozi 3
kaweefube 3
keeki 3
khan 3
kiba 3
kigongo 3
kiri 3
kirungi 3
kitovu 3
kizza 3
kkubo 3
kubeera 3
kugenda 3
kuteesa 3
kwogera 3
kwonna 3
lt 3
lugazi 3
lugoloobi 3
lukalala 3
lunaku 3
lwanga 3
lwokubiri 3
lwokuna 3
lwokusatu 3
lwokutaano 3
lyonna 3
mary 3
masuliita 3
mateeka 3
mawanga 3
mayiga 3
minisitule 3
mirimu 3
mitwalo 3
mubajje 3
mukasa 3
mukwano 3
mulimu 3
munisipaali 3
munne 3
mwaka 3
myaka 3
nakalema 3
nakanwagi 3
nakasongola 3
nassolo 3
nkola 3
nyika 3
nze 3
oboi 3
obudde 3
obusiraamu 3
obw 3
ofiisi 3
ogujja 3
okubaako 3
okubakolera 3
okuddamu 3
okugoberera 3
okugula 3
okukwata 3
okulondoola 3
okunoonyereza 3
okusalawo 3
okusooka 3
okussa 3
okutongoza 3
okuyitawo 3
okuzimba 3
okwabya 3
okwemulugunya 3
okwenyigira 3
okwetegekera 3
okwogera 3
olukuηηaana 3
olwa 3
omulamuzi 3
omulembe 3
omumyuka 3
omuwendo 3
omuze 3
paul 3
pawuda 3
ppikipiki 3
puleesa 3
samuel 3
simon 3
sizoni 3
squad 3
ssinga 3
tannaba 3
tasobola 3
ttaano 3
tumukunde 3
turyamureeba 3
tusobola 3
underwood 3
waliyo 3
yabyogeredde 3
yalina 3
yasooka 3
yasuubizza 3
yaweereddwa 3
yesu 3
yingini 3
11 2
2014 2
2016 2
2019 2
24 2
25 2
29 2
31 2
80 2
800 2
9 2
91 2
ababba 2
abaduumizi 2
abagagga 2
abagenda 2
abagoba 2
abaguza 2
abajja 2
abajjanjabirwa 2
abakazi 2
abakozi 2
abakulu 2
abakuumi 2
abakyala 2
abalonzi 2
abanja 2
abapoliisi 2
abasoba 2
abasobyako 2
abasukka 2
abasuubira 2
abatujju 2
abawagira 2
abawangudde 2
abazungu 2
abe 2
abeera 2
abeetabye 2
addayo 2
afubye 2
afune 2
agaana 2
agirye 2
agwa 2
akaateekebwawo 2
akagenda 2
akamyufu 2
akasaanyi 2
akasattiro 2
akaseera 2
akavuyo 2
akawumbi 2
akaze 2
akkiriza 2
akozesa 2
akwatidde 2
akyali 2
alabudde 2
alese 2
alimba 2
alinnya 2
alumiriza 2
amagi 2
amakubo 2
amanyiddwa 2
amasannyalaze 2
amasomero 2
amayumba 2
amazzi 2
amusikiza 2
and 2
anemia 2
angle 2
aplastic 2
asabye 2
asalawo 2
asisinkane 2
asoma 2
asooka 2
atereera 2
atereka 2
atuuka 2
atwine 2
atyo 2
ava 2
awalala 2
awamu 2
ayingidde 2
ayinza 2
ayita 2
ayogera 2
baakutte 2
baamukebera 2
baamusasula 2
baamututte 2
baana 2
baasazeewo 2
baatuukirira 2
baayo 2
babalonde 2
babawa 2
babirye 2
baduumizi 2
bafa 2
bafi 2
bafuna 2
baggulawo 2
bajaasi 2
bakizuula 2
bakolera 2
bakuba 2
bakungula 2
bakutte 2
bakyali 2
balala 2
baleme 2
baludde 2
balwana 2
bamaze 2
bamulumiriza 2
bamutegeeza 2
bannaddiini 2
basiru 2
batabukidde 2
batya 2
bawagira 2
bawala 2
bayibuli 2
bayinza 2
bazisolooza 2
bazze 2
bba 2
bbaala 2
bbanka 2
bbebi 2
bbo 2
beegasse 2
beemulugunya 2
beetaaga 2
bendera 2
bifo 2
bigere 2
bikira 2
biragiro 2
bitongole 2
bombi 2
bubaka 2
budde 2
bugenda 2
bugoloobi 2
bugwanjuba 2
buikwe 2
bukya 2
bulaaya 2
bulijjo 2
bulwadde 2
bumenyi 2
bumutawaanya 2
bungi 2
butuufu 2
buvuddeko 2
buwanguzi 2
buyindi 2
bwafumiintiriza 2
bwenkanya 2
bwonna 2
byobulamu 2
central 2
christopher 2
church 2
city 2
color 2
company 2
covid 2
cps 2
david 2
ddene 2
ddole 2
dennis 2
diana 2
dominic 2
doreen 2
ebbaluwa 2
ebifo 2
ebimu 2
ebirungi 2
ebisava 2
ebisolo 2
ebitanda 2
ebitongole 2
ebituufu 2
ebonies 2
ebyaliwo 2
ebyobugagga 2
ebyokulonda 2
eddala 2
eddiini 2
egiri 2
egumbuludde 2
egyali 2
ekakasa 2
ekifaananyi 2
ekika 2
ekiri 2
ekisoboka 2
ekitiibwa 2
ekizibu 2
ekola 2
ekyuma 2
emiriraano 2
emisango 2
emisanvu 2
emitima 2
emitwalo 2
emitwe 2
emmundu 2
enguudo 2
enjuyi 2
enkalakkalira 2
enkeera 2
enkuba 2
enkya 2
ennungi 2
ennyimbe 2
ennyumba 2
enock 2
ensingo 2
ensisinkano 2
ensobi 2
entaana 2
entegeka 2
eraga 2
erinnya 2
eritunda 2
eriwo 2
esatu 2
etonnya 2
ezimu 2
ffenna 2
for 2
fr 2
galabuzi 2
gayaaza 2
gombe 2
greater 2
guli 2
gulimu 2
gwabwe 2
gwetabiddwaako 2
gwonna 2
gyagenda 2
hajji 2
henry 2
high 2
ii 2
james 2
japan 2
jinja 2
john 2
julie 2
julius 2
kabenje 2
kagula 2
kakubiddwa 2
kamwa 2
kamyufu 2
kaseera 2
kasenge 2
katawuni 2
katonda 2
katusuubire 2
kawere 2
ke 2
kibeera 2
kibi 2
kigenda 2
kigoogwa 2
kijja 2
kikyamu 2
kimuli 2
kirina 2
kisaawe 2
kisekka 2
kitagwenda 2
kitalo 2
kitta 2
kitundu 2
kituufu 2
kituuka 2
kiwanuka 2
kizuulibwa 2
kkanisa 2
kristu 2
kubaawo 2
kubatwala 2
kubawa 2
kudda 2
kufa 2
kukombya 2
kukuuma 2
kulwanyisa 2
kumpi 2
kuno 2
kusalawo 2
kusooka 2
kuwangula 2
kwabwe 2
kyabwe 2
kyali 2
kyangu 2
kyankwanzi 2
kyetaagisa 2
kyuma 2
lirye 2
ltd 2
lugenda 2
lukwago 2
lutalo 2
luwunga 2
lwaki 2
lyabwe 2
makindye 2
maneja 2
mangi 2
mannya 2
maria 2
mark 2
masasi 2
matia 2
mawanda 2
mazaalibwa 2
mazima 2
mazzi 2
mega 2
mikidadi 2
mmengo 2
mmere 2
mmwe 2
moses 2
mubaka 2
mufti 2
mukene 2
mukyala 2
mulembe 2
muliraanwa 2
mulundi 2
munnabyabufuzi 2
munnamagye 2
munno 2
mutebi 2
mutono 2
muzeyi 2
mwagalwa 2
mwebe 2
mwekebeze 2
mwenda 2
mwijuke 2
nabyo 2
nakaseke 2
nakasirye 2
nakifuma 2
nakiwala 2
nakwero 2
nankabirwa 2
nansana 2
national 2
ndeeba 2
ndi 2
ndowooza 2
ngoobi 2
nguudo 2
nju 2
nkulaakulana 2
nkulu 2
nkumi 2
nkya 2
nnyingi 2
nsaba 2
nsawo 2
ntebe 2
nteekateeka 2
obiga 2
obubaka 2
obubi 2
obuganda 2
obujjulizi 2
obukodyo 2
obulala 2
obulya 2
obuwuka 2
obuwumbi 2
obuyambi 2
obuyinza 2
obuzibu 2
obwakabaka 2
ogubadde 2
ogwa 2
okubala 2
okubanja 2
okubategeeza 2
okubatuusaako 2
okuddiza 2
okufaayo 2
okugaba 2
okugeza 2
okuggyamu 2
okugumbulula 2
okujja 2
okujjanjaba 2
okujjanjabirwa 2
okujjumbira 2
okukala 2
okukeberebwa 2
okukolera 2
okukozesa 2
okukyusa 2
okuleka 2
okulongoosa 2
okulongoosebwa 2
okumutwala 2
okungudde 2
okunuula 2
okusaasaana 2
okusajjuka 2
okusenda 2
okusisinkanira 2
okusuula 2
okutambuza 2
okutangira 2
okutumbula 2
okutwala 2
okuwangula 2
okuyingira 2
okuziikula 2
okuzza 2
okuzzaawo 2
okwejjanjaba 2
okwekebeza 2
okwesimbawo 2
okwetooloola 2
oludda 2
olukiiko 2
olunaku 2
olwaleero 2
omubeezi 2
omugga 2
omukolo 2
omukwano 2
omukyala 2
omulungi 2
omusaayi 2
omusajja 2
omusawo 2
omusenyu 2
omusika 2
omuti 2
omuwala 2
omuwandiisi 2
omuyizi 2
omuzungu 2
omwabadde 2
omwami 2
omwezi 2
onyango 2
osigala 2
people 2
peter 2
power 2
rdc 2
ref 2
rev 2
rugunda 2
ruhakana 2
ruth 2
sabiiti 2
sam 2
sd 2
sembabule 2
singa 2
siri 2
solutions 2
ssaalongo 2
ssaawa 2
ssako 2
ssatu 2
standard 2
supermarket 2
tabula 2
tagenda 2
tali 2
tawuni 2
tebalaba 2
tebayinza 2
tomas 2
ttundubaali 2
tulina 2
twali 2
waakuwagira 2
wabaddewo 2
waffe 2
wala 2
wayini 2
weeri 2
west 2
wooteeri 2
yaabwe 2
yabaddemu 2
yabagambye 2
yabuuzizza 2
yaddukidde 2
yafa 2
yagobye 2
yakomyewo 2
yakwata 2
yakwatibwa 2
yakyusizza 2
yalaba 2
yalabudde 2
yalagidde 2
yalagiddwa 2
yalagira 2
yamaze 2
yamuwa 2
yasikidde 2
yasinzidde 2
yasisinkanidde 2
yatabukidde 2
yavudde 2
yeesiize 2
yiika 2
yisirayiri 2
yoweri 2
zainab 2
ziri 2
zokka 2
zombi 2
zonna 2
