mu 132
nga 66
za 62
embuzi 50
olina 49
ensigo 46
endiga 43
ku 43
chia 40
osobola 35
weetaaga 34
okukungula 33
ente 31
ebigimusa 28
ettaka 28
embizzi 25
y 23
enkoko 22
okuba 22
nnimiro 21
okulunda 21
entula 20
obulungi 20
kaloti 19
abamu 18
muwogo 18
nnyo 18
obumyu 18
okufuna 18
okusimba 17
ekifo 16
ennungi 16
n 16
chumu 15
embaata 15
enaanansi 15
entangawuzi 15
katungulu 15
kisoboka 15
ttaka 15
biriŋŋanya 14
ez 14
lumonde 14
okra 14
okumanya 14
kasooli 13
katunkuma 13
kifo 13
waliyo 13
zo 13
amazzi 12
engeri 12
enyaanya 12
kyetutumula 12
lya 12
yo 12
zisobola 12
bulungi 11
emboga 11
empindi 11
okukozesa 11
bya 10
ekika 10
faamu 10
ne 10
okulima 10
ya 10
biyamba 9
bw 9
by 9
ebiwuka 9
emmere 9
ennyama 9
ky 9
lirina 9
oba 9
okugula 9
okukula 9
okulimamu 9
omuddo 9
ssente 9
tonnasimba 9
z 9
bakozesa 8
ebyuuma 8
ekigazi 8
enkomamawanga 8
ennimiro 8
gya 8
kukungula 8
kulunda 8
kyonna 8
nnyingi 8
okubeera 8
okuteeka 8
oyagala 8
abalima 7
abalimi 7
ebikoola 7
emirandira 7
kozesa 7
kyeetagisa 7
okukuza 7
oluvannyuma 7
wamu 7
acid 6
amagi 6
bwe 6
ebimu 6
ebisolo 6
ekikomera 6
ekiriisa 6
ekirungi 6
endwadde 6
g 6
galeetera 6
greenhouse 6
katale 6
kika 6
kya 6
ly 6
nnyama 6
okukulira 6
okulundira 6
okusinga 6
okuteekako 6
okuvunda 6
olunda 6
omulungi 6
w 6
waliwo 6
zeetaaga 6
abakozi 5
bangi 5
buli 5
byuuma 5
ebika 5
ebiri 5
ebirungo 5
eby 5
embi 5
empewo 5
ennene 5
ennyo 5
funa 5
ki 5
kulima 5
lw 5
lwaaki 5
mbuzi 5
nyingi 5
okuliisa 5
okutema 5
omusawo 5
ssekkoko 5
tebakozesa 5
tulakita 5
zibeera 5
zirundibwa 5
amata 4
amavuunike 4
asobola 4
bbumba 4
bingi 4
binnya 4
bwolaba 4
ebichupuli 4
ebinaayamba 4
eddungi 4
emiti 4
emmwaanyi 4
emyezi 4
enkazi 4
ento 4
esobola 4
ewaka 4
galina 4
kiseera 4
ko 4
kuuma 4
kyeeya 4
liremesa 4
liyitamu 4
mazzi 4
namazzi 4
obusa 4
okulya 4
okumeza 4
okusimbamu 4
okusobola 4
olulyo 4
tandika 4
teweetaaga 4
tolina 4
uganda 4
wa 4
weegendereze 4
weetaga 4
yiika 4
zilina 4
abeera 3
akuze 3
alambule 3
alimu 3
alina 3
amangi 3
awaka 3
awo 3
bagakolamu 3
balima 3
bibiri 3
bikumi 3
bubeera 3
bungi 3
busobola 3
bwoba 3
ebilara 3
ebirya 3
eggonvu 3
egonvu 3
ekimala 3
ekituufu 3
emikono 3
enkuba 3
ennume 3
ensawo 3
enyingi 3
eza 3
ezenkanankana 3
gloves 3
gumera 3
gwa 3
kirungi 3
kubeera 3
kulegamya 3
kuliibwa 3
kusinziira 3
kutandika 3
kyangu 3
mangu 3
mutunzi 3
ntono 3
nyiriri 3
obirungi 3
ofiirwa 3
ogula 3
okubikka 3
okubuuliriza 3
okugulamu 3
okukola 3
okulabirira 3
okulemesa 3
okuteekamu 3
okutegeka 3
okutta 3
okutunda 3
okuyambako 3
okuyiga 3
omusana 3
ow 3
oyinza 3
tebisobola 3
webagula 3
weetaagaga 3
weewale 3
yiga 3
yita 3
zifuna 3
zonna 3
abalina 2
agatetagisa 2
akambe 2
akulira 2
alkaline 2
amapeesa 2
amayembe 2
amayinja 2
ataano 2
attaka 2
awamu 2
awokuteleka 2
b 2
baagala 2
bagitunda 2
basimba 2
baziteeka 2
beedi 2
beeyi 2
bifo 2
bitono 2
buseere 2
butale 2
buyamba 2
buyonjo 2
bwebimyuuka 2
bwokozesa 2
bye 2
cabohydrates 2
ddungi 2
ebbugumu 2
ebibala 2
ebifo 2
ebijanjaalo 2
ebikwaata 2
ebimuri 2
ebinene 2
ebirala 2
ebiriisa 2
ebirime 2
ebirungi 2
ebiseera 2
ebiyambako 2
ebweeru 2
eddagala 2
ekiddukano 2
ekimpi 2
ekisaakate 2
ekiseera 2
ekisiikirize 2
ekiwanvu 2
ekiyumba 2
eky 2
ekyaamaanyi 2
ekyokusimbamu 2
elirimu 2
ely 2
embeera 2
enkumbi 2
ennamu 2
ensajja 2
etaka 2
etundibwa 2
eyagalibwa 2
ezamata 2
ezimu 2
ezinakukolera 2
ga 2
gasobola 2
gwanga 2
gwotayagala 2
kiba 2
kija 2
kilaga 2
kisobola 2
kitandikira 2
kitwaala 2
kiyambe 2
kiyinza 2
kiyonjo 2
kizingiramu 2
kkumi 2
kufuna 2
kusimba 2
kutunda 2
kuyamba 2
kweetagisa 2
kyaalo 2
kyazo 2
liyamba 2
lwennaku 2
makumi 2
malamu 2
mata 2
matono 2
mpola 2
mpoombeefu 2
muddo 2
mukaaga 2
musiri 2
mwenda 2
na 2
ndwadde 2
nedda 2
nofunamu 2
nokujjamu 2
nsi 2
nti 2
nyaanya 2
nyangu 2
obirungo 2
obukugu 2
ofunamu 2
ojja 2
okozesa 2
okubuuka 2
okufiirwa 2
okugujja 2
okujjamu 2
okukabalibwa 2
okukuumiramu 2
okulaba 2
okulablira 2
okulundamu 2
okumukungula 2
okungula 2
okutambulatambula 2
okuwa 2
okuwakisa 2
okweetagisa 2
okwegendereza 2
olulungi 2
olundiramu 2
oluusi 2
omu 2
omutunzi 2
osimba 2
oyigiriza 2
salawo 2
sima 2
simba 2
singa 2
sooka 2
telirina 2
tonaba 2
tonnagula 2
wansi 2
we 2
ye 2
yiinci 2
yinchi 2
yokulundamu 2
zeetaga 2
zirina 2
zisaasana 2
ziwakisa 2
zokka 2
zoogula 2
