mu 489
ku 322
n 310
nga 289
nti 218
ne 200
e 129
ng 110
wa 95
era 94
y 78
poliisi 70
bwe 67
w 61
abantu 60
ye 59
bw 40
bano 39
ky 38
kya 38
ya 38
ba 37
gye 35
we 35
yagambye 34
eno 32
lw 32
oluvannyuma 31
wabula 30
lwa 29
minisita 29
okuva 29
kampala 28
kino 28
kkooti 28
omu 27
z 27
2 26
agamba 26
guno 26
gw 26
kuba 26
palamenti 26
abalala 25
ate 25
ekibiina 25
gwa 25
be 24
bino 24
emirimu 24
ono 24
uganda 24
kubanga 23
kyokka 23
naye 22
okuli 22
olw 22
abavubuka 21
abadde 20
abagagga 20
abatuuze 20
gwe 20
ppaaka 20
by 19
ettaka 19
omubaka 19
omulamuzi 19
zino 19
africa 18
b 18
buli 18
disitulikiti 18
kitundu 18
okukola 18
owa 18
ssente 18
8 17
ebintu 17
ey 17
gavumenti 17
gy 17
okulaba 17
ssentebe 17
eky 16
bodaboda 15
eby 15
enjawulo 15
omuntu 15
omusango 15
omwaka 15
sipiika 15
waliwo 15
wamu 15
yabadde 15
yali 15
yategeezezza 15
1 14
2022 14
ab 14
akulira 14
ali 14
alina 14
amateeka 14
ez 14
kamyuka 14
kawempe 14
lwe 14
ly 14
wakiso 14
abamu 13
amasasi 13
ategeezezza 13
baabwe 13
babadde 13
kigambibwa 13
mayanja 13
nakawa 13
omugenzi 13
omulambo 13
omumyuka 13
south 13
3 12
abaana 12
buno 12
g 12
kkomera 12
kye 12
lino 12
lya 12
ngeri 12
nsonga 12
oba 12
okuba 12
olukiiko 12
omukazi 12
pulezidenti 12
ttiimu 12
zooni 12
10 11
ababaka 11
agambye 11
ategeeza 11
bagenda 11
davis 11
ekitundu 11
embeera 11
ensonga 11
kcca 11
kwe 11
nantumbwe 11
nnyo 11
nrm 11
of 11
okufuna 11
omuli 11
ow 11
ttabamiruka 11
za 11
asaba 10
bagamba 10
bali 10
bba 10
bitundu 10
bwa 10
ebirala 10
ekitongole 10
ennaku 10
gya 10
ka 10
kati 10
lubaga 10
mulimu 10
na 10
omulimu 10
singa 10
ttaka 10
ttakisi 10
zaabwe 10
4 9
aba 9
abakiise 9
asabye 9
balina 9
bulungi 9
bya 9
eggwanga 9
ensimbi 9
eri 9
ggwanga 9
jinja 9
luno 9
maama 9
maaso 9
march 9
mpaka 9
mukyala 9
munisipaali 9
namubiru 9
obukadde 9
okusobola 9
okutuuka 9
okutuusa 9
olwo 9
poloti 9
si 9
abakulembeze 8
abazannyi 8
amenvu 8
amyuka 8
attiddwa 8
ayagala 8
bannakibiina 8
banne 8
basobole 8
dr 8
eggulo 8
emmotoka 8
ensi 8
eyali 8
ga 8
kiseera 8
kuliko 8
mabirizi 8
mbeera 8
mukasa 8
nabo 8
nansikombi 8
okubaka 8
omusajja 8
omwogezi 8
rdc 8
tebalina 8
yasabye 8
000 7
abali 7
abaserikale 7
abazigu 7
alagira 7
amawanga 7
amayumba 7
among 7
basatu 7
bonna 7
buganda 7
bye 7
enteekateeka 7
essimu 7
famire 7
ii 7
kifo 7
kw 7
mirimu 7
muganzi 7
muhwezi 7
mukono 7
naddala 7
obulungi 7
obuuma 7
okubeera 7
okusinziira 7
olwa 7
omwana 7
peter 7
ssegirinya 7
ssenyonga 7
wano 7
wiiki 7
yenna 7
12 6
aana 6
abalina 6
abasiraamu 6
abasirikale 6
ag 6
anita 6
baabadde 6
baddereeva 6
bannaabwe 6
bantu 6
bapasita 6
bayita 6
bukenya 6
bulaaya 6
ddwaaliro 6
ebyokwerinda 6
ekiro 6
emberenge 6
emisango 6
empaka 6
essomero 6
kabaka 6
kakalu 6
kakiiko 6
kibiina 6
leb 6
leero 6
maka 6
minsa 6
mmotoka 6
mpuuga 6
mukazi 6
nnamba 6
obulamu 6
obumu 6
ofiisi 6
ogw 6
okunoonyereza 6
oluvuganya 6
omukozi 6
omukyala 6
sarah 6
sheikh 6
ssaabasumba 6
ssaawa 6
waabwe 6
waggulu 6
wakati 6
wansi 6
yasangiddwa 6
100 5
30 5
5 5
7 5
9 5
abakazi 5
abakozi 5
abakungu 5
abategesi 5
abatendesi 5
abeera 5
abo 5
agambibwa 5
agenda 5
alupo 5
amagezi 5
amagye 5
amaka 5
baagala 5
baali 5
bakkansala 5
bangi 5
batandika 5
batandise 5
bazze 5
bizinensi 5
bukedde 5
bwabwe 5
church 5
council 5
diguli 5
east 5
eddembe 5
ekkanisa 5
emikono 5
emiriraano 5
emisinde 5
engeri 5
enkuba 5
erya 5
eya 5
eyabadde 5
ezo 5
gaabwe 5
hajat 5
iganga 5
k 5
kabanda 5
kalidinaali 5
kano 5
kashengyere 5
kaweefube 5
ke 5
kenya 5
kibuga 5
kuno 5
kwa 5
kyaddondo 5
kyalo 5
lutikko 5
mateeka 5
mizannyo 5
morocco 5
moses 5
mufti 5
mugezi 5
munnaabwe 5
mutebi 5
mwala 5
mwesigwa 5
nakaseke 5
njeru 5
nsangi 5
obubaka 5
obubbi 5
obulemu 5
obumenyi 5
obuzibu 5
okubba 5
okujulira 5
okukomyawo 5
okukwata 5
okumala 5
okwongera 5
omulala 5
omusumba 5
ronald 5
siteegi 5
ssomero 5
tebasobola 5
yaabwe 5
00 4
11 4
14 4
2000 4
2021 4
70 4
80 4
ababadde 4
ababbi 4
abakyala 4
abalokole 4
abasinga 4
abavuzi 4
akabenje 4
akabindo 4
akola 4
alabudde 4
allan 4
amakulu 4
amasiro 4
amazzi 4
atwala 4
avunaanyizibwa 4
awatali 4
babiri 4
babirye 4
bakola 4
balimwezo 4
bamaze 4
bank 4
bannayuganda 4
basaba 4
basajja 4
basobola 4
bava 4
bavudde 4
bayinza 4
bbiri 4
bbo 4
bo 4
brovad 4
bumativu 4
burundi 4
byonna 4
chris 4
david 4
ddiiru 4
ebidduka 4
ebifo 4
ebikolwa 4
ebiri 4
eggye 4
ekibuga 4
ekifo 4
ekintu 4
ekiragiro 4
ekutte 4
ekya 4
ekyo 4
emyaka 4
enju 4
enkadde 4
enkulu 4
enkwe 4
ennyumba 4
entekateeka 4
erina 4
eyo 4
fayiro 4
february 4
ffamire 4
fr 4
frank 4
ggombolola 4
ggoolo 4
gumu 4
hotel 4
jjajja 4
kaggo 4
kaleerwe 4
kalule 4
kalungu 4
kibuyaga 4
kimu 4
kira 4
kiro 4
kitebe 4
kityo 4
kiwanuka 4
kkampuni 4
kkanso 4
kugenda 4
kwosa 4
kyakwa 4
kyengera 4
luguudo 4
lukiiko 4
luzira 4
lv 4
lwanga 4
lyato 4
male 4
masaka 4
muganda 4
muhammad 4
mukaziwe 4
muluka 4
mulundi 4
muntu 4
musango 4
museveni 4
mutendera 4
muzeeyi 4
mwe 4
nabawanda 4
nakasero 4
nigeria 4
nja 4
nkola 4
nnungi 4
nnusu 4
nnya 4
nsimbi 4
ntebe 4
nteekateeka 4
obujaketi 4
obutali 4
obwesige 4
okuggyako 4
okukoona 4
okukuuma 4
okulaga 4
okusabira 4
okutandika 4
okutendekebwa 4
okuwulirwa 4
okuyita 4
okuzimba 4
okweddiza 4
oludda 4
oluguudo 4
olutobazzi 4
oluvanyuma 4
omubiri 4
omukisa 4
omwezi 4
pulojekiti 4
road 4
rt 4
segirinya 4
ssatu 4
ssemateeka 4
ssesolo 4
talina 4
teri 4
ti 4
town 4
unesco 4
yagasseeko 4
zaake 4
1-0 3
13 3
15 3
17 3
2018 3
35 3
6 3
86 3
a 3
aba-gagga 3
abaagwa 3
abagambibwa 3
abagoberezi 3
abakungubazi 3
abaliko 3
abalumiriza 3
abamawulire 3
abamyuka 3
abasajja 3
abasuubuzi 3
abattakisi 3
abatuula 3
abayizi 3
afrika 3
aga 3
agasseeko 3
akakiiko 3
akiikirira 3
akutte 3
alam 3
amaduuka 3
amawulire 3
amaze 3
annyonnyola 3
asobola 3
asoose 3
ategezeeza 3
ategezezza 3
attise 3
august 3
augustine 3
awabadde 3
awadde 3
awaka 3
ayogera 3
azzeemu 3
baakutte 3
baakwatibwa 3
baakwatiddwa 3
baba 3
babaka 3
babawadde 3
bafuna 3
bagambye 3
baggya 3
bakanyama 3
bakutte 3
balumiriza 3
baminisita 3
bamukuba 3
bana 3
bassaabasumba 3
batwalibwa 3
baweereddwa 3
bbanka 3
beemulugunya 3
betty 3
bingi 3
botswana 3
buikwe 3
bukya 3
bulijjo 3
burkina 3
butabika 3
butonde 3
buvuddeko 3
bwabadde 3
bwaise 3
bweyogerere 3
byabwe 3
byobulimi 3
commonwealth 3
covid-19 3
cup 3
dda 3
ddwaliro 3
dl 3
ebadde 3
ebigambo 3
ebipande 3
ebiragiro 3
ebitabo 3
ebitongole 3
edward 3
eggombolola 3
egy 3
ejja 3
ekibinja 3
ekikula 3
ekirala 3
ekizimbe 3
ekola 3
emiggo 3
emirala 3
emizannyo 3
emmundu 3
empapula 3
emperor 3
emu 3
endala 3
enddwadde 3
enduulu 3
engulu 3
enkola 3
ennyo 3
ensiike 3
ensoma 3
eragidde 3
essaawa 3
ewa 3
ewedde 3
eyamba 3
ezaabadde 3
faso 3
forest 3
gab 3
galabuzi 3
gayaza 3
ge 3
george 3
giants 3
guli 3
gutandike 3
i 3
james 3
jesus 3
john 3
july 3
june 3
justine 3
kabenje 3
kaguli 3
kaliro 3
kanungu 3
kasangati 3
kasimagwa 3
kasirivu 3
katende 3
kayunga 3
kibinja 3
kiddiridde 3
kigezi 3
kiggundu 3
kitaka 3
kitegeeza 3
kitintale 3
kituufu 3
kiwatule 3
kkanisa 3
kkansala 3
kkono 3
kubikkulirwa 3
kujja 3
kusaba 3
kwongera 3
kwossa 3
kyeyo 3
l 3
lee 3
ligyoni 3
lunaku 3
lwakataka 3
lwokuna 3
lyabwe 3
lye 3
makya 3
man-hee 3
masomero 3
mawanga 3
mayiga 3
mengo 3
metropolitan 3
misango 3
mmande 3
model 3
motors 3
mubajje 3
mukolo 3
mukulonda 3
munnayuganda 3
munne 3
munyalo 3
mupiira 3
musa 3
mutasingwa 3
muzannyo 3
muzibu-azaalampanga 3
mw 3
nabasirye 3
nabuduwa 3
najjuuko 3
nakajumba 3
nateete 3
nkiiko 3
nnaku 3
nnamukadde 3
nnyina 3
nnyumba 3
north 3
obore 3
obubenje 3
obudde 3
obujulizi 3
obukuba 3
obulabe 3
obulunzi 3
obulwadde 3
obupiira 3
obutakkaanya 3
obutonde 3
obutujju 3
obwedda 3
obwegassi 3
oku 3
okubaako 3
okubatulugunya 3
okubiri 3
okufera 3
okufuuka 3
okugenda 3
okukolera 3
okukozesa 3
okulambula 3
okuleeta 3
okumukwata 3
okunnyikiza 3
okusala 3
okusooka 3
okusuula 3
okutendeka 3
okutuukirira 3
okutwala 3
okuwa 3
okuwedde 3
okuyambako 3
okuzannya 3
okuzza 3
okw 3
okwekuuma 3
old 3
olukung 3
olusirika 3
omubeezi 3
omugagga 3
omukka 3
omuliro 3
omulundi 3
omutuuze 3
omuwaabi 3
omuwala 3
omuzannyo 3
omuzikiti 3
omwami 3
paalamenti 3
paasita 3
park 3
paul 3
rcc 3
sam 3
sheema 3
shincheonji 3
simon 3
siriimu 3
ssaako 3
ssaza 3
ssekamatte 3
ssinga 3
steven 3
tekinologiya 3
tewali 3
togo 3
ttabi 3
ttivvi 3
tumwine 3
updf 3
ura 3
waabaddewo 3
wadde 3
yafuna 3
yamaze 3
yasoose 3
yekka 3
yiika 3
yit 3
yonna 3
ze 3
zigenda 3
zonna 3
0 2
16 2
176 2
20 2
2010 2
2017 2
22 2
25 2
300 2
32 2
39 2
45 2
5-2 2
57 2
88 2
90 2
aba-kulembeze 2
abaabadde 2
abaaziikibwa 2
abafuna 2
abagenda 2
abagenzi 2
abagoba 2
abakristu 2
abakulira 2
abakulu 2
abakyamu 2
abalemesa 2
abalonzi 2
abasawo 2
abasoba 2
abasodokisi 2
abatujju 2
abavuga 2
abawagizi 2
abawanguzi 2
abayambeko 2
abazze 2
abdul 2
abeebyokwerinda 2
abyogeredde 2
aduumira 2
african 2
afudde 2
afuna 2
agaana 2
agabadde 2
agali 2
agamu 2
aggulawo 2
akaaba 2
akabizzi 2
akafuzi 2
akagudde 2
akandinda 2
akkiriza 2
akoze 2
akuba 2
akubira 2
akulembedde 2
akwasizza 2
akwatiddwa 2
akyaddeko 2
alaajana 2
alagidde 2
aliko 2
amaanyi 2
amangu 2
amannya 2
amansi 2
amapenzi 2
amasomero 2
amayinja 2
amir 2
amon 2
amugambye 2
amukuba 2
amulagira 2
amutegeezezza 2
amuwaako 2
anadda 2
ani 2
apetayiti 2
april 2
asimbiddwa 2
asinzidde 2
asoma 2
asudde 2
atannategeerekeka 2
atongozza 2
attibwe 2
atudde 2
atunda 2
australia 2
ava 2
ave 2
awakanya 2
awamu 2
awera 2
ayimbulwa 2
ayimbulwe 2
ayingidde 2
ayogerako 2
azaala 2
baakoze 2
baakubidde 2
baamaze 2
baatadde 2
baazimba 2
babakuba 2
babeera 2
babwe 2
badda 2
baffe 2
bafuluma 2
bagende 2
bajjo 2
bakafulu 2
bakansala 2
bakazi 2
bakazibaggya 2
bakiikirira 2
bakiise 2
bakira 2
bakkaanya 2
bakoona 2
bakoze 2
bakulembeddwa 2
bakulembeze 2
bakulira 2
bakung 2
bakuuma 2
bakyalina 2
balaajana 2
balinda 2
balumbye 2
baluzaawo 2
bamukutte 2
bamusuubizza 2
bamutwala 2
bamuwa 2
bamuyimbudde 2
bannabyabufuzi 2
bannaffe 2
bannannyini 2
basinziira 2
basomeseddwa 2
basoose 2
bategeeza 2
batuuze 2
bavunaanibwe 2
bawaanyisiganya 2
bawakanya 2
bayibuli 2
bazimba 2
bazudde 2
bbanga 2
bbulooka 2
beekalakaasa 2
beeyongedde 2
bibadde 2
bibanja 2
bibiina 2
bibiri 2
bijjidde 2
bimuli 2
bintu 2
biva 2
bm 2
boda 2
brian 2
bubaka 2
bujaketi 2
bujulizi 2
bukakasizza 2
bukolwa 2
bulamu 2
buloba 2
bulola 2
bumenyi 2
bungi 2
buntu 2
busega 2
buuma 2
bwangu 2
bwenkanya 2
byakare 2
bypass 2
caleb 2
cameroon 2
central 2
ch 2
charles 2
chikarito 2
christopher 2
chwa 2
col 2
community 2
companies 2
cranes 2
ddembe 2
ddyo 2
development 2
doreen 2
ebayambeko 2
ebbanga 2
ebibadde 2
ebidongo 2
ebigere 2
ebikondo 2
ebinnya 2
ebiro 2
ebisobola 2
ebisolo 2
ebisongovu 2
ebitundu 2
ebizimbe 2
ebyenfuna 2
ebyenjawulo 2
ebyenjigiriza 2
ebyuma 2
eddagala 2
eddakiika 2
eddiini 2
egenda 2
egiwera 2
egiyise 2
ejulirwamu 2
ekibira 2
ekigendererwa 2
ekika 2
ekikolwa 2
ekikopo 2
ekikugu 2
ekirwadde 2
ekisangibwa 2
ekisinze 2
ekiteeso 2
ekituufu 2
ekivaako 2
ekivunaanyizibwa 2
ekiyitibwa 2
ekkomera 2
ekkwaano 2
eklezia 2
eklisia 2
ekoze 2
ekyabadde 2
ekyakeesezza 2
ekyalo 2
ekyama 2
emabega 2
emidaali 2
emigaso 2
emirundi 2
emiti 2
emitwalo 2
emmanuel 2
emumenya 2
emyooga 2
endagaano 2
endwadde 2
engazi 2
enguzi 2
enjiri 2
enkaayana 2
enkolagana 2
ensala 2
ensonda 2
entaana 2
entalo 2
entambula 2
entegeka 2
enzannya 2
enzikiriza 2
eriko 2
erimu 2
erinnya 2
eririko 2
ery 2
eryawamu 2
esembayo 2
esobola 2
essaala 2
essanyu 2
essaza 2
essuubi 2
etandise 2
ettemu 2
eyafa 2
eyakubiddwa 2
eyaliko 2
eza 2
ezaali 2
eziri 2
ezitali 2
eziva 2
eziwerako 2
fc 2
ffujjo 2
galimu 2
gamuttirawo 2
gav 2
geegasse 2
geeti 2
gen 2
general 2
gino 2
group 2
gyebayinza 2
gyonna 2
hangoova 2
hassan 2
health 2
henry 2
homeboyz 2
house 2
hubert 2
iii 2
jackson 2
janet 2
jk 2
juma 2
kaabuyonjo 2
kaduukulu 2
kakurungu 2
kansala 2
karuna 2
kasaana 2
kasim 2
kasolo 2
kasubi 2
katonda 2
katono 2
katungi 2
ki 2
kibanja 2
kibuli 2
kibuuka 2
kigo 2
kigozi 2
kimenyebwa 2
kirima 2
kitalya 2
kitatta 2
kitongole 2
kizito 2
klesia 2
konsitityusoni 2
kontulakiti 2
kooti 2
kubeera 2
kubwa 2
kufuba 2
kufuna 2
kukuba 2
kukwatagana 2
kulaba 2
kulawuna 2
kulwana 2
kutuula 2
kuyamba 2
kuyambako 2
kweddiza 2
kwekuba 2
kwogasse 2
kwogera 2
kwokya 2
kyangatto 2
kyebakutika 2
kyetume 2
kyonna 2
laawundi 2
lawrence 2
lc 2
limanda 2
lodge 2
looya 2
lubadde 2
lubega 2
ludda 2
lukaya 2
luke 2
lukung 2
lungujja 2
lutalo 2
lutuula 2
luvannyuma 2
luyombya 2
luzannya 2
lwaki 2
lwokusatu 2
lwokutaano 2
lwomukaaga 2
maanyi 2
mabega 2
madrama 2
mafu 2
maganjo 2
maj 2
majeme 2
majeri 2
makerere 2
makubo 2
mangu 2
mapeera 2
mariam 2
mataka 2
matovu 2
mayirungi 2
mazzi 2
mbale 2
mbu 2
mbuya 2
mikwano 2
minisitule 2
mirembe 2
mmeeya 2
mpanga 2
mubantu 2
mubiru 2
mugambwa 2
mugema 2
mukaaga 2
mukulembeze 2
mukutu 2
mukwano 2
mulago 2
musigansimbi 2
musomo 2
mutabani 2
muteesa 2
mutimbagano 2
mutuba 2
mutuuze 2
mutwe 2
mwami 2
nabyo 2
naggulu 2
najjuma 2
namakula 2
namba 2
national 2
nayiga 2
nayo 2
ndiizi 2
nema 2
nguudo 2
njia 2
nju 2
nkolagana 2
nkumba 2
nnannyini 2
northern 2
nsaba 2
nsalessale 2
nsi 2
nsubuga 2
ntandikwa 2
ntinda 2
nzikiriza 2
obubaweereddwa 2
obubonero 2
obujjulizi 2
obukodyo 2
obukugu 2
obukuumi 2
obulimi 2
obunabbi 2
obuntu 2
obusolya 2
obutemu 2
obuwanana 2
obuyambi 2
obuyinza 2
obuzito 2
obw 2
obwa 2
obwakabaka 2
obwenkanya 2
ogubalagala 2
ogusoose 2
oguwedde 2
ogwa 2
ogwasooka 2
ogwel 2
okkuuma 2
okubadde 2
okubakolako 2
okubalaatira 2
okubifunamu 2
okubikkulirwa 2
okubongera 2
okuddaabiriza 2
okufiira 2
okugamba 2
okugezaako 2
okuggulwawo 2
okuggya 2
okugwa 2
okukendeeza 2
okukkaanya 2
okukomya 2
okukoonagana 2
okukwatibwa 2
okukyusa 2
okulonda 2
okulumbibwa 2
okulya 2
okumalawo 2
okumanya 2
okumpi 2
okumuguza 2
okumusiba 2
okuna 2
okusomoozebwa 2
okusunsulamu 2
okutambula 2
okutambuza 2
okutandikira 2
okuteeka 2
okuteesa 2
okutereeza 2
okutigomya 2
okutta 2
okutulugunyizibwa 2
okutumbula 2
okutunda 2
okutuula 2
okutyoboola 2
okuvvunuka 2
okuwagira 2
okuyingira 2
okwagala 2
okwamuka 2
okwegatta 2
okwekalakaasa 2
okwemulugunya 2
okwenjawulo 2
okwetaba 2
okwetandikirawo 2
okwetegeka 2
okwewala 2
okweyimirirwa 2
okwogera 2
olumbe 2
olunaku 2
oluusi 2
olwaleero 2
omuberyeberye 2
omukiise 2
omukungu 2
omukwanaganya 2
omupya 2
omuserikale 2
omusiguze 2
omutendesi 2
omuvubuka 2
omuwandiisi 2
omuwawabirwa 2
omwali 2
omwoyo 2
opendi 2
owners 2
owoyesigyire 2
panadol 2
parish 2
patrick 2
pikipiki 2
polof 2
ppaasi 2
prof 2
pulaani 2
pulo 2
rally 2
rashid 2
reunion 2
rubaga 2
saako 2
sands 2
sc 2
sd 2
secretariate 2
securiko 2
semuto 2
senegal 2
sewanyana 2
shaban 2
sj 2
sm 2
so 2
ssabanyala 2
ssabawaali 2
sseggwandiisizo 2
ssegirinnya 2
ssekaana 2
ssekindi 2
ssempala 2
ssese 2
ssukaali 2
sukaali 2
supreme 2
t 2
tanzania 2
tebaliiwo 2
tebasobodde 2
teyava 2
ttula 2
tunisia 2
twagala 2
twahilah 2
university 2
villa 2
vipers 2
waayo 2
waffe 2
wandegeya 2
wasswa 2
women 2
yafiiridde 2
yafunye 2
yakola 2
yakubiddwa 2
yakwatiddwa 2
yalagidde 2
yannyonnyodde 2
yasanga 2
yasse 2
yatadde 2
yategezezza 2
yatuuse 2
yayongeddeko 2
yeetaba 2
yu 2
yunifoomu 2
yunus 2
zambia 2
zimbabwe 2
ziyita 2
zoom 2
zzooni 2
