num 2635
mu 1695
na 414
ku 363
kkumi 311
bbiri 299
era 271
emu 262
abiri 258
ne 258
ssatu 228
mukaaga 204
yakuwa 204
nti 186
kamu 159
lukumi 156
eya 147
katonda 146
nga 138
musanvu 135
no 133
mitwalo 132
ebya 122
kikumi 122
bwe 121
bya 115
ttaano 115
oba 113
olwa 112
asatu 111
nnya 109
bayibuli 107
omu 107
munaana 98
naye 91
ebyo 89
mwenda 85
ekya 76
bo 74
lunaku 74
eri 69
ddala 67
bukadde 66
buli 66
ekiweebwayo 66
kya 66
kubanga 65
yesu 64
nkumi 60
oyo 59
ebiri 58
omuntu 58
ya 57
ebitabo 55
busiriivu 54
bye 54
lwa 53
wa 52
abantu 51
abo 51
ensi 51
abalala 50
ogu 49
intaneeti 48
ekyo 47
e 46
nsi 45
embaga 44
nge 44
omusajja 44
ana 43
empya 42
gumu 42
ga 41
ebintu 40
ebyawandiikibwa 40
kye 40
yokaana 40
ennaku 39
bitabo 38
maaso 37
singa 37
abassessalonika 36
bassekabaka 36
ebyomumirembe 36
enkyusa 36
kasiriivu 36
olunaku 36
omukazi 36
peetero 36
samwiri 36
univ/art 36
univ_sqr_xl 36
url 36
okuva 35
amaanyi 34
gwonna 34
gye 34
kino 34
ze 34
byonna 33
nze 33
obut 33
ssabbiiti 33
enjiri 32
obuseegu 32
ye 32
kiba 31
ngo 31
abakkolinso 30
abalalaweereza 30
bubiri 30
bufukunya 30
busedde 30
buwumbi 30
ebibi 30
ekyokebwa 30
jpg 30
lugandasoma 30
mutwalo 30
nnyo 30
za 30
ba 29
emmere 29
kyonna 29
musa 29
wammwe 29
abaleevi 28
abayisirayiri 28
okubiri 28
gwe 27
okuba 27
okumala 27
omuliro 27
agamba 26
ate 26
ayagala 26
essaala 26
ndi 26
waliwo 26
mutima 25
okukola 25
amaaso 24
buna 24
date 24
erikkakkanya 24
eriweweeza 24
okulaba 24
omusanvu 24
owa 24
ataano 23
awamu 23
be 23
kiseera 23
nja 23
abamu 22
byaliyo 22
ebifaananyi 22
ekibi 22
mulimu 22
okusaba 22
temukolanga 22
aba 21
ayogera 21
bisatu 21
ekisooka 21
emigaati 21
kitaawe 21
kyange 21
mwaka 21
olubereberye 21
omusaayi 21
anattibwanga 20
ensolo 20
kwe 20
munne 20
nkaaga 20
wo 20
zaffe 20
awo 19
engero 19
eyo 19
yenna 19
abakkolinsoabaggalatiyaabeefesoabafiripiabakkolosaayi 18
ai 18
akawungeezi 18
alya 18
amateeka 18
biba 18
bibiri 18
bonna 18
busatu 18
bwange 18
ebibala 18
ebikolwaabaruumi 18
ebikwata 18
ebirowoozo 18
ekyabalamuziluusi 18
ekyamateekayoswa 18
empeke 18
engeroomubuulizi 18
esezayobuzabbuli 18
ezeekyeridanyerikoseyayoweeriamosi 18
ezeranekkemiya 18
gamba 18
gwange 18
kirongoofu 18
kitabo 18
lukka 18
munaawangayo 18
musaba 18
nnannyini 18
okubala 18
okubikkulirwa 18
okukungubaga 18
olukuŋŋaana 18
olutukuvu 18
oluyimba 18
pulintaweereza 18
sindika 18
sulemaaniisaayayeremiya 18
timoseewo 18
timoseewotitofiremooniabebbulaniyayakobo 18
weereza 18
yokaanayuda 18
aneegattanga 17
banattibwanga 17
bombi 17
ekintu 17
ggulu 17
go 17
matayo 17
moleki 17
obadiyayonamikkanakkumukaabakuukuzeffaniyakaggayizekkaliyamalakimatayomakkolukkayokaana 17
okutuusa 17
olwo 17
omusango 17
abayigirizwa 16
baawandiika 16
bituufu 16
ekyokulabirako 16
emirembe 16
gange 16
kintu 16
nsonga 16
obulungi 16
okuwuliriza 16
okwewala 16
tewali 16
afa 15
amugamba 15
baba 15
ebibereberye 15
ekkumi 15
endiga 15
ennume 15
essuula 15
kyali 15
lunaabanga 15
mbaga 15
muganda 15
ngeri 15
obo 15
olusooka 15
omwezi 15
yonna 15
ebigambo 14
egamba 14
ge 14
gwo 14
ka 14
lya 14
munaabanga 14
musango 14
naawe 14
nnali 14
olaba 14
olwekyo 14
wadde 14
batukuvu 13
bwa 13
ebituli 13
engeri 13
kifo 13
kiyinza 13
kristo 13
kukkiriza 13
atugamba 12
bannabyafaayo 12
bina 12
bintu 12
biseera 12
byammwe 12
byange 12
ebyogerwako 12
egitali 12
egya 12
ekyasooka 12
ensobi 12
etaano 12
gunaabanga 12
gwa 12
gwabwe 12
kabona 12
kenda 12
kitaffe 12
kyasa 12
lukaaga 12
lumu 12
mizimbulukuse 12
mukwano 12
munaalangiriranga 12
nnyina 12
obulaga 12
obwa 12
okuddamu 12
okukungula 12
oluddirira 12
omubiri 12
si 12
tuba 12
tulina 12
yammwe 12
yazuukira 12
aleme 11
asobola 11
bakoze 11
bange 11
bangi 11
butuufu 11
eneebanga 11
eno 11
entukuvu 11
kitegeeza 11
lwe 11
mirembe 11
muka 11
mutukuvu 11
ogwo 11
okulya 11
okusobola 11
waffe 11
abakristaayo 10
amayinja 10
baana 10
bakkiriza 10
boogera 10
byawandiikibwa 10
ebikolwa 10
ebitukuvuebya 10
gya 10
kwa 10
leero 10
lita 10
lusanvu 10
nkola 10
ojja 10
okwegomba 10
omuze 10
sikoni 10
ssaala 10
tumusaba 10
tusaba 10
we 10
yange 10
ajja 9
amakondeere 9
atalya 9
balamu 9
bantu 9
beera 9
bigambo 9
ebiweebwayo 9
ekikyamu 9
ekinywa 9
ekitali 9
ekiwuubibwa 9
emiti 9
ensiisira 9
ento 9
ettaano 9
ffe 9
gu 9
kinneeraliikiriza 9
kiraga 9
laga 9
lup 9
lwaki 9
mmwe 9
mukama 9
munaabeeranga 9
munaakwatanga 9
munaaleetanga 9
mutwe 9
mwannyina 9
mwezi 9
nnina 9
nsiisira 9
obwenyi 9
obwenzi 9
ofuna 9
okunywa 9
okutangirirako 9
okuvvuunulwa 9
olulala 9
oluvannyuma 9
osoma 9
wakati 9
wanaabangawo 9
yali 9
zinaabanga 9
zino 9
abawandiisi 8
aka 8
alaba 8
baabuulira 8
bayita 8
bulumi 8
bwesimbu 8
bwo 8
ebiseera 8
efa 8
embala 8
emirundi 8
endagaano 8
ennyiike 8
eza 8
gavana 8
ggyayo 8
gyammwe 8
gyonna 8
isaaya 8
kiki 8
kitundu 8
kuba 8
kusalira 8
mwennyamivu 8
obukakafu 8
obuvumu 8
okufuba 8
okufuna 8
okugwa 8
okukemebwa 8
okukkiriza 8
okuziyiza 8
otya 8
oyinza 8
yakobo 8
yalabikira 8
yobu 8
agenda 7
ali 7
amannya 7
bazzukulu 7
biki 7
bwangu 7
ebiragiro 7
ebirungi 7
erinnya 7
kennyini 7
kweyongera 7
kwogera 7
mbeera 7
mubeere 7
obanga 7
okufuga 7
okutunuulira 7
okuyitako 7
tumubuulire 7
tusaanidde 7
wansi 7
yafa 7
abaali 6
ababeera 6
abalamu 6
abeera 6
abuulira 6
abuusabuusa 6
agaana 6
akozesa 6
akuba 6
alina 6
alutwala 6
amakungula 6
amatabi 6
amuwe 6
anaaba 6
asaba 6
asalawo 6
atusonyiwa 6
awaddeyo 6
awangule 6
awatali 6
aweebudde 6
awulire 6
ayenda 6
ayitibwa 6
bamenya 6
banaabonerezebwanga 6
banaamukubanga 6
batyo 6
beesimbu 6
bigyaamu 6
bikwatagana 6
bimu 6
binaabanga 6
bisangibwa 6
bitaano 6
bitangaavu 6
bitundu 6
biweebwayo 6
bubwe 6
bulamu 6
butaano 6
byali 6
ebibuga 6
ebijwenge 6
ebimuli 6
ebina 6
ebirime 6
ebisangibwa 6
ebisanyusa 6
ebitali 6
ebitukuvu 6
ebizibu 6
ebyayita 6
edda 6
eddungi 6
efaya 6
ekibiina 6
ekibuuzo 6
ekigenderako 6
ekigendererwa 6
ekinyonyi 6
ekitundu 6
ekiwonvu 6
ena 6
enjawulo 6
enkuŋŋaana 6
ennamu 6
entuufu 6
essanyu 6
evvumbe 6
eyaakakungulwa 6
eyayogeddwako 6
ezaawandiikibwa 6
eziyinza 6
ggwe 6
gulwadde 6
gwaffe 6
jpgobwa 6
kabaka 6
kafuumuulampawu 6
kanaana 6
kati 6
kesuboni 6
kibi 6
kikemo 6
kikulu 6
kinaabanga 6
kirungi 6
kitali 6
kola 6
kuddamu 6
kusuubira 6
kuwummulira 6
kuyimirira 6
kuziyiza 6
kwaffe 6
kwolekeza 6
kyangu 6
kyokka 6
lubeerera 6
lukuŋŋaana 6
luno 6
lutukuvu 6
luuyi 6
lwenda 6
maanyi 6
makulu 6
malaki 6
mawanga 6
mazima 6
mpulunguse 6
mubanga 6
mukakafu 6
mukwatenga 6
mumaze 6
munaabalanga 6
munda 6
muneebonyaabonyanga 6
muwaayo 6
muwala 6
muzizo 6
nabo 6
obudde 6
obukumi 6
obulamu 6
obulumi 6
obutaggwaawo 6
obutakkiririza 6
obutaliimu 6
obuwunga 6
obwereere 6
okufaananako 6
okufuuwa 6
okukakasanti 6
okukuviirako 6
okusoma 6
okuwaayo 6
okuzibya 6
oli 6
olumu 6
oluyonaani 6
olya 6
omukisa 6
omukwano 6
omulala 6
omulamu 6
omulimu 6
omululu 6
omunaana 6
omunafu 6
omuto 6
omuzizo 6
soma 6
ssaddaaka 6
ssuubi 6
takyagala 6
talya 6
tayagala 6
tebandibadde 6
tebyaliyo 6
tebyandibadde 6
temuddiŋŋananga 6
temufuna 6
tetuyinza 6
tteeka 6
tuddiŋŋane 6
tufa 6
tufuba 6
tuli 6
tumanyi 6
tumubuulira 6
tumusabye 6
tumutwala 6
twagala 6
twakola 6
twakwata 6
twenenya 6
wabula 6
wandiwulidde 6
watya 6
yagaana 6
yeebaza 6
zange 6
zzaala 6
ababa 5
abamulindirira 5
abasamize 5
akabi 5
alabika 5
amuzuukiza 5
amwegomba 5
anaabanga 5
awulira 5
baamukomerera 5
baamukuba 5
baamusibako 5
bajja 5
balala 5
bali 5
bazadde 5
bino 5
cody 5
ddyo 5
dylan 5
ebikemo 5
ebimu 5
ebingi 5
ebitukuvuabaruumi 5
ebitukuvuekyamateeka 5
ebitukuvuokubala 5
ebitukuvuzabbuli 5
ekirala 5
ekitiibwa 5
ezo 5
ffenna 5
gammwe 5
kale 5
kimu 5
kompyuta 5
kuttibwa 5
laba 5
misiri 5
mujja 5
muntu 5
musigale 5
musobole 5
muti 5
nkuŋŋaana 5
nsobola 5
obugambo 5
obuli 5
obumu 5
obusamize 5
okutta 5
okwegatta 5
okwenda 5
olukwe 5
omunazaaleesi 5
omutima 5
omuwala 5
omwoyo 5
osobole 5
sisobola 5
teweesittaza 5
tukolerere 5
tulabe 5
yafiira 5
yagamba 5
yattibwa 5
zokka 5
abaaliwo 4
abaaliyo 4
abaayogera 4
abamutta 4
abaruumi 4
abasukka 4
abatume 4
aboogerwako 4
alonderera 4
alunoni 4
atuyamba 4
ayogerwako 4
azuukiziddwa 4
b 4
baakola 4
babuusabuusa 4
badda 4
baggwaamu 4
bakakafu 4
bakimanya 4
bandibuulidde 4
bateekenga 4
battangamu 4
bayigirizwa 4
bikakasa 4
bingi 4
birowoozo 4
bisuniya 4
biwa 4
bukakafu 4
buyisi 4
bwebaamulaba 4
ddungu 4
ebifo 4
ebikyaliwo 4
ebiyinza 4
ebweru 4
ebyafaayo 4
ebyaliwo 4
egiwerako 4
ekiddako 4
ekigambo 4
ekiri 4
ekwatagana 4
ekyaleetera 4
ekyasa 4
embeera 4
enkukunala 4
ensongalwakiyesu 4
esawu 4
eyalina 4
eyazaalibwa 4
eyeenenyezza 4
eyogerwako 4
fuba 4
josephus 4
kalonda 4
kigenda 4
kufa 4
kugamba 4
kukakasa 4
kuzuukira 4
kyabwe 4
lowooza 4
lyasibuka 4
mba 4
mubikwate 4
mugulansigo 4
mukono 4
munnabyafaayo 4
mwe 4
nfumo 4
nnalemererwanga 4
nneewala 4
nnyumba 4
nsobi 4
ntandikwa 4
nzikiriza 4
obufuzi 4
obukristaayo 4
obuku 4
obutaddamu 4
okubaviirako 4
okubuna 4
okubuusabuusa 4
okukakasa 4
okukuumira 4
okulowooza 4
okumanya 4
okumuleetera 4
okusibibwa 4
okusinza 4
okuttibwa 4
okutwala 4
okuvvuunuka 4
okuzuukira 4
olusiisira 4
omuyudaaya 4
ononguza 4
onoosoma 4
onootegeera 4
piraato 4
pliny 4
pontiyo 4
saba 4
seyiri 4
sikozesa 4
suetonius 4
t 4
tacitus 4
tebaali 4
tebaasooka 4
tennatandika 4
tiberiyo 4
troy 4
tutaano 4
twawamba 4
waggulu 4
yabonaabona 4
yabonyaabonyezebwa 4
yaliyo 4
yaliyoobutafaananako 4
yattibwamu 4
yawandiika 4
younger 4
zabbuli 4
abaagala 3
abaavu 3
abaawudde 3
abafu 3
abagwira 3
abakola 3
abalabe 3
abalaguzi 3
abampalana 3
abamwegattako 3
abankyawa 3
abanoonya 3
abassessaloniika 3
abatukuza 3
abe 3
abeere 3
abenzi 3
akabokisi 3
akajiiko 3
akajja 3
akakwate 3
akifuula 3
akitwala 3
akkiriza 3
akkirizibwa 3
akolimidde 3
akwata 3
alekere 3
alukwata 3
alyennyonnyolako 3
alyoke 3
amafuta 3
amalala 3
amanye 3
amata 3
amawanga 3
amawulire 3
amaze 3
anaagendanga 3
anaagwa 3
anaakiwuubawuubanga 3
anaakiwuubirawuubiranga 3
anaakolanga 3
anaakolimiranga 3
anaasembereranga 3
anaawangayo 3
anaawuubawuubanga 3
anaayendanga 3
anaayimirira 3
anaayokebwanga 3
ani 3
asalira 3
asiimibwa 3
asingibwa 3
ataasiibenga 3
atalina 3
atawulira 3
atayogera 3
ateebonyeebonyengaku 3
ateesalira 3
ategeeza 3
atunuulira 3
atyo 3
avvoola 3
awasanga 3
aweereza 3
azaala 3
azuukira 3
baabwe 3
babuusa 3
bafuuse 3
bafuuwa 3
bagamba 3
bakemebwa 3
bakola 3
balabe 3
balaze 3
baleme 3
balyoke 3
bamanye 3
bammwe 3
banaabeeranga 3
bansasulamu 3
bantega 3
basamize 3
batamutta 3
beeyongedde 3
bibi 3
bikemo 3
bimera 3
binaawebwangayo 3
binaaweebwangayo 3
birabo 3
biri 3
birongoofu 3
birungi 3
bisigalidde 3
bitanye 3
bitukuvu 3
biwonvu 3
biwunya 3
bookera 3
bugenderevu 3
bugwenyufu 3
buleme 3
bunfumitidde 3
buswavu 3
butegeeza 3
butukuvu 3
butuukirivu 3
buzaaliranwa 3
bwanguekyokulabirako 3
byuma 3
ebbiri 3
ebe 3
ebigenderako 3
ebikoola 3
ebimyanso 3
ebinaabanga 3
ebinaakuyamba 3
ebireeta 3
ebituyamba 3
ebiva 3
ebiwundu 3
ebyokebwa 3
ebyuma 3
egikoleddwa 3
eginaddirira 3
egisingayo 3
egyo 3
ekifaananyi 3
ekifo 3
ekigere 3
ekigereke 3
ekikolwa 3
ekimuviirako 3
ekirongoofu 3
ekiruyi 3
ekiseera 3
ekisoboka 3
ekitakolebwa 3
ekitangaala 3
ekitukuvu 3
ekiwato 3
ekizimbulukusa 3
ekulukuta 3
ekyesittaza 3
ekyewalula 3
embuzi 3
emirimu 3
emisango 3
emitego 3
empapula 3
emyalava 3
endala 3
enderedde 3
endowooza 3
eneebeeranga 3
enjuki 3
enkaliriza 3
enkindu 3
ennimiro 3
ennongoofu 3
ennya 3
ensiike 3
ensonga 3
ente 3
entebe 3
envinnyo 3
ereme 3
eriiso 3
erya 3
eryo 3
etali 3
etasussa 3
ettukuvu 3
eziva 3
ezzeyituuni 3
gakoze 3
gakyusiddwa 3
gampeddemu 3
gayinza 3
gifumbibwanga 3
girimu 3
gonna 3
gukuba 3
guli 3
gunaaba 3
gunnyigiriza 3
guno 3
isirayiri 3
kamwa 3
kange 3
katono 3
kiggala 3
kikolwa 3
kinaaleetera 3
kinaawuubibwawuubibwanga 3
kiramu 3
kireetera 3
kiseeredde 3
kitaawo 3
kitiibwa 3
kituufu 3
kiviirako 3
kiweddewo 3
kizibu 3
kokka 3
kubeera 3
kugibawa 3
kujjukirwa 3
kukuume 3
kuli 3
kulya 3
kumusaanyaawo 3
kumutta 3
kumwolekeza 3
kuna 3
kunyooma 3
kunywa 3
kusanyukira 3
kutangirirako 3
kutegeera 3
kutwala 3
kuzeetikka 3
kuzikiriza 3
kwagala 3
kwange 3
kwenda 3
kyawandiikibwa 3
kyazo 3
kyesittaza 3
kyeyagalire 3
kyo 3
kyokerera 3
lekera 3
liba 3
liggyemu 3
likwesittaza 3
lino 3
lirinfukaamirira 3
luganda 3
lujjudde 3
lulimi 3
lulinga 3
lulwe 3
lulyatula 3
lusinga 3
lwatu 3
lyange 3
lyo 3
maama 3
magumba 3
maka 3
mangu 3
mateeka 3
mbaawula 3
mbaggya 3
mbatwalamu 3
mbawa 3
mmanyi 3
mmenyesemenyese 3
mmutte 3
mube 3
mubeera 3
mubenga 3
mubirekeranga 3
mubiri 3
mugaati 3
mugittanga 3
mukazi 3
mukitwale 3
mukiwa 3
mukola 3
mukungudde 3
mukungula 3
mukungulanga 3
muleetanga 3
muli 3
mumalirire 3
munaagikwatanga 3
munaajagulizanga 3
munaakolanga 3
munaaleeterangako 3
munaalyanga 3
munakuwavu 3
muneetwaliranga 3
musajja 3
musembeze 3
musunguwavu 3
muttanga 3
mutukuzibwe 3
mutuukanga 3
muwangayo 3
mwawulanga 3
mwenge 3
mwetukuzenga 3
mwewale 3
mwokya 3
mwoyo 3
nange 3
nayo 3
nfuuse 3
ngakyaye 3
ngoba 3
njagala 3
nnabaawulirawo 3
nnabagamba 3
nnabeeza 3
nnabulako 3
nnagamba 3
nnakaggula 3
nnaku 3
nnalaba 3
nnalindirira 3
nnalinga 3
nnamanyirawo 3
nnayatula 3
nnongoofu 3
nnyama 3
nsalosalo 3
nsannyaladde 3
nsinda 3
nteekateeka 3
ntukuvu 3
nva 3
nzijuvu 3
obagambe 3
obubi 3
obugwenyufu 3
obulimba 3
obulokozi 3
obungi 3
obusaale 3
obusirusiru 3
obusungu 3
obutabuddwamu 3
obutafuna 3
obutakola 3
obutalya 3
obutanywa 3
obutateerawo 3
obwakabaka 3
obweyamo 3
ogenze 3
oggyayo 3
okemebwa 3
okubasesema 3
okubeeramu 3
okubi 3
okubiziyiza 3
okufa 3
okufugamu 3
okugatta 3
okumpi 3
okumusobozesa 3
okumuyimiriza 3
okumwendako 3
okunkola 3
okunneekulumbalizaako 3
okusalira 3
okusalirako 3
okusiiba 3
okusiimibwa 3
okusinda 3
okusinziira 3
okutuusiza 3
okutwalira 3
okuweerangako 3
okuwummulira 3
okuwummuliranga 3
okuyitira 3
okuzannyirira 3
okuzikiriza 3
okuzimbagana 3
okwebonyaabonya 3
okwerumya 3
okwesittala 3
okwewalira 3
okwewozaako 3
okwogerwako 3
okwonoona 3
oliko 3
olina 3
olinako 3
olisuule 3
oluganda 3
olunaalangirirwanga 3
omubisi 3
omugugu 3
omugwira 3
omukono 3
omulaguzi 3
omuli 3
omulubaale 3
omusawo 3
omutukuvu 3
omuweereza 3
omuyisirayiri 3
omuzito 3
omwana 3
omwenda 3
onakuwaza 3
onyooma 3
onywa 3
osaanidde 3
osalira 3
osobola 3
otokola 3
otyo 3
oweebudde 3
siwuliriza 3
siyasamya 3
siyinza 3
sukaali 3
talina 3
tebafuba 3
tebutegeeza 3
tekiba 3
tekukukwekeddwa 3
temubasosonkereza 3
temukungulanga 3
temulekanga 3
temuli 3
temulondereranga 3
temulyanga 3
temumusalira 3
temutambuliranga 3
temwefuulanga 3
teweegattanga 3
tokyatambulira 3
tomuzikiriza 3
tongolola 3
tonnenya 3
ttivi 3
tube 3
tufudde 3
tugendeko 3
tujja 3
tukole 3
tuyiga 3
twesanyuseemu 3
vviivi 3
wandifubye 3
wange 3
wanziramu 3
weegendereze 3
wiiki 3
wooteeri 3
yaabwe 3
yafiirira 3
yagattako 3
yakuwaasobola 3
yakuwabo 3
yalaga 3
yamukugaana 3
yamusembeza 3
yandyegasse 3
yansaba 3
yatandika 3
yeegatta 3
yeegattanga 3
yiniya 3
yogera 3
zammwe 3
zeetuumye 3
ze“nnina 3
ziringa 3
zonna 3
abaamoni 2
abaamusanga 2
abaana 2
abaasanga 2
abaava 2
abaavi 2
ababaka 2
ababonaabona 2
abadde 2
abafiripi 2
abakafutoli 2
abakazi 2
abakooli 2
abalala”bayibuli 2
abali 2
abamowaabu 2
abanaawulira 2
abasajja 2
abatalina 2
abawemula 2
agezesebwa 2
agwa 2
akaatulema 2
akaguwa 2
akemebwa 2
akuyambe 2
akuyambebo 2
akyali 2
alooni 2
aloweri 2
amangu 2
amazzi 2
amenye 2
amutugabula 2
anvu 2
anyoomye 2
asendebwasendebwa 2
asobole 2
attibwe 2
atukubiriza 2
atwalirizibwa 2
awaganyala 2
ayimuka 2
ayongera 2
aŋŋamba 2
baabazikiriza 2
baabeeranga 2
baamuleeta 2
bafiirwa 2
bamugambe 2
bankolera—okutuusa 2
bannange 2
banneewala 2
banywanyi 2
basobola 2
batabani 2
bbulu 2
bibuga 2
bigere 2
bitereera 2
bukaba 2
bulijjo 2
buno 2
bwabangamu 2
byabwe 2
byalo 2
byannyamba 2
byo 2
byokka 2
byoolwa 2
dawudi 2
ddalane 2
ebbali 2
ebibakwatako 2
ebibaleetera 2
ebikulu 2
ebikyamu 2
ebiriraanye 2
ebirongoofu 2
ebitaliimu 2
ebitenderezebwa 2
ebitundu 2
ebituufu 2
ebituukirivu 2
ebyagalibwa 2
ebyambalo 2
eggulu 2
egyaamu 2
ekibuga 2
ekikristaayo 2
ekinaakuyamba 2
ekiragiro 2
ekirwadde 2
ekisingira 2
ekisuubizo 2
ekituli 2
elsa 2
enda 2
enkugiro 2
ennyo 2
ensozi 2
eraamangu 2
etangira 2
eyabaggya 2
eyali 2
eyasaba 2
eyavvuunuka 2
eyeegombanga 2
eyinza 2
eziriko 2
ezirimu 2
filipe 2
firimu 2
fuga 2
gaabwe 2
gaaza 2
galemenga 2
gireyaadi 2
gukakanyala 2
gwammwe 2
gyabwe 2
gyange 2
jjukiranga 2
juan 2
kabuga 2
kafutolibwe 2
kedemosi 2
kigyaamu 2
kijja 2
kimukuba 2
kimukubire 2
kimutwala 2
kiri 2
kityo 2
kiwonvu 2
kkono 2
konna 2
kubaleetera 2
kubayamba 2
kugenda 2
kujjukiza 2
kukankana 2
kukikola 2
kukyama 2
kuleete 2
kulekera 2
kumutunuulira 2
kusanyusa 2
kutambulira 2
kutandika 2
kuyita 2
kuzaala 2
kwo 2
kyandibadde 2
luguudo 2
lus 2
lutalo 2
lwali 2
maanyiwatya 2
mabbali 2
magezi 2
manya 2
mikwano 2
mingi 2
mitawaana 2
mitima 2
mmala 2
mmuwaddeyo 2
mpite 2
mpitemu 2
mpolampola 2
mugende 2
mujjukire 2
mukutulansanja 2
mumalirivu 2
mumulwanyise 2
munywevu 2
musituke 2
musomoke 2
mutabani 2
mutandike 2
mutiini 2
mwokka 2
nate 2
ndaba 2
ndimusanyufu 2
ndowooza 2
nfuba 2
nkirage 2
nkugiro 2
nnaakuwanga 2
nnaakuyambanga 2
nnaalya 2
nnaanywa 2
nnaasomoka 2
nnafubanga 2
nnagiteeka 2
nnagiteekako 2
nnalagaana 2
nnalina 2
nnamugamba 2
nnandiyinzizza 2
nnasanyusa 2
nnasigala 2
nnatuma 2
nnayiga 2
nsaba 2
ntandise 2
ntuuka 2
ntya 2
nyiikira 2
nyweza 2
nzekka 2
obugaati 2
obukulu 2
obunafu 2
ofubye 2
okola 2
okubagobamu 2
okubirwanyisa 2
okubyeggiramu 2
okugenda 2
okugendamu 2
okuggyako 2
okujjukira 2
okukikola 2
okukiziyiza 2
okukugabula 2
okulabira 2
okuleetera 2
okumusaba 2
okumuwaayo 2
okunviirako 2
okusatu 2
okutabulwatabulwa 2
okutekemuka 2
okutunula 2
okutuuka 2
okutuukira 2
okutuwa 2
okutwaŋŋanga 2
okutya 2
okuwamba 2
okuyimuka 2
okuzirabanga 2
okweggyamu 2
okwenyigira 2
olubuto 2
olukugiro 2
oluliko 2
oluusi 2
omukyala 2
omunda 2
omunyago 2
omuteegevu 2
omutuukirivu 2
omuwandiisi 2
omuyonjo 2
omwamoli 2
omwesigwa 2
onnyambe 2
onokkiriza 2
onoofuba 2
otwaliddemu 2
owunjule 2
ozeewale 2
saagala 2
sijja 2
sikolagana 2
tandika 2
tebasembera 2
tekyali 2
temugobereranga 2
temwasemberera 2
tetutuukiridde 2
teyatukkiriza 2
toggwaamu 2
tombeera 2
toyosa 2
tumuwangula 2
tuyinza 2
tuzikiriza 2
twaggya 2
twalekawo 2
twatwala 2
wabaawo 2
wala 2
weewaawo 2
weewale 2
yabboki 2
yabitugabula 2
yafuluma 2
yakazi 2
yakolera 2
yalagira 2
yamuleka 2
yangewadde 2
yanguwa 2
yannyamba 2
yatugaana 2
yazikiriza 2
yeegomba 2
yeekweka 2
yeewalanga 2
yini 2
yo 2
yoludaani 2
