mu 471
ku 308
n 277
nga 258
nti 197
ne 151
e 115
ng 110
abantu 91
y 79
wa 78
era 66
bwe 58
olw 55
poliisi 52
ya 49
w 48
gavumenti 47
kino 43
ate 40
kyokka 40
bw 39
ye 39
kya 37
agamba 36
ttiimu 35
yagambye 35
uganda 32
b 31
bano 31
okuva 31
ono 31
abadde 28
yategeezezza 28
eno 27
be 26
eby 26
gye 26
pulezidenti 26
arsenal 25
ba 25
ssente 25
by 24
omu 24
emmere 23
eri 23
gwe 23
gy 23
kiseera 23
ky 23
1 22
ettaka 22
buli 21
naye 21
za 21
ab 20
akulira 20
gw 20
wabula 20
we 20
000 19
abaana 19
abatuuze 19
amawulire 19
enjawulo 19
ez 19
okufuna 19
omuggalo 19
z 19
kkooti 18
kubanga 18
ssentebe 18
yali 18
abamu 17
abasuubuzi 17
disitulikiti 17
emirimu 17
lwe 17
nnyo 17
abakulembeze 16
bino 16
covid 16
kcca 16
lw 16
ly 16
moise 16
wakati 16
ekya 15
kati 15
omuliro 15
wadde 15
ze 15
zino 15
abalala 14
amazzi 14
ebintu 14
embeera 14
guno 14
kampala 14
lino 14
oluvannyuma 14
omugenzi 14
abaserikale 13
agambye 13
bangi 13
july 13
kitundu 13
kuba 13
kye 13
okukola 13
ssekitoleko 13
ttaka 13
19 12
banne 12
eddagala 12
ekibuga 12
ekirwadde 12
eky 12
ggoolo 12
gwa 12
japan 12
jinja 12
lwa 12
minisita 12
mpaka 12
na 12
omuli 12
omuntu 12
ramsdale 12
sizoni 12
villa 12
2 11
3 11
abakadde 11
amateeka 11
bakola 11
busoga 11
emmotoka 11
emmwaanyi 11
emu 11
engeri 11
ensonga 11
ewedde 11
fc 11
ga 11
kkampuni 11
kw 11
kwe 11
leero 11
lya 11
muggalo 11
naddala 11
waliwo 11
10 10
abayizi 10
ali 10
alina 10
ategeezezza 10
bonna 10
bye 10
eggwanga 10
ekifo 10
ennyo 10
ey 10
ggoolokipa 10
ggwanga 10
katale 10
kyalo 10
lye 10
mwe 10
nteekateeka 10
okulaba 10
okuli 10
okutuuka 10
omubaka 10
omutindo 10
zaabwe 10
20 9
7 9
aba 9
baana 9
bya 9
ekitundu 9
emyaka 9
essuubi 9
eyali 9
kibuga 9
omukono 9
ow 9
south 9
wiiki 9
2021 8
abasawo 8
asabye 8
bwa 8
ddwaaliro 8
ekitongole 8
enjuki 8
g 8
ka 8
kigambibwa 8
langi 8
mulimu 8
nnamba 8
obulamu 8
okumala 8
olunaku 8
road 8
tanzania 8
yabadde 8
15 7
ababadde 7
abali 7
akakiiko 7
amaanyi 7
amatooke 7
asaba 7
august 7
ayagala 7
bagenda 7
bungereza 7
buno 7
bwabwe 7
byabwe 7
covid19 7
dr 7
ebbanga 7
empaka 7
ennaku 7
essaawa 7
gano 7
ge 7
gen 7
group 7
gya 7
iganga 7
k 7
kyabwe 7
lukiiko 7
luwalira 7
maaso 7
museveni 7
mutyaba 7
myaka 7
nabo 7
ndagaano 7
nsi 7
nsonga 7
obuwunga 7
obuzibu 7
okubeera 7
okuyamba 7
oluguudo 7
owa 7
si 7
ssabbuuni 7
ssimu 7
wamu 7
yadde 7
13 6
8 6
a 6
abasinga 6
abazannyi 6
abo 6
amagezi 6
amanyiddwa 6
and 6
baagala 6
baali 6
babadde 6
bagamba 6
bakolera 6
bali 6
balimwezo 6
balina 6
bannansi 6
bantu 6
begovic 6
bifo 6
bukedde 6
bulungi 6
bulusi 6
charles 6
city 6
ebibinja 6
ebifo 6
ebweru 6
ekibiina 6
emitwalo 6
enjala 6
ensimbi 6
essaza 6
express 6
haiti 6
katabaazi 6
kaweefube 6
kibiina 6
kifo 6
kuliko 6
kuno 6
luguudo 6
luweero 6
lwanga 6
mbeera 6
mmotoka 6
munaabi 6
muntu 6
musaayimuto 6
musango 6
mutimbagano 6
ngeri 6
nsubuga 6
obukadde 6
obulemu 6
obuyambi 6
obwedda 6
okugenda 6
okuwangula 6
okwongera 6
omuceere 6
omulimu 6
omusana 6
omuzannyi 6
ozil 6
so 6
ssaako 6
ssaza 6
steven 6
tebalina 6
tewali 6
tumwine 6
vision 6
yasabye 6
4 5
5 5
abaabadde 5
abakazi 5
abaliko 5
abalimi 5
abavubuka 5
africa 5
ag 5
agenda 5
asobola 5
avunaanyizibwa 5
awamu 5
bamu 5
basabye 5
buganda 5
burundi 5
byonna 5
cap-haitien 5
cup 5
dahmer 5
dda 5
divizoni 5
eddiini 5
ekyalo 5
embuto 5
endala 5
ensawo 5
erina 5
eya 5
fayinolo 5
ggombolola 5
gyabwe 5
kabaka 5
kawempe 5
kenya 5
kikuubo 5
kizito 5
maka 5
masaka 5
meeya 5
minisitule 5
nayo 5
nnamwandu 5
nsangi 5
oba 5
obuyinza 5
oku 5
okuba 5
okufunako 5
okumpi 5
okunoonyereza 5
okusobola 5
okuvaayo 5
olukiiko 5
olwa 5
olwo 5
olympics 5
omumyuka 5
omusajja 5
omuvubuka 5
omwogezi 5
patrick 5
pikipiki 5
premier 5
rowe 5
sc 5
singa 5
sipiika 5
ssekindi 5
university 5
waabwe 5
wano 5
weasel 5
yonna 5
23 4
30 4
48 4
50 4
abaguzi 4
abakola 4
abakyala 4
abato 4
afudde 4
akasawo 4
akola 4
akuumirwa 4
alaze 4
amaze 4
amerika 4
amyuka 4
asobole 4
association 4
atandika 4
awaka 4
awerekeddwaako 4
baabadde 4
baabwe 4
bafuna 4
bakansala 4
bakasitoma 4
banaaba 4
bannamawulire 4
bannayuganda 4
basanyukidde 4
basuubira 4
batono 4
bazannyi 4
bba 4
bbeeyi 4
biseera 4
bournemouth 4
bp 4
brentford 4
bulumbaganyi 4
bwonna 4
byalo 4
cecafa 4
central 4
cranes 4
ddala 4
ebeera 4
ebijanjaalo 4
ebiri 4
ebitongole 4
ebitundu 4
ebyokwerinda 4
egenda 4
ekikulu 4
ekirabo 4
emiggo 4
empya 4
ennyumba 4
ettendekero 4
eyagala 4
eyaliko 4
eyongedde 4
feni 4
francis 4
gomba 4
kakiiko 4
kampeyini 4
katongole 4
kayanja 4
kimera 4
kisaawe 4
kusiima 4
leno 4
liigi 4
lwokuna 4
lyonna 4
makerere 4
mayanja 4
micho 4
mubiru 4
mulago 4
mw 4
mwezi 4
nakasongola 4
namirembe 4
new 4
nsimbi 4
obudde 4
obumanyirivu 4
obutali 4
obutonde 4
obuwumbi 4
obuzito 4
obw 4
obwetaavu 4
oguwedde 4
ogwa 4
okufa 4
okufaayo 4
okukuuma 4
okukuza 4
okulima 4
okulwanyisa 4
okusasula 4
okusoma 4
okussa 4
okusukka 4
okutambula 4
okutangira 4
okutumbula 4
okutuusa 4
okutya 4
okuweebwa 4
okwewala 4
oluvanyuma 4
olwokusatu 4
omulabirizi 4
omulanga 4
omutendesi 4
omwana 4
ossa 4
rdc 4
runarsson 4
rwanda 4
sheffield 4
ssabuuni 4
sserwadda 4
sudan 4
tumuhiirwe 4
turkey 4
united 4
wangula 4
wasswa 4
yaweereddwa 4
yo 4
yunivaasite 4
100 3
11 3
200 3
6 3
abaagala 3
abaali 3
abakoseddwa 3
abakozi 3
abalina 3
abasoba 3
abatalina 3
abawadde 3
abawala 3
abawera 3
abayambe 3
abayimbi 3
aboobuyinza 3
agaba 3
agenze 3
akalulu 3
akatale 3
akawuka 3
akubiriza 3
akwasa 3
alabudde 3
amalala 3
amannyo 3
amasimu 3
amatikkira 3
ankunda 3
asisinkanye 3
ategezezza 3
atyo 3
authority 3
ayinza 3
ayogera 3
baategeezezza 3
babeera 3
babiri 3
bakoze 3
balaga 3
baleme 3
baliko 3
bammemba 3
bamukuba 3
bamukwata 3
bamutwala 3
bang 3
banoonya 3
basobola 3
basobole 3
basuubuzi 3
batte 3
batunda 3
batuuze 3
baweze 3
bayimbi 3
bayinginiya 3
baziika 3
bbebi 3
bibuga 3
bitundu 3
biyimiridde 3
bizinensi 3
budde 3
bukenya 3
bukya 3
bulabirizi 3
bulijjo 3
butereevu 3
bwavu 3
bwereere 3
byokwerinda 3
corona 3
david 3
ddagala 3
ddene 3
east 3
ebbugumu 3
ebikolwa 3
ebikopo 3
ebikozesebwa 3
ebimu 3
ebiragiro 3
ebirala 3
ebirime 3
ebyapa 3
ebyo 3
ebyobulamu 3
edda 3
egamba 3
egy 3
ekibinja 3
ekifaananyi 3
ekigatta 3
ekinnansi 3
ekissaddaaka 3
ekizibu 3
ekkirize 3
ekyo 3
ekyokulya 3
emipiira 3
emirembe 3
emirundi 3
emisango 3
emizannyo 3
emmwanyi 3
endagaano 3
enduulu 3
endwadde 3
engatto 3
engoye 3
enkola 3
ennono 3
enteekateeka 3
eritrea 3
eryo 3
esatu 3
essanyu 3
etteeka 3
ewadde 3
eyabadde 3
eyatemulwa 3
eyingire 3
eyo 3
ezirimibwa 3
eziwera 3
ffamire 3
gabula 3
galandi 3
gali 3
gavt 3
gerald 3
ggulaamu 3
giso 3
james 3
jjingo 3
jovenel 3
kabi 3
kabineeti 3
kagame 3
kakande 3
kaleerwe 3
kalungu 3
kamaruka 3
kamulegeya 3
kamwokya 3
kano 3
kaseera 3
katikkiro 3
kazinga 3
ke 3
kibadde 3
kibinja 3
kiddiridde 3
kidibo 3
kigulu 3
kira 3
kiraabu 3
kiro 3
kirunda 3
kiwanuka 3
kugula 3
kwetegekera 3
kwogera 3
kyambogo 3
le 3
liita 3
ltd 3
lukaya 3
luke 3
luno 3
lutalo 3
maama 3
mary 3
masaza 3
mayiro 3
mayuge 3
mbaziira 3
mbi 3
me 3
messager 3
mirimu 3
mizannyo 3
mmande 3
mr 3
mukwasi 3
mulungi 3
munne 3
munno 3
musawo 3
mutabani 3
muwendo 3
muyiggo 3
mwaka 3
mwebe 3
nabbanja 3
nakawa 3
nansana 3
ngozi 3
nguudo 3
nrm 3
nup 3
obuganda 3
obulungi 3
obungi 3
obuyumba 3
obwavu 3
ogw 3
okubaako 3
okubakolera 3
okubawa 3
okubeerawo 3
okubulira 3
okubulwa 3
okudda 3
okudduukirira 3
okuggwaako 3
okukansa 3
okulya 3
okumenya 3
okusabira 3
okusigala 3
okusinziira 3
okutandika 3
okuteebwa 3
okutta 3
okuttibwa 3
okuwa 3
okuwaayo 3
okuzannya 3
okweddiza 3
okwegatta 3
okwetaba 3
okwetangira 3
okweyongera 3
olina 3
olukwe 3
omukisa 3
omulala 3
omulundi 3
omusango 3
omusituzi 3
omuwendo 3
omwaka 3
owoyesigyire 3
paasita 3
palamenti 3
ronald 3
samuel 3
semi 3
ssande 3
ssemogerere 3
ssewankambo 3
talina 3
tugenda 3
tukaikiriza 3
twine 3
uhuru 3
waakiri 3
wakula 3
wansi 3
wanyama 3
watete 3
yabyogedde 3
yakwatibwa 3
yamaze 3
yapangisa 3
yeegasse 3
zonna 3
zziwa 3
1-0 2
17 2
1994 2
2020 2
21 2
26 2
28 2
337 2
34 2
40 2
53 2
9 2
abaafuna 2
abaakolako 2
abafudde 2
abafunye 2
abagula 2
abakkakkamu 2
abakristaayo 2
abakuba 2
abakubiriza 2
abakungu 2
abakungubazi 2
abalunzi 2
abamukomyawo 2
abasaba 2
abasajja 2
abasaka 2
abasomera 2
abasomesa 2
abasula 2
abatambulira 2
abatasussa 2
abateebi 2
abategeezezza 2
abategesi 2
abatembeeyi 2
abatemu 2
abavuzi 2
abawa 2
abazadde 2
abeebyokwerinda 2
abeegattira 2
afcon 2
afuna 2
agenzeeyo 2
agezezzaako 2
aisha 2
aka 2
akabanga 2
akagenda 2
akatono 2
akawunga 2
akazito 2
akoma 2
akulembeddemu 2
akulembera 2
alabula 2
alaga 2
alambula 2
alex 2
alonze 2
alumbibwa 2
alumiriza 2
amakubo 2
amalawo 2
amangu 2
amasannyalaze 2
amatuufu 2
amaziika 2
amuyambe 2
anaakwata 2
anaateerangawo 2
anaayamba 2
anite 2
anyiikiridde 2
arteta 2
asibuka 2
asmir 2
aston 2
asuubirwa 2
ataasa 2
atadde 2
ategeeza 2
atunda 2
atutte 2
atwala 2
auto 2
ava 2
avudde 2
awabudde 2
awadde 2
awakanya 2
awataali 2
awatali 2
awezezza 2
ayiyiiza 2
ayongere 2
azam 2
azze 2
baagambye 2
baakakwata 2
baakola 2
baakuggulawo 2
baamukwata 2
baatandika 2
baayo 2
baba 2
badda 2
bafe 2
bafunye 2
bafunyisibwa 2
bagatuzaayo 2
bagende 2
bagoba 2
bajjajja 2
bakkaanya 2
bakozesa 2
bakozi 2
bakulembeddwa 2
bakulembera 2
bakwasi 2
bakyala 2
bakyalira 2
balabira 2
balaze 2
balinda 2
balooya 2
balyoke 2
bamakanika 2
bamala 2
bamubuulirizaako 2
bamulina 2
bamulinamu 2
bamusaba 2
bamuvunaana 2
bannaabwe 2
bannabyabufuzi 2
bannantameggwa 2
basaba 2
basibwa 2
basinze 2
basuubirwa 2
batandika 2
bategeeza 2
batudde 2
batuuse 2
bava 2
bavunaana 2
bayambibwako 2
bayinza 2
bayita 2
bayo 2
bazadde 2
bazannyira 2
bazze 2
bbaale 2
bbanja 2
bbiri 2
bbo 2
ben 2
bennyamidde 2
bennyini 2
bernd 2
big 2
bikopo 2
bintu 2
birala 2
biri 2
bisaawe 2
bisisimuko 2
bitaano 2
bituuse 2
bodaboda 2
bokka 2
bombo 2
boodabooda 2
bradford 2
brian 2
bucaafu 2
bukomansimbi 2
bulaaya 2
bulago 2
bulindaala 2
bullets 2
bulls 2
bumativu 2
bungi 2
butale 2
butebenkevu 2
buwaaya 2
buyonjo 2
bwatyo 2
bwavudde 2
bwegugungo 2
byayo 2
byekyamubuuza 2
c 2
christopher 2
church 2
cid 2
cipla 2
colombia 2
congo 2
cps 2
criminal 2
d 2
ddokita 2
directive 2
don 2
douglas 2
ebbiri 2
ebbula 2
ebibanja 2
ebigenda 2
ebikyupuli 2
ebina 2
ebirabo 2
ebisago 2
ebiseera 2
ebisooka 2
ebitaliimu 2
ebyamasanyu 2
ebyamutta 2
ebyasi 2
ebyenjigiriza 2
ebyuma 2
eddwaaliro 2
edith 2
efunye 2
egaana 2
eggulo 2
egula 2
ejja 2
ekanse 2
ekigendererwa 2
ekikontana 2
ekikopo 2
ekinoonyereza 2
ekintu 2
ekiri 2
ekiro 2
ekitone 2
ekivunaanyizibwa 2
ekkanisa 2
ekyakeesa 2
ekyalina 2
emikolo 2
emile 2
emingi 2
emiriraano 2
emiti 2
empapula 2
emulinamu 2
emyala 2
emyera 2
emyezi 2
ena 2
endaga 2
enganda 2
engendo 2
engulu 2
enguzi 2
enjiri 2
enkulaakulana 2
enkulu 2
ennene 2
ennimiro 2
ennyama 2
ennyimba 2
ensiri 2
ente 2
entongole 2
entuufu 2
envuuvuumo 2
eraga 2
erangiridde 2
ereme 2
erya 2
esinga 2
essatu 2
essira 2
esubwa 2
etaano 2
etaasizza 2
ethiopia 2
euro 2
evelyn 2
everton 2
eyabulira 2
eyakubiddwa 2
eyakubwa 2
eyasinze 2
ezaali 2
ezaategekeddwa 2
ezera 2
ezibadde 2
ezifulumiziddwa 2
ezigenda 2
eziri 2
ezitowa 2
eziyise 2
ezo 2
fayiro 2
ffe 2
fiina 2
force 2
fred 2
gaayo 2
gasiba 2
gift 2
gino 2
giragiba 2
gitwale 2
gumu 2
gumuvunaanibwa 2
gwamugoba 2
gwonna 2
gyakutandika 2
hajj 2
hajjat 2
hannifer 2
hotel 2
ibrahim 2
ii 2
intelligence 2
investigations 2
irene 2
jjumba 2
john 2
joseph 2
kabasudde 2
kafuuma 2
kagoma 2
kakomo 2
kakooge 2
kakwakulizo 2
kalulu 2
kasana 2
katimbo 2
katonda 2
katono 2
kazo 2
kibangirizi 2
kigitawaanya 2
kikkakkamu 2
kikontana 2
kinawa 2
kitalo 2
kitegeeza 2
kiteredde 2
kitintale 2
kitongole 2
kiyambako 2
kiyinda 2
kizibu 2
kkanisa 2
kkansala 2
kkiro 2
kkirommita 2
kkono 2
klezia 2
kmkm 2
konna 2
kugabira 2
kugireetera 2
kukiikirira 2
kukola 2
kumwesigamako 2
kunoonya 2
kuruthum 2
kusaba 2
kusalawo 2
kusindika 2
kutuuse 2
kuva 2
kuzimba 2
kwekusaba 2
kwonooneka 2
kyabadde 2
kyakulya 2
kyakusoomooza 2
kyamuviirako 2
kyatuhiire 2
kyazike 2
kyewalyanga 2
kyofatogabye 2
kyomuhendo 2
kyonna 2
league 2
leon 2
lijja 2
likyatubidde 2
looya 2
lugazi 2
lukwe 2
lulenzi 2
lumu 2
lunaku 2
lwabwe 2
lwaki 2
lwakubiri 2
lwalukibwa 2
lwomukaaga 2
lyayo 2
main 2
makya 2
malawi 2
malwaliro 2
mambuka 2
march 2
martha 2
martine 2
masiki 2
mateeka 2
matigga 2
mawulire 2
mayiga 2
mbarara 2
medical 2
mesut 2
mikel 2
misango 2
mmeeya 2
mmere 2
mohammed 2
mpigi 2
mpungu 2
mrs 2
mubende 2
mugudwa 2
muhwezi 2
mukuumi 2
mukwano 2
mukyala 2
mukyere 2
mulina 2
muliro 2
munaana 2
munnaabwe 2
munnansi 2
mupiira 2
museetwe 2
mutendera 2
mutungo 2
muzannyi 2
mwannyina 2
nabakooba 2
nabbi 2
nabweru 2
nadduli 2
nakalema 2
namubiru 2
namusabi 2
namuwoza 2
national 2
natukunda 2
nazo 2
newankubadde 2
newvision 2
nigeria 2
nju 2
nkizo 2
nkola 2
nnya 2
nsa 2
nsango 2
ntalo 2
ntimbe 2
ntobazzi 2
nze 2
nzibu 2
o 2
obufuzi 2
obujjanjabi 2
obukwakkulizo 2
obulimi 2
obulwadde 2
obusobozi 2
obutafuna 2
obutakkaanya 2
obutakuuma 2
obutimba 2
obuwaayiro 2
obwakabaka 2
obwakolwa 2
obwapulezidenti 2
obwegugungo 2
ofiisi 2
ogusoose 2
ogwali 2
okubadduukirira 2
okubasiima 2
okubayamba 2
okubba 2
okubula 2
okubunya 2
okuddaabiriza 2
okuddamu 2
okuddukirira 2
okuffa 2
okufiirwa 2
okufuuka 2
okugaba 2
okugondera 2
okugula 2
okukakasa 2
okukozesa 2
okukubiriza 2
okukuzibwa 2
okukwata 2
okukwatira 2
okulabikako 2
okulabirira 2
okulawuna 2
okulinnya 2
okulonda 2
okulondoola 2
okumalira 2
okumulaga 2
okumutunda 2
okumutwala 2
okumuvunaana 2
okunoonya 2
okusiba 2
okusibwa 2
okusiibula 2
okusiima 2
okusikiriza 2
okusimba 2
okusomera 2
okusomesa 2
okusula 2
okutambulira 2
okutandikawo 2
okuteekateeka 2
okuteesa 2
okutulagako 2
okutuula 2
okutwala 2
okuvuganya 2
okuwabulwa 2
okuwamba 2
okuwangulayo 2
okuyita 2
okuziika 2
okuzza 2
okw 2
okwagala 2
okwawukanako 2
okwettanira 2
okwogera 2
okwokya 2
olufuzi 2
omanyi 2
omubbi 2
omubeezi 2
omubisi 2
omuchina 2
omujoozi 2
omukolo 2
omukwanaganya 2
omukwano 2
omuluka 2
omusaayi 2
omusanyufu 2
omusawo 2
omusumba 2
omutanda 2
omuteebi 2
omutuufu 2
omutuuze 2
omuyambi 2
omuyimbi 2
omwezi 2
oola 2
palace 2
pastor 2
paul 2
peter 2
philip 2
queen 2
r 2
rahim 2
red 2
rev 2
robert 2
robinah 2
robusta 2
ruth 2
saako 2
sallies 2
sandra 2
simba 2
siteegi 2
sitoowa 2
smith 2
social 2
southern 2
ssegirinya 2
ssinga 2
ssuubi 2
stoke 2
takisi 2
tanui 2
task 2
tebakyakola 2
tebalabika 2
tebamuganya 2
tebamumazaako 2
tebamuwadde 2
tebategeeza 2
tegenda 2
tegwogera 2
teta 2
teyakutteyo 2
the 2
tokyo 2
tosubwa 2
town 2
ttaayi 2
ttani 2
tuli 2
tusker 2
ucda 2
ura 2
village 2
waakuziikibwa 2
waali 2
waayo 2
wi 2
wo 2
yaakuggulawo 2
yaakulwana 2
yaakuttunka 2
yaayo 2
yabwe 2
yafunye 2
yagenda 2
yakatonnya 2
yakkiriza 2
yakomezebwawo 2
yakosebwa 2
yakutte 2
yalabye 2
yalagira 2
yaliko 2
yanga 2
yasazeewo 2
yatadde 2
yatta 2
yattibwa 2
yavaawo 2
yawangudde 2
yayolesa 2
yayongeddeko 2
yazannyako 2
yazza 2
yeeyambula 2
yeeyamye 2
yenna 2
yennyamidde 2
ying 2
york 2
zaasaliddwaako 2
zanzibar 2
zigamba 2
zimuyaayaanira 2
zisuubirwa 2
zitongozebwa 2
ziweze 2
zombi 2
zzooni 2
