ne 355
mu 273
era 217
mukama 201
no 195
na 163
nga 156
bo 155
ku 151
kubanga 119
nti 106
bwe 91
so 89
nze 88
eri 86
naye 78
wa 76
ayogera 71
katonda 70
ggwe 58
gwe 55
olwa 50
abo 48
laba 48
ngo 47
ebya 45
mmwe 45
abantu 44
isira 44
nge 44
obutuukirivu 40
tewali 36
okuva 35
ensi 34
bange 33
be 33
kya 33
kye 33
weewaawo 33
ani 32
ekitiibwa 32
eza 32
oyo 32
ye 32
ba 31
wamu 31
wo 31
erinnya 30
bonna 29
maaso 29
amawanga 28
atyo 27
ekya 27
lwa 27
okuba 27
butuukirivu 26
gange 26
wange 26
amaaso 25
bwo 25
lya 25
omu 25
omukono 25
ya 25
emirembe 24
ndi 24
owa 23
yakobo 23
amaanyi 22
bya 21
ebyo 21
gya 21
lye 21
newakubadde 21
zonna 21
buli 20
gwo 20
kifo 20
kyange 20
ga 19
ge 19
si 19
edda 18
eggulu 18
gye 18
kale 18
obulokozi 18
omutukuvu 18
yerusaalemi 18
abaana 17
ddala 17
ebigambo 17
ennaku 17
gwange 17
kwe 17
omusana 17
yo 17
ali 16
bwange 16
ekyo 16
eya 16
gaabwe 16
gu 16
naawe 16
obutali 16
omuntu 16
aba 15
amazzi 15
bye 15
byo 15
e 15
gwa 15
kaakano 15
okutuusa 15
omuliro 15
omwana 15
omwoyo 15
we 15
eggwanga 14
ennyumba 14
ezzadde 14
kyo 14
lyo 14
mukono 14
nsi 14
obulamu 14
ogu 14
omuweereza 14
sayuuni 14
eddoboozi 13
eggye 13
go 13
muntu 13
nange 13
nate 13
omutima 13
byonna 12
kamwa 12
lyange 12
mulala 12
nnyumba 12
obo 12
omukisa 12
wabula 12
wala 12
zo 12
abaddu 11
abalina 11
aga 11
awo 11
bano 11
endiga 11
ensonyi 11
essanyu 11
lwange 11
lwe 11
mazima 11
oba 11
oli 11
yange 11
bantu 10
byabwe 10
ekifaananyi 10
ekigambo 10
ensozi 10
kyabwe 10
okujja 10
omulimu 10
omununuzi 10
omusango 10
wakati 10
bakabaka 9
emizabbibu 9
kabaka 9
ki 9
kwo 9
olusuku 9
yaabwe 9
agamba 8
amakubo 8
amatu 8
batabani 8
byange 8
ebifo 8
ebyazika 8
ekibi 8
ekizikiza 8
endagaano 8
gyabwe 8
linnya 8
makubo 8
nnyo 8
omukazi 8
omwenge 8
omwo 8
waffe 8
waggulu 8
zange 8
ze 8
abasajja 7
alina 7
amayinja 7
baabwe 7
baliba 7
bwabwe 7
bwaffe 7
ddyo 7
ebirowoozo 7
ekkubo 7
emigga 7
engoye 7
ennyanja 7
ensonga 7
ewala 7
fenna 7
gonna 7
gwabwe 7
kkubo 7
kyendiva 7
lubuto 7
lunaku 7
mirembe 7
mujje 7
muwulire 7
mwe 7
mwenna 7
nabo 7
nammwe 7
nno 7
nzuuyo 7
obusungu 7
ogwa 7
okubaawo 7
okutu 7
olutukuvu 7
ssabbiiti 7
wansi 7
zaabwe 7
zuukuka 7
akola 6
amazima 6
balijja 6
boogera 6
bwa 6
bwereere 6
ebibi 6
ebintu 6
egya 6
ekitundu 6
ekyole 6
empeera 6
engalo 6
enkomerero 6
enzigi 6
eryo 6
gammwe 6
gyonna 6
ka 6
kiriba 6
kizikiza 6
kuba 6
kwabwe 6
ludda 6
lyammwe 6
mawanga 6
mazzi 6
mutima 6
mwoyo 6
ndifuula 6
ndireeta 6
njogera 6
nnaku 6
ntonda 6
obubi 6
obungi 6
okusobya 6
okuyimba 6
okwogera 6
omusaayi 6
omuwala 6
yuda 6
zibasanze 6
abalabe 5
ago 5
ai 5
atali 5
bino 5
bulijjo 5
bwammwe 5
ebigere 5
ebikolwa 5
ebizinga 5
ebyasooka 5
ekisa 5
ekyambalo 5
emisingi 5
ennyama 5
ennyonta 5
ennyuma 5
erye 5
ffe 5
gwammwe 5
kange 5
kino 5
kitiibwa 5
kwange 5
kyakyo 5
lwaki 5
mangu 5
muliro 5
mumpulirize 5
mwene 5
ndikola 5
nnalonda 5
nsonyi 5
obukaali 5
obulimba 5
obulungi 5
okuyinza 5
olunaku 5
omugole 5
omulala 5
ssaddaaka 5
totya 5
za 5
ababi 4
abalonde 4
abazibe 4
akamwa 4
akatono 4
aleeta 4
amafuta 4
amagezi 4
amateeka 4
asanyusizza 4
ati 4
awali 4
awatali 4
baana 4
babulooni 4
balikwatibwa 4
balizimba 4
bannaggwanga 4
bifo 4
biri 4
biro 4
bityo 4
bubi 4
byaffe 4
ddungu 4
ebifaananyi 4
ebiri 4
ebiro 4
ebirungi 4
ebugwanjuba 4
ebuvanjuba 4
ebyambalo 4
ekifo 4
ekiro 4
ekiruyi 4
ekiweebwayo 4
ekyejo 4
emikono 4
emirimu 4
emmeeme 4
emmere 4
empewo 4
enfuufu 4
enjuyi 4
ensolo 4
ente 4
eritaliggwaawo 4
eyali 4
ffeeza 4
gyo 4
ke 4
kibuga 4
kifuba 4
kityo 4
kyoto 4
leero 4
lusozi 4
mugulumize 4
muli 4
mulokozi 4
mutukuvu 4
njagala 4
nkomerero 4
nnayita 4
nsiko 4
ntebe 4
obudde 4
obugagga 4
obusika 4
obutabaawo 4
obuyinike 4
obwa 4
okumasamasa 4
okusanyuka 4
okusiiba 4
okuteesa 4
okuzika 4
olyoka 4
omubiri 4
omugga 4
omukka 4
omuti 4
omutuukirivu 4
temuli 4
tewaliba 4
ttaka 4
tuli 4
tusuubira 4
wammwe 4
yali 4
zabbibu 4
zzadde 4
abaggya 3
abajulirwa 3
abakaludaaya 3
abateeka 3
abonyaabonyezebwa 3
aboogera 3
alanga 3
alifuuka 3
alijja 3
aliŋŋanga 3
alya 3
alyoka 3
anyweza 3
atambulira 3
ava 3
awasa 3
ayinza 3
azaala 3
bagalamira 3
bajja 3
bajulirwa 3
balireeta 3
balya 3
balyoke 3
bangi 3
bawala 3
busungu 3
butali 3
buto 3
byambalo 3
byammwe 3
byamu 3
ebbanga 3
ebendera 3
ebiweebwayo 3
ekikoligo 3
ekikolo 3
ekikompe 3
ekire 3
ekitala 3
ekitamiiza 3
ekitanda 3
ekkalu 3
embizzi 3
emimwa 3
emingi 3
emitima 3
empologoma 3
enda 3
enjala 3
ensigo 3
entiisa 3
eriggya 3
eriiso 3
erya 3
ettaka 3
ettendo 3
evvu 3
ezaabu 3
ggulu 3
gyammwe 3
gyange 3
kasookedde 3
kibira 3
kitaffe 3
kkono 3
ko 3
kubiri 3
kulaba 3
kuli 3
kuwonya 3
kwa 3
kwaffe 3
kyebaliva 3
kyennava 3
kyonna 3
lemaliya 3
lubereberye 3
luli 3
lulwo 3
matu 3
mirimu 3
misiri 3
mpozzi 3
mubaguke 3
mulimu 3
mulyoke 3
munda 3
musango 3
musanyukire 3
muti 3
mutunuulire 3
muweereza 3
muwendo 3
naffe 3
nditeeka 3
ndyoka 3
ndyoke 3
ngalo 3
nnema 3
nnyanja 3
nnyingi 3
nnyini 3
nsolo 3
ntadde 3
ntyo 3
nzekka 3
nzuuno 3
obukiika 3
obusozi 3
obusuuli 3
obuziba 3
oku 3
okudda 3
okumanya 3
okunenya 3
okusaasira 3
okusinga 3
okusooka 3
okuwulira 3
okwesiima 3
olabe 3
oliyitibwa 3
oluguudo 3
olukoba 3
olulimi 3
olusozi 3
omuddo 3
omugabo 3
omugavu 3
omukozi 3
omulokozi 3
omunyago 3
omuweesi 3
omuzibe 3
onoobanga 3
singa 3
talina 3
waabwe 3
wali 3
walibaawo 3
wataba 3
wendi 3
wulira 3
wuuyo 3
yambala 3
yeekaalu 3
yimba 3
yimirira 3
yimusa 3
yonna 3
zammwe 3
ziba 3
ziriba 3
abaagobebwa 2
ababaka 2
abaggavu 2
abakola 2
abakulu 2
abakuumi 2
abalanga 2
abali 2
abamukyawa 2
abangi 2
abasitula 2
abasobya 2
abatuula 2
abawalula 2
abawonye 2
abayigirizibwa 2
afuula 2
agasanyusa 2
ajjukira 2
akabonero 2
akaseera 2
akazi 2
akifuula 2
akiramba 2
akivuunamira 2
akwata 2
aleke 2
alibasasula 2
alifa 2
alikola 2
alinnyamba 2
aliraba 2
alisasula 2
alisikira 2
alumiddwa 2
alumwa 2
alyogera 2
amabeere 2
amabega 2
amagumba 2
amangi 2
amata 2
amatendo 2
amatongo 2
amayengo 2
anaabanga 2
antumye 2
anunudde 2
asanyuka 2
atalina 2
atayinza 2
atta 2
atuula 2
awamu 2
awatukuvu 2
aweebwe 2
awoza 2
ayagala 2
ayambala 2
ayima 2
ayita 2
ayokya 2
ayota 2
azuukusa 2
baba 2
baffe 2
baganda 2
bakabona 2
bakaludaaya 2
bakulokole 2
bali 2
balibayita 2
balikuvuunamira 2
baliraba 2
balirira 2
balitya 2
baliva 2
bamanya 2
bammwe 2
basanyuka 2
basinza 2
batamanyi 2
batayinza 2
batya 2
batyo 2
bava 2
bayimirire 2
bibuga 2
bigambo 2
bigula 2
bikkula 2
bimaze 2
bingi 2
biriba 2
birinnindirira 2
birisigala 2
birowoozo 2
bukaamukuukulu 2
bulamu 2
bunaabeereranga 2
bunaatera 2
bunnya 2
buseera 2
bwakabaka 2
bwonna 2
dawudi 2
dda 2
ebibala 2
ebibuga 2
ebibukutu 2
ebigenda 2
ebika 2
ebisasiro 2
ebisenge 2
ebisiba 2
ebitali 2
ebyakwekebwa 2
ebyokebwa 2
ebyonoono 2
ebyoya 2
eddungu 2
effeeza 2
efulayimu 2
eggaali 2
egitali 2
ekibbo 2
ekibuga 2
ekifisseeko 2
ekijjukizo 2
ekikolimo 2
ekimuli 2
ekingi 2
ekirenge 2
ekirungi 2
ekitukuvu 2
ekiva 2
ekivume 2
ekyali 2
ekyama 2
ekyuma 2
embaalebaale 2
embalaasi 2
embwa 2
emigwa 2
emimuli 2
emirambo 2
emirundi 2
emisana 2
emiti 2
emizizo 2
empya 2
emyaka 2
engule 2
enguudo 2
enjuba 2
enkomera 2
enkuba 2
enkuufiira 2
enkya 2
ennimi 2
ennimiro 2
ennungi 2
ennyenje 2
ennyo 2
ensuku 2
entukuvu 2
eribaliira 2
eriva 2
eruuyi 2
essogolero 2
eyafumbirwa 2
eyagobebwa 2
eyakubumba 2
eŋŋamira 2
fembi 2
gaayo 2
gali 2
gatyo 2
ginnaayo 2
ginyeenyezebwa 2
golokoka 2
guli 2
gulyoka 2
gutayinza 2
gutuuse 2
ibulayimu 2
kaseera 2
kibya 2
kikomo 2
kikumi 2
kimu 2
kintu 2
kiri 2
kiribikka 2
kiruyi 2
kisiikirize 2
kitaawo 2
kitundu 2
kiwonvu 2
komawo 2
kubonyaabonyezebwa 2
kufa 2
kulokola 2
kumanya 2
kumpi 2
kusaasira 2
kusobya 2
kutegeera 2
kuulo 2
kuusi 2
kuwulira 2
kuzaala 2
kwammwe 2
kyama 2
kyegwava 2
kyenvudde 2
kyewava 2
kyeyava 2
kyuma 2
leeta 2
lezini 2
lubale 2
luguudo 2
lukoola 2
lulimi 2
lumu 2
lwammwe 2
lwazi 2
lwo 2
lyabwe 2
lyonna 2
maanyi 2
manda 2
mbiriizi 2
me 2
migga 2
mimwa 2
mirongoofu 2
miti 2
mmanyi 2
mubuulire 2
mufulume 2
muganzi 2
mugende 2
mugule 2
mujjukire 2
mukyala 2
mulabe 2
mulimera 2
mulirumwa 2
muliweebwa 2
mulongoofu 2
mulongoose 2
mulye 2
mununuzi 2
musa 2
musembere 2
mutege 2
mutuukirivu 2
muve 2
muyite 2
mwa 2
mwana 2
mwekuŋŋaanye 2
mwenge 2
mwerage 2
mwezi 2
mwogere 2
nabuulira 2
nakola 2
namanya 2
natonda 2
nawaayo 2
nda 2
ndaba 2
ndabye 2
ndeeta 2
ndibawa 2
ndibikola 2
ndifuka 2
ndimuwonya 2
ndisasula 2
nguudo 2
njala 2
nkaliza 2
nkwatiddwa 2
nnalayira 2
nnayogera 2
nneme 2
nnyammwe 2
nnyonta 2
nsanyukira 2
nsozi 2
nsuku 2
nsunguwala 2
ntuma 2
ntuula 2
obubaane 2
obufunda 2
obuli 2
obulogo 2
obunyiikivu 2
obusawo 2
obutagyonoona 2
obutaliggwaawo 2
obutukuvu 2
obuulire 2
obuyonjo 2
obwakabaka 2
obwereere 2
oguboneredde 2
ogutaliggwaawo 2
ogutwalibwa 2
okubaggya 2
okubuulira 2
okufiirwa 2
okugasa 2
okugenda 2
okugoberera 2
okugolokosa 2
okujaguza 2
okujoogebwa 2
okukaawa 2
okukola 2
okukungubaga 2
okulamya 2
okulira 2
okulokola 2
okulya 2
okumpi 2
okusasula 2
okusirika 2
okuswala 2
okutagatta 2
okutegeera 2
okutendereza 2
okuttibwa 2
okuwaayo 2
okuwoomerera 2
okuzibya 2
okuzikirira 2
okwegomba 2
okwekolera 2
okwerabira 2
olaba 2
olemenga 2
olimanya 2
oliyinza 2
oliyita 2
oliyonka 2
olubereberye 2
olufulube 2
olugendo 2
olulituuka 2
olusalosalo 2
olwazi 2
olyoke 2
omugaati 2
omugwa 2
omujoozi 2
omukulu 2
omulabe 2
omunagiro 2
omusingi 2
omutonzi 2
omuyovu 2
omuzizo 2
omwaka 2
omwezi 2
ono 2
otuule 2
otya 2
oyagala 2
oyima 2
oyogera 2
siriiko 2
soogereranga 2
ssaasanyukira 2
talusiisi 2
tayogeranga 2
tebakyakuyitanga 2
tebalina 2
tebalowooza 2
tebamanyi 2
tebayinza 2
tekuli 2
tokwata 2
tommanyanga 2
tufuuse 2
tunula 2
tuula 2
tuwammanta 2
uzziya 2
wano 2
wasimba 2
watukuvu 2
yaakamaze 2
yafumitibwa 2
yakubibwa 2
yanyoomebwa 2
yasiima 2
yeetikka 2
yenna 2
zaabu 2
zikulukuta 2
