mu 142
ku 76
nga 74
ne 42
sentence 40
ngo 36
ebigambo 32
bwe 31
oba 27
ebyokulabirako 25
kyo 24
naye 24
wandiika 24
kitabo 23
nti 23
zino 21
wa 20
era 18
na 18
obugambo 18
omwana 17
ye 17
nge 15
nnyo 15
ate 14
embuzi 14
ki 14
abiri 13
kkumi 13
bino 12
ebyo 12
si 12
abaana 11
amakulu 11
be 11
buno 11
ekyokukola 11
no 11
oyo 11
akagambo 10
bye 10
emboozi 10
ko 10
omusajja 10
wano 10
emu 9
nze 9
buli 8
bwo 8
bya 8
ezo 8
ggwe 8
ngeri 8
ogenda 8
okugaana 8
omuntu 8
omwami 8
ossaamu 8
wammanga 8
ya 8
bulungi 7
byo 7
ebintu 7
ebiri 7
ebitabo 7
emmere 7
kyokka 7
obwannannyini 7
obwo 7
awo 6
bibuuzo 6
eno 6
eri 6
ge 6
gwe 6
kasita 6
kye 6
lwa 6
newaakubadde 6
obulungi 6
obuyunzi 6
olugoye 6
sikulwa 6
wo 6
ze 6
alina 5
amaaso 5
bingi 5
e 5
ekibuuzo 5
ekitabo 5
ennyama 5
eyo 5
kati 5
kya 5
luganda 5
lumonde 5
mabanga 5
mulimu 5
obutegeeza 5
okuddamu 5
okulya 5
okuwandiika 5
oluganda 5
olwo 5
omulenzi 5
osanga 5
taata 5
verb 5
waliwo 5
wazira 5
we 5
yange 5
yee 5
abakulu 4
abawala 4
agenda 4
ako 4
b 4
bbiri 4
bo 4
bonna 4
bukozesebwa 4
byennyini 4
ebirala 4
ebisoko 4
ebye 4
enkoko 4
ennaku 4
ennyo 4
ensuwa 4
ente 4
ezimu 4
ffe 4
ga 4
gakyuka 4
jjo 4
kabaka 4
kabekasinge 4
kino 4
kubanga 4
kulya 4
lujjuliro 4
mpozzi 4
mukwano 4
musisi 4
mw 4
nnya 4
nnyumba 4
obubonero 4
olubuto 4
omanyi 4
omugole 4
sinakindi 4
za 4
a 3
aa 3
abantu 3
agalimu 3
agamu 3
akambe 3
ali 3
alya 3
amagezi 3
amannyo 3
amubuuza 3
anti 3
atunula 3
ayita 3
ba 3
bantu 3
bigambo 3
biwandiike 3
bulala 3
bwa 3
comma 3
dda 3
ebbaluwa 3
ebirina 3
ekimu 3
embogo 3
emiti 3
emmeere 3
empampagama 3
engeri 3
engoye 3
enjogera 3
ennukuta 3
gira 3
gwange 3
gwo 3
gye 3
kakozesebwa 3
kasooli 3
kawandiikibwa 3
kibuga 3
kikolwa 3
kinnya 3
kintu 3
kkubo 3
kuba 3
kumpi 3
lusuku 3
lwe 3
lwomukaaga 3
makulu 3
mmotoka 3
mmwe 3
mukaaga 3
munne 3
musajja 3
mwami 3
nandiki 3
nedda 3
nnamusoke 3
nsiko 3
obiriraanya 3
obiwandiike 3
oboolyawo 3
obusittale 3
obutabo 3
odda 3
okukkiriza 3
oluusi 3
omubbi 3
omukazi 3
omukyala 3
omuwala 3
ono 3
ossa 3
ssatu 3
ssomero 3
ttaano 3
ttale 3
yali 3
zisibwa 3
ziwandiike 3
zo 3
aba 2
abaatuyamba 2
abaffe 2
abali 2
abalunzi 2
abayizzi 2
abazadde 2
abo 2
afa 2
agali 2
aguze 2
akafumu 2
akaloosa 2
akatuuso 2
akawoowo 2
akubye 2
amaanyi 2
amalaalo 2
amanyi 2
amasiro 2
amatooke 2
amawoowoolo 2
amawuggwe 2
ani 2
awaka 2
awamu 2
awandiika 2
ayinza 2
ayogera 2
bafuna 2
bagitadde 2
baleese 2
bangi 2
batya 2
bbanga 2
beppo 2
bisse 2
buganda 2
bukomera 2
bukulembera 2
bulanga 2
bumu 2
bungi 2
butabo 2
bwaffe 2
byombi 2
ddila 2
dduuka 2
ebibuuzo 2
ebidda 2
ebijanjaalo 2
ebikontana 2
ebireetebwa 2
effumu 2
efumbwa 2
eggwanga 2
ejjereere 2
ekibbo 2
ekisa 2
ekkalaamu 2
ekye 2
embwa 2
embwe 2
empeerezi 2
empisa 2
empologoma 2
enge 2
enkwafu 2
enkya 2
ennungi 2
ennyumba 2
envubo 2
erinnya 2
essaawa 2
ettimaa 2
ewammwe 2
ewo 2
ezigaana 2
ezituukiramu 2
gaazo 2
gaffe 2
gamu 2
gano 2
guno 2
j 2
ka 2
kabada 2
kabanika 2
kakulembera 2
kali 2
kamya 2
katera 2
kavuna 2
kiba 2
kikontana 2
kitalo 2
kiva 2
kokka 2
kugenda 2
kukkiriza 2
kyange 2
leero 2
luggale 2
lukumi 2
lwanga 2
lwange 2
lwenda 2
lwo 2
maanyi 2
masiga 2
mboozi 2
muganda 2
munaana 2
munene 2
musanvu 2
musoke 2
mutambula 2
muti 2
mwana 2
mwe 2
nabo 2
nako 2
ndaba 2
ndabye 2
ngalo 2
nju 2
nnagenda 2
nnakamya 2
nnakate 2
nnalaba 2
nnalule 2
nnamukasa 2
nnasanze 2
nnukuta 2
nnyama 2
noun 2
nsanze 2
ntya 2
nva 2
obiggyamu 2
obisazaako 2
obubi 2
obubiri 2
obukulu 2
obungi 2
obutera 2
obutuulo 2
obuyambi 2
obwanjula 2
obwavu 2
ogende 2
okuba 2
okudda 2
okuggyako 2
okukyukakyuka 2
okumpi 2
okusingawo 2
okutu 2
okutuuka 2
okuva 2
okuwaanyisibwa 2
okuyiga 2
olaba 2
oli 2
olubeerera 2
olunaku 2
olunyaafa 2
olwatika 2
omaze 2
omu 2
omukolo 2
omukulu 2
omulwadde 2
omupakasi 2
omupiira 2
omurambo 2
omusaayi 2
omusango 2
omusomesaa 2
omuwandiisi 2
omuwumbo 2
omwenge 2
otuta 2
owandiika 2
oziffula 2
ozissaamu 2
ppamba 2
sijja 2
singa 2
ssaamu 2
terwali 2
ttuntu 2
tubuwandiika 2
tufuna 2
tugende 2
tumenya 2
tuyita 2
twebaza 2
two 2
waakiri 2
wabula 2
wabweru 2
wadde 2
waggulu 2
wala 2
walya 2
wange 2
wansi 2
wattu 2
weebuuza 2
yaazo 2
yadde 2
yagenda 2
yakola 2
yatuuka 2
yawandiika 2
yazaala 2
yeekwese 2
yo 2
zange 2
ziba 2
zibeera 2
zirya 2
zitaliimu 2
