mu 305
ku 252
nga 206
n 203
nti 157
e 136
ne 124
ng 89
abantu 87
bwe 81
era 74
poliisi 52
y 51
w 42
bw 38
gye 38
wa 36
yagambye 36
kino 35
ate 30
kya 29
by 28
olw 28
wabula 28
yategeezezza 28
ky 27
nnasale 26
ssente 26
ye 26
z 26
ba 25
eby 25
abalala 24
buli 24
kuba 24
aba 23
bali 23
bantu 23
be 23
eno 23
naye 23
kubanga 22
agamba 21
ga 21
gw 21
we 21
akulira 19
b 19
balina 19
bye 19
ebyobulamu 19
eggwanga 19
wakiso 19
ddala 18
iran 18
ya 18
gwe 17
kyokka 17
lw 17
minisita 17
okuli 17
wadde 17
000 16
bano 16
gavumenti 16
naddala 16
amagye 15
disitulikiti 15
ensonga 15
kye 15
ly 15
mmotoka 15
museveni 15
oba 15
okuva 15
bwa 14
gwa 14
kkooti 14
maaso 14
masaka 14
odongo 14
omu 14
amasomero 13
baabwe 13
bonna 13
eddwaaliro 13
gy 13
kati 13
kiseera 13
mayiga 13
nansana 13
okubeera 13
okukola 13
ssentebe 13
waliwo 13
alina 12
bagenda 12
embeera 12
ggwanga 12
guno 12
jeje 12
kitundu 12
nnyo 12
pulezidenti 12
za 12
ab 11
abadde 11
abakulembeze 11
abasawo 11
abayizi 11
amaanyi 11
centre 11
ebirala 11
ebyenjigiriza 11
health 11
k 11
kyengera 11
omuntu 11
uganda 11
abaana 10
abavubuka 10
dr 10
enjawulo 10
eri 10
erina 10
ey 10
lya 10
mizayiro 10
okusobola 10
okutuuka 10
omwogezi 10
2021 9
abamu 9
abaserikale 9
ali 9
asaba 9
asp 9
baba 9
babadde 9
bino 9
bya 9
ebintu 9
ekkanisa 9
ensi 9
ffamire 9
january 9
na 9
nsonga 9
okuba 9
okukuba 9
okulaba 9
okuzimba 9
oluvannyuma 9
omusango 9
omusolo 9
ono 9
owa 9
si 9
yabadde 9
yasindikiddwa 9
yonna 9
ze 9
1 8
abalina 8
awamu 8
council 8
ekya 8
ekyo 8
emirimu 8
emisango 8
emyaka 8
ez 8
g 8
kireka 8
masomero 8
ngeri 8
ntebe 8
okulwanyisa 8
okuwamba 8
omuli 8
omulimu 8
omwana 8
palamenti 8
sp 8
ttakisi 8
wano 8
2 7
31 7
abalwadde 7
asabye 7
bangi 7
bannamateeka 7
bannayuganda 7
bbanka 7
bbiri 7
bulungi 7
byonna 7
david 7
ebikozesebwa 7
ebitundu 7
egenda 7
ekika 7
ekitongole 7
gen 7
kampala 7
katonda 7
kaziimba 7
kitegeeza 7
minisitule 7
mugerwa 7
mutendera 7
mwe 7
nakiweewa 7
nassale 7
ow 7
school 7
singa 7
town 7
ttiimu 7
tugenda 7
ura 7
wansi 7
20 6
3 6
6 6
8 6
abalamuzi 6
abasajja 6
abasomesa 6
abatuuze 6
abazze 6
agambye 6
ajja 6
amerika 6
ategeeza 6
baali 6
babiri 6
bajja 6
bakolera 6
baliko 6
bingi 6
bitundu 6
bodaboda 6
buganda 6
bulijjo 6
byabwe 6
corona 6
eddagala 6
ekibiina 6
ekibuga 6
emmotoka 6
ennanga 6
ennyumba 6
iii 6
katale 6
kayanja 6
kibiina 6
kitaawe 6
kitebe 6
luguudo 6
lwa 6
mbeera 6
mukono 6
nabo 6
nrm 6
obujjanjabi 6
obw 6
obwannannyini 6
ogw 6
okumpi 6
okusoma 6
olugenda 6
oluguudo 6
omunda 6
omuzadde 6
omwaka 6
rehema 6
rotary 6
yali 6
yawadde 6
zaabwe 6
zino 6
10 5
abaakwatiddwa 5
ababadde 5
ababbi 5
abeera 5
akakiiko 5
awaka 5
baabadde 5
bakola 5
bannaabwe 5
biden 5
bigere 5
bobi 5
bokka 5
city 5
club 5
ddoola 5
ddwaaliro 5
drone 5
ebizibu 5
ekitundu 5
ekutte 5
ekyokulabirako 5
ensimbi 5
erya 5
esobola 5
eyo 5
eza 5
gano 5
ggoolo 5
godfrey 5
kalungu 5
kifo 5
kitaawo 5
kukola 5
kuliko 5
kw 5
kwe 5
kyalo 5
moses 5
mukolo 5
mulimu 5
muntu 5
music 5
ndagaano 5
obulwadde 5
oku 5
okuduumira 5
okukwata 5
okukwatibwa 5
okulonda 5
okunoonyereza 5
okusaba 5
okutuusa 5
omubaka 5
omukolo 5
omulonde 5
paul 5
ronald 5
ssande 5
updf 5
wamu 5
abajaasi 4
abasuubuzi 4
abazadde 4
abo 4
aduumira 4
agenda 4
amalwaliro 4
amateeka 4
and 4
baakwatiddwa 4
baategeezezza 4
bagamba 4
bakozi 4
balonda 4
basobola 4
bbaale 4
bifo 4
boda 4
bulamu 4
bwatyo 4
charles 4
east 4
ebifo 4
ebitongole 4
ebyenfuna 4
ebyobufuzi 4
ekigatta 4
ekiseera 4
ekiwamba 4
ekyalo 4
embi 4
emmundu 4
engeri 4
enkambi 4
enkola 4
ennyo 4
essomero 4
eyali 4
ezo 4
ffe 4
ggombolola 4
grace 4
grade 4
jat 4
joseph 4
kasozi 4
katikkiro 4
kinene 4
kituufu 4
klopp 4
kugenda 4
kulonda 4
liverpool 4
lunaku 4
lwaki 4
malwaliro 4
masiki 4
mpaaba 4
muganda 4
mukasa 4
musanvu 4
myaka 4
namirembe 4
nnannyini 4
obukadde 4
obulamu 4
obululu 4
of 4
okufuna 4
okukolera 4
okumanya 4
okutuukiriza 4
okuwa 4
okuyiga 4
okwemulugunya 4
olukiiko 4
omukadde 4
omukazi 4
omulabe 4
omuwendo 4
omuyizi 4
otya 4
peter 4
sizoni 4
ssaabalabirizi 4
teri 4
trump 4
wabweru 4
waggulu 4
wiiki 4
yakwatibwa 4
yasabye 4
yenna 4
100 3
13 3
2020 3
30 3
40 3
5 3
abaawambibwa 3
abagambibwa 3
abajulizi 3
abakozi 3
abakulu 3
abamasomero 3
abawi 3
abooluganda 3
akabinja 3
akalulu 3
akola 3
alabula 3
aliko 3
amafuta 3
amawulire 3
ani 3
avumiridde 3
baabulijjo 3
baasooka 3
baddereeva 3
bakole 3
bakulembeze 3
bakwatibwa 3
balaze 3
baleme 3
bamanyi 3
bana 3
bannabyabufuzi 3
basaba 3
batuuze 3
batwala 3
bawambibwa 3
bazze 3
bbo 3
biri 3
bongere 3
bulaga 3
bungi 3
busega 3
busiro 3
buwama 3
bwangu 3
bwengula 3
byenfuna 3
byobulamu 3
church 3
covid-19 3
d 3
de 3
dpc 3
ebicupuli 3
ebimu 3
ebiri 3
ebisanja 3
ebisinga 3
ebitono 3
ebya 3
ebyo 3
eddembe 3
ekiddako 3
ekifo 3
ekisinga 3
ekitiibwa 3
ekizimbe 3
eky 3
emipiira 3
endagaano 3
ennaku 3
ensawo 3
erimu 3
eya 3
eyabadde 3
flying 3
francis 3
fred 3
ge 3
hassan 3
hospital 3
ii 3
john 3
ka 3
kamukama 3
kangume 3
kawaala 3
ki 3
kigambibwa 3
kiganda 3
kimera 3
king 3
kiro 3
kitebi 3
kkansala 3
kuzannya 3
limu 3
lino 3
lipooti 3
lukaya 3
lutikko 3
lwe 3
lwokutaano 3
lyabwe 3
lye 3
maj 3
man 3
mateeka 3
mawanga 3
mayanja 3
mayiro 3
mayitire 3
mbi 3
meeya 3
mengo 3
mirimu 3
misango 3
mityana 3
mmeeya 3
mmengo 3
mombasa 3
munisipaali 3
mutebi 3
muyaga 3
mw 3
namayanja 3
nate 3
nazo 3
nelson 3
nnamba 3
nnamukadde 3
november 3
nteekateeka 3
nursery 3
obukulu 3
obuvunaanyizibwa 3
obuweereza 3
obuyambi 3
obuzibu 3
oguwedde 3
ogwa 3
okubaako 3
okubuzaabuza 3
okugenda 3
okuggyawo 3
okugwa 3
okukkiriza 3
okumulaba 3
okusalawo 3
okusigala 3
okusinga 3
okusinziira 3
okusomesa 3
okutunda 3
okutwala 3
okuweereza 3
okwenyigira 3
okwewala 3
okwogera 3
olwaleero 3
olwo 3
omugenzi 3
omulala 3
omusawo 3
oteekwa 3
p/s 3
rev 3
road 3
siriimu 3
squad 3
ssaako 3
ssaawa 3
ssatu 3
ssemujju 3
sseninde 3
super 3
tebalina 3
tulina 3
wakati 3
wine 3
yagasseeko 3
yakuutidde 3
yalina 3
yasuubiza 3
ying 3
yingini 3
zokka 3
00 2
17 2
18 2
180 2
19 2
2016 2
2018 2
211 2
300 2
310 2
500 2
98 2
abaabakwata 2
abaabuzibwawo 2
abaakwatibwa 2
abaalondeddwa 2
ababbira 2
ababiri 2
ababuzibwawo 2
abajja 2
abakola 2
abakristaayo 2
abakugu 2
abakungu 2
abakuumi 2
abakwate 2
abakyanoonyezebwa 2
abali 2
abalonde 2
abangi 2
abasirikale 2
abasoba 2
abasobola 2
abasuubiza 2
abavuzi 2
abawambibwa 2
abdallah 2
abeewandiisa 2
abyogeredde 2
afuna 2
ag 2
agenze 2
agezaako 2
aggulawo 2
aka 2
akatale 2
akubiriza 2
akubirizza 2
alex 2
alisson 2
all 2
amabanga 2
amagezi 2
amagoba 2
amagulu 2
amaguzi 2
amaka 2
amalala 2
amangu 2
amanyi 2
amasannyalaze 2
amasasi 2
amawanga 2
amayumba 2
amusongamu 2
amyuka 2
asaanye 2
asobodde 2
asobola 2
associated 2
asula 2
atandika 2
atenderezza 2
atendeseeko 2
atwala 2
atyo 2
awa 2
ayogerera 2
baagala 2
baakulembeddwaamu 2
baakutwalibwa 2
baalonze 2
baana 2
baawambibwa 2
babatwala 2
babeera 2
babuzibwawo 2
badda 2
baffe 2
bafuna 2
bagguddwaako 2
bakolagana 2
bakwasibwa 2
bakwatibwe 2
bakwatiddwa 2
balimwezo 2
bamale 2
bannannyini 2
banne 2
basabye 2
basawo 2
basigala 2
basigale 2
basitukiremu 2
basomesa 2
batambudde 2
batambulira 2
batandike 2
bategeezezza 2
batunda 2
bava 2
bawa 2
bawakanya 2
baweereddwa 2
bawulira 2
bayizi 2
bbeeyi 2
bbomu 2
beenyigira 2
beewale 2
bekikwatako 2
bigenda 2
bijja 2
bikolwa 2
bikozesebwa 2
binnyonnyoddwa 2
bintu 2
bityo 2
bizibu 2
bizinensi 2
bombo 2
bongedde 2
bubenje 2
bubi 2
budde 2
buddo 2
buddu 2
bukasa 2
bukedde 2
bukoto 2
bukulembeze 2
bulange 2
bungereza 2
buufu 2
buwambe 2
buyinza 2
byalo 2
byobufuzi 2
bypass 2
care 2
center 2
central 2
col 2
day 2
dda 2
ddembe 2
dduuka 2
december 2
disan 2
divizoni 2
dollo 2
eba 2
ebadde 2
ebbeeyi 2
ebeera 2
ebibiina 2
ebigezo 2
ebikolwa 2
ebikuumaddembe 2
ebirabo 2
ebirowoozo 2
ebisookerwako 2
ebizuuse 2
ebyava 2
ebyetaagisa 2
ebyokulonda 2
ebyokwerinda 2
eddalu 2
eddamuzi 2
eddimu 2
egaana 2
eggye 2
egudde 2
ekigenda 2
ekikessi 2
ekikyamu 2
ekimu 2
ekinoonyereza 2
ekiragiro 2
ekirooto 2
ekituufu 2
ekivuddeko 2
ekoze 2
embalirira 2
emikono 2
emikwano 2
emirembe 2
emma 2
emu 2
enanga 2
engalo 2
enganda 2
engine 2
enguudo 2
enkadde 2
enkeera 2
enkoko 2
enkolagana 2
ennambulukufu 2
ensa 2
entakera 2
entebe 2
enteekateeka 2
entono 2
ery 2
eryo 2
esabuukuludde 2
esangibwa 2
esasula 2
esooka 2
essaawa 2
etabanguka 2
etaddewo 2
ettendekero 2
ewa 2
ewedde 2
eweesa 2
ewenyuka 2
eyawangudde 2
eye 2
eyise 2
eyitibwa 2
ezimu 2
eziwera 2
ezra 2
ggoolokipa 2
good 2
gulina 2
gwetabiddwaako 2
gwonna 2
hoima 2
infant 2
irwa 2
iv 2
janet 2
jesero 2
jjemba 2
joint 2
justine 2
kabaka 2
kabanda 2
kabenje 2
kabinja 2
kaggwa 2
kalunda 2
kano 2
kasaali 2
kasasa 2
kasenge 2
kasokoso 2
kawempe 2
kayongo 2
kayunga 2
keane 2
kibira 2
kibuli 2
kigenda 2
kihika 2
kika 2
kiki 2
kikosa 2
kikubampagi 2
kikulu 2
kikyamu 2
kimu 2
kindergarten 2
kira 2
kiri 2
kirina 2
kitaka 2
kitongole 2
kkono 2
kololo 2
kubala 2
kuddamu 2
kufa 2
kufi 2
kufuba 2
kufuna 2
kumala 2
kusoomooza 2
kutandika 2
kutukosa 2
kutya 2
kwa 2
kyaddiridde 2
kyonna 2
kyotera 2
law 2
lewis 2
liigi 2
lokech 2
lubaga 2
lugoloobi 2
luno 2
lusambu 2
luwalira 2
lwasa 2
lwokuna 2
lyetaaga 2
lyonna 2
maanyi 2
magunda 2
mangu 2
march 2
market 2
mbabazi 2
medical 2
minista 2
mitendera 2
mmundu 2
mpoza 2
mpumudde 2
mpuuga 2
mtk 2
mubaka 2
mugisha 2
muhammad 2
mukomye 2
mukyala 2
mulamba 2
mulekeraawo 2
mumyuka 2
munnamateeka 2
musango 2
musoke 2
mutundwe 2
mutungo 2
muwaya 2
muwendo 2
muyanja 2
nabusanke 2
nabweru 2
naguru 2
nakawa 2
nakitende 2
nakyejjwe 2
namuli 2
ndejje 2
nkola 2
nkyukakyuka 2
noah 2
northern 2
nsaba 2
nsi 2
ntandikwa 2
ntikko 2
ntono 2
ntumbwe 2
nup 2
obama 2
obufuzi 2
obungi 2
obuntu 2
obunyazi 2
obusungu 2
obutujju 2
obuwanguzi 2
obwereere 2
ogeraageranya 2
okimanyi 2
okubabuzaawo 2
okubayamba 2
okudda 2
okuddamu 2
okufa 2
okufulumya 2
okujja 2
okukkakkana 2
okukolerera 2
okukomawo 2
okukulira 2
okukuuma 2
okukwasa 2
okukyusa 2
okumuzza 2
okunywa 2
okunyweza 2
okusibwako 2
okusiima 2
okutambuza 2
okutandika 2
okuteeka 2
okutta 2
okutuula 2
okutwalira 2
okuvaayo 2
okuvunaanibwa 2
okuwaayo 2
okuwoza 2
okuyamba 2
okuyita 2
okuzaala 2
okuzzaawo 2
okwagala 2
okwali 2
okwambala 2
okwekulaakulanya 2
okweraliikiriza 2
okwesimba 2
okweteekateeka 2
okwongera 2
oli 2
olina 2
oludda 2
olunaku 2
olusiisira 2
olutabaalo 2
oluzimbi 2
olwa 2
omugaso 2
omuggalo 2
omujjuzo 2
omukono 2
omulabirizi 2
omulamuzi 2
omulangira 2
omulembe 2
omuluka 2
omutawaana 2
omutendera 2
omutindo 2
omutuuze 2
omuwandiisi 2
omuyaga 2
omwezi 2
owapoliisi 2
oyagala 2
p 2
p1 2
patrick 2
people 2
premier 2
pulayimale 2
rdc 2
richard 2
rosemary 2
ruberenga 2
s 2
saints 2
samuel 2
seminti 2
society 2
solskjaer 2
ssaabalamuzi 2
ssaza 2
ssebaggala 2
ssebalamu 2
ssebanyiga 2
ssegona 2
ssendikwanawa 2
ssenninde 2
ssundiro 2
steven 2
talina 2
tebamanyi 2
tekalina 2
temumanyi 2
tewali 2
times 2
ttendekero 2
tukoseddwa 2
vincent 2
waabwe 2
waka 2
wilberforce 2
william 2
wonna 2
yabutadde 2
yabyogeredde 2
yadde 2
yafuliddwa 2
yaggyawo 2
yagumizza 2
yakola 2
yalaze 2
yannyonnyodde 2
yasangibwa 2
yasiimye 2
yasinzidde 2
yatuukiriddwa 2
yatwaliddwa 2
yayogedde 2
yayogeddeko 2
yayongeddeko 2
yeebazizza 2
yeesimba 2
zonna 2
