mu 443
ku 308
nga 270
n 260
nti 157
e 152
ne 152
ng 118
era 94
y 93
abantu 86
bwe 69
w 68
wa 62
ya 55
olw 48
kino 46
eno 45
bw 44
ye 43
bino 34
eri 34
wabula 34
abadde 33
gavumenti 32
naye 32
asabye 31
ky 31
kuba 30
2 28
katonda 28
abaana 27
kubanga 27
okuva 26
agamba 25
kya 25
omusumba 25
we 25
buli 24
eby 24
ono 24
rev 24
ebintu 23
yesu 23
ate 22
ba 21
guno 21
kkanisa 21
lw 21
maaso 21
by 20
gw 20
gy 20
kusaba 20
kw 20
uganda 20
ategeezezza 19
enjawulo 19
agambye 18
fr 18
nnyo 18
abakkiriza 17
abalala 17
amazuukira 17
kampala 17
okusaba 17
abayizi 16
b 16
bantu 16
eggwanga 16
ggwanga 16
lwa 16
lya 16
ssentebe 16
z 16
8 15
ab 15
be 15
ga 15
yategeezezza 15
zino 15
2022 14
ali 14
baabwe 14
bonna 14
emirimu 14
kkooti 14
kyokka 14
mmisa 14
naddala 14
okuli 14
1 13
aba 13
abazadde 13
ensi 13
gye 13
k 13
kwa 13
omu 13
st 13
7 12
abakristu 12
abamu 12
balina 12
bano 12
bulamu 12
byonna 12
can 12
eky 12
emyaka 12
essomero 12
godfrey 12
mulago 12
ogw 12
okukola 12
omugenzi 12
paul 12
ssaako 12
waabwe 12
wakati 12
abakozi 11
akulira 11
bbeeyi 11
bugembe 11
bwa 11
ebikolwa 11
ennyo 11
gwa 11
kyalo 11
lubaga 11
oluvannyuma 11
omuntu 11
omwaka 11
paasika 11
poliisi 11
za 11
3 10
abakulembeze 10
abatuuze 10
abyogeredde 10
akakiiko 10
amafuta 10
ategeeza 10
bali 10
ey 10
eya 10
ez 10
kati 10
kifo 10
kristu 10
kye 10
lino 10
lutikko 10
lwe 10
ly 10
minisitule 10
moses 10
namirembe 10
obuwumbi 10
wano 10
yasabye 10
zaabwe 10
000 9
abawagizi 9
april 9
asaba 9
bagamba 9
bangi 9
bya 9
bye 9
church 9
ddwaaliro 9
ebirala 9
enkuba 9
kalangala 9
kristo 9
leero 9
masaka 9
mukama 9
ndejje 9
okuba 9
olunaku 9
singa 9
ttiimu 9
ven 9
wamu 9
yaabwe 9
10 8
100 8
19 8
4 8
abasuubuzi 8
babadde 8
bagenda 8
bbaasi 8
buno 8
bwabwe 8
covid 8
disitulikiti 8
ebbeeyi 8
ekisaawe 8
emipiira 8
ensonga 8
eyali 8
g 8
gwe 8
kimu 8
kiseera 8
kiwanuka 8
kuno 8
kwe 8
liigi 8
maama 8
ngeri 8
obulungi 8
okufuna 8
okulaba 8
omusango 8
s 8
sheikh 8
siteegi 8
sizoni 8
yagambye 8
yezu 8
11 7
africa 7
akulembeddemu 7
bannayuganda 7
banne 7
benders 7
bitundu 7
easter 7
ebyobulamu 7
ekikopo 7
ekkanisa 7
ekyalo 7
enguzi 7
ffamire 7
jinja 7
ka 7
kasangati 7
katongole 7
kiganda 7
kiraabu 7
kuliko 7
nansana 7
obutonde 7
ogwa 7
okukozesa 7
okusinziira 7
okutandika 7
okutuusa 7
okuzuukira 7
okwogera 7
olwaleero 7
omubaka 7
omulabirizi 7
omuli 7
omupiira 7
omutendesi 7
ow 7
palamenti 7
peter 7
ssente 7
ssomero 7
u 7
university 7
villa 7
00 6
14 6
30 6
9 6
ababaka 6
abadigize 6
abakyala 6
abasiraamu 6
abavubuka 6
akubirizza 6
amagezi 6
amasimu 6
amayumba 6
amazzi 6
baali 6
baana 6
bakola 6
bbanja 6
buganda 6
bwabadde 6
charles 6
ddala 6
dr 6
ebisale 6
ebizibu 6
ebyalo 6
ekitongole 6
ekitundu 6
ekya 6
endala 6
ennaku 6
ensangi 6
ensimbi 6
erya 6
essimu 6
francis 6
gya 6
katikkiro 6
kigo 6
kisaawe 6
kityo 6
layisinsi 6
makhonje 6
minisita 6
mmande 6
mukyala 6
mupiira 6
namusoke 6
nsonga 6
o 6
obulamu 6
ogujja 6
okubeera 6
okudda 6
okusalawo 6
okusobola 6
okutaasa 6
okwegatta 6
olwa 6
olwo 6
omulimu 6
owa 6
pikipiki 6
proline 6
robert 6
ssaabasumba 6
wadde 6
wakiso 6
waliwo 6
wiiki 6
yabadde 6
yali 6
yennyamidde 6
18 5
20 5
23 5
5 5
6 5
abafumbo 5
abasomesa 5
agenda 5
avumiridde 5
awatali 5
baagala 5
bajeti 5
bajja 5
bannaabwe 5
bbaala 5
bifo 5
bikolwa 5
bubaka 5
budde 5
bulijjo 5
burnley 5
c 5
city 5
divizoni 5
ebitundu 5
ekintu 5
ekiseera 5
ekkubo 5
embeera 5
emirembe 5
emisango 5
emiti 5
emitwe 5
empaka 5
emu 5
essaawa 5
ettemu 5
gyabwe 5
kiragga 5
kituufu 5
kugenda 5
kukola 5
kyetume 5
kyotera 5
makindye 5
masomero 5
monday 5
mugerwa 5
musumba 5
muwonge 5
mwe 5
na 5
nabo 5
nalunkuuma 5
namiiro 5
njeru 5
nk 5
nsi 5
oba 5
obukadde 5
obulabirizi 5
obusumba 5
okukuuma 5
okulinnya 5
okulonda 5
okusabira 5
okutta 5
okutunda 5
okutuuka 5
okuyambako 5
okwabadde 5
okwongera 5
olukiiko 5
omukulu 5
omulambo 5
omulangira 5
omusomesa 5
omwana 5
pulezidenti 5
ssemogere 5
ssuubi 5
taata 5
taxi 5
tom 5
yagasseeko 5
yonna 5
ze 5
1-0 4
12 4
13 4
15 4
22 4
ababadde 4
abaddusi 4
abakulisitaayo 4
abalangira 4
abali 4
abuulira 4
ag 4
alaze 4
alipoota 4
amaanyi 4
amawanga 4
amawulire 4
awaka 4
awamu 4
balumiriza 4
basobole 4
bazze 4
bba 4
boda 4
boodabooda 4
bukadde 4
bungi 4
busoga 4
byabwe 4
byalo 4
center 4
centre 4
christian 4
dyche 4
ebadde 4
ebikyamu 4
ebya 4
ebyenjawulo 4
ebyensimbi 4
eddagala 4
egy 4
ekibiina 4
ekiro 4
ekizibu 4
emikono 4
emmanuel 4
emmotoka 4
emmwanyi 4
ennyimba 4
ewa 4
eyekanamye 4
gano 4
gayaza 4
ggwanika 4
gombe 4
july 4
kano 4
kasujja 4
kayanja 4
kcca 4
kkampuni 4
lb 4
looya 4
lubowa 4
lukiiko 4
lunaku 4
luno 4
lye 4
maka 4
may 4
mayanja 4
mazuukira 4
mbarara 4
mbeera 4
mipiira 4
mirimu 4
misinde 4
mityana 4
mubajje 4
mubangizi 4
mukasa 4
mukolo 4
munne 4
mutwe 4
nansikombi 4
nayo 4
nyanzi 4
nyerere 4
obubaka 4
obubonero 4
obudde 4
obutabanguko 4
obw 4
obwedda 4
oku 4
okubaako 4
okubiri 4
okubula 4
okufa 4
okuleeta 4
okulya 4
okutumbula 4
okuwulira 4
okuzimba 4
okwagala 4
okwenyigira 4
okwewala 4
olulangira 4
olutalo 4
omulamuzi 4
omusaalaba 4
omutukuvu 4
omuyimbi 4
omuzzukulu 4
omwezi 4
omwogezi 4
ossa 4
ppaasika 4
rakai 4
sam 4
samuel 4
school 4
si 4
ssabalangira 4
ssentaayi 4
ssese 4
tanzania 4
tebalina 4
wansi 4
wiini 4
wilson 4
yeebazizza 4
zonna 4
1500 3
24 3
47 3
a 3
abagenda 3
abakristaayo 3
abakulu 3
abasaabaze 3
abasinga 3
abato 3
abayimbi 3
abazzukkulu 3
abyogedde 3
acamudde 3
acheng 3
aciru 3
afiiridde 3
ajok 3
ak 3
akabonero 3
akaseera 3
akola 3
akuba 3
akubiriza 3
akuutidde 3
akuutira 3
all 3
amalala 3
amanyiddwa 3
amasannyalaze 3
amasomero 3
amataba 3
amyuka 3
apollo 3
asabidde 3
asinzidde 3
asoma 3
avuga 3
baabadde 3
bakyampiyoni 3
basabiddwa 3
basatu 3
basobodde 3
basuze 3
batuuze 3
batwala 3
baweereddwa 3
bayizi 3
bazadde 3
bbiri 3
beekube 3
bibadde 3
bigenda 3
bingi 3
biri 3
bishop 3
bo 3
bokka 3
buikwe 3
bujulizi 3
bukedde 3
bul 3
bulungi 3
bunjo 3
bunya 3
busiika 3
butwa 3
buwanguzi 3
buzibu 3
bwatyo 3
bwonna 3
championships 3
cissy 3
coporal 3
council 3
danstun 3
david 3
ddagala 3
ddene 3
ddiini 3
december 3
ebbaluwa 3
ebigezo 3
ebikozesebwa 3
ebiri 3
ebitongole 3
ebyeyongedde 3
ebyo 3
edda 3
ekibuga 3
ekifo 3
ekkulu 3
ekulembeddwamu 3
ekyokulabirako 3
emikisa 3
emitima 3
emizannyo 3
emmaali 3
emmundu 3
empisa 3
enduulu 3
engeri 3
enguudo 3
enkulu 3
ennuuni 3
ennyumba 3
eryo 3
esangibwa 3
esooka 3
essaza 3
essuubi 3
ettaka 3
ettu 3
eviiriddeko 3
eyawangula 3
eyeekanamye 3
fellowship 3
flash 3
fom 3
friday 3
gamba 3
ggombolola 3
gravity 3
house 3
hy 3
ibrahim 3
isaac 3
jjumba 3
john 3
june 3
kabanda 3
kabenje 3
kabonero 3
kagenda 3
kanisa 3
kaweefube 3
kazo 3
kiboga 3
kibuli 3
kidiba 3
kigambibwa 3
kiggundu 3
kijja 3
kikyamu 3
kirungi 3
kitebe 3
kitongole 3
kitundu 3
kutya 3
kwebyo 3
kyabwe 3
kyofatogabye 3
kyonna 3
l 3
league 3
love 3
lubwama 3
lulyo 3
luwalira 3
luwonko 3
luwummula 3
luzira 3
lv 3
lwaki 3
lwandasa 3
lwokuna 3
lwokutaano 3
maj 3
makya 3
maria 3
masannyalaze 3
mayiga 3
mazinga 3
mbejjo 3
mbuya 3
me 3
medical 3
meeya 3
mmita 3
mpaka 3
mt 3
mufti 3
muhammad 3
mukoka 3
mulimu 3
munisipaali 3
musanje 3
musede 3
musingi 3
mutendera 3
mutundwe 3
muyanja 3
mwanyi 3
mwesigwa 3
mwezi 3
myaka 3
nakyejwe 3
nambassa 3
namboole 3
national 3
nkola 3
nkya 3
nnamba 3
nnamungi 3
november 3
nsubuga 3
ntege 3
obujulizi 3
obulwadde 3
obumu 3
obusabadinkoni 3
obusiraamu 3
obutundu 3
obuvunanyizibwa 3
obuyimba 3
obuyisiraamu 3
of 3
okubadde 3
okubawa 3
okuddamu 3
okugenda 3
okuggya 3
okugonjoola 3
okukimanya 3
okukoma 3
okukomezebwa 3
okukomya 3
okumala 3
okusamba 3
okusigala 3
okusimba 3
okusinga 3
okusonyiwagana 3
okutaano 3
okutambula 3
okutambuza 3
okutya 3
okuyita 3
okw 3
okwebaza 3
okwekennenya 3
okwenenya 3
okwongeza 3
old 3
oluguudo 3
oluva 3
omar 3
omugoba 3
omuguwa 3
omulala 3
omulokozi 3
omumyuka 3
omutwe 3
omuwandiisi 3
omuwendo 3
omuziki 3
opa 3
orland 3
otim 3
our 3
oyesigye 3
oyo 3
pallaso 3
patrick 3
pentecostal 3
phina 3
pr 3
primary 3
russia 3
saints 3
sekonda 3
sentamu 3
simbwa 3
sitaani 3
south 3
ss 3
ssaabadinkoni 3
ssaawa 3
ssande 3
ssemmanda 3
ssinga 3
steven 3
su 3
town 3
ttaka 3
ukraine 3
umsc 3
united 3
wampeewo 3
worship 3
yasinzidde 3
yategezezza 3
yatuuse 3
yenna 3
yenyamidde 3
0-0 2
1000 2
2-1 2
2016 2
2021 2
25 2
250 2
27 2
28 2
3-2 2
341 2
40 2
43 2
500 2
5000 2
52 2
652 2
abaabadde 2
abaagala 2
abaakafiira 2
abaakafuna 2
abaakoseddwa 2
abaamuwadde 2
abaddewo 2
abafamire 2
abagagga 2
abagoba 2
abakadde 2
abakazi 2
abakiriza 2
abakola 2
abakolera 2
abakungu 2
abalimi 2
abalina 2
abalokole 2
abalumiziddwa 2
abalwadde 2
abalwanyi 2
abamugoberera 2
abasaba 2
abasajja 2
abasatu 2
abasawo 2
abasirikale 2
abasodokisi 2
abasoma 2
abatafaayo 2
abatalina 2
abe 2
adduka 2
afuuke 2
agezaako 2
agula 2
ajjukiza 2
akabenje 2
akalulu 2
akankwasa 2
akatale 2
akazibu 2
akolera 2
akulembedde 2
al 2
alex 2
alfred 2
alina 2
alon 2
amagombe 2
amagye 2
amalungi 2
amatabi 2
amayonjo 2
and 2
andereya 2
annyonyode 2
arua 2
asabira 2
asiibuddwa 2
association 2
asuubizza 2
ategeerekeseeko 2
ategeezza 2
ategezeeza 2
atendeka 2
atwala 2
avuddeyo 2
awadde 2
awagidde 2
ayagaliza 2
ayambalidde 2
ayanukudde 2
ayongedde 2
ayongera 2
ayongerako 2
ayume 2
azuukidde 2
baaluganda 2
babaako 2
babiri 2
bacamudde 2
badda 2
baddembe 2
bafudde 2
bafumbo 2
bafunye 2
bagende 2
bagenze 2
bagezezaako 2
bakira 2
bakkiriza 2
bakoloobya 2
bakoze 2
bakubiriziddwa 2
bakungubagidde 2
bakyala 2
balabe 2
balamu 2
baleme 2
balumba 2
balya 2
bamala 2
bamatidde 2
band 2
bannaddiini 2
bannannyini 2
banoonya 2
banywevu 2
basaba 2
basigala 2
basobola 2
basooka 2
batambulira 2
bategeezezza 2
batuuse 2
batya 2
bavudde 2
bayan 2
bayinza 2
bayita 2
bayogeddeko 2
bazannyi 2
bbaale 2
bbanga 2
bbanka 2
bbo 2
benard 2
bibira 2
bigere 2
bijja 2
bikozesebwa 2
bintu 2
bitegeezeddwa 2
bizibu 2
bizinensi 2
bizinga 2
bongere 2
bright 2
buba 2
bufumira 2
bugenyi 2
bukenya 2
buwumbi 2
buzzibwe 2
bwanamukulu 2
bwangu 2
bweyali 2
byabadde 2
byabulijjo 2
byaffe 2
byekwaso 2
byogeddwa 2
bypass 2
canon 2
cathedral 2
central 2
cherop 2
cindy 2
cipusi 2
cup 2
cwf 2
ddakiika 2
ddigi 2
de 2
development 2
division 2
dorcus 2
ebbanga 2
ebbiri 2
ebeeyi 2
ebibi 2
ebifaananyi 2
ebifo 2
ebigenda 2
ebimu 2
ebimuli 2
ebinnya 2
ebisago 2
ebisanyukirwamu 2
ebitiibwa 2
ebitone 2
ebitundibwa 2
ebizimbe 2
ebyenfuna 2
ebyokulonda 2
eddiini 2
eddwaliro 2
egenda 2
egikolebwa 2
egisoba 2
egitwala 2
egiyise 2
egudde 2
ejja 2
ekigo 2
ekiraga 2
ekisangibwa 2
ekitiibwa 2
ekiwandiiko 2
ekiwugirwaamu 2
ekko 2
ekola 2
ekubwa 2
ekyabadde 2
ekyo 2
elizabeth 2
emabega 2
embalirira 2
embiro 2
emirundi 2
emisinde 2
emiziko 2
emmere 2
empya 2
emwanyi 2
emyala 2
engoye 2
enjiri 2
enkalala 2
enkuuli 2
enkwe 2
enkya 2
ennyimbe 2
ennyonta 2
enteekateeka 2
entindo 2
entobazi 2
entono 2
erigema 2
erimu 2
erinnya 2
essanyu 2
essira 2
etaddewo 2
ettima 2
eva 2
evelyn 2
ewedde 2
eyabadde 2
eyafiiridde 2
eyafudde 2
eyanjulidde 2
eyawummula 2
eyazuukira 2
eyonoona 2
ezisoba 2
faaza 2
fambo 2
ffaamu 2
first 2
fl 2
fortune 2
fred 2
fufa 2
fuso 2
gaabwe 2
ge 2
geofrey 2
gertrude 2
giants 2
gift 2
gino 2
gladys 2
gommotoka 2
green 2
guba 2
gugenda 2
gulinnye 2
gulu 2
gutti 2
gyonna 2
hajat 2
hajji 2
hakim 2
hassan 2
health 2
henry 2
hotel 2
i 2
iganga 2
iv 2
jackson 2
janet 2
jeronymos 2
jude 2
julius 2
kabaka 2
kadde 2
kadhi 2
kakiiko 2
kansanga 2
kapiteeni 2
kasagga 2
kasita 2
katale 2
kato 2
kayabula 2
kazimba 2
ke 2
khalid 2
kibiina 2
kibinja 2
kibuga 2
kifuba 2
kigongo 2
kimera 2
kiro 2
kisiibo 2
kitegeeza 2
kiwenda 2
kizimbe 2
kizito 2
kkaadi 2
kkoma 2
knight 2
kontulakita 2
kufa 2
kugezesa 2
kuggwa 2
kugitunulamu 2
kukosa 2
kulaba 2
kumpi 2
kusimba 2
kusoomozebwa 2
kutambuza 2
kuva 2
kwetabiddwamu 2
kyebakola 2
kyenvu 2
kyerima 2
kyetaaga 2
lady 2
libadde 2
lillian 2
limu 2
loole 2
loosi 2
lt 2
lu 2
ludda 2
lutalo 2
lwakubiri 2
lwengo 2
magombolola 2
mande 2
martyrs 2
mary 2
masajja 2
mataba 2
mateeka 2
matyrs 2
mayumba 2
mazzi 2
mbalirira 2
mbiro 2
mbuga 2
miracle 2
mitima 2
mmeeya 2
mohammed 2
mothers 2
muffe 2
muganda 2
mugumbula 2
muhammed 2
mukono 2
mukulu 2
mulala 2
mulamwa 2
muluka 2
munnaabwe 2
musa 2
musango 2
musasizi 2
muslim 2
mutetsi 2
muto 2
mutuuze 2
muwanika 2
muzeeyi 2
mwaka 2
mwanja 2
mwanje 2
myala 2
nabbanja 2
nabbi 2
nabisaso 2
nakibizzi 2
nal 2
nalule 2
namungoona 2
nathan 2
nawandagala 2
neyebaza 2
ngalo 2
nicholas 2
nkambo 2
nnaku 2
nnamutikwa 2
nnyaabwe 2
nnyambala 2
nnyingi 2
noordin 2
nsereko 2
nsiike 2
ntalo 2
obubindo 2
obujjanjabi 2
obukodyo 2
obuli 2
obulimi 2
obupya 2
obutagwaamu 2
obutali 2
obutwa 2
obuvunaanyizibwa 2
obuyambi 2
obuyinza 2
obwamazuukira 2
obwesige 2
odeba 2
oguwedde 2
oketch 2
okubaawo 2
okubatiza 2
okubazimbira 2
okubuulira 2
okufaayo 2
okugaanibwa 2
okugatta 2
okugema 2
okugeza 2
okuggyayo 2
okugobwa 2
okugogola 2
okujja 2
okujjukira 2
okukendeeza 2
okukiika 2
okukkiriza 2
okukulembera 2
okukuliza 2
okukwatira 2
okuleetawo 2
okuliraana 2
okulondoola 2
okulowooza 2
okulwa 2
okulwanyisa 2
okumanyagana 2
okunoonya 2
okunyeenya 2
okunyigirizibwa 2
okunyweeza 2
okusiima 2
okusinza 2
okusomoozebwa 2
okutambulira 2
okutangaaza 2
okutereeza 2
okutuukirizanga 2
okutwala 2
okuvaayo 2
okuwa 2
okuwangana 2
okuwangula 2
okuyamba 2
okuyiga 2
okuyimba 2
okuyingira 2
okuyisa 2
okwa 2
okwagalana 2
okwaliwo 2
okwefumintiriza 2
okwekubamu 2
okwemulugunya 2
okweriisa 2
okwetaba 2
okwetoloola 2
okwezza 2
okwonooneka 2
olugendo 2
olukya 2
olulimi 2
olusoma 2
olusozi 2
oluwaabi 2
olwassibwawo 2
olwekyo 2
olwokubiri 2
omubeezi 2
omuggalo 2
omukolo 2
omukubiriza 2
omukuumi 2
omukwano 2
omukyala 2
omusaayi 2
omutindo 2
omutujju 2
omuwaabi 2
omuzigiti 2
onduparaka 2
otadde 2
parish 2
pc 2
pinetti 2
ppaaka 2
premio 2
racheal 2
ramadan 2
robinah 2
rt 2
saako 2
sayuuni 2
sc 2
schools 2
sean 2
sempijja 2
semuto 2
senior 2
serverus 2
sheldon 2
sipiika 2
so 2
son 2
sot 2
ssaalongo 2
ssabadinkoni 2
ssabalabirizi 2
ssatu 2
ssebuguzi 2
ssebunya 2
ssebyala 2
ssekaggo 2
sseminti 2
ssemogerere 2
ssenga 2
ssenjobe 2
ssenkindu 2
ssenyonjo 2
stars 2
stav 2
stephen 2
stores 2
talina 2
tebamanyi 2
tebandeke 2
tebannafuna 2
tebayinza 2
technical 2
terina 2
tewali 2
teyitamu 2
the 2
tonny 2
ttakka 2
ttani 2
ttooki 2
tugenda 2
tukulaze 2
tulina 2
ubteb 2
ukrain 2
umeme 2
union 2
unra 2
ura 2
vent 2
vipers 2
waakiri 2
waffe 2
waggulu 2
wakula 2
waleed 2
wasinzidde 2
wasswa 2
watuba 2
webayita 2
wiikendi 2
wilberforce 2
women 2
yadde 2
yafudde 2
yafunye 2
yagulira 2
yahaya 2
yajja 2
yakola 2
yalagira 2
yalina 2
yava 2
yaweebwa 2
yazaalibwa 2
yebintu 2
yeemu 2
yeetabiddwamu 2
yiika 2
yunivasite 2
zaakugula 2
zakwongeza 2
zirabamuzaale 2
zitikka 2
ziyitibwa 2
zombi 2
