num 18219
mu 7196
emu 2271
kkumi 2239
na 1942
abiri 1811
bbiri 1391
ssatu 1059
asatu 999
mukaaga 913
ne 903
ttaano 844
nnya 842
musanvu 720
munaana 718
ku 705
mwenda 694
nkumi 662
mitwalo 361
katonda 344
lukumi 338
ana 324
kikumi 315
ebya 290
busiriivu 287
bya 278
era 278
yakobo 278
kya 271
yakuwa 265
nga 264
kamu 263
musa 251
eya 250
no 234
ba 223
yusufu 210
bubiri 209
e 205
bibiri 201
olwa 196
ya 192
bukadde 190
bayibuli 179
bisatu 174
abayisirayiri 169
ekya 168
wa 168
bo 162
naye 156
omu 152
bwe 144
aba 141
lwa 139
ga 135
nti 132
gumu 131
okuva 129
abantu 125
mutwalo 125
buli 124
abaleevi 122
busatu 120
ataano 118
kye 117
eri 115
peetero 115
ensi 113
abalala 112
bitaano 108
ibulaamu 108
bufukunya 106
buwumbi 106
okukola 103
omuntu 103
busedde 99
ebiri 97
bassekabaka 96
samwiri 96
weema 96
yokaana 96
abassessalonika 95
ebyomumirembe 95
isaaka 95
ebintu 93
lukaaga 93
bina 88
ekibonyoobonyo 88
lwenda 88
ebitabo 87
baganda 86
oba 86
lunaana 84
falaawo 81
entukuvu 79
lya 79
alooni 78
gya 78
okuba 78
abo 77
olunaku 77
oyo 77
ngo 74
okubiri 73
ibulayimu 72
misiri 72
omwana 72
endagaano 71
bye 69
maaso 69
awa 68
oku 68
amazzi 67
ebigambo 67
okubala 67
ogu 66
abakkolinso 65
ayagala 65
bakabona 65
ebikwata 65
ebiweebwayo 65
omukazi 65
omusajja 65
be 64
esawu 64
buna 63
ebyawandiikibwa 63
kasiriivu 63
olubereberye 63
butaano 61
ebiragiro 60
empya 60
ekitiibwa 59
gye 59
timoseewo 59
univ_sqr_xl 59
url 59
gu 58
gwa 58
kubanga 58
amagezi 56
ebibi 56
kanani 56
oluyimba 56
balamu 55
engeri 55
enkolagana 55
lusanvu 55
ssente 55
addamu 54
abaana 53
ajja 53
esatu 53
okubikkulirwa 53
bazzukulu 51
isirayiri 50
muba 50
nsanvu 50
ssabbiiti 50
abalalaweereza 49
amateeka 49
lutti 49
ye 49
ebikolwaabaruumi 48
ekisooka 48
ekyabalamuziluusi 48
ekyamateekayoswa 48
enkyusa 48
esezayobuzabbuli 48
ezeekyeridanyerikoseyayoweeriamosi 48
ezeranekkemiya 48
obadiyayonamikkanakkumukaabakuukuzeffaniyakaggayizekkaliyamalakimatayomakkolukkayokaana 48
obunnabbi 48
okukungubaga 48
sulemaaniisaayayeremiya 48
timoseewotitofiremooniabebbulaniyayakobo 48
yokaanayuda 48
abakkolinsoabaggalatiyaabeefesoabafiripiabakkolosaayi 47
engeroomubuulizi 47
kwa 46
bwa 45
egamba 45
ekyo 45
obulungi 45
jpg 44
munno 44
nkaaga 44
amaanyi 43
embaga 43
muyinza 43
amakulu 42
okugenda 42
agenda 41
mubeere 41
oyinza 41
univ/art 41
laakeeri 40
maka 40
okuweereza 40
yuda 40
kanaana 39
kino 39
obo 39
yoswa 39
ebirala 38
essuula 38
kyenda 38
nge 38
byonna 37
ena 37
kabaka 37
okuwuliriza 37
wammwe 37
ebyo 36
ekibinja 36
emikisa 36
erinnya 36
intaneeti 36
kisiisira 36
owa 36
agakwata 35
agali 35
kakaaga 35
lunaku 35
omuliro 35
date 34
ebizibu 34
emyaka 34
ge 34
kiseera 34
za 34
awulira 33
ebitali 33
kwe 33
zabbuli 33
afa 32
azaala 32
bagenda 32
benyamini 32
bulijjo 32
ebyambalo 32
ekyoto 32
isimayiri 32
miriyamu 32
nnyumba 32
okuwaayo 32
omulundi 32
saala 32
batabani 31
matayo 31
musaanidde 31
obulamu 31
aga 30
engero 30
lugandasoma 30
nsi 30
okumanya 30
weereza 30
okwagala 29
pulintaweereza 29
sindika 29
abasajja 28
etteeka 28
ngeri 28
okufuna 28
agamba 27
ekiseera 27
emmere 27
kijja 27
kitabo 27
ludda 27
nnannyini 27
okufa 27
wo 27
yammwe 27
zzaabu 27
abuulira 26
amaka 26
atuumibwa 26
bonna 26
kiyinza 26
ali 25
amayinja 25
ebipande 25
ebitukuvu 25
ebweru 25
goseni 25
gwe 25
mufube 25
nnyo 25
obukumi 25
obulenzi 25
okusuubiza 25
abakazi 24
abimereki 24
amataba 24
asisinkana 24
awangulwa 24
bamalayika 24
ebirooto 24
ekikomo 24
ekkumi 24
emmyufu 24
ettaala 24
laga 24
lebbeeka 24
leeya 24
mujja 24
nuuwa 24
obubaani 24
obuweereza 24
obwa 24
obweyamo 24
omukisa 24
omwoyo 24
sinaayi 24
awamu 23
bulungi 23
muka 23
munne 23
obut 23
okusisinkana 23
omubi 23
wadde 23
akola 22
alina 22
amafuta 22
bimu 22
obuggya 22
omugayaavu 22
omuggo 22
omutima 22
si 22
we 22
ayinza 21
eggulu 21
enteekateeka 21
etaano 21
kiba 21
kizibu 21
kuba 21
okuzaala 21
abaami 20
aka 20
boogera 20
ebikolwa 20
ebitukuvuengero 20
ekibi 20
ekkubo 20
ensibuko 20
kifuba 20
mukama 20
obugagga 20
obulimba 20
okusobola 20
omusaayi 20
ababi 19
abakola 19
bakabaka 19
ebirungi 19
ffeeza 19
kuweebwa 19
mwogere 19
akadde 18
asobola 18
emirembe 18
ennyo 18
eza 18
kenda 18
kristo 18
luuyi 18
mmwe 18
okugonjoola 18
omunnyo 18
univ/wpub 18
yasuubiza 18
abaabalibwa 17
adamu 17
amakondeere 17
asuubiza 17
ava 17
bantu 17
batukuzibwa 17
bisolo 17
ddaani 17
ddungu 17
ebisolo 17
ebuvanjuba 17
edeni 17
efulayimu 17
empagi 17
empologoma 17
erikwata 17
esobola 17
kinaana 17
kusinza 17
kuyitako 17
lewubeeni 17
lusegere 17
mowaabu 17
nammwe 17
obuwala 17
okukozesaamu 17
okuna 17
okusatu 17
omubuulizi 17
omuwala 17
seemu 17
yazaala 17
zo 17
abaamoli 16
abakessi 16
abamaleki 16
agaana 16
akabaati 16
akomawo 16
akyawa 16
alagirwa 16
amawanga 16
annyonnyola 16
ate 16
awasa 16
awondera 16
azaalibwa 16
babonerezebwa 16
baddayo 16
bajja 16
bajjuzibwa 16
bakazi 16
bakyalira 16
batuuka 16
bawala 16
bawangulwa 16
baweebwa 16
bazaalibwa 16
beseri 16
ebbenseni 16
ebyokebwa 16
edomu 16
ekibonerezo 16
ekikondo 16
ekimu 16
ekire 16
ekisajja 16
ekizibaawo 16
ennaku 16
ennyanja 16
ensalo 16
essaala 16
gafuuka 16
ka 16
kayini 16
kibereberye 16
kintu 16
kkubo 16
kusiisira 16
labbaani 16
lusozi 16
lyato 16
malayika 16
midiyaani 16
mikono 16
mufuneeyo 16
mutabani 16
obugubi 16
obukwata 16
obusika 16
okusinza 16
okusoma 16
okutongoza 16
okutuuka 16
okuyitako 16
okuzimba 16
okwemulugunya 16
olukalala 16
olulimi 16
omusanvu 16
omusota 16
osobole 16
potifaali 16
salaayi 16
sodomu 16
yeegayirira 16
zipola 16
ababereberye 15
ababiri 15
abajeemu 15
attibwa 15
biyinza 15
bwenkanya 15
ddala 15
ebibuga 15
emmaanu 15
gwo 15
kufuna 15
okola 15
okukuyamba 15
okulabirira 15
okuyitira 15
okuyomba 15
okwebaka 15
omuwendo 15
wamu 15
yesero 15
abakadde 14
agasobola 14
akwatibwa 14
baabwe 14
bakola 14
bijja 14
ennungi 14
essanduuko 14
ggwe 14
lye 14
mukola 14
omusango 14
ttaala 14
bingi 13
bufumbo 13
ekisa 13
ennyumba 13
kirungi 13
magezi 13
muli 13
mwana 13
okukangavvula 13
okukuba 13
okuyiga 13
abeefeso 12
amakungula 12
amalala 12
amangu 12
amenya 12
asinga 12
ayogera 12
bammwe 12
bikolwa 12
ebimu 12
ebinyonyi 12
ebirowoozo 12
efodi 12
ekiro 12
ekituufu 12
emmeeza 12
endala 12
ensusso 12
essanyu 12
katono 12
kisoboka 12
kukkiriza 12
kulaba 12
kuliyirirwa 12
kunyweza 12
lup 12
mufunye 12
mutima 12
mwekka 12
nsonga 12
obukambwe 12
obuwombeefu 12
obwannannyini 12
okufuba 12
okwemalira 12
oluggya 12
olwekyo 12
omutuukirivu 12
tajja 12
wabula 12
wange 12
wansi 12
wuliriza 12
yenna 12
akabi 11
akyali 11
alaba 11
amaaso 11
amalungi 11
ateekateeka 11
bakama 11
bakkiriza 11
balina 11
basisinkana 11
bayita 11
bigere 11
bujja 11
bulamu 11
ebitundu 11
eddungi 11
eggwanga 11
ekisibo 11
ekisingayo 11
genda 11
kabonero 11
kufuuka 11
kukiraba 11
kuwa 11
kyokka 11
mwagalanenga 11
mwetaaga 11
obubaka 11
obungi 11
obusirusiru 11
okubeera 11
okuddayo 11
okujja 11
okukuuma 11
okulaba 11
okumala 11
okunyweza 11
okusalawo 11
okutya 11
okuweebwa 11
singa 11
ssaddaaka 11
aziyiza 10
beeyongera 10
biri 10
ebiseera 10
ekyamateeka 10
enfuna 10
kitaawe 10
kukola 10
mukulembeze 10
munyweze 10
nimuloodi 10
okusaba 10
okuwulira 10
okwesanyusaamu 10
omunaala 10
waliwo 10
abagagga 9
abagwira 9
abebbulaniya 9
afuuka 9
akolebwa 9
amazima 9
amoni 9
asenzesenze 9
atondebwa 9
baba 9
baddu 9
bannansi 9
basiisira 9
bbanga 9
biba 9
bintu 9
bwakabaka 9
byonooneddwa 9
ebbanga 9
ebibeeraliikiriza 9
ebimera 9
ebirime 9
ebituli 9
ebugwanjuba 9
ebukiikaddyo 9
ebukiikakkono 9
ebyaka 9
ebyennyanja 9
eddoboozi 9
egya 9
ejjiba 9
ekibuga 9
ekirungi 9
ekitangaala 9
emisango 9
emitanda 9
empeera 9
endowooza 9
enkomerero 9
enkwe 9
enoka 9
ensiisira 9
ensonga 9
etalizibwa 9
ewuluguma 9
eyo 9
ezzadde 9
fuleemu 9
gamu 9
gyogerwako 9
jpgnwt 9
kaamu 9
kafuumuulampawu 9
kalebu 9
kisa 9
kizingiramu 9
kulangirirwa 9
kumansirwa 9
kusaba 9
kuva 9
lisindikibwa 9
lukalu 9
magumba 9
makkati 9
mukazi 9
mukkakkamu 9
mukwano 9
mukyala 9
mumanye 9
munaakoma 9
munaku 9
muntu 9
musaayi 9
mwezi 9
myango 9
nakyo 9
nfuufu 9
nkuŋŋaana 9
obugambo 9
obuli 9
obulimu 9
obusungu 9
obutoffaali 9
obutuukirivu 9
obwasooka 9
obwenkanya 9
okubayamba 9
okubonaabona 9
okubuulira 9
okubuulirako 9
okufuuwa 9
okugobwa 9
okukoma 9
okuli 9
okumusinza 9
okutaano 9
okutali 9
okutangirirako 9
okutegeera 9
okutegeeza 9
okutendeka 9
okuyigiriza 9
okuyimba 9
okuyisa 9
olukalu 9
olusooka 9
omukaaga 9
omulabe 9
omululu 9
omulyolyomi 9
omuti 9
omwami 9
omwenkanya 9
omwesigwa 9
siiro 9
teera 9
tegaamanyibwa 9
uli 9
weetegereze 9
weeyongere 9
yafeesi 9
yatambula 9
yeegomba 9
yesu 9
ze 9
zzadde 9
abaagenda 8
abaavu 8
abafiripi 8
abagamba 8
abagerusoni 8
abakiiti 8
abakkirizibwa 8
abakokasi 8
abakozi 8
abakugu 8
abalamuzi 8
abamerali 8
abamisiri 8
abamowaabu 8
abana 8
abanefuli 8
abassessaloniika 8
abatya 8
abaweebwa 8
abawere 8
abazaalisa 8
abbeeri 8
abeemulugunya 8
abiraamu 8
abonyaabonya 8
addayo 8
addukira 8
afiira 8
afuula 8
agakaawa 8
agasa 8
agaweebwa 8
agezesa 8
agula 8
agumya 8
aguza 8
akatabo 8
akoleeza 8
akozesa 8
akuba 8
akubwa 8
akudaalira 8
akulemberamu 8
akuza 8
aladi 8
alangirira 8
alondebwa 8
alya 8
amabanja 8
amannya 8
amatukuvu 8
amayute 8
amazaalibwa 8
ameggana 8
amusanga 8
amwegayirira 8
anaabasemberera 8
anaatera 8
anunula 8
anunulibwa 8
asaba 8
asabibwa 8
asalira 8
aseka 8
aseri 8
asitula 8
asunguwala 8
asuubizibwa 8
atabulatabula 8
atali 8
ataliiko 8
atawuliriza 8
ateeberezebwa 8
atunda 8
atundibwa 8
atya 8
awali 8
aweebwa 8
awolereza 8
awummula 8
ayakaayakana 8
ayigirizibwa 8
ayimba 8
ayonoona 8
aziika 8
aziikibwa 8
azitoowereddwa 8
b 8
baagala 8
baana 8
baasiisira 8
baawukana 8
babeeri 8
baddamu 8
baddiriŋŋanamu 8
bafune 8
bagambibwa 8
bagobebwa 8
baguza 8
bajeema 8
bakaabira 8
bakatonda 8
bakkalira 8
bakkiririza 8
bakolenga 8
bakomawo 8
balagirwa 8
balaki 8
balala 8
bali 8
balondebwa 8
balumba 8
banenya 8
bange 8
basatu 8
basimbula 8
basomoka 8
basuubizibwa 8
batandika 8
batta 8
battibwa 8
bawaayo 8
bawakanya 8
bawasa 8
bawonyaawo 8
beemulugunya 8
beetooloola 8
benda 8
bezaleeri 8
bibi 8
bibinja 8
biddibwamu 8
bifa 8
bika 8
binakuwaza 8
bireetera 8
biruka 8
biteekebwateekebwa 8
bituufu 8
biweebwayo 8
bizikirizibwa 8
buddu 8
bugenderevu 8
bukatuuni 8
bulindaala 8
butanwa 8
butuufu 8
byetaagibwa 8
byeyongera 8
dasani 8
ebibiri 8
ebifo 8
ebigenge 8
ebiginnyonnyola 8
ebijwenge 8
ebikere 8
ebimukwatako 8
ebisibo 8
ebisusse 8
ebyabwe 8
ebyasooka 8
ebyewuunyisa 8
egitali 8
eka 8
ekibiina 8
ekifo 8
ekijjukizo 8
ekijjulo 8
ekikolwa 8
ekikopo 8
ekiremba 8
ekirooto 8
ekisaka 8
ekisuubizo 8
ekitaaliko 8
ekitaliiko 8
ekizikiza 8
emigaati 8
emigabo 8
emirimu 8
emisana 8
emiwendo 8
endogoyi 8
engoye 8
enkuyege 8
ennamula 8
ennyama 8
ennyana 8
enosi 8
ente 8
entegeke 8
enzige 8
enzizi 8
erimu 8
erudaadi 8
eryato 8
eteekebwateekebwa 8
eterekebwa 8
ewa 8
eyabanga 8
eyamenya 8
eyogera 8
ezaasembayo 8
fenekaasi 8
gaadi 8
gabuutikira 8
gakalira 8
gatya 8
gava 8
gayinza 8
gerali 8
ggomola 8
ggye 8
go 8
gufuuka 8
guloka 8
gwokya 8
isakaali 8
kadesi 8
kalani 8
kalaze 8
kano 8
kawawa 8
kibuga 8
kijjula 8
kirangirirwa 8
kisimbula 8
kitammwe 8
kkomera 8
kobabu 8
kolebu 8
koola 8
kubongerwako 8
kuddamu 8
kukwata 8
kumala 8
kumusaba 8
kutandikibwawo 8
kuuma 8
kuwasa 8
kuziikibwa 8
kwavuwala 8
kweyongera 8
kyonna 8
leevi 8
lusuku 8
lwazi 8
magye 8
manase 8
mangi 8
medadi 8
merukizeddeeki 8
mikwano 8
mizimbulukuse 8
mmaanu 8
mufumiitirize 8
mukulembeza 8
mulongoofu 8
mumusabenga 8
munaabeera 8
musemberere 8
musinzize 8
musoke 8
musoma 8
musomye 8
muwala 8
muyiga 8
mwe 8
mwetegefu 8
nafutaali 8
nnaabeera 8
nnamaddala 8
nnyanja 8
nsawo 8
obubonero 8
obukulembeze 8
obukulu 8
obulagirizi 8
obutayosa 8
obutugu 8
obutukuvu 8
obuwanguzi 8
obuyinza 8
obuzaale 8
obwakabona 8
oggyeeko 8
ogi 8
ogusinga 8
oguva 8
okoliyaabu 8
okubaamu 8
okubanunula 8
okubonyaabonyezebwa 8
okubulwa 8
okudda 8
okuddukiramu 8
okufunira 8
okugabanamu 8
okugabanyaamu 8
okugamba 8
okugatta 8
okukaaba 8
okukaayanira 8
okukolamu 8
okukomolebwa 8
okukulembeza 8
okulabagana 8
okulagirira 8
okuliyirira 8
okulonda 8
okunaabiramu 8
okunona 8
okununula 8
okunyigirizibwa 8
okusabawadde 8
okusimba 8
okusinga 8
okusisinkaniramu 8
okusitula 8
okutangirira 8
okuteekebwako 8
okutondebwa 8
okutukuza 8
okuwa 8
okuwambamu 8
okuwandiika 8
okuwasa 8
okuwoolera 8
okuyamba 8
okuyingira 8
okuyita 8
okuzaalibwa 8
okwatula 8
okwawula 8
okwolekera 8
olunyiriri 8
olusiisira 8
oluuyi 8
oluvannyuma 8
olwazi 8
omulala 8
omulungi 8
omunaziri 8
omunene 8
omunyago 8
omutonzi 8
omuzira 8
osabira 8
padanalaamu 8
seezi 8
sekemu 8
sikoni 8
simiyoni 8
ssanyu 8
tasobodde 8
tebawandiikibwa 8
tewaabangawo 8
teyeenenya 8
waggulu 8
wakati 8
wateresebwa 8
weesiga 8
yabasonyiwa 8
yayenda 8
yeekenneenya 8
yeenyooma 8
yeeyoleka 8
yeggyako 8
yoludaani 8
zaayo 8
zammwe 8
zerofekaadi 8
zirina 8
zirupa 8
amakabayibuli 7
bino 7
bubbi 7
ebisinga 7
ekyaka 7
entimbe 7
eyagamba 7
ffe 7
gammwe 7
kakadde 7
kasanvu 7
kinunulo 7
mulundenga 7
ndagaano 7
nze 7
okubala—ebirimu 7
okuganyula 7
okuva—ebirimu 7
okweraliikirira 7
olubereberye—ebirimu 7
onoobyogerangako 7
onoogalamiranga 7
onoogolokokanga 7
onootambuliranga 7
onootuulanga 7
sumimu 7
tunaaweerezanga 7
ulimu 7
yange 7
yo 7
zebbulooni 7
a 6
abafuga 6
abakkolosaayi 6
abali 6
abalina 6
abamu 6
abaruumi 6
abe 6
afuga 6
akamwa 6
alinga 6
amaleyo 6
amuwuliriza 6
anaakola 6
asobole 6
atalina 6
atayinza 6
ategeeza 6
ayogerako 6
ayogere 6
ayusufu 6
babenga 6
bakkakkamu 6
biseera 6
bisibenga 6
bulungibayibuli 6
bumanyirivu 6
bungi 6
bwammwe 6
byo 6
dina 6
ebakubiriza 6
ebirabo 6
ebitaliimu 6
ekiragiro 6
ekizibu 6
emikono 6
endabika 6
enguzi 6
eyeegatta 6
gezaako 6
gwonna 6
jpgobwa 6
ke 6
kikulu 6
kirage 6
kirimi 6
kitangaala 6
kkakafu 6
kubaawo 6
kubaganyula 6
kubayamba 6
kuggwaawo 6
kusunguwala 6
kuyimirira 6
kwagala 6
kwavuwaza 6
kwogera 6
leka 6
luvannyuma 6
m 6
mangu 6
mazima 6
mitawaana 6
mmwenna 6
mubadde 6
mufumbiriganwa 6
muganyulo 6
mukolamu 6
mukolere 6
mukono 6
mukoze 6
mukubaganye 6
mukwase 6
mukyogerako 6
mulimu 6
mulinabuli 6
mulinamunno 6
mulinde 6
mulowoozaamu 6
mumaze 6
munaaba 6
munaakolera 6
musabe 6
musaleewo 6
musazeewobayibuli 6
musigale 6
musooka 6
mutego 6
mutuuse 6
muwere 6
mwavu 6
mwewale 6
mweyongere 6
mwogerako 6
naawe 6
njawulo 6
nkuyigiriza 6
nnyoko 6
nw 6
obadde 6
obeera 6
obufumbo 6
obugumiikiriza 6
obugwi 6
obujulizi 6
obukkakkamu 6
obulokozi 6
obutaggwaawo 6
obutakkaanya 6
obwogezi 6
okubaako 6
okubaawo 6
okubazibuwalira 6
okubazzaamu 6
okubeetaagisa 6
okubigonjoola 6
okuggyako 6
okugwaawo 6
okukimanya 6
okukituukiriza 6
okukkiriza 6
okulondawo 6
okulwana 6
okulya 6
okumusaba 6
okusunguwala 6
okutuusa 6
okuvvuunulwa 6
okuwaŋŋana 6
okwagalana 6
okwewala 6
okwogera 6
oli 6
oluganda 6
olutalo 6
oluusi 6
olyoke 6
omubiri 6
omukyala 6
omulimu 6
omulongoofu 6
omulumirirwa 6
omutwala 6
omwavu 6
osooke 6
owulirize 6
oyogere 6
so 6
soma 6
talina 6
tamali 6
tekikusanyusagezaako 6
temukkiriziganyizza 6
toba 6
tojja 6
tomusala 6
tulabe 6
tunaabanga 6
vidiyo 6
waakiri 6
wabweru 6
waffe 6
walala 6
weewala 6
yakuwabayibuli 6
yeeyongera 6
yekka 6
abaagala 5
abayigiriza 5
agabira 5
aganyulwa 5
akolera 5
aluŋŋamya 5
asaanyaawo 5
bawe 5
bawombeefu 5
bazikirira 5
businga 5
buulira 5
buvaamu 5
bwonna 5
ebibuuzo 5
ebifundikira 5
ebitukuvuokubala—ebirimuluganda 5
ebitukuvuokuva—ebirimuluganda 5
ebitukuvuolubereberye—ebirimuluganda 5
ekiruyi 5
emitawaana 5
ennyombo 5
eyakola 5
gasobola 5
kubikka 5
kugula 5
kumalawo 5
kuwona 5
kyambika 5
lisinga 5
mufune 5
mulina 5
mulinabayibuli 5
museenene 5
musinze 5
muto 5
nu 5
obulungi​—okukozesa 5
obunyiikivu 5
okubuulirira 5
okugaggawala 5
okukozesa 5
okutuyamba 5
okuwakanya 5
okwaŋŋanga 5
okwogereramu 5
olabye 5
olowooza 5
omukozi 5
owuliramu 5
oyolekagana 5
taddibwamu 5
tezisobola 5
wabaawo 5
weekuume 5
weeyimirira 5
abaddu 4
abafumbo 4
abazadde 4
bakoowu 4
bivaamu 4
bulimba 4
busika 4
byammwe 4
eddamubayibuli 4
ekitono 4
enkyukakyuka 4
eyeesiga 4
kibaleetera 4
kimala 4
kimu 4
kinnya 4
kubeerako 4
kulabirira 4
kuleetawo 4
mubimalira 4
mwakafuuka 4
nkozesa 4
obulungiluganda 4
obutafuna 4
okubala—ebirimuenkyusa 4
okubaleetera 4
okujjukira 4
okukisanga 4
okuleetera 4
okuva—ebirimuenkyusa 4
okuvuma 4
olina 4
olubereberye—ebirimuenkyusa 4
omukuumiwandyewoze 4
ssenteamagezi 4
weegendereze 4
zuukuka 4
abaafa 3
abaagalwa 3
abaako 3
ababa 3
ababanyaga 3
abafaako 3
abaganyulwa 3
abagoberezi 3
abagolokofu 3
abagulumize 3
abagwanidde 3
abajulirwa 3
abakkiriza 3
abakwatagana 3
abakyala 3
abalabirizi 3
abalaga 3
abalamusizza 3
abalowooza 3
abamaliridde 3
abangi 3
abanoonya 3
abanyiikivu 3
abapapa 3
abatakyategeera 3
abatali 3
abavubuka 3
abawa 3
abawe 3
abawombeefu 3
abba 3
abeera 3
abeere 3
abeesaawo 3
abeeyimirira 3
abonerezebwa 3
aboonoonefu 3
abyewala 3
afeebezebwa 3
afiibwako 3
afuba 3
afufuggaza 3
afuna 3
agaba 3
agookya 3
aguzza 3
agwa 3
akaddebaako 3
akaddiye 3
akalabo 3
akalamba 3
akaseera 3
akasolya 3
akebera 3
akikola 3
akugamba 3
akula 3
akumpanya 3
akungula 3
akusaba 3
akutte 3
akuyigiriza 3
akuze 3
alabirira 3
aleetawo 3
aleetera 3
alemenga 3
aliba 3
alifuula 3
alikigwamu 3
aliko 3
alikoowoola 3
alinako 3
alirabisibwa 3
aliwa 3
alumwa 3
alwanyisa 3
alwawo 3
alyoke 3
alyoleka 3
amaggwa 3
amakubo 3
amanya 3
amasanyu 3
amatuufu 3
amuwola 3
anaagenda 3
anaalya 3
anoonya 3
anyiiganyiiga 3
asaanidde 3
asalidde 3
asiga 3
asiiba 3
asiita 3
ataddibwamu 3
atalabangako 3
atambulatambula 3
atayagalira 3
atega 3
ategeera 3
atta 3
atuwa 3
awaayo 3
awaba 3
aweebwe 3
awenyaawenya 3
awoolera 3
awuliriza 3
ayenda 3
ayigiriza 3
ayogeza 3
ayonoonabya 3
azikiriza 3
babaweerezenga 3
babayambamu 3
babulooni 3
bafaananya 3
bagabanenga 3
bagabi 3
bagagga 3
bagambe 3
bagolokofu 3
bagwa 3
bakyala 3
bakyamiziddwa 3
balamulwa 3
baleme 3
baliteeke 3
balitwala 3
balizimbako 3
bamativu 3
bamukwata 3
banaabanga 3
bannaabwe 3
banywevu 3
basaanidde 3
basanyufu 3
basobole 3
bassaawo 3
batwalirizibwa 3
batyo 3
bava 3
bavudde 3
bbala 3
bbugwe 3
beereetera 3
beesiga 3
beeterekera 3
beewoze 3
bigambo 3
bikukwasizza 3
bikusudde 3
bimugasa 3
bimukwatako 3
binaakukulemberanga 3
binaakukuumanga 3
binaakuyigirizanga 3
binaayogeranga 3
biramu 3
bireme 3
biribasaanyaawo 3
birina 3
birowoozo 3
birungi 3
bitono 3
boolekagana 3
buba 3
bubi 3
budde 3
bugenzi 3
bukuzinde 3
bukyamu 3
bulagirizi 3
bulago 3
buleetera 3
busungu 3
butuukirivu 3
buva 3
buwaze 3
buweereza 3
buwere 3
bwabwe 3
bwo 3
byabwe 3
byakulabirako 3
byakwo 3
byambalo 3
ddi 3
ddoboozi 3
ddukanga 3
ebidduka 3
ebifunibwa 3
ebigasa 3
ebigere 3
ebikwatagana 3
ebingi 3
ebirimu 3
ebiruubirirwa 3
ebisendasenda 3
ebisobola 3
ebiswaza 3
ebitusanyusa 3
ebituufu 3
ebityoboola 3
ebiwundu 3
ebyava 3
ebyenkana 3
ebyesigika 3
edda 3
egiyiwa 3
ejja 3
ekigabibwa 3
ekigenda 3
ekigendererwa 3
ekigere 3
ekigereke 3
ekigo 3
ekingi 3
ekinyonyi 3
ekirabo 3
ekitanda 3
ekitasemberekeka 3
ekitiibwakisinga 3
ekyabakwasibwa 3
embagirawo 3
embalaasi 3
embiro 3
emikutu 3
emirundi 3
emitego 3
emitima 3
emize 3
empaka 3
emulisa 3
engalo 3
engule 3
enjawukana 3
enjaza 3
enjigiriza 3
enkaayanano 3
enkyukakyukabayibuli 3
enoobuteegulumiza 3
eriiso 3
eriwulikika 3
eriyo 3
erya 3
etayonooneka 3
eweebwa 3
eyabayita 3
eyakuguka 3
eyakutuma 3
eyalaba 3
eyalondebwa 3
eyawa 3
eyeetulinkiriza 3
eyeewola 3
ezikontana 3
faayo 3
gakuuma 3
galabika 3
gamba 3
gatamwokya 3
girindiridde 3
gonna 3
gubuggyamu 3
gujja 3
gulinga 3
gutayokya 3
gyonna 3
k 3
kaakano 3
kale 3
kamugwako 3
kamwa 3
kantu 3
kaseera 3
kendeeza 3
kibeere 3
kijjukire 3
kikkakkanya 3
kikoligo 3
kimanye 3
kisinga 3
kitaawo 3
kitegeeza 3
kitiibwa 3
kituuka 3
kituuse 3
kitya 3
kityo 3
kiwanvu 3
kkiriza 3
ko 3
kola 3
kolera 3
konna 3
kubaako 3
kubafuula 3
kubanyooma 3
kubanyweza 3
kubateeka 3
kubeetaagisa 3
kubimala 3
kubonerezebwa 3
kufa 3
kugaggawala 3
kugamba 3
kugejja 3
kuggyamu 3
kugumiikiriza 3
kukaaba 3
kukakasa 3
kukemebwa 3
kukkakkana 3
kukoma 3
kukukuuma 3
kukuzinda 3
kulabisibwa 3
kumaliriza 3
kumenyebwa 3
kumu 3
kumutta 3
kumwagala 3
kunge 3
kunoonya 3
kunzitira 3
kusaasira 3
kutegeera 3
kuwakanya 3
kuweereza 3
kuzikirira 3
kuzikiriza 3
kwammwe 3
kwatanga 3
kwefunira 3
kwegatta 3
kwogerwako 3
kwonoona 3
kyabwe 3
kyakwo 3
kyama 3
kyekanaava 3
kyetakkuluza 3
kyeyagalire 3
kyo 3
laba 3
lagira 3
liba 3
liiso 3
lubeerera 3
lubuto 3
luganda 3
luguudo 3
lujjudde 3
luubiriranga 3
lwananga 3
lwe 3
lwonna 3
lyabwe 3
lyo 3
maanyi 3
makko 3
malaaya 3
malala 3
manda 3
mateeka 3
mbawandiikidde 3
mbuulirira 3
mesegi 3
mirimu 3
mmanyi 3
mmere 3
mubaagala 3
mubasiime 3
mubategeera 3
mubeerenga 3
muddiŋŋane 3
muddu 3
muduumizi 3
mufissizeewo 3
mufissizzeewo 3
mufuna 3
mufuzi 3
mugonderenga 3
mugumiikiriza 3
mukadde 3
mukakanyavu 3
mukakase 3
mukijjukire 3
mukikola 3
mukolagana 3
mukole 3
mukolera 3
mukozesa 3
mukulu 3
mukyali 3
mulagaanye 3
mulage 3
mulamusagane 3
mulifuna 3
mulyango 3
mumanyi 3
mumukwasabyonna 3
mumusomera 3
mumusomere 3
mumuziyizenga 3
munaakola 3
munaamala 3
munnaabwe 3
munyweza 3
musaba 3
musango 3
musiime 3
musingi 3
mutegeera 3
mutyo 3
muwendo 3
muwulirize 3
muyambeko 3
muyigiriza 3
muyizzi 3
muyombi 3
muzannya 3
muzigo 3
muzizo 3
mwagala 3
mwambale 3
mwefunira 3
mwembi 3
mwesigwa 3
mwesimbu 3
mwetakkuluzeeko 3
mwetulinkirize 3
mwewombeeke 3
mwolekagana 3
mwonoonefu 3
n 3
naawengo 3
nakwo 3
nange 3
ndi 3
newakubadde 3
ngalo 3
njawukana 3
nkukutuekkakkanya 3
nkulagira 3
nkunnyonnyodde 3
nneewulira 3
nnene 3
nnyini 3
nsibuko 3
nsonda 3
nsonyi 3
nteekateeka 3
nwt 3
nyumyako 3
nywezanga 3
obudde 3
obuddu 3
obujulirwa 3
obukkirizibwa 3
obuleetera 3
obulumi 3
obulungividiyo 3
obuntu 3
obuswavu 3
obutali 3
obutateeka 3
obutategeera 3
obutonotono 3
obutuufu 3
obuva 3
obwavu 3
obwegendereza 3
obwesige 3
obwetaavu 3
obwetoowaze 3
ofuna 3
ogudde 3
ogugunja 3
ogutaliiko 3
okoze 3
okubakakasa 3
okubawulira 3
okubeerako 3
okubibakuutira 3
okubikkulwa 3
okubikuumira 3
okubiyiga 3
okubyogerangako 3
okufiirwa 3
okugabana 3
okukaayana 3
okukakasa 3
okukangavvulwa 3
okukikola 3
okukikolamu 3
okukiraba 3
okukoowa 3
okukubuulirira 3
okukufuula 3
okukukambuwalira 3
okukusobozesa 3
okukuyambako 3
okukuyigiriza 3
okukwatagana 3
okukwatanga 3
okuleetebwawo 3
okulinnya 3
okulowooleza 3
okulwanyisa 3
okumufaako 3
okumuwa 3
okumuweereza 3
okunenyezebwa 3
okunoonya 3
okunyumirwa 3
okunywegera 3
okusasula 3
okusiima 3
okusiimibwa 3
okussa 3
okussibwamu 3
okutambulira 3
okutambuliramu 3
okuteeka 3
okuteesa 3
okutendekebwa 3
okutu 3
okutwala 3
okuviirako 3
okuwaayiriza 3
okuwabulwa 3
okuwakana 3
okuwangula 3
okuzaagala 3
okuzikiririra 3
okwambala 3
okwegatta 3
okwegomba 3
okweraga 3
okwewonya 3
okwo 3
oliremwa 3
olufu 3
oluggwaawo 3
olulimba 3
olulungi 3
omala 3
omaze 3
omugaati 3
omugabiajja 3
omugagga 3
omuganyulo 3
omugezi 3
omugolokofu 3
omugumu 3
omugwenyufu 3
omugwira 3
omujulizi 3
omukono 3
omukudaazi 3
omukulu 3
omulimba 3
omumativu 3
omungi 3
omusana 3
omusanyufu 3
omusingi 3
omusirusiru 3
omusumba 3
omuvubuka 3
omuwere 3
omuyombimu 3
omuzigu 3
omwagala 3
omwegayirire 3
omwenge 3
omwenzi 3
onoomuwa 3
onootuusa 3
onoozuukuka 3
osula 3
osumagiramu 3
otambula 3
oti 3
otobeera 3
otomanyi 3
owone 3
owulire 3
owummuleko 3
oyatula 3
oyiga 3
oyoleka 3
ozinga 3
ozuukuse 3
piraato 3
pontiyo 3
sigala 3
sikulwa 3
siruvano 3
ssuubi 3
taba 3
takikola 3
takkiriziganya 3
takodowala 3
takwatirwa 3
takyafiibwako 3
talirema 3
talirivaamu 3
tammanga 3
tannazaalibwa 3
tasigaza 3
tasobola 3
tayagala 3
tebaagala 3
tebujja 3
tebulimuvaako 3
tega 3
tekunyiiga 3
tekwenoonyeza 3
temukajjala 3
temutya 3
tetulina 3
tetwaleeta 3
tewayinza 3
teweefaako 3
teweegombanga 3
tezirina 3
tobanga 3
tobeera 3
tojjululanga 3
tokolagananga 3
toliiko 3
tomunenya 3
tonyaganga 3
tonyigiririzanga 3
tosikirizibwanga 3
tosumagira 3
tovanga 3
ttereevu 3
tulo 3
tuyinza 3
two 3
um 3
waakazaala 3
wajja 3
wakola 3
wamanya 3
wammwebayibuli 3
wammwebwe 3
wasuubiza 3
wayitirwa 3
weebakamu 3
weebase 3
weetoowaze 3
weewaawo 3
weeyimiririra 3
wekka 3
yaazo 3
yabatonda 3
yambako 3
yammwebayibuli 3
yatamiira 3
yatonda 3
yeegaggawaze 3
yeekweka 3
yeetakkuluza 3
yeetegereza 3
yigiriza 3
zijja 3
zikola 3
zikuŋŋaanya 3
ziteekateeka 3
zitegekerwa 3
zivaamu 3
ziweebwayo 3
ziyinza 3
ab 2
abatuukirivu 2
abeeba 2
aleme 2
alikolimirwa 2
alisiimibwa 2
aliyavuwala 2
amageziajja 2
amiina 2
anaabanga 2
anenya 2
anyaga 2
atamanya 2
atambulira 2
ayitibwa 2
azibiriza 2
bafuna 2
beekweka 2
binoomunaala 2
bukatuuniabavubuka 2
bulimbabiringa 2
ddunguno 2
ebikolimo 2
ebitukuvuokubala—ebirimu 2
ebitukuvuokuva—ebirimu 2
ebitukuvuolubereberye—ebirimu 2
ekisaajja 2
enjalaabantu 2
eno 2
enovidiyo 2
ensaalwaayagala 2
eyeewaanaayitibwa 2
gobawo 2
gyeno 2
i 2
iri 2
kikyamu 2
kubalaba 2
leeroosobole 2
lweyeewala 2
media 2
munakunaye 2
musirusiru 2
nkuwandiikidde 2
nnyina 2
o 2
obwenkanyakisanyusa 2
ofune 2
ogwa 2
ogwekulumbaza—ye 2
okumuwaanawaana 2
okutajjulukukaajja 2
okuzannya 2
olusalosalobajjajjaabo 2
omululuawakula 2
omunyoomi 2
playereremereddwa 2
taajulenga 2
tebamunyooma 2
teweebaka 2
yakuwabivaamu 2
