mu 121
ku 72
enkoko 47
ente 45
kulima 44
okulima 42
nnimiro 36
nga 32
abalimi 29
nnyo 26
bulimi 23
omulimi 21
ne 20
bw 19
n 19
naye 19
nze 19
bwe 18
kasooli 17
eno 16
ssente 16
nkoko 15
sizoni 15
wano 15
nte 14
y 14
yange 14
amagi 13
emmere 13
buli 12
bye 12
kati 12
ng 12
gye 11
we 11
amazzi 10
ennimiro 10
eyo 10
mulimi 10
nange 10
nti 10
by 9
kuba 9
kubanga 9
ky 9
kye 9
ly 9
mbadde 9
okusiga 9
zange 9
abaana 8
alina 8
embuzi 8
emmwanyi 8
era 8
ettaka 8
njagala 8
oyo 8
teri 8
wa 8
waliwo 8
z 8
lwa 7
makungula 7
mmere 7
muwogo 7
okulunda 7
ttaka 7
ye 7
ze 7
zino 7
bangi 6
bonna 6
byange 6
ebijanjaalo 6
ebitooke 6
enkuba 6
gwa 6
kasita 6
ki 6
mulimu 6
muntu 6
nja 6
oba 6
w 6
wange 6
ya 6
yenna 6
awo 5
be 5
eddagala 5
embizzi 5
ensigo 5
eŋŋanda 5
gavumenti 5
gy 5
kulunda 5
leero 5
mmanyi 5
nnali 5
nnima 5
nnina 5
nno 5
obulimi 5
ssirina 5
za 5
agenda 4
amakungula 4
amanyi 4
amatooke 4
amayuuni 4
ate 4
baffe 4
banno 4
budde 4
bya 4
ddala 4
edda 4
enda 4
enkwa 4
enzungu 4
ge 4
gonna 4
gwe 4
gya 4
ka 4
kuno 4
kwe 4
lwaki 4
mba 4
mbeera 4
mwe 4
na 4
ndabye 4
obudde 4
okufuna 4
okukungula 4
okulya 4
okutunda 4
omwana 4
ssimanyi 4
waakiri 4
woofiisi 4
abadde 3
abantu 3
ajja 3
akawunga 3
amata 3
ayagala 3
b 3
baagala 3
bajja 3
banne 3
bbeeyi 3
bingi 3
bungi 3
byonna 3
dda 3
e 3
ebbeeyi 3
ebiri 3
eggwanga 3
emala 3
emimwa 3
emiti 3
emmotoka 3
empanga 3
enkumbi 3
ennyange 3
g 3
ga 3
ggwanga 3
guno 3
gw 3
gyonna 3
jjo 3
katono 3
kitange 3
kujja 3
kusiga 3
kwa 3
kya 3
kyeya 3
lya 3
lyange 3
lyonna 3
maama 3
mbu 3
mbuzi 3
mmaze 3
mmwanyi 3
mmwe 3
ndaba 3
nkumbi 3
okukoola 3
okusimba 3
olunaku 3
olw 3
omusana 3
si 3
ssijja 3
ssinga 3
taata 3
tayagala 3
tulina 3
yonna 3
zo 3
zonna 3
ababbi 2
abalina 2
abasomesa 2
abeera 2
alabika 2
asinga 2
ba 2
baana 2
bagamba 2
balimi 2
bange 2
bannange 2
bannayuganda 2
basinga 2
bayize 2
bikwata 2
bisagazi 2
bisatu 2
biwandiiko 2
bukulu 2
bulungi 2
buto 2
bwayo 2
bwonna 2
ddundiro 2
eba 2
ebimera 2
ebinnya 2
ebintu 2
ebinyeebwa 2
ebirime 2
eby 2
eggana 2
eka 2
ekifuba 2
ekola 2
emberenge 2
emirimu 2
endiga 2
endwadde 2
enjoka 2
ennaku 2
ennima 2
ennyaanya 2
ennyama 2
ennyo 2
entende 2
entuufu 2
erabika 2
eri 2
erina 2
erinnya 2
esobola 2
ettooke 2
eyamba 2
ezange 2
ggwe 2
gumu 2
gwange 2
gwo 2
gwonna 2
k 2
kalimu 2
kampala 2
katale 2
kifo 2
kino 2
kirabika 2
kizibu 2
kozesa 2
kubula 2
kufuna 2
kugenda 2
kugula 2
kuttira 2
labayo 2
layisi 2
liiso 2
lino 2
lulyo 2
lumonde 2
lwe 2
lye 2
magi 2
mala 2
malagala 2
mmeka 2
mmotoka 2
mpaayo 2
mubi 2
mulala 2
muli 2
musajja 2
musomo 2
muva 2
muwala 2
nabo 2
ndowooza 2
nkeera 2
nneewuunya 2
nsigo 2
obugagga 2
obulungi 2
obutale 2
obw 2
ofunye 2
ojja 2
okufuuyira 2
okukula 2
okuleka 2
okulonda 2
okunywa 2
okusala 2
okuva 2
olabe 2
olima 2
omala 2
omanyi 2
omaze 2
omu 2
omukisa 2
omulaalo 2
omulimu 2
osooka 2
oyinza 2
sooka 2
ssaagala 2
ssaawa 2
ssatu 2
terina 2
tetujja 2
tewali 2
tteeka 2
ttulakita 2
tugenda 2
tugende 2
tujja 2
twala 2
wala 2
wali 2
wonna 2
yazze 2
yeeyagaleko 2
yokka 2
yuganda 2
ziba 2
zinywa 2
zirina 2
zirya 2
