mukama 232
mu 220
ne 175
era 102
ku 82
no 80
kubanga 77
na 76
bwe 65
nga 57
katonda 56
ggwe 52
ai 51
abo 48
naye 45
eri 44
ye 41
ebya 38
emirembe 37
kye 32
abantu 30
oyo 30
olwa 29
bwo 28
so 28
wange 27
gwange 26
nge 26
yange 26
mumutendereze 25
amaanyi 24
bwange 24
gwe 24
ekitiibwa 23
emmeeme 23
ensi 23
bonna 22
lye 22
omutima 22
owa 22
gyonna 21
lya 21
mmwe 21
amaaso 19
bange 19
bye 19
eza 19
go 19
omukisa 19
wa 19
be 18
butuukirivu 18
ge 18
maaso 18
ngo 18
nti 18
byange 17
eddoboozi 17
ekisa 17
gange 17
gwo 17
obulokozi 17
ogu 17
zonna 17
bo 16
obulungi 16
abalabe 15
ekya 15
ennaku 15
erinnya 15
ga 15
kabaka 15
obubi 15
obutuukirivu 15
oli 15
kya 14
kyange 14
kyo 14
ababi 13
aga 13
amazima 13
ani 13
ddala 13
gya 13
gye 13
kwange 13
lwange 13
nsi 13
bya 12
byonna 12
ebigambo 12
nze 12
omubi 12
omukono 12
omusango 12
abalina 11
ekkubo 11
eya 11
newakubadde 11
obulamu 11
we 11
abaana 10
amazzi 10
ba 10
buli 10
kwo 10
lwa 10
obo 10
seera 10
ya 10
aba 9
abakola 9
ddyo 9
emikono 9
essanyu 9
ezzadde 9
ggulu 9
gu 9
lyo 9
maanyi 9
mukono 9
ogwa 9
omu 9
waggulu 9
abatukuvu 8
abatuukirivu 8
akamwa 8
amawanga 8
eggulu 8
ekigambo 8
ettendo 8
lyange 8
mirembe 8
wamu 8
wansi 8
abamutya 7
abawombeefu 7
amagezi 7
bwa 7
ebigere 7
ekiro 7
ennanga 7
eryo 7
gaabwe 7
gonna 7
gyabwe 7
gyange 7
isira 7
kale 7
kange 7
kkubo 7
mazima 7
nange 7
obutali 7
okuba 7
omukka 7
omuntu 7
tewali 7
waffe 7
weewaawo 7
wo 7
zange 7
ali 6
amagumba 6
awonya 6
biro 6
byabwe 6
egya 6
ekitala 6
empewo 6
ennyo 6
ensonyi 6
gwabwe 6
gyo 6
kifo 6
kintu 6
kisa 6
kwe 6
lwe 6
nnaku 6
obudde 6
obulimba 6
obusika 6
okusaasira 6
olwazi 6
omuliro 6
omusana 6
omwoyo 6
zo 6
akola 5
alina 5
amalala 5
amangi 5
awatali 5
ayagala 5
bakabaka 5
balabe 5
bubi 5
byo 5
emimwa 5
emirimu 5
ensonga 5
eriiso 5
kaakano 5
kiri 5
kwa 5
kwabwe 5
liri 5
lunaku 5
mmeeme 5
mutima 5
mwenna 5
ndi 5
nnyingi 5
nsonyi 5
obukulu 5
obuyinza 5
okufa 5
okukaaba 5
okunakuwala 5
okutendereza 5
okutuusa 5
okuva 5
okuziba 5
olulimi 5
omuddu 5
omutuukirivu 5
omuzira 5
ondokole 5
sayuuni 5
yakobo 5
yo 5
abali 4
abankyawa 4
akabi 4
amafuta 4
awa 4
baleme 4
balina 4
balisikira 4
balizikirizibwa 4
bannaggwanga 4
bantu 4
bifo 4
boogera 4
bulokozi 4
bunnya 4
ebikolwa 4
ebyo 4
eggye 4
ekigo 4
ekitalo 4
ekizikiza 4
emigwa 4
emisango 4
emmere 4
empologoma 4
erya 4
ettukuvu 4
eyatuukirira 4
ffe 4
kaabwe 4
kamwa 4
kiruyi 4
lusozi 4
lwo 4
makubo 4
mangu 4
mazzi 4
mmange 4
mwe 4
naawe 4
naayimbanga 4
neebazanga 4
ngabo 4
nnyumba 4
obusungu 4
obwakabaka 4
oluyimba 4
omutwe 4
onsaasire 4
temuli 4
wala 4
weema 4
wulira 4
za 4
zaabwe 4
zaffe 4
ze 4
abalokola 3
abangi 3
abanjigganya 3
abasuubira 3
abato 3
akuuma 3
alaba 3
amakubo 3
amanda 3
amateeka 3
amayinja 3
asanyukira 3
atuula 3
awanirira 3
aweereddwa 3
awulira 3
ayima 3
ayimiriza 3
baabwe 3
baakoowoola 3
baffe 3
bangi 3
bikolwa 3
bulamu 3
bulijjo 3
busungu 3
bwonna 3
ebibi 3
ebintu 3
ebire 3
ebirowoozo 3
ebitaliimu 3
ebyonoono 3
eggwanga 3
ekibi 3
ekibiina 3
ekifo 3
ekinene 3
ekiragiro 3
ekitukuvu 3
ekyejo 3
emirungi 3
engabo 3
engalo 3
engoye 3
enjala 3
enkomerero 3
enkwe 3
ennyingi 3
ensozi 3
entiisa 3
enzigi 3
ezaabu 3
giri 3
golokoka 3
ka 3
kiki 3
kukwatibwa 3
kumpi 3
kyabwe 3
lowooza 3
lwazi 3
lyonna 3
magombe 3
malayika 3
mulamu 3
mulungi 3
mumuwe 3
mumuyimbire 3
muntu 3
mutuukirivu 3
mutwe 3
nammwe 3
nayogera 3
nkomerero 3
nkoowoola 3
nkwesiga 3
nneme 3
nnyo 3
nsonga 3
ntyo 3
okolenga 3
okubeera 3
okulaba 3
okuteesa 3
okutu 3
okwonoona 3
olugendo 3
oluggya 3
olutukuvu 3
omubeezi 3
omubiri 3
omuddo 3
omulongoofu 3
omutego 3
omwana 3
omwavu 3
oneeraganga 3
onziye 3
tendereza 3
teweeraliikiriranga 3
yasiiga 3
yeekaalu 3
abajoogebwa 2
abakka 2
abakutama 2
abakwesiga 2
abalala 2
abalamu 2
abamukaabira 2
abamunoonya 2
abamwesiga 2
abandaba 2
abannyimukirako 2
abanoonya 2
abasala 2
abataggwaawo 2
abatya 2
abawala 2
abawonya 2
abayamba 2
aboogera 2
abuuka 2
afaanana 2
agulumizibwe 2
alasa 2
aleeta 2
aliwa 2
alokola 2
amasavu 2
amulokola 2
anaayingira 2
andokola 2
antwala 2
anziramu 2
atalina 2
atunuulira 2
atuukiriza 2
atuukirizenga 2
atya 2
aweereza 2
ayinza 2
baagala 2
baakwesiganga 2
baana 2
babi 2
bagwa 2
bajagulize 2
bakwatibwe 2
baliba 2
balibula 2
balirya 2
baliwulira 2
banaayogeranga 2
baswazibwe 2
bateesa 2
batendereze 2
batuukirivu 2
batyo 2
bawankaaki 2
beesiga 2
bibi 2
bibonoobono 2
bigambo 2
bukulu 2
bukuusa 2
bungi 2
butali 2
buyita 2
bwabwe 2
dawudi 2
ebbanga 2
ebibonoobono 2
ebikutte 2
ebirina 2
ebirungi 2
ebisiba 2
ebitaasa 2
ebiwundu 2
edda 2
eddungu 2
ejjembe 2
ekigazi 2
ekikompe 2
ekisiikirize 2
ekisulo 2
ekitaasa 2
ekitaliimu 2
ekyambika 2
ekyo 2
ekyonoono 2
ekyuma 2
embalaasi 2
embogo 2
embwa 2
emisana 2
emisingi 2
emitego 2
emiti 2
emitwe 2
emmunyeenye 2
empeera 2
empeewo 2
endagaano 2
endiga 2
enfuufu 2
enjegere 2
enjuba 2
ennimi 2
ennungi 2
ennyana 2
ennyuma 2
ennyumba 2
ensolo 2
ente 2
etteeka 2
ettima 2
eweema 2
girimenyeka 2
gulituuka 2
gusanyuka 2
gwagala 2
gwammwe 2
gyammwe 2
kaganzi 2
ke 2
kibiina 2
kigambo 2
kigo 2
koogera 2
kulaba 2
kutya 2
kuyimuka 2
kwayo 2
kwonna 2
kyama 2
kyambika 2
kyeguva 2
laba 2
lindirira 2
lokola 2
lubuto 2
lugendo 2
lyabwe 2
lyaffe 2
lyakolebwa 2
lyatuukirira 2
mawanga 2
mbalaasi 2
mimwa 2
mirimu 2
mubiri 2
mukulu 2
muli 2
musana 2
musango 2
musanyukire 2
muyimbe 2
muyimuse 2
naakugulumizanga 2
naakwebazanga 2
naatenderezanga 2
nali 2
natambuliranga 2
ndyoke 2
nfuufu 2
nfuuse 2
ngalo 2
nguudo 2
njogera 2
nkaaba 2
nkukoowodde 2
nkyali 2
nnindirira 2
nnyanja 2
oba 2
obawe 2
obugagga 2
obukambwe 2
obungi 2
obusaale 2
okukutendereza 2
okulungi 2
okulwana 2
okumutendereza 2
okunkola 2
okunnumba 2
okusaba 2
okusinga 2
okusunguwala 2
okutegana 2
okutegeeza 2
okutenderezebwa 2
okutuuka 2
okutya 2
okuyigiriza 2
okuzikirira 2
okuzina 2
okwebaza 2
okwegayirira 2
okwekwekamu 2
okwogera 2
olumbe 2
omponye 2
omponyezza 2
omuggo 2
omunafu 2
omusaayi 2
onjigirize 2
onkuume 2
onnuŋŋamye 2
onsalire 2
onsonyiwe 2
ontegere 2
ovenga 2
singa 2
sirisagaasagana 2
siritya 2
siwali 2
ssaddaaka 2
taasagaasaganenga 2
talibeerawo 2
tobaganya 2
tombeera 2
ttaka 2
waabwe 2
waba 2
wabula 2
wali 2
weesigenga 2
wonya 2
yaffe 2
yamponya 2
yanguya 2
yerusaalemi 2
zinneetoolodde 2
zisseddume 2
