mu 157
ku 100
nga 67
si 49
era 47
nti 47
naye 35
oba 29
omukazi 29
abasajja 26
bwe 26
kino 25
buli 23
omusajja 22
ne 21
n 20
tewali 20
iran 19
kya 18
ekitiibwa 17
abakyala 16
bwo 16
nnyo 16
yo 16
bye 15
mukazi 15
musajja 15
ya 15
abamu 14
ajja 14
awo 14
baagala 14
kye 14
on 14
the 14
abakazi 13
emyaka 13
eri 13
gwe 13
kubanga 13
ye 13
bwa 12
kati 12
obusajja 12
she’s 12
alina 11
ngeri 11
yali 11
amaanyi 10
bulamu 10
bw’aba 10
engeri 10
ggwe 10
obulamu 10
omukwano 10
so 10
gye 9
nneewulira 9
yonna 9
abantu 8
basajja 8
birowoozo 8
bulijjo 8
dda 8
gwo 8
katonda 8
na 8
okuba 8
okwegomba 8
oluvannyuma 8
wa 8
ali 7
asobola 7
ayagala 7
bulungi 7
ddala 7
ebintu 7
ekyo 7
kwe 7
ky 7
kyoto 7
leero 7
lwa 7
lwaki 7
middle 7
mubiri 7
nsonga 7
okukola 7
okumala 7
oli 7
singa 7
2 6
amerika 6
ba 6
bw’oba 6
e 6
eno 6
guno 6
gwa 6
kasirise 6
kwo 6
mpola 6
mukwano 6
nsaba 6
nsi 6
obulungi 6
of 6
okubeera 6
okuwa 6
omusaayi 6
omwoyo 6
owek 6
wansi 6
wo 6
y’ebintu 6
za 6
1 5
aba 5
abasinga 5
adamu 5
and 5
be 5
butonde 5
bya 5
byo 5
east 5
emirembe 5
ensi 5
ezo 5
february 5
gavumenti 5
ge 5
gy 5
katikkiro 5
khamenei 5
kikwata 5
kyo 5
maanyi 5
maaso 5
mizayiro 5
naawe 5
nedda 5
ng 5
obufumbo 5
obukuumi 5
okusinga 5
okuva 5
okweyisa 5
omubiri 5
omukyala 5
omuntu 5
to 5
tosobola 5
uganda 5
w 5
y’ensonga 5
ze 5
9 4
a 4
abalala 4
amaaso 4
baali 4
bali 4
bba 4
bino 4
bokka 4
bw 4
created 4
drawn 4
ebbanga 4
ebbeeyi 4
ebimu 4
ekigendererwa 4
ekizimbe 4
enjawulo 4
enneewulira 4
ensonga 4
essira 4
eyali 4
ezisinga 4
go 4
kale 4
kiba 4
kifo 4
kimu 4
kiri 4
kumukuuma 4
kwagala 4
magezi 4
mirembe 4
mukama 4
mutima 4
obubi 4
obwesige 4
ojja 4
okufuna 4
okulaba 4
okusikiriza 4
omu 4
omulungi 4
omutima 4
onal 4
osobola 4
oyo 4
palamenti 4
sitaani 4
ssanyu 4
tajja 4
talina 4
tehran 4
yekka 4
yisirayiri 4
y’emu 4
zeberaze 4
zo 4
20 3
2026 3
5 3
8 3
abagoba 3
abalungi 3
agamba 3
akavuyo 3
akomyewo 3
akooye 3
akuwe 3
akwagala 3
amanyi 3
amazima 3
asooka 3
ate 3
bajja 3
bakazi 3
bakola 3
bakyala 3
bantu 3
basikiriza 3
biseera 3
bizinensi 3
blood 3
bonna 3
buba 3
bubi 3
buganda 3
bujjuvu 3
bungereza 3
busajja 3
bwabwe 3
byokka 3
byonna 3
by’ensimbi 3
by’omwoyo 3
charles 3
ddene 3
ddoola 3
ebitundu 3
egenda 3
ekitongole 3
ekitundu 3
embeera 3
emirundi 3
emmere 3
emu 3
endowooza 3
ennyonyi 3
ga 3
ggaayi 3
guys 3
gwokka 3
gya 3
gyo 3
jangu 3
jjukira 3
ka 3
kaawa 3
kabaka 3
kavuyo 3
ki 3
kintu 3
kisa 3
kiseera 3
kitegeeza 3
kitiibwa 3
kiyinza 3
kristo 3
kuba 3
kufa 3
kugezaako 3
kukula 3
kumala 3
kuyinza 3
kuzimba 3
kwa 3
mangu 3
mbeera 3
mingi 3
mukyala 3
musango 3
muwendo 3
mwoyo 3
nakibinge 3
nguudo 3
no 3
n’obukadde 3
obusobozi 3
obuyinza 3
obwagazi 3
ogw’omukwano 3
okukozesa 3
okukuba 3
okukyusa 3
okulwanagana 3
okwagala 3
okwegatta 3
olaba 3
olutalo 3
olw 3
olw’ekyo 3
olw’okuba 3
omulembe 3
omumyuka 3
ono 3
owa 3
she’ll 3
soma 3
ssente 3
tebulina 3
up 3
validati 3
wabula 3
walina 3
we 3
yazaalibwa 3
z 3
zino 3
000 2
2025 2
28 2
3 2
33 2
4 2
abaavu 2
abadde 2
abafumbo 2
abagagga 2
abakozi 2
abakulembera 2
abalina 2
abasiraamu 2
abasomesa 2
abeera 2
abo 2
agabuguma 2
agenda 2
agende 2
agwanidde 2
akaboozi 2
akaseera 2
akimanyi 2
akubirizza 2
akukyawa 2
akuwa 2
akyakuleka 2
alowooza 2
altar 2
alwanyisa 2
amagoba 2
amannya 2
ani 2
asabye 2
asigala 2
asitudde 2
ayatollah 2
ayinza 2
baabwe 2
bagala 2
bakyawa 2
bangi 2
bateeka 2
batera 2
bawa 2
bbomu 2
bbugwe 2
being 2
biba 2
bikolwa 2
bingi 2
boring 2
boxer 2
bukulembeze 2
bulumbaganyi 2
buno 2
buwooma 2
bwonna 2
bw’omukazi 2
bw’omusajja 2
bw’onywegera 2
by 2
byabwe 2
chwa 2
class 2
daudi 2
doola 2
dr 2
ebigambo 2
ebiri 2
ebisolo 2
ebivaamu 2
ebiwandiiko 2
ebyo 2
ebyobufuzi 2
eby’ekyama 2
eby’emabega 2
eby’obugagga 2
eddembe 2
ego 2
ejja 2
ekibi 2
ekintu 2
ekirabika 2
ekiro 2
ekisinga 2
ekiwanvu 2
eky’enjawulo 2
emmeeme 2
empisa 2
emyoyo 2
enkola 2
enkolagana 2
enkomerero 2
ennaku 2
ennungi 2
ensalo 2
enseke 2
ensigo 2
entalo 2
enteekateeka 2
entunula 2
esobola 2
essuubi 2
eya 2
eyinza 2
eyo 2
ey’omulembe 2
for 2
gaali 2
gano 2
gatuuka 2
genda 2
ggwanga 2
god’s 2
gumuvaako 2
gwabwe 2
gw’atasobola 2
gy’oli 2
g’obugwanjuba 2
g’omukazi 2
he 2
here 2
ii 2
in 2
internati 2
kaawaase 2
kamwa 2
kassim 2
katemba 2
kebera 2
kemiko 2
kibuga 2
kifuula 2
kikulu 2
kinnya 2
kisaawe 2
kitegeere 2
kitundu 2
kiyita 2
kkooti 2
kubikulembera 2
kufera 2
kufuga 2
kufuna 2
kukikola 2
kukola 2
kukubuulira 2
kukwatagana 2
kusomesa 2
kutandika 2
kuwulira 2
kuyita 2
kwekalakaasa 2
kwekwasa 2
kyali 2
kyangu 2
kyayo 2
kyetaagisa 2
ky’oli 2
ky’omukazi 2
last 2
lekera 2
lino 2
lowooza 2
lujjudde 2
lumu 2
lunaku 2
lutalo 2
lya 2
lyo 2
lyokka 2
lyonna 2
magumba 2
mayiga 2
missi 2
mugambe 2
muganda 2
mulamu 2
muleke 2
mulekere 2
mulungi 2
munafu 2
munda 2
muntu 2
musunguwavu 2
mutaabani 2
mutebenkevu 2
mwetegefu 2
mwoleso 2
nabo 2
naddala 2
ng’ayita 2
ng’entandikwa 2
ng’oli 2
ng’omaze 2
ng’omusajja 2
ntebe 2
nukiriya 2
nze 2
n’abasajja 2
n’agamba 2
n’agenda 2
n’amazzi 2
n’ekigendererwa 2
n’okufaayo 2
n’okukuuma 2
n’okwegomba 2
n’omukazi 2
n’omukwano 2
n’omuntu 2
obubaka 2
obugenda 2
obukyayi 2
obumanyirivu 2
obunene 2
obutakyukakyuka 2
obutebenkevu 2
obutonde 2
obuwoomi 2
obuwumbi 2
obuyonjo 2
obuzibu 2
obwesigwa 2
obwo 2
obwongo 2
obw’amaanyi 2
obw’ekyama 2
okufuuka 2
okuggulawo 2
okukangavvula 2
okukkiriza 2
okukula 2
okukwata 2
okulabula 2
okulowooza 2
okulwawo 2
okunywegera 2
okusembeyo 2
okusigala 2
okusiima 2
okusinziira 2
okuttibwa 2
okutwala 2
okuzimba 2
okwesasuza 2
okwetereeza 2
okwetooloola 2
okwolesebwa 2
okwonoona 2
okw’amaanyi 2
olina 2
olubereberye 2
olunaku 2
olw’ebyo 2
omanyi 2
omubisi 2
omuguwa 2
omukolo 2
omukulu 2
omulala 2
omulangira 2
omuliro 2
omulunzi 2
omusango 2
omutuufu 2
omuwendo 2
ova 2
ow 2
ow’ekisa 2
ow’omuwendo 2
oyagala 2
oyinza 2
peter 2
plan 2
prime 2
prof 2
pulezidenti 2
s 2
samusooni 2
ssekabaka 2
takulwanyisa 2
tasobola 2
tavuganya 2
tebaagala 2
tojja 2
toli 2
tolina 2
toyomba 2
ttiimu 2
twaha 2
wabaawo 2
waffe 2
waggulu 2
wakati 2
waliwo 2
wange 2
weetegereze 2
woman 2
wuliriza 2
y 2
yaabwe 2
yabwatuka 2
yajja 2
yandibadde 2
yasaba 2
yazzeemu 2
yebazizza 2
yenna 2
yesu 2
yintaneeti 2
your 2
zaabu 2
zirawuna 2
z’amagye 2
