mu 463
ku 328
nga 279
n 266
ne 189
e 166
nti 162
ng 124
era 84
bwe 83
y 74
wa 65
abantu 62
kino 51
w 50
ya 50
gye 42
kya 41
ye 41
eno 38
fc 38
bw 37
ssente 37
gavumenti 35
abadde 34
kyokka 33
poliisi 33
okuva 32
ky 31
olw 31
yagambye 31
by 28
omwaka 28
b 27
buli 27
lw 26
wabula 26
bano 25
eby 25
gw 24
lukwago 24
ttiimu 24
yategeezezza 24
we 23
za 23
ab 22
ez 22
fr 22
okuli 22
ono 22
ali 21
ate 21
be 21
ly 21
naye 21
abalala 20
abatuuze 20
enjawulo 20
kampala 20
eddagala 19
oluvannyuma 19
omubaka 19
omugenzi 19
uganda 19
yali 19
abaana 18
ba 18
bagenda 18
emyaka 18
paapa 18
2022 17
abavubuka 17
agaba 17
gwe 17
gy 17
okukola 17
bino 15
bro 15
bya 15
bye 15
disitulikiti 15
ekya 15
enguudo 15
kifo 15
maka 15
nsonga 15
omwana 15
2 14
abazadde 14
asaba 14
balina 14
eky 14
g 14
ga 14
kitundu 14
kubanga 14
kye 14
lwa 14
omu 14
ze 14
10 13
2023 13
abakyala 13
city 13
kigambibwa 13
kuba 13
omulambo 13
omwogezi 13
palamenti 13
ssentebe 13
z 13
zino 13
abamu 12
agamba 12
ebintu 12
ekifo 12
ensimbi 12
kcca 12
lubanga 12
mmeeya 12
naddala 12
obukadde 12
ofiisi 12
omuli 12
ow 12
russia 12
updf 12
00 11
3 11
abajaasi 11
abakulembeze 11
abasawo 11
bukedde 11
busoga 11
bwa 11
ebyokwerinda 11
ey 11
kati 11
kwe 11
malwaliro 11
munisipaali 11
okufuna 11
okulaba 11
okwongera 11
omuvubuka 11
ukraine 11
abasajja 10
asabye 10
baabadde 10
baabwe 10
bali 10
bonna 10
br 10
charles 10
ensonga 10
isabirye 10
kadaga 10
kasasiro 10
kisaka 10
kiseera 10
kyalo 10
lya 10
na 10
ngeri 10
olwo 10
owa 10
pulezidenti 10
road 10
somalia 10
ssaawa 10
waiswa 10
yasabye 10
000 9
23 9
aba 9
amasasi 9
bannayuganda 9
benedict 9
bitundu 9
cranes 9
dr 9
egenda 9
ekitundu 9
eri 9
essimu 9
kkooti 9
lwe 9
museveni 9
nnyo 9
okunoonyereza 9
wansi 9
yabadde 9
zonna 9
50 8
abazannyi 8
abitex 8
agambye 8
agenda 8
amaanyi 8
bangi 8
banne 8
ddala 8
dorothy 8
ebitone 8
eddwaaliro 8
ekibiina 8
ekyalo 8
emirimu 8
emmundu 8
engeri 8
eya 8
francis 8
guno 8
gwa 8
gya 8
jaguzi 8
kalangala 8
katonda 8
kiteredde 8
kw 8
mbarara 8
mukono 8
myaka 8
nju 8
oku 8
okutuusa 8
olutindo 8
omulimu 8
omuntu 8
wadde 8
waliwo 8
wamu 8
wiiki 8
8 7
abasoba 7
ag 7
akulira 7
alina 7
amateeka 7
anatoli 7
bantu 7
basobole 7
ebiri 7
ebirime 7
eggulo 7
eggwanga 7
ekibuga 7
ekiro 7
endongo 7
erya 7
essaza 7
ggaba 7
ggombolola 7
ggwanga 7
john 7
kibuuka 7
kitara 7
klezia 7
kukola 7
kuliko 7
kyabwe 7
leero 7
luno 7
maaso 7
mbeera 7
mpaka 7
mutindo 7
obusamize 7
okufa 7
okutuuka 7
okuziika 7
omutindo 7
paul 7
peter 7
s 7
sipiika 7
ssaabasumba 7
st 7
yonna 7
abagenda 6
afudde 6
amasannyalaze 6
amawanga 6
anatooli 6
ategeezezza 6
awaka 6
baagala 6
baali 6
babadde 6
bamusaayimuto 6
bbiri 6
bifo 6
buganda 6
byonna 6
december 6
ekkubo 6
ekkulu 6
embeera 6
empaka 6
ennaku 6
eyo 6
ka 6
kimu 6
lino 6
lukiiko 6
lwokubiri 6
lwokuna 6
makumbi 6
minisitule 6
mmisa 6
mwe 6
nambooze 6
nnyumba 6
nsambya 6
nsi 6
obulungi 6
okumala 6
omusango 6
oyo 6
tibikoma 6
vatican 6
wakati 6
yannyonnyodde 6
zaake 6
12 5
17 5
30 5
7 5
abaddusi 5
abakazi 5
abakozi 5
abasinga 5
abayizi 5
afiirawo 5
amafuta 5
amalala 5
amaze 5
among 5
ayagala 5
ayogera 5
bagamba 5
bakola 5
basaba 5
basilica 5
bulungi 5
ddaamu 5
ebbanga 5
ebirala 5
ebitundu 5
ebyalo 5
eggombolola 5
emmotoka 5
enkola 5
essaawa 5
essomero 5
ezigenda 5
freedom 5
isimba 5
k 5
katale 5
kibet 5
loodi 5
lutalo 5
lwaki 5
masaka 5
mayuge 5
micho 5
minisita 5
mityana 5
mmande 5
mukasa 5
mwaka 5
mwanje 5
nec 5
nguudo 5
nnaku 5
ntebe 5
nteekateeka 5
obubenje 5
obuwumbi 5
oguwedde 5
ogw 5
ogwa 5
okuba 5
okukolera 5
okulondoola 5
okumalako 5
okutandika 5
okutwala 5
okuziikibwa 5
omukazi 5
omukyala 5
omulala 5
omusumba 5
omutendesi 5
salaama 5
saudi 5
simon 5
ssatu 5
ssemogerere 5
ssomero 5
sudan 5
villa 5
yategeezeza 5
26 4
4 4
40 4
6 4
ababeera 4
abaserikale 4
abasirikale 4
abasula 4
abooluganda 4
akola 4
akuba 4
alaga 4
alambula 4
amaliriza 4
amawulire 4
amazzi 4
amyuka 4
anita 4
atwala 4
awambye 4
baana 4
babeera 4
bagenze 4
bakireke 4
bakole 4
bannabyabufuzi 4
bannakalooli 4
bannakibiina 4
bannamawulire 4
batta 4
bbondi 4
betty 4
big 4
bikolwa 4
bokka 4
budde 4
buddo 4
bukadde 4
buva 4
chan 4
congo 4
council 4
ddwaaliro 4
development 4
east 4
ebibiina 4
ebigezo 4
ebikwekweto 4
ebya 4
ekigendererwa 4
ekintu 4
ekisangibwa 4
ekitongole 4
emaku 4
emisana 4
emisango 4
emisinde 4
emitwalo 4
empisa 4
emu 4
enkulu 4
erias 4
erina 4
ezikola 4
jinja 4
junction 4
kamuli 4
kawempe 4
kayunga 4
kibuga 4
kiddiridde 4
kivvulu 4
kiyaga 4
kizimbe 4
kkampuni 4
kuziika 4
league 4
lirina 4
lule 4
lumu 4
maama 4
makya 4
mirimu 4
mmotoka 4
mukyala 4
mulago 4
munnaabwe 4
munnaddiini 4
muwanga 4
mw 4
nabo 4
namuganza 4
njia 4
nnamba 4
nnankulu 4
north 4
oba 4
obubbi 4
obujulizi 4
obutonde 4
obuyambi 4
obuzibu 4
obwannannyini 4
okubeera 4
okudda 4
okugenda 4
okugolola 4
okukendeeza 4
okukolebwa 4
okukuba 4
okukuuma 4
okukwata 4
okumaliriza 4
okunnyonnyola 4
okunywa 4
okuvuganya 4
okuwangula 4
okuzuula 4
okweyongera 4
oluguudo 4
olunaku 4
olutalo 4
oluvanyuma 4
omumyuka 4
omwali 4
patrick 4
petero 4
police 4
putin 4
si 4
singa 4
sirinya 4
south 4
ssenyi 4
ssozi 4
street 4
talina 4
tamanyi 4
town 4
twaha 4
united 4
waayo 4
wabweru 4
wasswa 4
william 4
yamukubye 4
1 3
18 3
2013 3
25 3
28 3
300 3
400 3
44 3
5 3
75 3
abaabadde 3
abaagala 3
abaali 3
ababaka 3
abadigize 3
abafere 3
abakulu 3
abakungu 3
abali 3
abamenyi 3
abanene 3
abangi 3
abasamize 3
abasomesa 3
abasukka 3
abawala 3
abo 3
adjumani 3
afaanana 3
africa 3
agambibwa 3
ajjanjabisa 3
akakwasisa 3
akambe 3
amaka 3
amasomero 3
asobola 3
ategeeza 3
awadde 3
azze 3
bakafulu 3
bakkansala 3
bakolera 3
bakulembeze 3
balaze 3
bamateeka 3
bamaze 3
bank 3
bannakampala 3
banzizaayo 3
basamize 3
basattira 3
basuubira 3
bategese 3
bazadde 3
bazze 3
bbeeyi 3
bigere 3
bintu 3
bizinga 3
brig 3
brother 3
bubi 3
bukuumi 3
bulabe 3
bulago 3
bunya 3
byabwe 3
byalo 3
chelangat 3
cherop 3
chesang 3
cpl 3
dan 3
ddagala 3
ddiiru 3
derrick 3
ebidduka 3
ebikajjo 3
ebikolwa 3
ebimu 3
ebisinga 3
ebitongole 3
ebivvulu 3
ebiwundu 3
ebyenjawulo 3
ebyenjigiriza 3
egy 3
ekimu 3
ekimuli 3
ekinnansi 3
ekiraamo 3
ekiri 3
ekirindi 3
ekizimbe 3
embuto 3
emikisa 3
emirembe 3
emiriraano 3
emirundi 3
emiwendo 3
emmere 3
emyezi 3
enda 3
enddala 3
enkambi 3
ensi 3
entalo 3
entambula 3
erisa 3
ettaano 3
ettaka 3
eyabadde 3
eyafiiridde 3
eyaliko 3
ezisoba 3
felix 3
ffe 3
fiika 3
gaabwe 3
ge 3
george 3
ggoolo 3
ggwanika 3
gino 3
gumu 3
herbal 3
iddi 3
january 3
jjumba 3
joseph 3
kabenje 3
kagabo 3
kalule 3
kasadha 3
kataka 3
kawooya 3
kibangirizi 3
kibiina 3
kibuye 3
kigo 3
kinyamasika 3
kiro 3
kiromiita 3
kisaawe 3
kitabo 3
kitebe 3
kitongole 3
kkansala 3
kr 3
kubeera 3
kukuba 3
kulaba 3
kulaigye 3
kuno 3
kwa 3
kwabwe 3
l 3
l/cpl 3
liigi 3
limanda 3
lubaga 3
lugazi 3
luke 3
lusooka 3
lutindo 3
lutoboka 3
lwanga 3
lwokutaano 3
lye 3
ma 3
mabbali 3
mateeka 3
matugga 3
meeya 3
mmere 3
mugambe 3
mukaaga 3
mukama 3
mukolo 3
mulimu 3
muluka 3
muntu 3
musanvu 3
mutima 3
mutwe 3
muvubuka 3
mv 3
naikondo 3
nakasujja 3
nakawa 3
nakiwogo 3
namwendwa 3
nateete 3
ndeeba 3
ngalo 3
nkulu 3
nnannyini 3
nnanyini 3
nnayikondo 3
nsimbe 3
ntikko 3
nyc 3
nze 3
o 3
obulamu 3
obungi 3
obusobozi 3
obw 3
obwa 3
okola 3
okubayamba 3
okuddamu 3
okufuba 3
okujaguza 3
okukanda 3
okumpi 3
okusaba 3
okusala 3
okusinga 3
okusinziira 3
okusobola 3
okuteekawo 3
okutta 3
okutya 3
okuyamba 3
okuyingira 3
okuyoola 3
okuzimba 3
okuzza 3
okw 3
okwagala 3
okwenyigira 3
oluusi 3
omugga 3
omujaasi 3
omukisa 3
omukolo 3
omukozi 3
omukwano 3
omulamuzi 3
omulundi 3
omupya 3
omusolo 3
omuwendo 3
omuzannyi 3
pikipiki 3
rev 3
roma 3
saawa 3
samuel 3
seminaaliyo 3
serverus 3
soroti 3
spare 3
ssamba 3
ssebalamu 3
ssimu 3
tamanyikiddwa 3
tewali 3
waabwe 3
waggulu 3
wakiso 3
wano 3
xvi 3
yaayo 3
yakola 3
yakwatiddwa 3
yalabudde 3
yasanze 3
yasooka 3
yasoose 3
yayongeddeko 3
yenna 3
ziweza 3
zzooni 3
13 2
130 2
14 2
19 2
31 2
35 2
375 2
9 2
95 2
aanya 2
abaalumba 2
abaatudde 2
ababatigomya 2
ababiri 2
abacuba 2
abagoberezi 2
abakola 2
abakuumaddembe 2
abalambuzi 2
abalenzi 2
abalumbye 2
abasaba 2
abataka 2
abateeberezebwa 2
abategeeza 2
abatemu 2
abatonotono 2
abattiddwa 2
abawangaalira 2
abazungu 2
abazze 2
abdallah 2
abdul 2
abeera 2
aboobuyinza 2
aboogerwako 2
abtex 2
adf 2
aduuyi 2
afa 2
african 2
agaana 2
agattako 2
agugulana 2
agula 2
agusuula 2
agwa 2
ajja 2
ajjanjabibwa 2
akabinja 2
akakasizza 2
akakiiko 2
akatwongera 2
akazito 2
akolera 2
akuuma 2
alambudde 2
alaze 2
aleeta 2
alingiza 2
alitwala 2
alya 2
amagoba 2
amagye 2
amakakali 2
amalwaliro 2
amayumba 2
amazina 2
amumanyi 2
amuteeka 2
amutta 2
amutuga 2
amutwala 2
amuwamba 2
and 2
annyonnyola 2
apollo 2
asiimwe 2
asindikiddwa 2
asinziira 2
asobole 2
asomesa 2
asooka 2
association 2
asula 2
asulawo 2
atalina 2
atemuddwa 2
atyo 2
august 2
augustine 2
awamu 2
awanika 2
awatali 2
aweze 2
awo 2
ayinza 2
ayita 2
ayogedde 2
aziikibwa 2
aziikiddwa 2
baakutte 2
baakwongera 2
baakyo 2
baalabiddwako 2
baalabye 2
baalina 2
baalowoozezza 2
baalumba 2
baami 2
baamukutte 2
baasobola 2
baasooka 2
baasoose 2
baayolesezza 2
bababdde 2
babaka 2
babukeerezza 2
baddamu 2
bafaaza 2
bafuna 2
bafunye 2
baganzika 2
bagezeezaako 2
bagusuula 2
bajaasi 2
bajaguza 2
bajeemedde 2
bajeti 2
bakaanyizza 2
bakakasa 2
bakkirize 2
bakozesa 2
bakubaganye 2
bakulembeddwa 2
bakulembeddwamu 2
bakung 2
bakyetegereza 2
balaam 2
balabuddwa 2
balaga 2
balimu 2
balumba 2
bamenyi 2
bamufeze 2
bamutenguwa 2
bandiba 2
bankalakkalira 2
bannamateeka 2
bannanyini 2
basabiddwa 2
basajja 2
basasula 2
basatu 2
base 2
basobeddwa 2
basobodde 2
basonda 2
bassentebe 2
batadde 2
batandike 2
batuuza 2
bavaayo 2
bavubuka 2
bawagizi 2
bayinginiya 2
bayita 2
bbaala 2
bbanka 2
beekozeemu 2
beetegereza 2
beeyongedde 2
begumisa 2
benjamin 2
bibiri 2
bigenda 2
bo 2
boodabooda 2
bosco 2
bubaka 2
bubenje 2
buikwe 2
bukambwe 2
bulungu 2
bunamwaya 2
bunnaddiini 2
busiika 2
buvuddeko 2
buweereza 2
buwumbi 2
buyera 2
bwaffe 2
bwatyo 2
bwebatali 2
bwonna 2
byaggweera 2
byali 2
c 2
camp 2
canon 2
capt 2
central 2
certification 2
chebet 2
cheptegei 2
christopher 2
college 2
country 2
crop 2
cross 2
ddwaliro 2
ddyo 2
de 2
divisoni 2
dominic 2
drone 2
ebadde 2
ebibadde 2
ebigenda 2
ebikozesa 2
ebimotoka 2
ebinnya 2
ebipya 2
ebirabo 2
ebisenge 2
ebisigalira 2
ebitali 2
ebitannajja 2
ebiwerako 2
ebiwerera 2
ebiwoobe 2
ebula 2
edda 2
egimanyiddwa 2
eguudo 2
ekibinja 2
ekiddukanya 2
ekifaananyi 2
ekigenda 2
ekika 2
ekikolwa 2
ekikopo 2
ekikuumi 2
ekirungi 2
ekiruubirirwa 2
ekisaawe 2
ekiso 2
ekisulo 2
ekitali 2
ekitebe 2
ekitiibwa 2
ekiyumba 2
ekola 2
ekubye 2
ekulembedde 2
ekyakeesezza 2
ekyali 2
ekyatwalibwa 2
ekyekusifu 2
ekyombo 2
emidaali 2
emipiira 2
emirala 2
emirambo 2
emmeeri 2
empawa 2
endagaano 2
endwadde 2
enjega 2
enkiiko 2
enkulaakulana 2
enkyukakyuka 2
ennyumba 2
entaana 2
ente 2
enteekateeka 2
entiisa 2
erimu 2
eritatuuse 2
ery 2
esangibwa 2
esatu 2
etannaggwa 2
etuuke 2
evunaanyizibwa 2
ewedde 2
eweze 2
eyafiira 2
eyagenze 2
eyattiddwa 2
eyawummula 2
eyita 2
eza 2
ezimu 2
ezo 2
ezzeeyo 2
famire 2
february 2
february/2023 2
fire 2
florence 2
fred 2
gavuga 2
germany 2
group 2
guli 2
gutwalibwa 2
gwabwe 2
gwamanyiiko 2
henry 2
hospital 2
ibra 2
ibrahim 2
ii 2
iii 2
imaam 2
inspection 2
joan 2
juma 2
kabaka 2
kabuye 2
kaduukulu 2
kaggwa 2
kaguli 2
kakiiko 2
kanaala 2
kasujja 2
kibinja 2
kifuba 2
kigongo 2
kikuumiramu 2
kira 2
kirabika 2
kiri 2
kiringo 2
kiromita 2
kisambira 2
kisulwamu 2
kisuza 2
kiteeberezebwa 2
kituufu 2
kiyinza 2
kizinga 2
kkanso 2
kkava 2
kkwiini 2
kubalabula 2
kudda 2
kufumbira 2
kukozesa 2
kukulemberwa 2
kumpi 2
kunoonyereza 2
kusaba 2
kusomesa 2
kutandika 2
kuva 2
kuziikibwa 2
kwonna 2
kyabadaaza 2
kyandiba 2
kyotera 2
lawrence 2
leediyo 2
life 2
limbo 2
linnya 2
lonzino 2
lord 2
ludda 2
luguudo 2
lunaku 2
lusiisira 2
lutandika 2
luweero 2
luzira 2
lweza 2
lyabwe 2
maaliri 2
mangwi 2
masomero 2
mawanga 2
mawulire 2
mayumba 2
mbalirira 2
medical 2
medicine 2
mercyline 2
michael 2
mirembe 2
mirima 2
mirundi 2
modern 2
mogadishu 2
mpigi 2
mpola 2
mubiru 2
mudumu 2
mugezi 2
mugongo 2
mujwahuzi 2
mukulu 2
mulambo 2
mulundi 2
mundeeba 2
mungi 2
musajja 2
musango 2
musinguzi 2
mutabani 2
mwana 2
mwezi 2
mwodi 2
myala 2
nabyo 2
namutaawe 2
nannyini 2
nantongo 2
ndagaano 2
ngobe 2
nkambi 2
nkokola 2
nkoyoyo 2
nnyingi 2
noomu 2
november 2
nsasa 2
nsingo 2
nsobi 2
nsolo 2
ntambuza 2
obudde 2
obufiiriddemu 2
obujjanjabi 2
obukodyo 2
obukuumi 2
obuli 2
obunene 2
obutakotoggera 2
obwannanyini 2
obwavu 2
obwennyamivu 2
of 2
ofwono 2
ogubadde 2
ogumu 2
ogwo 2
okubaako 2
okubamanya 2
okubanja 2
okubeeemulugunyako 2
okubeerawo 2
okubulwa 2
okuddaabiriza 2
okudduka 2
okufuluma 2
okufulumya 2
okugamba 2
okujjanjabisa 2
okujjula 2
okukongola 2
okukubira 2
okuliraana 2
okulowooza 2
okumanya 2
okumukwata 2
okumusendasenda 2
okunoonya 2
okusiiba 2
okusimbulanga 2
okusobya 2
okusomesa 2
okutaasa 2
okutangaaza 2
okutegeka 2
okutendekebwa 2
okutereeza 2
okutereka 2
okutwalibwa 2
okuvaako 2
okuwa 2
okuwaayo 2
okuwamba 2
okwaniriza 2
okwerinda 2
okwetoloola 2
okwettanira 2
okwewala 2
okwokya 2
old 2
oledo 2
oli 2
olugatta 2
olutaba 2
olwa 2
olwalabye 2
olwokusatu 2
omubbi 2
omuggya 2
omugoba 2
omukadde 2
omukama 2
omukuumi 2
omulabe 2
omulimi 2
omulungi 2
omumyuuka 2
omupiira 2
omusaayi 2
omusajja 2
omusuubuzi 2
omutegesi 2
omutemu 2
omutima 2
omutujju 2
omutume 2
omutuuze 2
omuwaabi 2
omuyiggo 2
omuzadde 2
omuzannyo 2
omwezi 2
opondo 2
otadde 2
otucet 2
owoyesigyire 2
p7 2
parish 2
persis 2
portbell 2
pte 2
pulogulaamu 2
ra/192118 2
ra/204402 2
rebecca 2
robert 2
rogers 2
rubaga 2
s4 2
s6 2
saako 2
saundi 2
sc 2
school 2
sente 2
sentebe 2
september 2
sga 2
sheeba 2
sir 2
spire 2
square 2
ssaabaminisita 2
ssaako 2
ssanduuke 2
ssekabira 2
ssekukkulu 2
ssi-bukunja 2
taata 2
tc 2
tebaalabikako 2
tebalabikako 2
tebalina 2
tegalina 2
tekinologiya 2
tekyamulobedde 2
terina 2
ttaka 2
ttenda 2
tusobole 2
twatuuse 2
vision 2
waakuziikibwa 2
waakyo 2
wange 2
wasigaddewo 2
works 2
world 2
yabawa 2
yabawadde 2
yabayita 2
yafiiridde 2
yafuna 2
yakakasizza 2
yakakolerawo 2
yakomawo 2
yakubirizza 2
yakubye 2
yakulira 2
yakyusibwa 2
yalumiriza 2
yamaze 2
yamusanze 2
yasala 2
yasambazze 2
yasinzidde 2
yassaawo 2
yateeka 2
yategeeza 2
yatuuka 2
yatwalibwa 2
yava 2
yeebaza 2
yeebazizza 2
yeemulugunya 2
yeetegekera 2
yeewunyisa 2
yennyamidde 2
yezu 2
zaali 2
zaazimbibwa 2
zaffe 2
zikola 2
zokka 2
zooni 2
