num 1646
mu 950
na 381
abantu 255
ne 245
era 240
kkumi 235
nti 199
bbiri 193
ku 187
katonda 169
yakuwa 152
abiri 136
emu 135
ssatu 133
bo 114
nga 113
bayibuli 111
bwe 105
ttaano 88
ya 88
enguzi 87
mukaaga 83
no 81
abalala 80
munaana 80
musanvu 76
ebintu 72
ekyo 71
nnya 71
wa 70
eya 67
dawudi 66
owa 66
engeri 64
kamu 64
gavumenti 62
nkumi 61
gye 60
ye 60
naye 57
oba 57
aba 56
asatu 54
kikumi 54
olwa 54
ba 53
buli 53
ensi 52
mitwalo 52
essanduuko 49
ngeri 46
okuba 46
kya 45
mwenda 45
omu 45
bonna 43
ebizibu 40
zabbuli 40
omuntu 39
lukumi 37
essanyu 36
okukola 36
awo 35
bye 35
gu 34
kasiriivu 34
kulya 34
obulyi 34
amazima 33
ebya 33
okwagala 33
bukadde 32
emirembe 32
maaso 32
bya 31
bangi 30
okuyiga 30
gya 29
yokaana 29
be 28
byonna 28
kubanga 28
zaffe 28
alina 27
ngo 27
bakkiriza 26
ekitiibwa 26
emikwano 26
eza 26
lwaki 26
za 26
bajja 25
omunaala 25
omutonzi 25
yonna 25
bubiri 24
ensonga 24
gumu 24
mutwalo 24
nnyo 24
okukozesa 24
okumanya 24
waffe 24
enteekateeka 23
ojja 23
ebikolwa 22
ggwe 22
gyali 22
kuba 22
kwe 22
abo 21
agenda 21
ga 21
nnamaddala 21
nnyumba 21
okwekkiririzaamu 21
ajja 20
ekya 20
gyonna 20
obulamu 20
okulya 20
tuba 20
url 20
abaana 19
bwabwe 19
ebirungi 19
ennungi 19
jpg 19
nguzi 19
bintu 18
ebibi 18
ebiri 18
gwe 18
lya 18
mikali 18
nge 18
nsi 18
okubikkulirwa 18
okuyigiriza 18
tukoma 18
uzza 18
yali 18
yekka 18
abakungu 17
abalalaweereza 17
atubuulira 17
bulyi 17
bwa 17
ebiva 17
eteribaamu 17
kwagala 17
samwiri 17
ssente 17
yaabwe 17
engero 16
kibuga 16
naffe 16
nkuŋŋaana 16
okuddamu 16
omukuumi 16
waggulu 16
abatekkiririzaamu 15
abekkiririzaamu 15
ana 15
baba 15
batera 15
ddala 15
ebiramu 15
edomu 15
ekibiina 15
etaano 15
isirayiri 15
kiseera 15
muntu 15
obedi 15
okuva 15
olubereberye 15
si 15
univ/art 15
univ_sqr_xl 15
bulungi 14
ekizimbe 14
kufuna 14
okufuna 14
osobola 14
oyinza 14
south 14
zeero 14
abaali 13
akola 13
ate 13
balala 13
bingi 13
ebibuuzo 13
ebimukwatako 13
ekizibu 13
erinnya 13
eyo 13
kimu 13
kino 13
nabo 13
okumalawo 13
okumwagala 13
okusinga 13
olwekyo 13
tulina 13
yaffe 13
yatonda 13
abakkolinso 12
abassessalonika 12
bassekabaka 12
beera 12
bina 12
busiriivu 12
buwumbi 12
ebifaananyi 12
ebikwata 12
ebyawandiikibwa 12
ebyomumirembe 12
ekisa 12
ennyumba 12
essaala 12
ka 12
kiyinza 12
kubeera 12
mikwano 12
mulimu 12
okunoonyereza 12
peetero 12
tujja 12
tukozesa 12
tuli 12
weereza 12
abakkolosaayi 11
abaruumi 11
balina 11
ebitabo 11
eggwanga 11
enkalu 11
enkuŋŋaana 11
jw 11
kiba 11
kubaawo 11
kumalawo 11
laba 11
nsolo 11
obulungi 11
okubeera 11
okusonyiwa 11
org/lg 11
vidiyo 11
wadde 11
yagamba 11
abajulirwa 10
abakufaako 10
ali 10
ataano 10
baabwe 10
babba 10
bibi 10
bujja 10
ekyokulabirako 10
eri 10
kukola 10
kulimu 10
kyenda 10
leero 10
luuyi 10
lwa 10
obusungu 10
obuyinza 10
okubala 10
okubiri 10
okuganyula 10
okulaba 10
okuweebwa 10
olulala 10
oluusi 10
omwana 10
soma 10
wansi 10
abasanyufu 9
abinadaabu 9
afuga 9
akwata 9
asingayo 9
baali 9
bamanye 9
bino 9
byabwe 9
ebitonde 9
ejja 9
emikisa 9
emirundi 9
emyaka 9
ensobi 9
esinga 9
eyasooka 9
eyigiriza 9
kabaka 9
kinaana 9
kuggwaawo 9
kumuleetera 9
kyonna 9
lyabwe 9
lyo 9
mutima 9
muwala 9
newakubadde 9
obukulu 9
okukungubaga 9
okusinza 9
okuyitira 9
pulintaweereza 9
sawulo 9
sindika 9
sitaani 9
ssanduuko 9
timoseewo 9
wekka 9
yamba 9
ze 9
abaafa 8
atukoze 8
baatondebwa 8
bakimanyi 8
dda 8
e 8
ebitunyiiza 8
enkolagana 8
ensolo 8
eyatonda 8
ffe 8
ffenna 8
kubaamu 8
kubaayo 8
kubasobozesa 8
mirembe 8
obukkakkamu 8
okubonaabona 8
omuyinza 8
oyo 8
tukola 8
tuwa 8
yakola 8
abaasibibwa 7
abalonzi 7
abeera 7
affairs 7
afirika 7
africa 7
agakwata 7
akimanyi 7
akulira 7
akutwala 7
amerika 7
asiya 7
asonyiwa“oli 7
ayagala 7
baalya 7
baasibibwa 7
baavunaanibwa 7
baddukanya 7
bitaano 7
bokka 7
brazil 7
bulaaya 7
bulamu 7
cecilia 7
commissi 7
ddyo 7
ebitali 7
ebizimbisibwa 7
ebukiika 7
egya 7
ekibuga 7
ekiyitibwa 7
erinnya“abantu 7
erya 7
eryo 7
european 7
eyaliko 7
eyazimba 7
ge 7
gonna 7
gyaffe 7
home 7
isaaya 7
kampuni 7
kibaleetera 7
kitta 7
kityo 7
korea 7
kuzimba 7
kwakolebwa 7
kyagwa 7
kyazuulibwa 7
kye 7
kyeyongeramu 7
lukka 7
lwe 7
lwenda 7
malmström 7
mateeka 7
mutindo 7
mwali 7
mwe 7
nekkemiya 7
obugambo 7
obuli 7
obutagoberera 7
okugulirira 7
okwagala“katonda 7
oli 7
omukulembeze 7
omumyuka 7
omusolo 7
omuwi 7
omwetegefu 7
on 7
oul 7
se 7
tetutuukiridde 7
tumusemberere 7
tuyige 7
weetegereze 7
wiiki 7
yagattako 7
yeeraliikiriza 7
zirabika 7
ziremereddwa 7
abagabi 6
abakkolinsoabaggalatiyaabeefesoabafiripiabakkolosaayi 6
abaleevi 6
abalina 6
abamukoowoola 6
abanunula 6
abazaana 6
abazadde 6
addamu 6
afuuka 6
agamba 6
agatuyamba 6
agitwala 6
akaddiye 6
akiyo 6
alaga 6
aliba 6
amagezi 6
anoonyereza 6
anyooma 6
asaanidde 6
attibwa 6
atusonyiwa 6
awulira 6
awuliriza 6
bakuba 6
batyo 6
bawuliriza 6
bijja 6
bimu 6
biraga 6
biro 6
bisatu 6
bucaase 6
bufukunya 6
bulabika 6
busedde 6
butaano 6
bwereere 6
bwesimbu 6
date 6
ebayamba 6
ebikolebwa 6
ebikolwaabaruumi 6
ebirala 6
ebisingawo 6
ebitukuvu 6
ebivuga 6
ebiweebwayo 6
ebyokebwa 6
eggye 6
ekifo 6
ekipya 6
ekiseera 6
ekisooka 6
ekitabo 6
ekitabonyumirwa 6
ekitole 6
ekkubo 6
ekyabalamuziluusi 6
ekyamateekayoswa 6
emabaga 6
emirimu 6
empya 6
endwadde 6
engeroomubuulizi 6
enkyukakyuka 6
enkyusa 6
ennaku 6
ente 6
eraga 6
esezayobuzabbuli 6
ewuwe 6
eyali 6
eyannonda 6
ezeekyeridanyerikoseyayoweeriamosi 6
ezeranekkemiya 6
gaabwe 6
gyazo 6
hall 6
intaneeti 6
kenda 6
ki 6
kifo 6
kingdom 6
kinnyonnyola 6
kirimu 6
kuggyawo 6
kumalibwawo 6
kumpi 6
kutuvunaana 6
kuzikiriza 6
kwabwe 6
lusanvu 6
lusozi 6
muganda 6
mwetegefu 6
nate 6
nja 6
obadiyayonamikkanakkumukaabakuukuzeffaniyakaggayizekkaliyamalakimatayomakkolukkayokaana 6
obulombolombo 6
obutaddamu 6
obutasobola 6
okufa 6
okugaba 6
okulongoosa 6
okusobola 6
okutambuliramu 6
okutusonyiwa 6
okutuusa 6
okuwanjaga 6
oluyimba 6
omuggundu 6
omugitti 6
omukuumigavumenti 6
omukuumilwaki 6
omukwano 6
pulofeesa 6
roseackerman 6
ssaddaaka 6
sulemaaniisaayayeremiya 6
susan 6
taddamu 6
talirivaamu 6
tayagala 6
tekulibaawo 6
tezisobola 6
timoseewotitofiremooniabebbulaniyayakobo 6
tufuba 6
tugoberera 6
tumusinze 6
twakola 6
twenenya 6
vidiyobiki 6
wakati 6
wammanga 6
wamu 6
wo 6
yawandiika 6
yigiriza 6
yokaanayuda 6
zaffe“yakuwa 6
ziddukanyaamu 6
zirina 6
abalamuzi 5
abamu 5
abateenyooma 5
akozesa 5
alidde 5
asobozese 5
atusuubiza 5
awamu 5
baanirizibwa 5
babeera 5
babitunuulira 5
bafa 5
bafuna 5
bagamba 5
baganyulwa 5
bakungu 5
balamuzi 5
banguyirwa 5
banywevu 5
basigala 5
basooka 5
bayibulituyigiriza 5
baŋŋanda 5
beewala 5
bibiina 5
biruubirirwa 5
biseera 5
bisinga 5
bitongole 5
biyamba 5
bizibu 5
boolekagana 5
bufuzi 5
bukomi 5
bulamuengeri 5
bulijjo 5
businga 5
ebiragalalagala 5
ebitongole 5
ebitono 5
eddamu 5
egisukka 5
ekinoonyereza 5
ekisuubizo 5
ekiyitibwatransparency 5
emabega 5
eminywevu 5
ennyo 5
erimu 5
erina 5
eryali 5
essuula 5
etteeka 5
etwalibwa 5
ewa 5
eyafulumizibwa 5
eziba 5
gyabwe 5
internati 5
kati 5
kibalemesa 5
kibanguyira 5
kibasobozesa 5
kijja 5
kikulu 5
kkubo 5
kubalemesa 5
kufa 5
kugulirirwa 5
kukkiriza 5
kulaga 5
kumanya 5
kusolooza 5
kutuuka 5
kutuukirira 5
kyava 5
lg 5
ligaana 5
lipoota 5
lu/pt/wp_lu 5
lugandasoma 5
mingi 5
mirundi 5
mugasoengeri 5
nnamaddalaate 5
nsonga 5
nteekateeka 5
nw 5
obubi 5
obukakafu 5
obutalya 5
okubaako 5
okubaamu 5
okukolagana 5
okukuyamba 5
okunoonya 5
okunywa 5
okutereeza 5
okuzibeeramu 5
okwaŋŋanga 5
okwegeraageranya 5
okwennyamira 5
okweraliikirira 5
okwesigamiziddwa 5
okwetooloola 5
okwogera 5
olunene 5
olusozi 5
olwekiise 5
omukungu 5
omutwelwaki 5
omwenge 5
onal 5
onojja 5
paliyamenti 5
poliisi 5
tebakkiriza 5
tekukoma 5
teri 5
tukkiriza 5
tutaano 5
tuwuliriza 5
wabaawo 5
wagenda 5
yajeemera 5
yakobo 5
yalaga 5
yeefunira 5
yerusaalemi 5
zaabwe 5
ziteekeddwawo 5
abafiripi 4
abajja 4
abakkakkamu 4
abakulu 4
abalamu 4
abalamu“wajja 4
abantubonnaba 4
abassa 4
abatasobola 4
abato 4
abebbulaniya 4
abeetoowaze 4
aga 4
agaabwe 4
akoze 4
akulamu 4
akyali 4
alumwa 4
amawanga 4
amukkiriza 4
amutya 4
asobola 4
atalina 4
atusunguwalira 4
baazuukizibwa 4
babasinga 4
baddamu 4
bakakafu 4
bakkakkamu 4
bakuze 4
balaba 4
bamu 4
bantu 4
banyumirwa 4
basinga 4
batuufu 4
batwewala 4
bayiga 4
bayinza 4
beerowoozaako 4
beezimbira 4
bibalumya 4
bugenderevu 4
busobozi 4
buwombeefu 4
bwetuba 4
ebimu 4
ebinyiiza 4
ebyo 4
ebyokulabirako 4
eddamuddala 4
efaananako 4
efuuliddwa 4
eggonjebwa 4
egisinga 4
egiyise 4
egizimba 4
ekibi 4
ekigambo 4
ekiruubirirwa 4
ekiruyi 4
ekitalo 4
ekituufu 4
ekkayu 4
embeera 4
emibiri 4
eneeba 4
enfuna 4
enguziluganda 4
enjala 4
enkulu 4
enkyafu 4
ensolotezaatondebwakubeerawo 4
eriva 4
esobozesa 4
esooka 4
eyonooneddwa 4
ggwanga 4
gyatondebwamu 4
kibi 4
kimalawo 4
kindi 4
kintu 4
kiraga 4
kireeta 4
kiri 4
kirina 4
kiruyi 4
kisanyusa 4
kitasoboka 4
kituluma 4
kitusobozesa 4
kiyamba 4
kolagana 4
kubaleka 4
kubayisa 4
kuddamu 4
kufaayo 4
kugaba 4
kukirowoozaako 4
kukkakkanya 4
kukukolera 4
kukutegeera 4
kulekera 4
kusigala 4
kuva 4
kuzuukira 4
kuzzaawo 4
kwekkiririzaamu 4
kwogera 4
kyaffe 4
langi 4
lubuto 4
luganda 4
lugandalwaki 4
lwabwe 4
lwakikikulu 4
lye 4
mayumba 4
mitono 4
mugabi 4
mukitwale 4
mukkakkamu“mwambale 4
munaaba 4
munne 4
mwetoowaze 4
nalyo 4
nfuufu 4
nguziluganda 4
njawulo 4
nkaaga 4
nnakolebwa 4
nneewulira 4
nnyina 4
obeera 4
obunafu 4
obusozi 4
obutabeerera 4
okolera 4
okoze 4
okubaawo 4
okubategeera 4
okubazuukiza 4
okubeerawo 4
okubigonjoola 4
okugibeerako 4
okukikolamu 4
okukkakkana 4
okukuzimba 4
okulaga 4
okulimba 4
okumuwa 4
okumuyamba 4
okusinziira 4
okusonyiwagananga 4
okusonyiyibwa 4
okusosola“katonda 4
okutuwabula 4
okuviira 4
okuvvuunuka 4
okuzuukira 4
okwegonjoolera 4
okweyongera 4
okwogerako 4
olowooza 4
olulimi 4
olusuku 4
omuli 4
omululu 4
omuwandiisi 4
omwavu 4
singa 4
so 4
somazabbuli 4
tasosola 4
tatwala 4
tebakaluubirirwa 4
tebalabye 4
tebalijjukira 4
tebatya 4
teeberezaamu 4
tekikwewuunyisa 4
tetujja 4
tetumujjukiza 4
tetumukola 4
tetumusibira 4
tetusobola 4
tewajja 4
tewali 4
teyamutonda 4
tubayisa 4
tukalambira 4
tumuddamu 4
tusonyiwa 4
tuyinza 4
twagala 4
twetaaga 4
twetwala 4
waabwe 4
wabula 4
wagamba 4
wandyagadde 4
wano 4
wateekwa 4
watya 4
weebazenga“okugaba 4
weewale 4
wiikimu 4
yaliko 4
yamutonda 4
yazuukiza 4
yenna 4
zaatondebwamu 4
zityo 4
abaagala 3
ababi 3
ababi“ababi 3
abagaana 3
abagoba 3
abagondera 3
abakozi 3
abalungi 3
abalwanyi 3
abamugondera 3
abasajja 3
abasingayo 3
abasirusiru 3
abatatya 3
abatiisa 3
abatuukirivu 3
abaweereza 3
abayisirayiri 3
abuukabuuka 3
adamu 3
addayo 3
afiira 3
afuluma 3
agaba 3
agamu 3
agayambye 3
agayanja 3
aggya 3
agisimbidde 3
agolola 3
ajaganya 3
akulembeddemu 3
akuŋŋaanya 3
alaba 3
alingiza 3
alisangula 3
amaanyi 3
amabi 3
amakubo 3
amalanga 3
amangu 3
amugamba 3
amunyooma 3
amuttira 3
anaamala 3
asaddaaka 3
asunguwala 3
asuubiza 3
atayagala 3
atazaala 3
ateebaza 3
atuula 3
awa 3
awaayo 3
awadde 3
ayagaliza 3
ayambaddeefodi 3
azina 3
azinira 3
baagala 3
baagitambuliza 3
baakatambulako 3
baala 3
baatuuka 3
baava 3
babakoledde 3
babe 3
babi 3
badayimooni 3
bafuuwa 3
bagenda 3
baggya 3
bagiggya 3
bagiteeka 3
bajaganya 3
bakoowoolera 3
baleeta 3
baligibeeramu 3
baliko 3
balisikira 3
balyoke 3
bameruka 3
banaabeera 3
banaamala 3
bandibadde 3
basajja 3
basanyufu 3
basitudde 3
batabani 3
bategeeza 3
batwala 3
bazikirizibwe 3
bbaaleyuda 3
binoomunaala 3
birijaganya 3
birimu 3
biyonjo 3
bubuubuukidde 3
bubuubuukira 3
bungi 3
butuukirivu 3
bwaffe 3
bwali 3
byeyongera 3
ddirisa 3
ebibye 3
ebigere 3
ebikwatagana 3
ebitaasa 3
ebitundu 3
ebyaleetebwa 3
eddungu 3
egamba 3
ekigaali 3
ekirabika 3
ekitali 3
ekivuddeko 3
emiberosi 3
emigga 3
emiti 3
emizira 3
emmere 3
emyezi 3
eneetwalibwa 3
engevvu 3
enkoba 3
enkomerero 3
ennume 3
ennyana 3
ennyanja 3
ennyo“olukoola 3
ensaasi 3
entende 3
entongooli 3
esatu 3
etya 3
eyeebaza 3
ezzabbibu 3
eŋŋombe 3
gange 3
gguuliro 3
kaawa 3
kennyini 3
kibe 3
kigaali 3
kingi 3
kitaani 3
kitaawo 3
kitabo 3
kitegeeza 3
kitiibwa 3
kitundu 3
kituumibwa 3
kituyigiriza 3
kubaleetera 3
kubetenta 3
kufuula 3
kugisuula 3
kujaguliza 3
kujjawo 3
kunzisaamu 3
kutwala 3
kwetoowaza 3
kwonna 3
kyamagero 3
kyayo 3
kyokka 3
laga 3
linnya 3
lirimulisa 3
lirisanyuka 3
lujjudde 3
lukya 3
lunaku 3
magezi 3
maka 3
mangu 3
matayo 3
mbeera 3
mbeere 3
mikka 3
mukazi 3
musajja 3
muzigo 3
mwana 3
naawe 3
nakoni 3
njagala 3
njagulizza 3
nkomerero 3
nnaku 3
nnannyini 3
nnungi 3
nsanvu 3
nze 3
obugoma 3
obulumi 3
obut 3
obutali 3
obutawa 3
obuteenyoomaabantu 3
obutono 3
okubasiima 3
okufa“weema 3
okuggibwawo 3
okuggyawo 3
okuggyayo 3
okukaaba 3
okukolalonda 3
okukulembera 3
okukyusa 3
okulonda 3
okumala 3
okumpi 3
okumusisinkana 3
okupondooka 3
okusigalawo 3
okusingako 3
okusoma 3
okuvvuunulwa 3
okuwaayo 3
okwagaliza 3
okwebaza 3
okwo 3
oluvannyuma 3
olwo 3
omuddo 3
omugaati 3
omugabi 3
omukisa 3
omukodo 3
omukono 3
omwetooloovu 3
otyo 3
oyagala 3
oyogeddeko 3
pereeziuzza 3
sitaani“katonda 3
sonyiwanga“mweyongere 3
tebapondooka 3
tekitwewuunyisa 3
tewalibaawo 3
tteeka 3
tulabye 3
tusobola 3
wabakerubi 3
wajja 3
wala 3
walabika 3
we 3
weebuuze 3
weema 3
yabeera 3
yaddayo 3
yafa 3
yagabira 3
yakiraga 3
yamala 3
yamuwa 3
yatuuka 3
yatya 3
yeebikkula 3
yeebikkulidde 3
yeesibye 3
yeewadde 3
zaali 3
zigenda 3
zziga 3
binoebibuuzo 2
enokatondassaayansi 2
mugaso 2
obwa 2
