mu 232
ku 141
embuzi 127
ebyennyanja 85
n 81
nga 57
kasooli 50
ng 48
y 48
bw 46
nti 37
nnyo 34
uganda 34
abalimi 33
ettaka 33
okulima 33
enjuki 32
z 32
by 31
okulunda 31
ne 30
ky 28
ssente 27
emmere 24
kya 23
amata 21
bwe 21
era 21
amazzi 20
buli 19
kulima 19
okubeera 19
okuva 19
ennaanansi 18
ez 18
gw 18
ttaka 18
ennyo 17
ly 17
mbuzi 17
vvanira 17
ebidiba 16
ffaamu 16
waliwo 16
yiika 16
kkumi 15
lw 15
okufuna 15
abiri 14
agamba 14
enjawulo 14
ente 14
g 14
kino 14
oba 14
omuddo 14
singa 14
za 14
abalunzi 13
ebimera 13
ekidiba 13
engeri 13
kulunda 13
abantu 12
bwa 12
ebintu 12
kubanga 12
oluvannyuma 12
omulimi 12
bbiri 11
bulungi 11
ebika 11
kkiro 11
kw 11
na 11
okusimba 11
okwongera 11
w 11
wa 11
ze 11
bya 10
bye 10
ebisolo 10
eby 10
gye 10
kikumi 10
obukadde 10
obulungi 10
siringi 10
bizinensi 9
enkola 9
enkumi 9
eri 9
ey 9
gwa 9
kiseera 9
okukozesa 9
sizoni 9
ttaano 9
we 9
ye 9
alina 8
ebyuma 8
emu 8
endala 8
okuba 8
okugula 8
okusinga 8
okutunda 8
omulembe 8
osobola 8
ssatu 8
ttulakita 8
waakiri 8
ya 8
b 7
byennyanja 7
ebitundu 7
emyezi 7
erina 7
gy 7
kifo 7
kye 7
maaso 7
mwaka 7
obutungulu 7
okufukirira 7
okukungula 7
okusobola 7
olina 7
olw 7
omu 7
omubisi 7
si 7
wamu 7
weetaaga 7
abasinga 6
amaanyi 6
amakumi 6
balimi 6
bangi 6
birina 6
bulunzi 6
busobola 6
ddala 6
ebirungo 6
ekigimusa 6
eky 6
enkoko 6
ggwanga 6
gumu 6
gwe 6
kaseera 6
kidiba 6
kitundu 6
mangu 6
mulimi 6
munaana 6
ngeri 6
noolwekyo 6
obungi 6
wabula 6
yatandika 6
zeetaaga 6
zisobola 6
asidi 5
asobola 5
bakozesa 5
basanga 5
bijja 5
budde 5
bungi 5
ebisagazi 5
eggwanga 5
ekifo 5
enkuba 5
ennimiro 5
ennume 5
ensigo 5
enteekateeka 5
ezisinga 5
kirina 5
kwetaaga 5
mazzi 5
mukaaga 5
ndiwulira 5
obeera 5
okozesa 5
okukula 5
okumala 5
okusima 5
okusinziira 5
okutandika 5
olulyo 5
ono 5
wakati 5
ziwe 5
abalina 4
agatunda 4
akatale 4
ali 4
alima 4
balunda 4
basobola 4
bintu 4
bubiri 4
ebigimusa 4
ebiwuka 4
ebyobulimi 4
ekika 4
ekiwuka 4
ekya 4
ekyo 4
emirimu 4
emmwanyi 4
endwadde 4
enganda 4
enkazi 4
ennungi 4
ennyama 4
eno 4
esinga 4
esobola 4
essuubi 4
eza 4
ga 4
kano 4
lirina 4
lunaku 4
maduuka 4
magezi 4
mulimu 4
myaka 4
ndwadde 4
nkola 4
nnimiro 4
nnyangu 4
noonya 4
obudde 4
obulunzi 4
obw 4
ojja 4
okugenda 4
okulimibwa 4
okupangisa 4
okusimako 4
okusooka 4
okusoomoozebwa 4
okuvaamu 4
oyagala 4
yonna 4
ziba 4
abalima 3
abamu 3
abeera 3
akozesa 3
amangu 3
ate 3
ayinza 3
ba 3
bbali 3
bino 3
birime 3
birungi 3
buno 3
buseere 3
butono 3
byonna 3
covid 3
e 3
ebibala 3
ebikozesebwa 3
ebiri 3
ebirime 3
ebiseera 3
ebisinga 3
ebisobola 3
ebizungu 3
ebyo 3
ekimu 3
ekintu 3
ekirungi 3
ekisinga 3
ekitali 3
ekitongole 3
ekizibu 3
emikono 3
emitwalo 3
empeke 3
endokwa 3
enkumbi 3
ennaku 3
ensimbi 3
ensobi 3
ensonga 3
enzungu 3
eririmu 3
esatu 3
ezo 3
fuba 3
gasobola 3
gavumenti 3
kamu 3
katale 3
kati 3
kijja 3
kimu 3
kitwala 3
kiyinza 3
kkoliyanda 3
kuba 3
kuliko 3
kulimu 3
kutandika 3
kwa 3
kyennyanja 3
kyenvu 3
kyokka 3
mata 3
mmere 3
mugaso 3
mw 3
naddala 3
naye 3
njagala 3
nkumi 3
nnakavundira 3
nnayikondo 3
nnyingi 3
ntono 3
obusobozi 3
obuwunga 3
obwetaavu 3
ogw 3
okulaba 3
okulabirira 3
okulundibwa 3
okulya 3
okumanya 3
okutangira 3
okuvaako 3
okuwakisa 3
okwetooloola 3
okwewala 3
oluganda 3
olunda 3
omukka 3
omulunzi 3
omutindo 3
omuwendo 3
sso 3
teekamu 3
terina 3
waakutandika 3
wabweru 3
yagambye 3
yeetaaga 3
zijja 3
zo 3
ababbi 2
abadde 2
abakola 2
abalala 2
afuna 2
ag 2
agali 2
agatambula 2
agattako 2
ago 2
agula 2
ajja 2
akayumba 2
akungula 2
amagezi 2
amagi 2
amasannyalaze 2
ana 2
ataano 2
atambula 2
awantu 2
bakugu 2
bakyawulira 2
balina 2
balowooza 2
balunzi 2
banno 2
beetaaga 2
bibuga 2
bidiba 2
bikoola 2
bikozesebwa 2
bikuze 2
bingi 2
biriko 2
biyumba 2
bizibu 2
booda 2
boodabooda 2
bunene 2
butaano 2
butale 2
buzibu 2
byalo 2
byetaaga 2
ccacu 2
dap 2
east 2
ebbeeyi 2
ebibeera 2
ebibira 2
ebifo 2
ebimu 2
ebimuli 2
ebingi 2
ebirala 2
ebirimu 2
ebirungi 2
ebisaanyi 2
ebito 2
ebitundibwa 2
ebiva 2
ebyalo 2
ebyetaagisa 2
ebyonoona 2
efuna 2
egirimu 2
egula 2
ekibiina 2
ekikuba 2
ekiri 2
ekirimu 2
ekirungo 2
ekivunyu 2
ekizimba 2
ekkumi 2
ekyuma 2
emabega 2
emberenge 2
emigga 2
eminene 2
emiti 2
emitono 2
emizinga 2
emyaka 2
engege 2
enjala 2
enjuba 2
enkula 2
ennanansi 2
ennyongereza 2
ennyumba 2
entono 2
eriko 2
etaano 2
ezikamibwa 2
ezisukka 2
gakoma 2
galimu 2
ggimu 2
gireke 2
gukozesebwa 2
gulina 2
hive 2
k 2
ka 2
kiba 2
kibeera 2
kika 2
kinnya 2
kiraga 2
kirungi 2
kisobola 2
kiyamba 2
kko 2
kozesa 2
kubeera 2
kufuna 2
kukolebwa 2
kukungula 2
kulabirira 2
kuno 2
kutunda 2
kuvunaanibwa 2
kuziriisa 2
kwe 2
kwonoona 2
kyangu 2
kyonna 2
layimu 2
liita 2
lima 2
limu 2
lisobola 2
lubeerera 2
lugo 2
lukaaga 2
lwaki 2
lwe 2
maanyi 2
maleeto 2
malundiro 2
mbeera 2
mikono 2
minisitule 2
mirimu 2
mizinga 2
mubende 2
mubisi 2
muddo 2
mukono 2
mulungi 2
muntu 2
mwenda 2
myezi 2
newankubadde 2
njawulo 2
njuki 2
nkalu 2
nkumbi 2
nkungula 2
nkuubo 2
nnaanansi 2
nnagula 2
nnakungula 2
nnayirooni 2
nnya 2
nnyama 2
nsanvu 2
nsobola 2
nte 2
obubuzi 2
obugimu 2
obulimi 2
obunene 2
obusinga 2
obutale 2
obutalima 2
obutiba 2
ogufulumizibwa 2
ogula 2
okufaako 2
okuggyamu 2
okukakasa 2
okukola 2
okukozesebwa 2
okukuza 2
okulabika 2
okuli 2
okuliira 2
okulowoozaako 2
okulundiramu 2
okulwanyisa 2
okumpi 2
okunoonyaamu 2
okusimbako 2
okusimbibwa 2
okutambuzibwa 2
okutangirwa 2
okuteeka 2
okuteekawo 2
okutegekebwa 2
okutumbula 2
okuwa 2
okuwakula 2
okuweebwa 2
okuyimirira 2
okuzimbira 2
okw 2
okwebuuza 2
okwettanirwa 2
oli 2
olonda 2
olunnyo 2
olusinga 2
olwazi 2
omubiri 2
omukozi 2
omulimu 2
omuluzi 2
omusanvu 2
omusulo 2
omwaka 2
osima 2
otandika 2
oteeka 2
simba 2
soma 2
ssenkulu 2
ssukaali 2
teeka 2
tekinologiya 2
tewali 2
tezirumbibwa 2
the 2
tolina 2
tonnasimba 2
ttani 2
wansi 2
wiiki 2
yaabyo 2
yagula 2
yalina 2
yasalawo 2
yatunda 2
yo 2
zaabwe 2
zeerunda 2
zidda 2
zikula 2
zino 2
ziri 2
ziriko 2
zirina 2
zirundibwa 2
zisangibwa 2
zitwala 2
zizaala 2
z’okuwola 2
