mu 446
ku 348
n 292
nga 277
nti 172
ne 164
e 158
ng 111
era 107
y 91
bwe 83
wa 64
ya 63
w 59
olw 54
abantu 48
poliisi 46
bw 42
omu 37
abaana 36
bye 36
yagambye 36
we 35
isma 34
ye 32
kino 31
abayizi 30
gye 30
kya 30
kyokka 30
be 29
eno 29
buli 28
okuva 28
z 28
naye 26
ono 26
lwa 25
uganda 25
bano 24
lw 24
by 23
agamba 22
ky 22
wabula 22
abadde 21
africa 21
ate 21
eggwanga 21
kampala 21
lya 21
nnyo 21
oluvannyuma 21
st 21
za 21
kati 20
ssente 20
ba 19
baabwe 19
eby 19
mmotoka 19
oba 19
yali 19
eri 18
essomero 18
gwa 18
kkooti 18
obukadde 18
omubaka 18
yonna 18
zino 18
bali 17
gavumenti 17
abatuuze 16
bya 16
gw 16
kubanga 16
ly 16
mpaka 16
10 15
aba 15
b 15
bino 15
enjawulo 15
nansana 15
netball 15
wamu 15
yategeezezza 15
ze 15
baana 14
ebidduka 14
gwe 14
lino 14
maaso 14
okuba 14
okukola 14
okulaba 14
ow 14
ssomero 14
abamu 13
abazadde 13
ekya 13
ez 13
kye 13
mwe 13
okuli 13
abalala 12
ali 12
bagenda 12
bantu 12
bbomu 12
disitulikiti 12
ebintu 12
eya 12
guno 12
isbat 12
kasasiro 12
kawempe 12
kwe 12
lwe 12
okubaka 12
waliwo 12
ab 11
abeera 11
akulira 11
balina 11
bonna 11
bwa 11
cranes 11
empaka 11
ensi 11
ey 11
kukola 11
kyalo 11
minisita 11
munisipaali 11
museveni 11
nsonga 11
obulamu 11
okubeera 11
okutuusa 11
pulezidenti 11
pulojekiti 11
she 11
ssande 11
ttiimu 11
2023 10
bulungi 10
ebirala 10
ekyo 10
emirimu 10
emmotoka 10
ennyo 10
ichuli 10
jjajja 10
kanyanya 10
kuba 10
miss 10
na 10
nabo 10
omusango 10
omwaka 10
palamenti 10
south 10
ukraine 10
ababaka 9
ababiikira 9
asabye 9
bangi 9
bwabwe 9
charles 9
ekibiina 9
ekkubo 9
eky 9
emmundu 9
emu 9
ensonga 9
etteeka 9
eza 9
francis 9
ggwanga 9
gy 9
ka 9
kigambibwa 9
leero 9
mbeera 9
mukono 9
naddala 9
of 9
omugenzi 9
omuli 9
omuteebi 9
omuzikiti 9
safiina 9
school 9
ssaabasumba 9
ssaako 9
ssentebe 9
yabadde 9
yasabye 9
abaali 8
abasajja 8
agaba 8
ategeezezza 8
bagamba 8
buloba 8
ekkanisa 8
ettaka 8
igeme 8
k 8
kadodi 8
katwe 8
kifo 8
kiseera 8
kkompyuta 8
luzira 8
mayanja 8
nalumansi 8
nnyumba 8
obulungi 8
olaxes 8
oluguudo 8
omukyala 8
omulambo 8
wadde 8
wano 8
world 8
yunivaasite 8
zzooni 8
25 7
abavubuka 7
akaseera 7
amazzi 7
awaka 7
awamu 7
bakola 7
basobole 7
batuuze 7
bba 7
dr 7
east 7
ebitongole 7
egenda 7
ekika 7
embeera 7
emiti 7
emitwalo 7
engola 7
essaawa 7
ewa 7
god 7
kcca 7
kibaale 7
kimu 7
kitundu 7
klezia 7
liigi 7
maama 7
mwaka 7
nassaazi 7
nguudo 7
nnamba 7
okubba 7
okufuna 7
okutuuka 7
omulamuzi 7
omutuuze 7
owa 7
ssaawa 7
20 6
28 6
abaserikale 6
agambibwa 6
ajja 6
amagye 6
amalala 6
amasasi 6
april 6
asaba 6
awo 6
babadde 6
babeera 6
basoma 6
bavubuka 6
bitundu 6
bukedde 6
cup 6
ddala 6
ebiragalalagala 6
egy 6
emikono 6
emyaka 6
ennaku 6
ennyumba 6
enteekateeka 6
erya 6
g 6
ga 6
ge 6
joseph 6
katonda 6
kisowera 6
kw 6
luno 6
masese 6
masomero 6
nkokonjeru 6
nsi 6
nze 6
obubbi 6
obucupa 6
ofiisi 6
ogw 6
okufaayo 6
okunoonyereza 6
okwongera 6
oludda 6
olunaku 6
omuntu 6
omuvubuka 6
prisons 6
putin 6
robert 6
seed 6
si 6
smith 6
tewali 6
tusuubira 6
wakati 6
wiiki 6
zaabwe 6
00 5
100 5
abaavuganya 5
abagambibwa 5
abakozi 5
abakulembeze 5
abatemu 5
abayimbi 5
abooluganda 5
agenda 5
akola 5
amaanyi 5
amanyiddwa 5
baabadde 5
baagala 5
baali 5
baddereeva 5
bajja 5
bakozesa 5
bambega 5
basobola 5
bayiga 5
bobi 5
boogera 5
buikwe 5
buno 5
bwaise 5
championships 5
crb 5
ddereeva 5
ddyo 5
ebyalaani 5
ebyemikono 5
ebyenjigiriza 5
ekitongole 5
ekitundu 5
engeri 5
ensimbi 5
ensonda 5
essaza 5
ewedde 5
fayiro 5
ffamire 5
john 5
kasasa 5
kkamera 5
kkampuni 5
kkansala 5
kkomera 5
kuziika 5
kyabwe 5
kyanja 5
kyonna 5
looya 5
luguudo 5
lukalu 5
lwaki 5
lwokutaano 5
masooli 5
muhammad 5
muhwezi 5
mukolo 5
muwala 5
nasser 5
ndi 5
ngeri 5
nsereko 5
nsubuga 5
okukozesa 5
okukwata 5
okusaba 5
okwenyigira 5
okwogera 5
olupot 5
oluwaabi 5
olwo 5
omubeezi 5
omukubiriza 5
omulabirizi 5
omutendesi 5
omwana 5
s 5
secondary 5
siraje 5
siteegi 5
sr 5
ssemogerere 5
ucu 5
yaabwe 5
young 5
zooni 5
000 4
137 4
5 4
7 4
abaabadde 4
abakozesa 4
abali 4
abo 4
ag 4
akiikirira 4
alina 4
alupo 4
amateeka 4
amawulire 4
amusaba 4
and 4
asiimye 4
ategeeza 4
atuuka 4
ayagala 4
ayogera 4
bafunye 4
bakansala 4
bakulembeddwa 4
balimwezo 4
basaba 4
bataano 4
bayize 4
bayizi 4
bazadde 4
bbanga 4
beetaaga 4
bikolwa 4
bingi 4
bo 4
bp 4
bubbi 4
bumativu 4
butongole 4
byarugaba 4
byonna 4
cape 4
central 4
ddiifiri 4
ddoola 4
ebiri 4
ebisenge 4
ebyo 4
ebyokwerinda 4
eddibu 4
eggulo 4
ekibinja 4
ekirala 4
ekiseera 4
ekizibu 4
embi 4
emiriraano 4
enduulu 4
erinnya 4
essimu 4
eyo 4
gaabwe 4
gayaza 4
ggombolola 4
gya 4
hajji 4
iddi 4
ii 4
jinja 4
kabangali 4
kano 4
katumba 4
kevina 4
kibuga 4
kuliko 4
kuno 4
limanda 4
lubaga 4
lukululana 4
luwalira 4
male 4
may 4
minisitule 4
mityana 4
moses 4
mr 4
mukyala 4
musanvu 4
nabukalu 4
nabukeera 4
nakawa 4
nakitende 4
namulumba 4
obutali 4
obuweereza 4
obuzibu 4
obw 4
obwa 4
oketch 4
okugenda 4
okugwa 4
okukula 4
okulaga 4
okulowooza 4
okulwanyisa 4
okusinziira 4
okusoma 4
okusonda 4
okutta 4
okuyita 4
okuzimba 4
okwagala 4
okwekebejja 4
oli 4
olumu 4
oluzibizi 4
omukungu 4
omumyuka 4
omupiira 4
omusumba 4
omuyimbi 4
omwogezi 4
p/s 4
paul 4
peter 4
polof 4
rev 4
russia 4
sitoowa 4
ss 4
ssali 4
ssinga 4
town 4
toyota 4
ttaka 4
tumushimye 4
updf 4
waggulu 4
wakiso 4
yasiimye 4
yasin 4
yenna 4
1 3
15 3
19 3
2 3
2022 3
21 3
22 3
3 3
30 3
50 3
60 3
8 3
abaakwatiddwa 3
ababadde 3
ababbi 3
abakola 3
abakyala 3
abamasaba 3
abasomesa 3
abdul 3
agumizza 3
akatale 3
akomyewo 3
alaze 3
amaka 3
amuwa 3
amyuka 3
angella 3
annyonnyola 3
asiima 3
asinga 3
asinze 3
avumiridde 3
awangudde 3
baba 3
bakanyike 3
bakhmut 3
bakimanyi 3
bakuba 3
bakuηηaanya 3
bannaabwe 3
bannamawulire 3
banne 3
basalawo 3
basindikiddwa 3
batandika 3
bategeeza 3
batuusa 3
bawala 3
bazannyi 3
bbiri 3
bibwa 3
bifo 3
bigambo 3
bimu 3
bintu 3
biseera 3
brig 3
budde 3
buddo 3
buganda 3
bukyamu 3
bulijjo 3
bulwanyi 3
busaabadinkoni 3
butya 3
buvanjuba 3
byabwe 3
byalo 3
christine 3
club 3
cmi 3
dda 3
ddakiika 3
ddayirekita 3
ddiiru 3
denis 3
ebadde 3
ebbanga 3
ebbula 3
ebibiina 3
ebifo 3
ebigimusa 3
ebikolwa 3
ebikozesebwa 3
ebikwata 3
ebimu 3
ebiragiro 3
ebizimbe 3
ebyenfuna 3
ekibuga 3
ekigendererwa 3
ekintu 3
ekiro 3
ekituufu 3
ekizimbe 3
ekkulu 3
ekyapa 3
emisango 3
emitima 3
empenda 3
empya 3
endala 3
engoye 3
enkuba 3
ensangi 3
entambula 3
es&shy 3
etategeerekeka 3
eyali 3
famire 3
fred 3
gen 3
gerald 3
ggwe 3
gino 3
girls 3
green 3
gyabwe 3
isaac 3
joan 3
july 3
june 3
junior 3
kam&shy 3
kanyike 3
kasajja 3
katambi 3
katono 3
kaweefube 3
ki 3
kibiina 3
kiggundu 3
kikolebwa 3
kisembo 3
kisitu 3
kitaawe 3
kitebe 3
kkanisa 3
kkono 3
kkubo 3
kulubya 3
kumar 3
kuzimba 3
kwagala 3
liri 3
little 3
lubega 3
ludda 3
lukiiko 3
luwummula 3
lwomukaaga 3
lydia 3
maj 3
maka 3
makerere 3
makindye 3
man 3
mangu 3
march 3
mawanga 3
mayumba 3
maziga 3
mbu 3
mikutu 3
mirembe 3
mirimu 3
mmwe 3
muhammed 3
mutwe 3
muwanguzi 3
muyenje 3
mw 3
nagwo 3
nakitto 3
nakyo 3
nambaziira 3
nange 3
national 3
nayo 3
ngule 3
njovu 3
nnyina 3
nup 3
obeera 3
obubenje 3
obucaafu 3
obudde 3
obutonde 3
obuveera 3
obuvumu 3
obuyambi 3
obwetaavu 3
oguwedde 3
oku&shy 3
okudda 3
okukiikirira 3
okukuguka 3
okuliraana 3
okumala 3
okumaliriza 3
okumanya 3
okusazaamu 3
okusinga 3
okusitukiramu 3
okutandika 3
okutya 3
okuvaayo 3
okw 3
okwo 3
olina 3
olukwe 3
oluwummula 3
olwa 3
omubiri 3
omuddo 3
omugaso 3
omukulembeze 3
omukuumi 3
omukwano 3
omulimu 3
omuliro 3
omuzannyo 3
omwala 3
omwezi 3
onyango 3
pradeep 3
ronald 3
sam 3
sheikh 3
sikaala 3
simu 3
siniya 3
sisters 3
sizoni 3
super 3
university 3
vivian 3
waabwe 3
wise 3
wo 3
yadde 3
yagamba 3
yagasseeko 3
yasuubizza 3
yatandika 3
yava 3
yayongeddeko 3
yazaala 3
yiga 3
zaakubeera 3
12 2
2018 2
23 2
27 2
4 2
40 2
6 2
800 2
aanidde 2
aanya 2
abaabaddeyo 2
abaagala 2
abaami 2
abakontanyi 2
abakristaayo 2
abakulu 2
abakungubazi 2
abakwatiddwa 2
abalamuzi 2
abalenzi 2
abalina 2
abasaba 2
abasawo 2
abasukka 2
abatono 2
abava 2
abavuganya 2
abawala 2
abazannyi 2
abazze 2
abdelhadi 2
abeebyokwerinda 2
act 2
adams 2
adda 2
addirirwa 2
advertising 2
afrika 2
aga 2
agambye 2
agenze 2
aisha 2
ak 2
akabaga 2
akadodi 2
akakiiko 2
akali 2
akasaawe 2
akatimba 2
akazibu 2
akozesa 2
akulembeddemu 2
alabudde 2
aliko 2
amafuta 2
amangu 2
amasomero 2
amayirungi 2
amaze 2
amutwala 2
amwegayirireko 2
apanga 2
asiimwe 2
asimbiddwa 2
asindikiddwa 2
associates 2
association 2
asula 2
atandike 2
atyo 2
august 2
ava 2
avunaanibwa 2
awatali 2
awera 2
ayimbira 2
azze 2
baakola 2
baamaze 2
baamuttidde 2
baamuwadde 2
baasoose 2
baawadde 2
baawukanye 2
babalaga 2
babikola 2
babirye 2
bafube 2
bafuna 2
bagende 2
baggye 2
bagudde 2
bagula 2
bajjajaabe 2
bakedde 2
bakira 2
bakitunzi 2
bakkaanya 2
bakole 2
bakungubagira 2
balaba 2
balaze 2
baleme 2
baludde 2
bamasinale 2
bamaze 2
bamufunampola 2
bamusuubiza 2
bamuteeka 2
bamutegeeza 2
bamutiisatiisa 2
bannakibiina 2
bannamateeka 2
bannayuganda 2
basabiddwa 2
basanze 2
bashira 2
basinga 2
basuubira 2
batambulira 2
bategeezezza 2
battibwa 2
batwalibwa 2
bavunaaniddwa 2
bayibuli 2
bayita 2
bazinira 2
bazze 2
betta 2
bianco 2
bibiina 2
biggya 2
bitabo 2
bitongole 2
bitooke 2
biwoobe 2
bizibu 2
bizimbe 2
bizinga 2
board 2
bodaboda 2
bongedde 2
bongere 2
brilliant 2
bubenje 2
bubiri 2
bugenyi 2
bujulizi 2
bunkenke 2
busumba 2
bususse 2
butabo 2
butamanya 2
butter 2
buwanguzi 2
bwangu 2
bwati 2
bwatyo 2
bwavu 2
bweru 2
bweyogerere 2
byali 2
byekwaso 2
byokwerinda 2
carnival 2
china 2
christopher 2
church 2
community 2
cps 2
ddamba 2
ddwaaliro 2
ddwaniro 2
developers 2
dinah 2
ebalirirwamu 2
ebbaluwa 2
ebibbo 2
ebifaananyi 2
ebifanaanyi 2
ebigambibwa 2
ebigambo 2
ebikolebwa 2
ebimotoka 2
ebiriraanye 2
ebisolo 2
ebisooka 2
ebitaano 2
ebiteeteeyi 2
ebizigo 2
ebya 2
ebyamasannyalaze 2
ebyazimbisibwa 2
ebyenguudo 2
ebyobulamu 2
edda 2
eddagala 2
edward 2
egamba 2
egimu 2
ekibangirizi 2
ekifaananyi 2
ekifo 2
ekigwo 2
ekikopo 2
ekikulu 2
ekiraga 2
ekisangibwa 2
ekisooka 2
ekitebe 2
ekyalo 2
embaawo 2
emigattabantu 2
emikolo 2
emikutu 2
emmanuel 2
empisa 2
emyezi 2
endwadde 2
eng 2
enjaga 2
enkola 2
ennamba 2
eriiso 2
erikugira 2
eryo 2
esatu 2
essatu 2
estate 2
ettemu 2
evvannyuma 2
ew 2
eyabadde 2
eyamukubirwa 2
eyasengulwa 2
eyattiddwa 2
eyawangudde 2
eyongedde 2
ezab&shy 2
ezigenda 2
eziri 2
ezisinga 2
fort 2
frank 2
freeman 2
fufa 2
geoffrey 2
ggoolo 2
gibadde 2
grace 2
gudda 2
gumu 2
gusangiddwa 2
gutandike 2
gutuuse 2
hajjati 2
hamidu 2
hamuza 2
ibrahim 2
igga 2
innocent 2
jambula 2
jas 2
jerusha 2
jessica 2
johns 2
joshua 2
kakalu 2
kalangala 2
kale 2
kansala 2
kapeeka 2
kasangati 2
kasozi 2
ke 2
kenya 2
kibinja 2
kiddawalime 2
kiddiridde 2
kifuba 2
kikulu 2
kiraga 2
kisiga 2
kisoro 2
kiteeberezebwa 2
kituufu 2
kizibu 2
kizimbe 2
kizza 2
kkompyuuta 2
kkuumiro 2
kololo 2
kontulakiti 2
kubeera 2
kubeerawo 2
kubula 2
kuddamu 2
kukwata 2
kukwatibwa 2
kulaga 2
kumpi 2
kusaba 2
kusimba 2
kutendekebwa 2
kutya 2
kuwangula 2
kuzimbibwa 2
kwa 2
land 2
lauben 2
ligenda 2
lt 2
lubeerera 2
lubowa 2
lugamba 2
lugazi 2
lugoba 2
lukambuzi 2
luke 2
lukwe 2
lunaku 2
lutaaya 2
luyimbaazi 2
lwategeezezza 2
lye 2
maanyi 2
maganjo 2
makya 2
mangat 2
mark 2
masaba 2
masaka 2
mathias 2
mawulire 2
mbaziira 2
mbizzi 2
mboozi 2
mengo 2
michael 2
micheal 2
mike 2
mikwano 2
mipiira 2
miranga 2
misoni 2
mk 2
mmisa 2
mpewo 2
mpola 2
mugabe 2
muganda 2
mugerwa 2
mugoye 2
mukaaga 2
mukula 2
mukwano 2
mulambo 2
mulimu 2
muluka 2
munne 2
muntu 2
munyonyo 2
musango 2
mutabani 2
mutabuliiki 2
mutendera 2
muthusi 2
mutindo 2
muto 2
mwezi 2
myaka 2
myala 2
nabyo 2
naggalama 2
nakabuye 2
nakiryowa 2
nalumu 2
namagunga 2
namirembe 2
namutebi 2
nancy 2
nasanga 2
nateete 2
ndejje 2
ndowooza 2
new 2
newankubadde 2
ngoye 2
ninsiima 2
nkola 2
nkonkonjeru 2
nkulungo 2
nkyagala 2
nnabakyala 2
nnalulungi 2
north 2
nsangi 2
ntaana 2
nya 2
obubaka 2
obukugu 2
obumyu 2
obusobozi 2
obusumba 2
obutayonooneka 2
obuwanguzi 2
obuwumbi 2
obwakitunzi 2
oguzimbibwa 2
ogwang 2
oku 2
okubaako 2
okubadde 2
okubadduukirira 2
okubangula 2
okubatiza 2
okubula 2
okuddamu 2
okufunira 2
okufunza 2
okugaana 2
okuggalawo 2
okuggyako 2
okugumbulula 2
okukakasa 2
okukolera 2
okukolwako 2
okukomawo 2
okukomya 2
okukuba 2
okukubira 2
okukuuma 2
okulabirira 2
okulengera 2
okulunda 2
okumenya 2
okumpi 2
okumukuba 2
okunonyereza 2
okunoonya 2
okusala 2
okusigala 2
okusiima 2
okusobola 2
okusomesa 2
okutaasa 2
okutegeeza 2
okutema 2
okutendekebwa 2
okutumbula 2
okutunga 2
okuwulirwa 2
okuyamba 2
okuyimba 2
okuyimirira 2
okuziba 2
okuziika 2
okuzimbwa 2
okuzuula 2
okwabadde 2
okwegendereza 2
okwekalakaasa 2
okwekubira 2
okwetaba 2
okwetooloola 2
okweyambisibwa 2
old 2
olexas 2
olubeerera 2
olubuto 2
olugendo 2
oluusi 2
omubuulizi 2
omugga 2
omukisa 2
omukono 2
omukulu 2
omulala 2
omusawo 2
omusomesa 2
omusulo 2
omusuubuzi 2
omuwaabi 2
omuwala 2
omuyizi 2
omuzannyi 2
omwami 2
ossa 2
oyinza 2
paapa 2
pala 2
pamiti 2
party 2
patrick 2
pearl 2
penati 2
pikipiki 2
pisito 2
portal 2
rally 2
richard 2
road 2
rocky 2
rukundo 2
saka 2
samuel 2
schools 2
sd 2
sgs 2
shafik 2
shea 2
simon 2
singa 2
singapore 2
soroti 2
ssaalongo 2
ssatu 2
ssebo 2
ssendegeya 2
sserulungi 2
ssettendekero 2
ssimu 2
stella 2
stephen 2
sweden 2
taata 2
tebalina 2
technology 2
tekinologiya 2
tobago 2
trinidad 2
ttakisi 2
tteeka 2
vidiyo 2
vincent 2
vipers 2
vx 2
wabeewo 2
wajjala 2
wamma 2
wansi 2
wegner 2
wenenge 2
west 2
wooteeri 2
yabba 2
yabula 2
yaddukira 2
yafuna 2
yakubiddwa 2
yakuutidde 2
yaleka 2
yalina 2
yamuleka 2
yandiba 2
yannyonnyodde 2
yasisinkana 2
yasooka 2
yasoose 2
yategeeza 2
yayogera 2
yazikwasizza 2
yeebaza 2
yeegaana 2
yekka 2
yennyamidde 2
yiika 2
yinginiya 2
yintaneeti 2
yokka 2
yunivasite 2
zaabadde 2
zaategeezezza 2
zealand 2
zigenda 2
zombi 2
zonna 2
