mu 460
ku 326
n 259
nti 231
nga 200
ne 162
ng 103
e 99
era 85
y 77
bwe 69
wa 58
ya 54
abantu 51
gavumenti 48
w 48
yagambye 47
ate 46
kkooti 44
by 43
kya 41
wabula 40
uganda 38
z 38
ba 37
ssente 37
kino 36
kyokka 34
okuva 32
be 30
eno 30
buli 29
ky 29
olw 29
we 29
poliisi 26
gye 25
kati 25
kubanga 25
bw 24
mutebi 24
naye 24
ye 24
agamba 23
okukola 23
b 22
express 22
yategeezezza 22
oluvannyuma 21
ttiimu 21
bino 20
bye 20
abasomesa 19
afrika 19
bulungi 19
eggwanga 19
gwa 19
museveni 19
omupiira 19
bagenda 18
balina 18
bonna 18
bwa 18
enjawulo 18
ensonga 18
guno 18
miracle 18
omu 18
abamu 17
abatuuze 17
bano 17
eby 17
ey 17
ez 17
gw 17
kuba 17
kyagulanyi 17
lw 17
lwa 17
omusango 17
za 17
aba 16
gwe 16
gy 16
obujulizi 16
st 16
ab 15
amerika 15
eri 15
eyali 15
kampala 15
kye 15
akulira 14
amateeka 14
enguudo 14
ga 14
kkampuni 14
kwe 14
lino 14
musango 14
nsonga 14
oba 14
ttaka 14
yonna 14
abalala 13
abazannyi 13
ekkanisa 13
embeera 13
ggoolo 13
mwe 13
oluguudo 13
p/s 13
pulezidenti 13
yali 13
000 12
asabye 12
ddala 12
enteekateeka 12
erina 12
luno 12
luwum 12
lya 12
minisitule 12
okuba 12
okutuuka 12
olwa 12
2020 11
abasuubuzi 11
abo 11
agenda 11
bali 11
ebirala 11
ekitongole 11
ekya 11
ggwanga 11
kifo 11
naddala 11
nnamba 11
omulamuzi 11
unra 11
villa 11
wakati 11
waliwo 11
yasabye 11
abaana 10
amasomero 10
baabadde 10
baagala 10
babadde 10
bangi 10
bya 10
ekisiibo 10
eky 10
ettaka 10
gaasi 10
kcca 10
kw 10
ly 10
obudde 10
okufuna 10
okuli 10
okusolooza 10
ono 10
yagasseeko 10
zaabwe 10
ze 10
abayizi 9
ali 9
ayagala 9
buno 9
bwabwe 9
ebintu 9
egenda 9
ekibiina 9
ekiseera 9
emirimu 9
emu 9
ensi 9
ery 9
fr 9
kansala 9
kiseera 9
manu 9
mulimu 9
ngeri 9
ntikko 9
obusa 9
okusinziira 9
omugenzi 9
omuli 9
omuntu 9
richard 9
ssaabalabirizi 9
wakiso 9
ababadde 8
abadde 8
amaanyi 8
bantu 8
budde 8
charles 8
disitulikiti 8
dollo 8
ebyo 8
endala 8
engeri 8
ffamire 8
hakki 8
kagina 8
kira 8
kirumira 8
luguudo 8
lunaku 8
lwaki 8
lwe 8
minisita 8
obuyambi 8
okubeera 8
okukuba 8
okulaba 8
ow 8
pasita 8
robert 8
wamu 8
wano 8
00 7
11 7
2018 7
3 7
30 7
abakristu 7
abakyala 7
alina 7
asaba 7
baabwe 7
byonna 7
eddagala 7
emisango 7
kalungu 7
katonda 7
kuteesa 7
mombasa 7
myaka 7
na 7
nabo 7
nsi 7
obuwumbi 7
okulonda 7
okutuusa 7
olunaku 7
olwo 7
omulimu 7
owa 7
siraale 7
ssaabalamuzi 7
ssaawa 7
ssatu 7
wange 7
watson 7
yabadde 7
zebra 7
zzaabu 7
1 6
10 6
2 6
20 6
2021 6
abaali 6
abakulembeze 6
abakungu 6
abalamuzi 6
abavubuka 6
akakiiko 6
amawanga 6
bagamba 6
bbanga 6
bitundu 6
butindo 6
byabwe 6
china 6
dda 6
dizayini 6
ebimu 6
ebyokwerinda 6
ekifo 6
ekigo 6
emyaka 6
enkulu 6
ennyo 6
evvu 6
february 6
g 6
joseph 6
june 6
k 6
ka 6
kigambibwa 6
kitonsa 6
kitooke 6
kukola 6
maaso 6
march 6
mmeeri 6
munisipaali 6
muntu 6
ogw 6
oku 6
okuddaabiriza 6
okumala 6
okusaba 6
okusalawo 6
okutta 6
okuwa 6
omukambwe 6
psg 6
ssennyiga 6
ssentebe 6
tewali 6
wadde 6
wiiki 6
yannyonnyodde 6
18 5
19 5
4 5
5 5
7 5
9 5
abakozesa 5
abasajja 5
abawagizi 5
abubaker 5
allen 5
amagye 5
amata 5
amawulire 5
amyuka 5
andrew 5
ategeeza 5
avunaanyizibwa 5
awamu 5
baali 5
barcelona 5
basobodde 5
belesis 5
bikolwa 5
bingi 5
bodaboda 5
bulaaya 5
buvunaanyizibwa 5
december 5
denis 5
ebikolwa 5
ebiragiro 5
eddembe 5
egy 5
ekisooka 5
ekitundu 5
emirembe 5
empenda 5
endagaano 5
engoye 5
ensonda 5
entebbe 5
essomero 5
kibeera 5
kisiibo 5
kitundu 5
kuliko 5
kyabwe 5
liigi 5
lwanga 5
masomero 5
mateeka 5
mbappe 5
mike 5
mmande 5
nanteza 5
nnamwandu 5
nnannyini 5
nnyo 5
ntebe 5
obukadde 5
obulungi 5
obuyinza 5
obw 5
ofiisi 5
okukuuma 5
okusobola 5
okuvaayo 5
olina 5
omubaka 5
omukisa 5
omutendesi 5
omwana 5
palamenti 5
puleesa 5
road 5
sizoni 5
ssomero 5
ttanka 5
yabyogeredde 5
yeetaaga 5
ying 5
12 4
abaagusambako 4
abajulizi 4
abakkiriza 4
abali 4
abalunzi 4
abamerika 4
abato 4
abazzukulu 4
agenze 4
akola 4
amazzi 4
astrazeneca 4
bajja 4
baleme 4
bannaddiini 4
bannalukalala 4
bannamateeka 4
bazannyi 4
bbiri 4
bbo 4
bifo 4
bigendererwa 4
bo 4
bwayo 4
byekwaso 4
cameroon 4
chibita 4
corporation 4
covid-19 4
cup 4
ddoola 4
dr 4
ebibi 4
ebifo 4
ebika 4
ebisolo 4
ebitundu 4
ebyenjigiriza 4
edward 4
effujjo 4
egamba 4
ekibangirizi 4
ekibinja 4
ekika 4
ekikwekweto 4
emikono 4
emmeeri 4
emmotoka 4
enkizo 4
ennaku 4
entabwe 4
ente 4
essaawa 4
eya 4
eyabadde 4
faaza 4
jude 4
kafiyu 4
kakooza 4
kalulu 4
kato 4
kawooya 4
kenya 4
kimu 4
kiraabu 4
kitaabwe 4
kitgum 4
klezia 4
kojja 4
kuddamu 4
kwogera 4
kyalo 4
league 4
leero 4
leipzig 4
lwokusatu 4
lwomukaaga 4
lyabwe 4
maka 4
masaka 4
mauritania 4
mawanga 4
mbeera 4
muguwa 4
muhanguzi 4
mukasa 4
mukiibi 4
mukono 4
munnamateeka 4
mwaka 4
mwana 4
ndagaano 4
nfa 4
nguudo 4
njagala 4
nkola 4
nnyingi 4
nsiike 4
obuyumba 4
obwenkanya 4
okubawa 4
okudda 4
okugamba 4
okugenda 4
okuggyako 4
okulwanyisa 4
okumanya 4
okusiiga 4
okuteeka 4
okutuukiriza 4
okutwalira 4
okuwabula 4
okuwamba 4
okuwandiisa 4
okuyamba 4
okwogera 4
omukaaga 4
omulabirizi 4
omusumba 4
omuwandiisi 4
omwaka 4
omwezi 4
omwogezi 4
otim 4
paul 4
rev 4
sheikh 4
ssaako 4
upamecano 4
yalaze 4
yenna 4
zino 4
zokka 4
zonna 4
14 3
16 3
17 3
1995 3
200 3
2019 3
26 3
8 3
aanya 3
abajjuvu 3
abamyuka 3
abasatu 3
abatujju 3
abawa 3
abawala 3
abeera 3
aduumira 3
ag 3
agambye 3
ajja 3
akuutidde 3
amangu 3
amasannyalaze 3
amazima 3
amuriat 3
and 3
ani 3
awali 3
awatali 3
ayanjula 3
ayinza 3
baakola 3
baana 3
baba 3
babawe 3
bafuna 3
bakola 3
bakuba 3
bannamawulire 3
bannannyini 3
bannansi 3
bannayuganda 3
basatu 3
batandise 3
bavunaanibwe 3
bba 3
bbaala 3
bbanka 3
bbosa 3
beetaaga 3
beetereeze 3
betty 3
bitagenda 3
bizinensi 3
black 3
boogere 3
brivian 3
bufalansa 3
bukulula 3
bulamu 3
bungi 3
busa 3
butereevu 3
buyindi 3
bwenkanya 3
byali 3
byokwerinda 3
capt 3
covid 3
cps 3
david 3
dayirekita 3
ddiifiri 3
deputy 3
district 3
ebbaluwa 3
ebbanga 3
ebidyeri 3
ebigambo 3
ebikwekweto 3
ebitongole 3
ebya 3
ebyenguudo 3
ebyensimbi 3
ebyobulamu 3
ebyokulonda 3
education 3
ekigendererwa 3
ekigimusa 3
ekintu 3
ekiriisa 3
ekiteeso 3
ekitiibwa 3
ekizibu 3
ekwata 3
ekyo 3
emipiira 3
emiti 3
emitima 3
emmere 3
emyezi 3
enkuba 3
ensimbi 3
entalo 3
essuubi 3
eva 3
ewa 3
eyakwatibwa 3
ezimu 3
ezisoba 3
ezizze 3
faith 3
fc 3
fdc 3
ferdinand 3
ffe 3
gano 3
gavt 3
ge 3
gen 3
grace 3
greenwood 3
gsl 3
gya 3
gyabwe 3
heedimasita 3
highway 3
january 3
jinja 3
john 3
julius 3
kaggwa 3
kakiiko 3
kaseeta 3
kasirye 3
katwesigye 3
kavuma 3
kazimba 3
kazinda 3
kibinja 3
kibirige 3
kigo 3
kijja 3
kika 3
kikyamu 3
kiro 3
kitaawe 3
kitebe 3
kizito 3
kkomera 3
kufuna 3
kulonda 3
kusalawo 3
kutya 3
kwabaddeko 3
kyali 3
lubiri 3
ludda 3
lweza 3
lwokubiri 3
lye 3
magombolola 3
mangu 3
margic 3
martin 3
mmisa 3
moses 3
mozambique 3
mukama 3
mukyala 3
mulungi 3
munaana 3
mutindo 3
nakawa 3
nayo 3
nazo 3
nnaku 3
nnyama 3
november 3
nrm 3
ntandikwa 3
nteekateeka 3
obufumbo 3
obulamu 3
obululu 3
obulwadde 3
obumu 3
obuvunaanyizibwa 3
obwagazi 3
october 3
ogujja 3
okuddamu 3
okufa 3
okuggya 3
okukolebwa 3
okukolera 3
okukozesa 3
okulumba 3
okunnyonnyola 3
okusigala 3
okusiiba 3
okusika 3
okusomesa 3
okutabuka 3
okutandika 3
okutegeeza 3
okutema 3
okutwala 3
okuwaayo 3
okuyingira 3
okwagala 3
okwenenya 3
okwewala 3
okweyambisa 3
oluva 3
omukazi 3
omukono 3
omukulu 3
omumyuka 3
omuze 3
osobola 3
osooka 3
overlock 3
parking 3
polof 3
ppipa 3
ruth 3
school 3
september 3
si 3
singa 3
ss 3
ssaabawandiisi 3
ssande 3
ssekinnoomu 3
sseruwu 3
tebalina 3
tugenda 3
tuli 3
ura 3
vvu 3
wansi 3
yaabwe 3
yadde 3
yakkiriza 3
yasoose 3
yayongeddeko 3
yeebazizza 3
yiika 3
zaategeezezza 3
1-1 2
13 2
15 2
1993 2
1994 2
2-0 2
2000 2
2006 2
2010 2
2015 2
21 2
22 2
25 2
34 2
40 2
50 2
500 2
53 2
6 2
68 2
75 2
82 2
90 2
abaabadde 2
abaabwe 2
abaafiirwa 2
abaagala 2
abaagalana 2
abaakwatibwa 2
abaamutta 2
abaddayo 2
abafumbo 2
abagambye 2
abakozi 2
abakristaayo 2
abakulira 2
abakulu 2
abalondeddwa 2
abamasomero 2
abamawulire 2
abamenya 2
abanja 2
abaserikale 2
abasibe 2
abataali 2
abatannaba 2
abattibwa 2
abatulugunyizibwa 2
abavunaanibwa 2
abavuzi 2
abawambibwa 2
abazigu 2
abazze 2
abdallah 2
achieng 2
addako 2
africa 2
afuna 2
agaana 2
agavubuka 2
agobwe 2
agumya 2
ajiji 2
akalulu 2
akawoowo 2
akiikirira 2
akwatibwe 2
akyali 2
alagira 2
alex 2
alfonse 2
aliko 2
alipoota 2
aloysius 2
alumirizza 2
amakolero 2
amalala 2
amasasi 2
amataala 2
amin 2
andy 2
annyonnyola 2
asiiga 2
asikizibwa 2
asobola 2
association 2
asuubira 2
atalina 2
ategeezezza 2
ategeka 2
atwala 2
avuga 2
awaka 2
awakanya 2
awo 2
ayingizzaawo 2
baaguwadde 2
baakugissaako 2
baakulizza 2
baakwatibwa 2
baakwatiddwa 2
baalina 2
baamukwata 2
babagalidde 2
baddayo 2
bagezaako 2
bagula 2
baguma 2
bakama 2
bakireke 2
bakkaanyizza 2
bakolera 2
bakulembeddwa 2
bakwatagane 2
bakyala 2
balemwa 2
balikuddembe 2
balyoke 2
bamenye 2
bamwine 2
bannamakolero 2
banne 2
bannyonnyodde 2
basaba 2
basajja 2
basalawo 2
basattira 2
basimba 2
basobola 2
basome 2
basooka 2
basooke 2
bassaawo 2
batandika 2
batandike 2
batono 2
batta 2
batuuka 2
batuuze 2
bave 2
bavuganya 2
bawagizi 2
bawambibwa 2
bawandiikidde 2
bawulira 2
bayern 2
bayita 2
bazzeemu 2
bbaale 2
bbaluwa 2
beeraliikirivu 2
beesimbyewo 2
besigye 2
biba 2
bibi 2
bigenda 2
biki 2
birime 2
biseera 2
bituukiddwako 2
bizikyusa 2
bizimbe 2
bob 2
boda 2
boga-zaire 2
boogedde 2
boogera 2
bp 2
brown 2
bubeera 2
bufaransa 2
bujulizi 2
bukyayi 2
bungereza 2
burundi 2
busatu 2
buvuddeko 2
buwandiike 2
buweereza 2
buzibu 2
bwaffe 2
bwaise 2
bwangu 2
bwatyo 2
bwonna 2
byabufuzi 2
byaffe 2
byava 2
byetaaga 2
byo 2
byobusuubuzi 2
center 2
central 2
champions 2
commission 2
corona 2
dauda 2
ddakiika 2
ddiiru 2
deacon 2
divizoni 2
drone 2
east 2
ebbaala 2
ebikolebwa 2
ebirayiro 2
ebiri 2
ebirime 2
ebirungi 2
ebisigalira 2
ebissi 2
ebweru 2
ebyal&agrave 2
ebyalaani 2
ebyenjawulo 2
ebyobufuzi 2
ebyuma 2
eddiini 2
eggaali 2
eggulo 2
egumbye 2
egya 2
ekigenda 2
ekijaasi 2
ekikeesezza 2
ekikolwa 2
ekikulu 2
ekimu 2
ekinnya 2
ekiramuzi 2
ekiri 2
ekiro 2
ekirungi 2
ekiruubirirwa 2
ekirwadde 2
ekisigalidde 2
ekitali 2
ekitooke 2
ekyalaani 2
ekyalo 2
ekyama 2
emabega 2
embizzi 2
emikutu 2
emisomo 2
emitendera 2
emmundu 2
empapula 2
eneeba 2
engulu 2
enjala 2
enjigiriza 2
enjiri 2
enkalakkalira 2
enkolagana 2
ennya 2
ennyonyi 2
ensobi 2
entambula 2
entebe 2
entuufu 2
eraga 2
eriko 2
erinnya 2
eritali 2
erya 2
eryo 2
esatu 2
esella 2
essaala 2
essanyu 2
esther 2
etandika 2
etandise 2
ettunka 2
etuula 2
evudde 2
ewala 2
eyamussa 2
eyasooka 2
eyawummula 2
eyawumudde 2
eyita 2
eyongedde 2
ezaali 2
ezekiel 2
ezigenda 2
eziri 2
frank 2
gaayisibwa 2
ggye 2
gino 2
girimaani 2
godfrey 2
gray 2
gumu 2
gwabadde 2
gyaffe 2
hamza 2
harvest 2
hippos 2
hotel 2
institute 2
isaac 2
janan 2
jane 2
kabolera 2
kaija 2
kalantiini 2
kaliisoliiso 2
kalule 2
kalungi 2
kalyango 2
kampla 2
kanene 2
kano 2
kanungu 2
kareman 2
katale 2
katikkiro 2
kawempe 2
kcc 2
khadi 2
khan 2
kibiina 2
kichwa 2
kidduka 2
kigenda 2
kikolwa 2
kimalirizza 2
kinene 2
kinnya 2
kirabika 2
kirangira 2
kiri 2
kisaawe 2
kisakye 2
kitandise 2
kitara 2
kitongole 2
kituufu 2
kituuse 2
kivuddeko 2
kiwanga 2
kizibu 2
kizza 2
kkampeyini 2
kontulakiti 2
kubeera 2
kujjukira 2
kukikola 2
kukkiriza 2
kukoma 2
kulaba 2
kulya 2
kuno 2
kusiiga 2
kusooka 2
kutandika 2
kutuukiriza 2
kutwala 2
kuva 2
kwa 2
kwali 2
kwaliko 2
kwekalakaasa 2
kwonna 2
kyaddiridde 2
kyangu 2
kyasinze 2
kyatabudde 2
kyawedde 2
kyazze 2
liita 2
lipooti 2
liverpool 2
liweereddwa 2
ltd 2
lubega 2
luboga 2
lubowa 2
lubwama 2
lugazi 2
lugenda 2
lukaya 2
luke 2
lukiiko 2
lule 2
lumu 2
luswata 2
luwemmense 2
mangi 2
manufacturers 2
mark 2
mary 2
mazima 2
mazzi 2
mbasaba 2
mbuga 2
media 2
meeya 2
messi 2
mini 2
ministries 2
mirimu 2
mitendera 2
mmeeya 2
mmere 2
mmotoka 2
morley 2
mpaka 2
mukankusi 2
mukolo 2
mukyamu 2
mulundi 2
mumyuka 2
munnansi 2
munnayuganda 2
mupiira 2
musanvu 2
musisi 2
muwendo 2
mwebe 2
mwenda 2
mwesonyiwe 2
nabyo 2
nairobi 2
najjembe 2
nakibinge 2
nakivubo 2
nalukwago 2
nama 2
namatovu 2
nambooze 2
namirembe 2
namugongo 2
nfuufu 2
njeru 2
nkalubo 2
nkiggale 2
nkomerero 2
nkoona 2
nkozesa 2
nnina 2
nsala 2
ntale 2
ntegeka 2
ntunda 2
nup 2
nze 2
obubaawo 2
obubaka 2
obubi 2
obubonero 2
obukugu 2
obulaga 2
obuli 2
obumala 2
obuntu 2
obusuubuzi 2
obutaddamu 2
obutafaayo 2
obutagufuula 2
obutebenkevu 2
obuteeka 2
obutereevu 2
obuwanguzi 2
obuweereza 2
obuzibu 2
obwapulezidenti 2
obwo 2
ogugenda 2
oguli 2
ogwa 2
okubulwa 2
okubuzaawo 2
okuddayo 2
okugaba 2
okugatta 2
okugema 2
okuggwaayo 2
okugobererwa 2
okujja 2
okukiikirira 2
okukkakkana 2
okukolagana 2
okukubwa 2
okukukola 2
okukulaakulanya 2
okukulembera 2
okukuula 2
okukwata 2
okukyusa 2
okulondoola 2
okulowoolezanga 2
okumaliriza 2
okunoonya 2
okunoonyereza 2
okunyweza 2
okusabira 2
okusalwako 2
okusasulibwa 2
okusonyiwa 2
okusookera 2
okussa 2
okussaako 2
okusuubula 2
okuteekamu 2
okuteekayo 2
okutunda 2
okutya 2
okutyoboola 2
okuvaamu 2
okuwagira 2
okuyimiriza 2
okuyingirira 2
okuyisa 2
okuzannya 2
okuzimba 2
okuzza 2
okwabadde 2
okwawukana 2
okweddiza 2
okwegatta 2
okwegayirira 2
okwekolerera 2
okwemulugunya 2
okwerinda 2
okwerula 2
okwesogga 2
okwetegekera 2
okwetooloola 2
okwongera 2
olwaleero 2
omuguwa 2
omukago 2
omukama 2
omukka 2
omukolo 2
omukozesa 2
omukyala 2
omulembe 2
omusolo 2
omutawaana 2
omutindo 2
omutuufu 2
omuzibizi 2
omwoyo 2
owino 2
owinyi 2
owookusatu 2
oyitamu 2
oyo 2
pastor 2
patrick 2
payipu 2
plastic 2
police 2
poloti 2
ppikipiki 2
recycle 2
ronaldo 2
rubaga 2
ruharuza 2
rwanda 2
s 2
sakina 2
samuel 2
sanga 2
seed 2
sementi 2
semi 2
senior 2
sentimita 2
serum 2
service 2
simanyi 2
simba 2
sirabaasi 2
sirale 2
sister 2
so 2
solomon 2
solskjaer 2
somalia 2
south 2
ssemakula 2
ssenga 2
ssenyange 2
ssinga 2
ssita 2
sso 2
ssozi 2
super 2
taata 2
tagenda 2
talina 2
tanzania 2
tawunya 2
teachers 2
tebajja 2
tebamanyi 2
temuli 2
tomanya 2
tulina 2
twagala 2
ued 2
ufb 2
ufe 2
vipers 2
wabeewo 2
wamala 2
wameri 2
watono 2
way 2
weebali 2
wilson 2
world 2
yaayo 2
yabasabye 2
yabuuziddwa 2
yafa 2
yafulumizza 2
yagamba 2
yagenda 2
yakozesa 2
yaliko 2
yalina 2
yamalira 2
yasiimye 2
yatadde 2
yateeba 2
yavudde 2
yayisa 2
yaziikibwa 2
yazzeemu 2
yeeyita 2
yesu 2
zaayo 2
ziri 2
zo 2
zongera 2
zoonoonebwa 2
