mu 366
ku 274
n 264
nti 169
ne 159
nga 157
e 109
ng 99
bwe 65
y 62
era 60
w 55
abantu 51
kabaka 41
bw 39
ya 39
poliisi 37
wa 36
by 34
ky 34
ate 33
kya 33
katikkiro 29
buli 28
kuba 27
abadde 26
gavumenti 26
gye 26
ssente 25
z 25
bano 24
naye 24
ye 24
be 23
gy 23
kino 23
wabula 23
gw 22
lw 22
minisita 22
agamba 21
ly 21
uganda 21
ebintu 20
eggwanga 20
ensonga 20
olw 20
oluvannyuma 19
we 19
b 18
bino 18
bwa 18
eby 18
omu 18
pulezidenti 18
yagambye 18
yategeezezza 18
abamu 17
gwe 17
ab 16
akulira 16
embeera 16
kati 16
kubanga 16
kye 16
ssaabasumba 16
bulungi 15
ba 14
dr 14
lwanga 14
nsonga 14
omwana 14
bye 13
enjawulo 13
eri 13
ettaka 13
ez 13
gabunga 13
maaso 13
okuva 13
ababaka 12
amaka 12
ekibiina 12
ekika 12
eno 12
kcca 12
kiseera 12
okuli 12
palamenti 12
wakati 12
abafumbo 11
alina 11
ura 11
abakristaayo 10
abatuuze 10
abayimbi 10
bagamba 10
bantu 10
bonna 10
disitulikiti 10
ebirala 10
ensi 10
kwe 10
lubaga 10
lwaki 10
mbeera 10
mmisa 10
okuvaayo 10
omwaka 10
ssaabasajja 10
villa 10
yonna 10
abaana 9
abali 9
amafuta 9
asaba 9
awatali 9
buganda 9
bya 9
emisolo 9
engeri 9
fr 9
gwa 9
kalungu 9
kampala 9
kkanisa 9
maka 9
mmotoka 9
nnyo 9
oba 9
ono 9
ow 9
zino 9
aba 8
abakulembeze 8
abalala 8
ali 8
ategeeza 8
bagenda 8
balina 8
bangi 8
bannayuganda 8
byonna 8
eddwaaliro 8
ekkanisa 8
ekya 8
ga 8
hajji 8
john 8
katonda 8
masaka 8
mubiru 8
nabo 8
obuntu 8
okuba 8
sacco 8
si 8
tamale 8
wadde 8
yasinzidde 8
00 7
19 7
allergy 7
bbosa 7
bulijjo 7
byabwe 7
covid 7
ddala 7
ebyo 7
ekitongole 7
emmamba 7
essimu 7
ewa 7
ge 7
ggwanga 7
joseph 7
jpg 7
ka 7
kadaga 7
kaleerwe 7
kibuga 7
kkono 7
lino 7
luwalira 7
luzira 7
lwa 7
lwokuna 7
mcmahon 7
mmengo 7
mukolo 7
mulwadde 7
mwaka 7
nakitto 7
nrm 7
obulwadde 7
okubeera 7
okumpi 7
okutuuka 7
okwagala 7
okwongera 7
omubaka 7
omulabirizi 7
omusango 7
omuzikiti 7
sipiika 7
ssekitto 7
ssentebe 7
ze 7
abakadde 6
abavubuka 6
akakiiko 6
avunaanyizibwa 6
baali 6
banja 6
basobole 6
ebweru 6
ekitiibwa 6
eky 6
ekyapa 6
emikolo 6
emmotoka 6
essuubi 6
eyali 6
g 6
gya 6
jjumba 6
kenya 6
kkampuni 6
kkooti 6
kyokka 6
lukyamuzi 6
matovu 6
moses 6
musinguzi 6
muwonge 6
mwe 6
na 6
ngeri 6
nnyanja 6
obuganda 6
ofiisi 6
oku 6
okugenda 6
okusabira 6
olukiiko 6
oluusi 6
omumerica 6
omuntu 6
omusolo 6
rev 6
rwanda 6
ssaawa 6
ttiimu 6
waliwo 6
yali 6
000 5
1 5
10 5
abakungubazi 5
abanene 5
abasuubuzi 5
abawa 5
agenda 5
ajja 5
akola 5
amagye 5
amalala 5
amateeka 5
amawanga 5
asalawo 5
awamu 5
azze 5
bakola 5
bali 5
balumiriza 5
bamanyi 5
bannaddiini 5
brian 5
bukya 5
ddwaaliro 5
ddyo 5
eddembe 5
egy 5
ekifo 5
ekiseera 5
emirembe 5
emirimu 5
guno 5
kakiiko 5
kamoga 5
kasibante 5
kibiina 5
kwa 5
kyabwe 5
lipooti 5
luguudo 5
lwe 5
lya 5
makumbi 5
mayiga 5
minisitule 5
mukenenya 5
mulamu 5
mulimu 5
obujjanjabi 5
okubba 5
okukola 5
okulaba 5
okumalawo 5
okusaba 5
okusinga 5
okuwangula 5
okuzimba 5
omulimu 5
omutaka 5
omuwandiisi 5
owa 5
robert 5
s 5
sheikh 5
ssempijja 5
ssemugenyi 5
ssomero 5
ven 5
waabwe 5
yabadde 5
zonna 5
2021 4
abaabadde 4
abakozi 4
abakristu 4
abalwadde 4
abapya 4
abaserikale 4
abasinga 4
abasiraamu 4
abataka 4
abazze 4
adduka 4
ag 4
agambye 4
akuutidde 4
alamula 4
alliance 4
amagezi 4
amazaalibwa 4
annyonnyola 4
ategeezezza 4
ayagala 4
babadde 4
bakateyamba 4
bannakibiina 4
banne 4
batandika 4
bategeezeddwa 4
bayitamu 4
bazze 4
bazzukulu 4
bba 4
bingi 4
bo 4
bukalasa 4
bukedde 4
bulamu 4
buno 4
byalo 4
david 4
development 4
ebeera 4
ebibuuzo 4
ebitone 4
ebya 4
egamba 4
egenda 4
ekittabantu 4
ekkubo 4
emipya 4
emirambo 4
emu 4
ennono 4
ennyanja 4
ensimbi 4
erimu 4
erina 4
eyabadde 4
group 4
jinja 4
k 4
kaliiro 4
kayongo 4
kiddiridde 4
kifo 4
kiri 4
kitundu 4
kityo 4
kyamuliibwa 4
lambu 4
leero 4
lugogo 4
lutikko 4
lwokutaano 4
lwomukaaga 4
lyabwe 4
mpagi 4
mpaka 4
mukono 4
munnaabwe 4
musolo 4
muwada 4
mw 4
nalukolongo 4
ndeeba 4
nnamba 4
nup 4
obubaka 4
obulamu 4
obutabanguko 4
obuyambi 4
obuzibu 4
obwavu 4
ogw 4
okudda 4
okufa 4
okukolera 4
okumanya 4
okusinziira 4
okutuusa 4
okwezza 4
omugenzi 4
omulala 4
omusumba 4
omwoyo 4
ramathan 4
ref 4
saluuni 4
sd 4
simon 4
south 4
ssabadinkoni 4
ssanyu 4
st 4
ttaka 4
ttivvi 4
vision 4
wamu 4
yaabwe 4
yagasseeko 4
yasabye 4
yasiimye 4
zaabwe 4
zombi 4
100 3
16 3
2 3
29 3
3 3
30 3
4 3
5 3
ababadde 3
ababiri 3
abagambibwa 3
abakulu 3
abakwatibwa 3
abangi 3
abanyarwanda 3
abasawo 3
abato 3
abazadde 3
abazzukkulu 3
abbamu 3
abo 3
adda 3
africa 3
aleme 3
aliko 3
alumiriza 3
amasimu 3
amb 3
amerika 3
andrew 3
april 3
asabye 3
asoma 3
asooka 3
ayogera 3
ayogerako 3
baabadde 3
bajja 3
bambega 3
bammemba 3
bannaabwe 3
basaba 3
bataddewo 3
bava 3
bavudde 3
bbeeyi 3
bbira 3
benon 3
bifo 3
bikolwa 3
bintu 3
biseera 3
bitundu 3
bizinensi 3
black 3
bp 3
bungi 3
bwonna 3
byekwaso 3
caleb 3
canon 3
cindy 3
cyprian 3
dda 3
ebbaala 3
ebikwata 3
ebirabo 3
ebiri 3
ebitundu 3
ebyensimbi 3
eddagala 3
ekibinja 3
ekigatta 3
ekikwekweto 3
ekimu 3
ekirwadde 3
ekizibu 3
ekkulu 3
ekola 3
embalirira 3
emikutu 3
emisomo 3
emyaka 3
enkola 3
ennene 3
ennyo 3
entambula 3
erigema 3
essaawa 3
essira 3
ey 3
eyattibwa 3
ezaali 3
farid 3
fayiro 3
frank 3
gino 3
gyabwe 3
hajarah 3
hippos 3
jovia 3
kakooza 3
kalule 3
kasumba 3
katusiime 3
ken 3
kibuuka 3
kifaananyi 3
kika 3
kikyamu 3
kisaawe 3
kisitula 3
kituufu 3
kizito 3
kkeeki 3
kkiro 3
klezia 3
kobs 3
kukola 3
kuno 3
kusaba 3
kussa 3
kuwa 3
kuzimba 3
kwongera 3
kyagulanyi 3
kyalo 3
liigi 3
ltd 3
lukaya 3
lukiiko 3
lusirika 3
lutoma 3
maanyi 3
makya 3
maseruka 3
mateeka 3
mayanja 3
meddie 3
meeya 3
mikolo 3
mityana 3
mufti 3
mukama 3
mukyala 3
munne 3
museveni 3
mutumba 3
muwala 3
mwana 3
myaka 3
nagawa 3
namirembe 3
ndawula 3
nelson 3
nnungi 3
nnyina 3
nsi 3
obukadde 3
obungi 3
obutwa 3
obuwangwa 3
obwa 3
odongo 3
oggyeeko 3
ogujja 3
okubasuula 3
okubawa 3
okufuna 3
okuggulawo 3
okujjukira 3
okukkaanya 3
okulinnyisa 3
okumala 3
okumenya 3
okumusabira 3
okusigala 3
okusisinkana 3
okusomesa 3
okuttibwa 3
okutuuza 3
okutwala 3
okuwaayo 3
okuyamba 3
okuyita 3
okuziika 3
okwogera 3
olunaku 3
olwo 3
omukono 3
omuli 3
omupiira 3
omutanda 3
omutima 3
omuyimbi 3
omuyizi 3
omwogezi 3
rdc 3
rebecca 3
rt 3
rukundo 3
rwaboogo 3
serverus 3
sizoni 3
sow 3
ssabasajja 3
ssekiziyivu 3
sso 3
tebalina 3
tomanyi 3
ttabamiruka 3
ttakisi 3
tufuna 3
tukaikitiza 3
tulina 3
vipers 3
wabweru 3
wakabi 3
wandegeya 3
wiiki 3
yekka 3
za 3
zooni 3
12 2
17 2
177 2
2019 2
2020 2
28 2
400 2
423 2
6 2
ab&eacute 2
abaako 2
ababbi 2
abaddde 2
abaddukanya 2
abafuuka 2
abagala 2
abaganda 2
abakkiriza 2
abakugu 2
abalina 2
abalonde 2
abambejja 2
abamulambika 2
abamuli 2
abanti 2
abasajja 2
abattakisi 2
abatuusi 2
abawerako 2
abayinza 2
abazannyi 2
abazirwanako 2
abdul 2
abebyokulabirako 2
abeerufu 2
abeesojja 2
abeetabye 2
abubaker 2
abuuliridde 2
abuulirira 2
abuyisa 2
abyogeredde 2
acfod 2
action 2
afa 2
afunye 2
agambibwa 2
agapangisibwa 2
agayinja 2
agency 2
agenze 2
aggulawo 2
agoberera 2
aids 2
akasana 2
akatimba 2
akavunaanyizibwa 2
akawaayiro 2
akulembeddemu 2
akwasa 2
alaajanira 2
alabudde 2
alaga 2
alagidde 2
alimu 2
amadirisa 2
amangu 2
amawulire 2
amayumba 2
ambassador 2
amufumbiikirizza 2
amwogerako 2
asima 2
asobole 2
assa 2
asuuke 2
atabukira 2
atugamba 2
atuuka 2
awandiikidde 2
aweerezaamu 2
ayambiddwako 2
ayigiriza 2
ayimbulwa 2
ayita 2
ayitibwa 2
ayongedde 2
aziggyamu 2
azikwasizza 2
baabwe 2
baagenda 2
baasigaza 2
baategeezezza 2
baatuuka 2
baayo 2
babasaba 2
babawadde 2
babazimbidde 2
babeera 2
babeere 2
babusomese 2
badda 2
bafaaza 2
bagambye 2
bajjajja 2
bakafulu 2
bakiwagi 2
bakolamu 2
bakole 2
bakoze 2
bakozesa 2
bakubiriziddwa 2
bakyali 2
balemererwa 2
balonzemu 2
bamukuba 2
bamukwatidde 2
bamulumirizza 2
bannamakolero 2
bannyabo 2
basabye 2
basawo 2
basiraamu 2
basobola 2
basomeseddwa 2
bassa 2
bassentebe 2
batendekebwa 2
batonedde 2
batuuka 2
bavaayo 2
bavuddeyo 2
bawaayo 2
bawaddeyo 2
bayagira 2
baziikibwa 2
beebo 2
beene 2
beewogomye 2
beeyimirizaawo 2
betway 2
bibaawo 2
bibadde 2
bibaddewo 2
bibakuumira 2
bigenda 2
bikontana 2
binnaabyo 2
bisinga 2
bizimbe 2
bokka 2
boogera 2
brig 2
bubakwasiddwa 2
bukadde 2
bukomansimbi 2
bulwadde 2
bumaali 2
bunkemke 2
busuulwa 2
butereevu 2
butwa 2
buwanga 2
buwangwa 2
bwangu 2
bwetaavu 2
bwetyo 2
byokka 2
championship 2
charles 2
club 2
commission 2
corona 2
covid19 2
dan 2
dayirekita 2
ddembe 2
ddene 2
ddereeva 2
ddi 2
ddibu 2
dollo 2
dombo 2
east 2
ebbaluwa 2
ebbeeyi 2
ebibuga 2
ebikalu 2
ebikopo 2
ebikwatagana 2
ebimu 2
ebimukwatako 2
ebipya 2
ebirime 2
ebirungi 2
ebiruubirirwa 2
ebisale 2
ebisinga 2
ebizibu 2
ebyabwe 2
ebyalo 2
ebyamaanyi 2
ebyenfuna 2
ebyeyambisibwa 2
ebyobufuzi 2
ebyobusuubuzi 2
ebyuma 2
eddakiika 2
eddiini 2
eddoboozi 2
eggulo 2
eggulu 2
ejjudde 2
ekibasomesezza 2
ekibiinja 2
ekikulirwa 2
ekikumu 2
ekiro 2
ekisinga 2
ekisomesa 2
ekitambiro 2
ekitebe 2
ekiyinza 2
eklezia 2
ekyakeesezza 2
ekyali 2
ekyatta 2
ekyo 2
embi 2
emigaso 2
emiggo 2
emisana 2
emisango 2
emito 2
emmuli 2
emmwaanyi 2
empaka 2
empuliziganya 2
empya 2
enfuna 2
enkaayana 2
enkalu 2
enkiiko 2
enkolagana 2
enkulaakulanya 2
enkulu 2
ennaku 2
ennyimba 2
enteekateeka 2
enzigi 2
erasmus 2
erinnya 2
erirambika 2
ery 2
erya 2
essaza 2
etandika 2
ettwale 2
european 2
ewedde 2
eya 2
eyabubasakidde 2
eyakulembeddemu 2
eyakwatiddwa 2
eyategekeddwa 2
eyinza 2
eyo 2
eyogezza 2
ezinaabatambuzanga 2
faaza 2
for 2
fred 2
gardens 2
gattako 2
gavt 2
gayaza 2
ggombolola 2
ggoolo 2
gibadde 2
gikuliddwa 2
godfrey 2
gombi 2
guli 2
gusigale 2
gutambula 2
gyebali 2
gyonna 2
haidah 2
haji 2
hakim 2
hassan 2
imam 2
jeje 2
jjeje 2
joanita 2
joyce 2
kaduukulu 2
kamisona 2
kano 2
kaseera 2
kasensero 2
katale 2
kategere 2
kawalya 2
kawooya 2
kiba 2
kibadde 2
kibinja 2
kigambibwa 2
kiki 2
kimu 2
kinene 2
kinyozi 2
kiruddu 2
kirungi 2
kirwadde 2
kisobozesa 2
kisuubirwa 2
kitebi 2
kiyambibwako 2
kiyingi 2
kiyunga 2
kkamera 2
kubakuliza 2
kubasasuza 2
kubayamba 2
kugenda 2
kuliko 2
kulonda 2
kulwana 2
kusisinkana 2
kuteekawo 2
kutemya 2
kutendekebwa 2
kutwala 2
kuva 2
kw 2
kwegulumiza 2
kwekuluntanza 2
kwokya 2
kyankwanzi 2
kyankwazi 2
ldu 2
league 2
lee 2
lifting 2
likodi 2
lotale 2
lugaayu 2
lukwago 2
lwabenge 2
lwabwe 2
lwasa 2
lwatu 2
mabirizi 2
march 2
masomero 2
masuliita 2
mayumba 2
mazaalibwa 2
mazzi 2
mbalirira 2
mbasaba 2
mgr 2
mikutu 2
mirimu 2
mitendera 2
miti 2
mmamba 2
morley 2
mpisa 2
mubajje 2
mubaka 2
mugenzi 2
muhumuza 2
mukaaga 2
mukolerere 2
muliika 2
munteekateeka 2
muntu 2
musaala 2
musango 2
muslim 2
musoba 2
mutuuze 2
muzzukulu 2
mwezi 2
n&aacute 2
naddala 2
nadduli 2
nakuyisa 2
namuganza 2
nandala 2
natal 2
national 2
ndagaano 2
ndala 2
ndowooza 2
new 2
nguudo 2
nile 2
nkola 2
nkulaakulana 2
nnalubaale 2
nnono 2
nsangi 2
ntuufu 2
nyendo 2
obeera 2
obubonero 2
obudde 2
obugagga 2
obukoddyo 2
obukosefu 2
obulungi 2
obusiraamu 2
obusobozi 2
obusuubuzi 2
obutebenkevu 2
obuvunaanyizibwa 2
obuweereza 2
obuyinza 2
obuzito 2
oguwedde 2
ogwa 2
ogwo 2
okubatwala 2
okubuulira 2
okudduka 2
okufunamu 2
okugatabangula 2
okuggyako 2
okugimaliriza 2
okugula 2
okujja 2
okukakasa 2
okukolerera 2
okukozesa 2
okukulaakulana 2
okukulemberamu 2
okukuuma 2
okukwasizaako 2
okukwata 2
okukyusa 2
okulabirirwa 2
okulonda 2
okulowooza 2
okulwanaga 2
okulwanirira 2
okumaliriza 2
okumutambuza 2
okunnyonnyola 2
okusala 2
okusinza 2
okusitula 2
okusobola 2
okusooka 2
okussa 2
okutambulira 2
okutta 2
okutuulizaayo 2
okutwalibwa 2
okuvaako 2
okuyigira 2
okuyiiya 2
okuyimba 2
okuyisa 2
okuzannya 2
okuzuula 2
okuzza 2
okw 2
okwagalana 2
okwebaza 2
okwefuula 2
okwegatta 2
okwegobako 2
okwewala 2
olaga 2
oluggi 2
olukalala 2
olusirika 2
oluvanyuma 2
olwa 2
olwaleero 2
olwokutaano 2
omanyi 2
omubbi 2
omubuulirizi 2
omugagga 2
omugenyi 2
omuggalo 2
omugoteko 2
omukago 2
omukazi 2
omukisa 2
omukolo 2
omukubiriza 2
omukulembeze 2
omukulu 2
omukyala 2
omulambo 2
omuliro 2
omusajja 2
omuserikale 2
omuzzukulu 2
omwenge 2
paul 2
peter 2
pikipiki 2
pope 2
power 2
ramadhan 2
richard 2
roadtoll 2
rotary 2
rugby 2
rutabana 2
save 2
shaban 2
shetra 2
siniya 2
so 2
ssande 2
ssegawa 2
ssenyonyi 2
ssevvume 2
ssundiro 2
stephen 2
sulaiman 2
talent 2
tali 2
tebabitwalanga 2
tebamanyi 2
tebasobola 2
teri 2
tewali 2
transport 2
tteeka 2
tubikwasizza 2
tukwasibwe 2
tumwebaze 2
tusaba 2
twaruhukwa 2
twesiga 2
twongere 2
union 2
utrada 2
village 2
villamaria 2
waakusooka 2
waffe 2
wakiso 2
wala 2
walugembe 2
wano 2
wasswa 2
wilberforce 2
world 2
wpa 2
yaayo 2
yabasuubiza 2
yagenze 2
yakubwa 2
yalabye 2
yandibadde 2
yanokoddeyo 2
yasazeewo 2
yawadde 2
yawangudde 2
yayongeddeko 2
yazadde 2
yeebazizza 2
yeerowoozaako 2
yeetaaga 2
yenna 2
yenyigira 2
yiika 2
yobutasasaanya 2
zaali 2
zaayo 2
zirambikiddwa 2
zitadde 2
