mu 508
ku 357
n 324
nga 313
ne 225
nti 199
e 155
ng 119
era 99
y 99
bwe 83
wa 83
w 59
bw 58
olw 50
ya 50
ye 50
ssente 45
abadde 41
agamba 41
gye 40
ate 39
by 38
we 38
abayizi 37
wabula 37
abaana 36
poliisi 36
abantu 35
kino 35
b 33
aba 32
kya 32
kyokka 31
okukola 31
yagambye 31
ba 30
ky 30
z 30
bano 29
oluvannyuma 29
eno 28
lw 27
nnyo 26
be 25
buli 25
emirimu 25
lwa 25
disitulikiti 24
gavumenti 24
gw 24
lya 24
naye 24
ennyumba 23
gy 23
okuli 23
za 23
abalala 22
omwana 22
ssomero 22
obubonero 21
okufuna 21
okuva 21
abazadde 20
amaanyi 20
bye 20
eya 20
guno 20
obulungi 20
omu 20
ono 20
ukraine 20
abamu 19
bino 19
bya 19
eby 19
ez 19
kubanga 19
russia 19
zino 19
bulungi 18
gwa 18
maama 18
mukono 18
nnyumba 18
ssentebe 18
uganda 18
yategeezezza 18
babadde 17
ekitongole 17
oba 17
okutuusa 17
omwaka 17
school 17
wakiso 17
wano 17
ekitundu 16
ensonga 16
ey 16
mulimu 16
mx 16
obukadde 16
sizoni 16
yabadde 16
yafunye 16
africa 15
akakiiko 15
akulira 15
bagamba 15
engeri 15
enjawulo 15
gwe 15
katonda 15
kuba 15
lwe 15
nabo 15
6 14
abakozi 14
abawala 14
bank 14
bayizi 14
bukedde 14
byonna 14
kati 14
kiseera 14
muwonge 14
okuba 14
omusango 14
abasawo 13
ategeezezza 13
bwa 13
ga 13
naddala 13
nsonga 13
sipiika 13
waabwe 13
wamu 13
2 12
abasomesa 12
agambye 12
agenda 12
bali 12
bonna 12
eggwanga 12
ekya 12
ewedde 12
kampala 12
kw 12
kye 12
mpaka 12
na 12
okutuuka 12
okuzimba 12
omulimu 12
ow 12
palamenti 12
pulezidenti 12
ttiimu 12
wiiki 12
yasabye 12
1 11
12 11
4 11
7 11
abakulembeze 11
america 11
baabwe 11
bangi 11
bannayuganda 11
ddala 11
ekibiina 11
emyaka 11
ennyo 11
ensimbi 11
kitundu 11
kkooti 11
namirembe 11
okulaba 11
okwongera 11
owa 11
10 10
8 10
9 10
abakyala 10
abatuuze 10
bagenda 10
bantu 10
eri 10
ettaka 10
kifo 10
kobugabe 10
kwe 10
kyalo 10
liigi 10
north 10
nssf 10
okupangisa 10
ple 10
rugomoka 10
ze 10
15 9
abavubuka 9
abeera 9
afunye 9
asaba 9
balina 9
council 9
ebirala 9
emmotoka 9
emu 9
endala 9
k 9
kawempe 9
kobs 9
ly 9
maaso 9
mizayiro 9
mmotoka 9
munisipaali 9
nkola 9
nnannyini 9
oguwedde 9
okubeera 9
okugenda 9
okunoonyereza 9
olukiiko 9
singa 9
ssaako 9
ttaka 9
yonna 9
11 8
2023 8
3 8
alina 8
amateeka 8
asia 8
ategeeza 8
babbulooka 8
bafunye 8
bbaale 8
bbo 8
blazers 8
city 8
ekintu 8
eky 8
embeera 8
empaka 8
ennaku 8
kkanisa 8
lino 8
masomero 8
mbeera 8
obucupa 8
okusoma 8
okuyita 8
olwo 8
omugenzi 8
omulabirizi 8
omulamuzi 8
omuli 8
pass 8
ssaawa 8
super 8
waggulu 8
waliwo 8
yali 8
50 7
ab 7
abaliko 7
ayagala 7
babeera 7
bazadde 7
bbasale 7
bingi 7
bitundu 7
bulabirizi 7
buno 7
byarugaba 7
ddigi 7
ebigezo 7
emitwalo 7
ennyonyi 7
essomero 7
ka 7
kalenda 7
kano 7
kyabwe 7
lule 7
maka 7
mukazi 7
nam 7
nsi 7
nsimbi 7
obulemu 7
obuwumbi 7
ogw 7
okwewala 7
olwa 7
omumyuka 7
omupangisa 7
omusumba 7
primary 7
richard 7
st 7
tebalina 7
town 7
ttanka 7
ttondo 7
yagula 7
125 6
20 6
25 6
ababadde 6
abaserikale 6
abawagizi 6
abazannyi 6
akola 6
al 6
amasomero 6
amerika 6
asabye 6
azze 6
baali 6
bagenze 6
baliraanwa 6
bana 6
banne 6
batandika 6
ddaala 6
ebintu 6
ekika 6
ewa 6
eza 6
fc 6
g 6
gaabwe 6
ge 6
ggwanga 6
gyabwe 6
heathens 6
jinja 6
jonathan 6
junior 6
kansiime 6
katende 6
katungi 6
kcca 6
kibiina 6
kirabo 6
korea 6
kuliko 6
kuno 6
kyampiyoni 6
lukiiko 6
luyimbazi 6
market 6
minisitule 6
mucureezi 6
mukisa 6
mukyala 6
myaka 6
nalubowa 6
nanyonjo 6
ngeri 6
okujja 6
okusasula 6
okuwa 6
okuwangula 6
omubaka 6
omuntu 6
omusomo 6
omuwendo 6
rev 6
sheikh 6
wakati 6
00 5
000 5
2022 5
5 5
abaakoze 5
abalenzi 5
abasinga 5
abawuzi 5
abazungu 5
abo 5
alaga 5
ali 5
alupo 5
amaaso 5
amasasi 5
amazzi 5
arsenal 5
asinga 5
atwala 5
awamu 5
bakansala 5
bakola 5
bakozesa 5
bamaze 5
banoonya 5
basatu 5
basomesa 5
bassentebe 5
bava 5
bayita 5
bbulooka 5
david 5
dayirekita 5
diana 5
ebadde 5
ebitundu 5
ebyokwerinda 5
edda 5
egy 5
ekimu 5
ekinnansi 5
emabega 5
emirembe 5
endwadde 5
enguudo 5
enkola 5
erisangibwa 5
erisooka 5
eyali 5
ezo 5
february 5
fresh 5
garuga 5
germany 5
ggombolola 5
january 5
kasangati 5
kigambibwa 5
kiro 5
kitongole 5
kkampuni 5
kukola 5
league 5
leero 5
lugazi 5
lwokuna 5
lye 5
mikutu 5
minisita 5
mwoleso 5
nakawa 5
nalukenge 5
namutebi 5
obudde 5
of 5
oku 5
okufa 5
okugeza 5
okukozesa 5
okukwata 5
okulwanyisa 5
okusaba 5
okusobola 5
okuvaayo 5
omukadde 5
omukulu 5
omulangira 5
omwezi 5
ossa 5
p7 5
patrick 5
sacu 5
siniya 5
spice 5
ssaabasumba 5
taata 5
twaha 5
yaabwe 5
yayongeddeko 5
ying 5
13 4
19 4
300 4
65 4
abaali 4
ababbi 4
ababeera 4
abagenyi 4
abatereka 4
abavuzi 4
afa 4
aga 4
allen 4
alumiriza 4
amadirisa 4
amafuta 4
among 4
amongi 4
amyuka 4
and 4
asiimye 4
baagala 4
baayitidde 4
babbi 4
babiri 4
baganda 4
bange 4
bannannyini 4
bapangisa 4
basabye 4
basisinkane 4
bayitidde 4
bba 4
bbanga 4
bbanka 4
bbiri 4
big 4
boarding 4
bombi 4
bugoba 4
bukadde 4
buto 4
deng 4
dr 4
ebyo 4
ebyobulamu 4
ebyokulwanyisa 4
ebyuma 4
ekizimbe 4
ekkanisa 4
emipiira 4
emmundu 4
empya 4
enduulu 4
engule 4
enguzi 4
enju 4
enkuba 4
enkya 4
ensi 4
ery 4
eryasinze 4
essuubi 4
eyagala 4
fmu 4
gen 4
godfrey 4
gya 4
james 4
joseph 4
kaali 4
kaana 4
kafeero 4
kakeeto 4
kakooza 4
kamu 4
kansala 4
kaseera 4
katumba 4
kayunga 4
kenya 4
kid 4
kisakye 4
kitaffe 4
kitara 4
kkansala 4
kumpi 4
kwa 4
luguudo 4
luwummula 4
lwakataka 4
lwengo 4
mabega 4
mbarara 4
moses 4
muganzi 4
mukaaga 4
mukolo 4
mulago 4
mulundi 4
munne 4
muyanja 4
mw 4
mwaka 4
mwezi 4
nabulwadda 4
namuganza 4
nange 4
nnyingi 4
nukiriya 4
nup 4
nze 4
obeera 4
obulamu 4
obuweereza 4
ofoywroth 4
okubawa 4
okufaayo 4
okumanya 4
okusinga 4
okusinziira 4
okusomera 4
olima 4
olunaku 4
omuliro 4
omupiira 4
omusuubuzi 4
omutuuze 4
omuvubuka 4
pikipiki 4
pulojekiti 4
putin 4
quran 4
saako 4
semakookiro 4
so 4
south 4
ssande 4
ssemogerere 4
sseruwu 4
talina 4
tewali 4
top 4
wabweru 4
wansi 4
wasswa 4
yasooka 4
yasoose 4
yeebazizza 4
zana 4
100 3
31 3
abaabadde 3
abaakulembeddwa 3
abaayitidde 3
abakola 3
abalina 3
abasiraamu 3
abattibwa 3
abayimbi 3
abayinza 3
afuna 3
agambibwa 3
ahmad 3
akasattiro 3
akaseera 3
akawumbi 3
akiikirira 3
akulembera 3
alabudde 3
alipoota 3
amabaati 3
amaka 3
amanyiddwa 3
amawulire 3
amayumba 3
amaze 3
anoonya 3
aquatic 3
atyo 3
aweebwa 3
ayinza 3
baana 3
baba 3
bagoole 3
bajaganya 3
bajeti 3
bajja 3
bakiggala 3
bannaddiini 3
bannakibiina 3
bannalukalala 3
bannanyini 3
basajja 3
basobole 3
bbanja 3
bbeeyi 3
bbomu 3
ben 3
biden 3
bifo 3
bigirwa 3
bisambi 3
bodaboda 3
bokka 3
brenda 3
bufumbo 3
buganda 3
bulungibwansi 3
butcher 3
buyinza 3
bwabuuziddwa 3
bwereere 3
bweyali 3
bwonna 3
byabwe 3
central 3
chaggason 3
christian 3
church 3
community 3
cps 3
dda 3
ddiini 3
ddwaaliro 3
district 3
east 3
ebbaluwa 3
ebbanga 3
ebbanja 3
ebifaananyi 3
ebirabo 3
ebyenjigiriza 3
eddiini 3
efuna 3
egenda 3
ekifo 3
ekigendererwa 3
ekikolwa 3
ekirala 3
ekisangibwa 3
ekiseera 3
ekyalo 3
ekyo 3
ekyokulya 3
embuzi 3
emikwano 3
emizinga 3
emmere 3
endagaano 3
ennyimba 3
entambula 3
enziggi 3
eppya 3
equity 3
erinnya 3
erya 3
esaba 3
esangibwa 3
essaza 3
essimu 3
essira 3
etteeka 3
famire 3
francis 3
geeti 3
gumu 3
gwabwe 3
hajji 3
hiqmah 3
hussein 3
ibrahim 3
jesca 3
jita 3
john 3
kaabuyonjo 3
kakungulu 3
kaliisoliiso 3
kaliro 3
kamwokya 3
kanso 3
kasasiro 3
kasujja 3
kateete 3
katikkiro 3
katuuti 3
kawumbi 3
ke 3
ki 3
kibuga 3
kifuba 3
kikuubo 3
kimu 3
kiu 3
kkomera 3
kkubo 3
kkufulu 3
kugula 3
kusooka 3
kwaliko 3
kwetegereza 3
kyakwambala 3
lukaya 3
luno 3
lutalo 3
lutikko 3
luwalira 3
luyirika 3
luzannya 3
lwabwe 3
lwaki 3
lwokutaano 3
maanyi 3
maj 3
makanika 3
makindye 3
man 3
mantra 3
mawanda 3
mawulire 3
mayuge 3
mayumba 3
micheal 3
miguel 3
mirimu 3
mmeeya 3
mulimira 3
musanvu 3
musoke 3
mutaawe 3
mutendera 3
mutuma 3
mutwe 3
muwala 3
muyingo 3
muyizi 3
mwana 3
mwe 3
nalongo 3
nalubega 3
nama 3
namulondo 3
nduga 3
new 3
nnamukadde 3
nnya 3
nrc 3
nsamba 3
nteekateeka 3
obujjanjabi 3
obumenyi 3
obupya 3
obutukuvu 3
obuzibu 3
obwavu 3
odaka 3
ogujja 3
ogwa 3
oilers 3
okubangula 3
okubangulwa 3
okubayamba 3
okubba 3
okubiri 3
okukakasa 3
okukendeeza 3
okukomya 3
okulaga 3
okuleeta 3
okulonda 3
okulya 3
okumala 3
okusalawo 3
okutuula 3
okutwala 3
okuwagira 3
okuwangaala 3
okuyamba 3
okuyambako 3
okuyiga 3
okuyitira 3
okwagala 3
okwebuuza 3
okweyongera 3
okwogera 3
okwonoona 3
oluusi 3
omugagga 3
omukono 3
omulala 3
omutindo 3
omuyizi 3
omuzadde 3
omuzannyo 3
peneti 3
poloti 3
pulogulamu 3
rally 3
robert 3
ronald 3
rose 3
rotary 3
schools 3
shabaab 3
shadrack 3
somero 3
sooka 3
ssabadinkoni 3
ssanyu 3
ssatu 3
ssebaggala 3
ssekaana 3
ssekimpi 3
ssemutumba 3
ssenninde 3
ssenoga 3
stella 3
tawuni 3
titans 3
tosubwa 3
tugenda 3
turinawe 3
united 3
vipers 3
wadde 3
waffe 3
wange 3
wangubo 3
yagasseeko 3
yatuuse 3
yeegasse 3
yinginiya 3
zaabwe 3
zahara 3
zibeera 3
zigenda 3
zooni 3
zzooni 3
03 2
101 2
17 2
200 2
2014 2
2016 2
2021 2
26 2
29 2
332 2
35 2
354 2
64 2
70 2
80 2
85 2
a 2
abaagudde 2
abaavudde 2
ababaka 2
abadventi 2
abafumbo 2
abagenda 2
abajulizi 2
abakazi 2
abakoze 2
abakristaayo 2
abakulira 2
abakulisitaayo 2
abakulu 2
abakungubazi 2
abalabula 2
abalungi 2
abamaanyi 2
abas 2
abasaba 2
abasangi 2
abategesi 2
abatendesi 2
abaterekayo 2
abawawaabirwa 2
abaweereza 2
abdul 2
aboludda 2
abrams 2
abyogedde 2
academy 2
adda 2
addamu 2
adduka 2
afaanana 2
afudde 2
ag 2
agattako 2
agenze 2
agula 2
agwa 2
ajja 2
akatuuti 2
akena 2
akkiriza 2
akubiddwa 2
akuutira 2
akwatiddwa 2
alaajanidde 2
alabula 2
alice 2
alimuwa 2
amagombolola 2
amagye 2
amakubo 2
amalala 2
amalidde 2
amannya 2
amannyo 2
amanyikiddwa 2
amasannyalaze 2
amasimu 2
amaziga 2
amisi 2
amos 2
ampaire 2
amukwateko 2
amuriat 2
amusaba 2
amutegeeza 2
ana 2
ani 2
anita 2
annyonnyola 2
ashiraf 2
asinzidde 2
asomedwa 2
asooka 2
asoose 2
association 2
at 2
ateekateeka 2
awa 2
awaka 2
awangudde 2
awatali 2
awera 2
awezezza 2
ayitira 2
ayota 2
baabadde 2
baakola 2
baakwongera 2
baaleese 2
baanokoddeyo 2
baasazeewo 2
baatuuza 2
baawadde 2
babaggyako 2
babbukooka 2
badda 2
baddamu 2
bafubye 2
bafulumya 2
bafumbo 2
bafuna 2
bagattibwe 2
baggulawo 2
bajjukidde 2
bakadde 2
bakendeeza 2
bakolamu 2
bakulembeddwaamu 2
bakulembeddwamu 2
bakulirwa 2
bakwata 2
balaga 2
balala 2
balamu 2
balanga 2
balanze 2
balaze 2
bamanyi 2
bamativu 2
bamukwata 2
bamwebuuzaako 2
banaggya 2
bankola 2
bannaabwe 2
basemera 2
basigadde 2
basinziira 2
basketball 2
basomera 2
basoose 2
basse 2
basuubira 2
batera 2
bato 2
batuuze 2
batuuzizza 2
batya 2
bayiga 2
bayingidde 2
bayinza 2
bayise 2
bazze 2
bbebi 2
beebazizza 2
beetaaga 2
beti 2
bibuuzo 2
bigambo 2
bigezo 2
biingi 2
bikes 2
bimu 2
bintu 2
biragiro 2
birungi 2
bo 2
boogere 2
bubi 2
bubonero 2
budde 2
bugembe 2
building 2
bukoba 2
bukulembeze 2
bulamu 2
burundi 2
busatu 2
busoga 2
busumba 2
buvad 2
buvuddeko 2
buwanguzi 2
buyondo 2
buzibu 2
bwabwe 2
byali 2
byemizannyo 2
catholic 2
charles 2
class 2
club 2
covid 2
crest 2
daniellah 2
day 2
ddoola 2
ddyo 2
december 2
destini 2
dikong 2
djibouti 2
dorothy 2
drone 2
dynamo 2
ebawadde 2
ebeera 2
ebibadde 2
ebibiina 2
ebibinja 2
ebibuuzo 2
ebigambo 2
ebikolwa 2
ebikompola 2
ebikulu 2
ebikyamu 2
ebipya 2
ebiraga 2
ebiri 2
ebirowoozo 2
ebisale 2
ebisinga 2
ebitabo 2
ebitone 2
ebitongole 2
ebiwayi 2
ebiyinza 2
ebizibu 2
ebula 2
ebweru 2
ebya 2
ebyana 2
education 2
eggye 2
egobye 2
ekibwatukira 2
ekif 2
ekifaananyi 2
ekifuga 2
ekikopo 2
ekiro 2
ekirungi 2
ekirwadde 2
ekisooka 2
ekisulo 2
ekitiibwa 2
ekitiisizza 2
ekitone 2
ekittavu 2
ekizibu 2
ekooneddwa 2
ekulembedde 2
ekyakeesezza 2
ekyokubiri 2
emikisa 2
emikyamu 2
emmanuel 2
empapula 2
empeta 2
employers 2
encukwe 2
eng 2
enjigiriza 2
enkizo 2
enkulu 2
ennyingi 2
enoonya 2
ensaamusaamu 2
ensangi 2
entalo 2
ente 2
enteekateeka 2
enunudde 2
eriko 2
erimu 2
eriri 2
esatu 2
essaawa 2
ester 2
ewala 2
ewatali 2
eyabadde 2
eyafudde 2
eyafunye 2
eyakwatibwa 2
eyasoose 2
eyasudde 2
eyenjebuse 2
eyo 2
ezigenda 2
ezikuba 2
ezimu 2
ezisukka 2
faith 2
fayinolo 2
ffamire 2
ffiizi 2
fields 2
fiizi 2
fik 2
florence 2
frank 2
gattako 2
ggeeti 2
ggoolo 2
gino 2
gwakuyamba 2
gwakwetabwamu 2
gwali 2
gyebali 2
henry 2
hippos 2
hood 2
house 2
hudah 2
hunter 2
institute 2
isanga 2
isis 2
ivan 2
jamirah 2
joe 2
julius 2
kaakutandika 2
kabaga 2
kabaka 2
kabangali 2
kaganda 2
kagato 2
kagenda 2
kagugube 2
kalungu 2
kamaadi 2
kamya 2
kanaaba 2
kanyanya 2
kapiteeni 2
karla 2
katale 2
katongole 2
katono 2
kawooya 2
kibedi 2
kibwatukira 2
kigen 2
kiggundu 2
kiki 2
kimwetaagisa 2
kintu 2
kira 2
kiri 2
kirya 2
kisaawe 2
kisaka 2
kisawuzi 2
kitaabwe 2
kitandise 2
kitende 2
kitunzi 2
kivuddeko 2
kiwa 2
kiwalimu 2
kiwandiiko 2
kiwanuka 2
kiyambeko 2
kkanso 2
klezia 2
kompyuta 2
kubawala 2
kubeera 2
kudda 2
kufuna 2
kugoba 2
kukubye 2
kulaba 2
kulondoola 2
kunoonyereza 2
kusaba 2
kusisinkana 2
kusoma 2
kwabayambye 2
kwegatta 2
kyakubiri 2
kyakusatu 2
kyali 2
kyebasobola 2
kyonna 2
libadde 2
lipoota 2
lipooti 2
lisooka 2
looni 2
lubaga 2
lubega 2
lubuto 2
luganda 2
lukalo 2
lukalu 2
luke 2
lukuli 2
luweero 2
lwokusatu 2
lwomukaaga 2
magumba 2
makumbi 2
makya 2
male 2
maneja 2
mangu 2
marvin 2
masaka 2
mateeka 2
matovu 2
mawanga 2
mazzi 2
mbadde 2
mbale 2
media 2
memorisation 2
michael 2
miita 2
mike 2
mikono 2
mityana 2
mmande 2
mmere 2
mongers 2
mpola 2
mubiru 2
mudaala 2
mudhungu 2
muganda 2
mugatta 2
mugisha 2
muhammad 2
mukama 2
mukaziwe 2
mulinde 2
mulyango 2
munda 2
munnaabwe 2
munnakenya 2
muno 2
muntu 2
mupangisa 2
mupiira 2
musaayi 2
museveni 2
musingi 2
musomo 2
mutabaazi 2
mutabani 2
mutebi 2
mutindo 2
muto 2
mwine 2
myezi 2
nabatanzi 2
nabulwadde 2
nabweru 2
naggulu 2
nakadama 2
namanya 2
namba 2
namukwaya 2
nangoye 2
nansamba 2
nato 2
nayo 2
nddala 2
ndejje 2
ndwadde 2
need 2
news 2
nguudo 2
nju 2
nnalukalala 2
november 2
nsere 2
ntandikwa 2
ntebe 2
ntege 2
ntikko 2
nyo 2
nzannya 2
nzirukanya 2
obleng 2
obubaka 2
obufumbo 2
obujulizi 2
obukujjukujju 2
obukulembeze 2
obukulu 2
obulabirizi 2
obuli 2
obulumbaganyi 2
obumu 2
obusabadinkoni 2
obutakkaanya 2
obutaweera 2
obutonde 2
obuvunaanyizibwa 2
obuwanguzi 2
obuyinza 2
obw 2
obwetaavu 2
ochom 2
ofiisi 2
oggyeeko 2
oguwagiddwa 2
oguyindira 2
okubaako 2
okubalondoola 2
okubatuusa 2
okugamba 2
okugezaako 2
okujulira 2
okukolagana 2
okukuba 2
okukubiriza 2
okukuuma 2
okulabirira 2
okulambula 2
okumaliriza 2
okumpi 2
okumuwoomera 2
okunywerera 2
okusigala 2
okusima 2
okusonda 2
okutambula 2
okutandika 2
okuteeka 2
okuteekesa 2
okutumbula 2
okuviira 2
okuvuga 2
okuvuganya 2
okuwulira 2
okuyimba 2
okuyisa 2
okuzikomyawo 2
okw 2
okwagalana 2
okwagazisa 2
okwesiga 2
okwo 2
olufuzi 2
olumala 2
olupapula 2
olutalo 2
olweggulo 2
olwokubiri 2
omar 2
omukisa 2
omukolo 2
omukozesa 2
omukulembeze 2
omukungu 2
omukwano 2
omukyala 2
omulenzi 2
omulundi 2
omutawaana 2
omuteebi 2
omutendesi 2
omuwala 2
omuwanguzi 2
omuyimbi 2
omwogezi 2
orland 2
osobola 2
otolina 2
oyagala 2
oyinza 2
paapa 2
parent 2
paul 2
poko 2
polofeesa 2
ppikippiki 2
preparatory 2
pulasitiika 2
rams 2
rapheal 2
rdc 2
rhinos 2
rosemary 2
rukia 2
s1 2
saali 2
saidi 2
sanyu 2
saul 2
sc 2
serugo 2
si 2
sikonda 2
simu 2
sir 2
siteegi 2
social 2
somalia 2
springs 2
ssali 2
ssebuguzi 2
ssebunnya 2
sseddume 2
ssekanjako 2
ssemaka 2
ssisa 2
sudani 2
swagiah 2
tamanyi 2
tara 2
tayebwa 2
team 2
tebatuuse 2
teyali 2
thomas 2
tiktok 2
times 2
timothy 2
tonny 2
travis 2
tteeka 2
tukugattiddeko 2
tukulaze 2
tuli 2
tulillion 2
twali 2
union 2
v 2
vision 2
wabaawo 2
wokorach 2
wokulira 2
world 2
xpulse 2
yabyogedde 2
yagaana 2
yagaseeko 2
yakola 2
yakubiddwa 2
yakubirizza 2
yalabudde 2
yalagidde 2
yalagira 2
yamulagira 2
yange 2
yannyonnyodde 2
yasiimye 2
yategezezza 2
yawandiikira 2
yawawaabira 2
yaweebwa 2
yeegaanyi 2
yeegatta 2
yeewuunya 2
yenna 2
yennyamidde 2
yusufu 2
zalika 2
zikekkereza 2
zisitudde 2
zo 2
zokka 2
zonna 2
