ne 779
mu 521
na 440
mukama 199
ba 193
ku 184
bwe 170
eri 167
nga 132
era 130
abaana 125
wa 123
awo 113
katonda 112
kabaka 107
isira 101
ya 96
no 94
ennyumba 92
olwa 92
e 86
ebya 82
yerusaalemi 75
kya 71
kubanga 70
abantu 60
bakabona 60
bo 59
sulemaani 59
be 57
naye 55
byonna 54
ga 54
bonna 52
maaso 52
yuda 51
nti 50
nnyumba 48
abaleevi 47
bye 43
aba 42
eya 42
nsi 42
bya 39
omu 39
zaabu 39
dawudi 38
ebintu 38
ekya 38
keezeekiya 38
nge 38
ogu 38
ebyo 37
ebiweebwayo 35
mutabani 35
ye 35
batabani 34
gye 34
abiri 33
buli 33
abo 32
kifo 31
amakumi 29
eza 29
ngo 29
ebikumi 28
kye 28
mukono 28
aga 26
emikono 26
baabwe 25
za 25
ayogera 24
gwa 24
akola 23
ekibiina 23
kale 23
kyonna 23
abakulu 22
abasajja 22
erinnya 22
lunaku 22
yali 22
abaddu 21
nnyo 21
we 21
ebyokebwa 20
kyali 20
ekigambo 19
gwe 19
kwe 19
manase 19
oku 19
so 19
yenna 19
emyaka 18
gya 18
okuyitako 18
abaali 17
ente 17
ge 17
ggwe 17
kino 17
kkumi 17
kwabwe 17
okuva 17
yosiya 17
amaaso 16
baganda 16
ekiragiro 16
emirembe 16
gyonna 16
kikumi 16
bbiri 15
ebigambo 15
ekiweebwayo 15
enkumi 15
ennaku 15
atyo 14
baali 14
eno 14
gange 14
musanvu 14
omulimu 14
zonna 14
abakazi 13
ataano 13
babiri 13
ebyali 13
ekyoto 13
endiga 13
ggulu 13
lwa 13
lwe 13
omutima 13
wamu 13
zaabwe 13
babulooni 12
byabwe 12
gu 12
laba 12
lya 12
nate 12
okubiri 12
okufuga 12
okutuusa 12
okuweereza 12
omwezi 12
wo 12
abayimbi 11
amawanga 11
asatu 11
baana 11
bibiri 11
bibuga 11
ebibuga 11
ekkumi 11
ekyo 11
endagaano 11
ennyo 11
ensi 11
essanduuko 11
etaano 11
kitaawe 11
lukaaga 11
lukumi 11
muntu 11
oba 11
okuba 11
okusaba 11
olubereberye 11
omuwendo 11
yakola 11
amateeka 10
bakitaabwe 10
bisatu 10
bwasuli 10
byali 10
ebifaananyi 10
ekifo 10
ekyokebwa 10
embaga 10
go 10
mwaka 10
omuddu 10
omwo 10
ssaddaaka 10
waggulu 10
zaali 10
ali 9
bakatonda 9
balina 9
bangi 9
bawaayo 9
boogera 9
bwali 9
ddyo 9
ebyoto 9
ekibuga 9
ffeeza 9
gaabwe 9
gwange 9
kuulo 9
lyange 9
newakubadde 9
obwakabaka 9
oyima 9
yeekaalu 9
yesuwa 9
afugira 8
ai 8
ana 8
bajja 8
bakerubi 8
bantu 8
bayimirira 8
bingi 8
buperusi 8
ddala 8
eggulu 8
ennyanja 8
eyo 8
gonna 8
gwabwe 8
kibuga 8
kirukiya 8
kyoto 8
lyo 8
misiri 8
mukaaga 8
musa 8
mutima 8
nno 8
nnyini 8
ogwa 8
okwo 8
owuliranga 8
oyo 8
safani 8
yonna 8
ze 8
abaami 7
alagira 7
amakondeere 7
atuma 7
bannaggwanga 7
basatu 7
batta 7
bigambo 7
biro 7
bwakyo 7
bwonna 7
ebifo 7
ebirungi 7
ebyambalo 7
effeeza 7
egya 7
ekitabo 7
ekitukuvu 7
empagi 7
enzigi 7
esatu 7
gwonna 7
kabona 7
kitabo 7
kkono 7
kulamu 7
kwali 7
mwe 7
mwezi 7
nnabbi 7
nsanvu 7
obugazi 7
okukola 7
oluvannyuma 7
omungi 7
ttaano 7
waffe 7
wansi 7
yaakamaze 7
yatanula 7
abaabeeranga 6
abaggazi 6
abalala 6
amaanyi 6
amayinja 6
asafu 6
awa 6
ayimirira 6
azimba 6
baalagirwa 6
baasera 6
baleeta 6
bange 6
bassekabaka 6
batunuulira 6
bawa 6
bbugwe 6
bina 6
bwabwe 6
ebibi 6
ebigulumivu 6
ebikolwa 6
ebirala 6
ebweru 6
eddoboozi 6
efulayimu 6
ekibi 6
ekitiibwa 6
embalaasi 6
emigaati 6
emitwe 6
empalo 6
entebe 6
eruuyi 6
ezera 6
gumu 6
kitange 6
kyawandiikibwa 6
lusanvu 6
luuyi 6
mikono 6
mmwe 6
munaana 6
nebukadduneeza 6
ntebe 6
obusungu 6
obutassaako 6
obuwanvu 6
okutuuka 6
okuwaayo 6
omukazi 6
omukulu 6
omusaayi 6
omusanvu 6
omwoyo 6
owa 6
ssatu 6
talanta 6
yalina 6
abaabalibwa 5
ababaka 5
abakadde 5
abamu 5
alyoka 5
amagezi 5
ateeka 5
azaliya 5
bajjajjammwe 5
bakabaka 5
bammwe 5
bataano 5
benyamini 5
bintu 5
biri 5
bwayo 5
byawandiikibwa 5
byombi 5
ebibya 5
ebisolo 5
ebyole 5
ekiwawaatiro 5
embuzi 5
emyezi 5
engalo 5
ennume 5
essatu 5
gali 5
gwo 5
gyabwe 5
ka 5
kyabwe 5
kyebaava 5
leero 5
lye 5
maaseya 5
mateeka 5
mbaga 5
nkaaga 5
obugulumivu 5
obukumi 5
okubuna 5
okukwata 5
okulongoosa 5
okusaasira 5
okuzaalibwa 5
okwegayirira 5
okwogera 5
omukisa 5
omukono 5
omunaana 5
osonyiwanga 5
sennakeribu 5
ssabbiiti 5
tewali 5
waabwe 5
wammwe 5
yaabwe 5
yamala 5
yazimba 5
yekyeri 5
yeremiya 5
abagamba 4
abakozi 4
abalabe 4
abato 4
abeera 4
abiteeka 4
agibikkako 4
ajja 4
alooni 4
amafuta 4
amagaali 4
amasavu 4
amoni 4
asimba 4
awayimibwa 4
baba 4
baffe 4
bagolokoka 4
bajjajjaabe 4
bajjajjaabwe 4
bakola 4
bakyuka 4
baleevi 4
bali 4
balyoke 4
bana 4
bano 4
basaba 4
basibe 4
basinza 4
batayinza 4
batendereza 4
batyo 4
beebaza 4
beetukuza 4
benaya 4
bwa 4
ebiri 4
ebitaasa 4
ebitukuvu 4
ebivuga 4
ebiwawaatiro 4
ebuvanjuba 4
ebyagwanira 4
egitazimbulukuswa 4
ekiri 4
ekitala 4
ekitundu 4
emisingi 4
endala 4
enkuba 4
ensonga 4
entuumo 4
eramu 4
essanyu 4
gwali 4
kaakano 4
kalimu 4
kamwa 4
kerubi 4
kiri 4
kubeerera 4
kuweereza 4
kwa 4
kyeyava 4
kyo 4
lebanooni 4
lyabwe 4
lyonna 4
mpalo 4
munne 4
mwa 4
nabo 4
nu 4
nze 4
obeeramu 4
obubaane 4
obubi 4
obusibe 4
obwesigwa 4
okulwana 4
okuzimba 4
oluggya 4
olwatuuka 4
omulabi 4
omuliro 4
omusajja 4
omusango 4
sallumu 4
seeba 4
semaaya 4
simeeyi 4
wange 4
wawa 4
yalagira 4
yozabadi 4
zitunuulira 4
zo 4
abaleetako 3
abali 3
abanesinimu 3
abazimbi 3
abeebagala 3
addamu 3
agamba 3
agolokoka 3
akaloosa 3
akamwa 3
akolanga 3
akuŋŋaanya 3
alaba 3
amakomamawanga 3
amannya 3
amaziga 3
amazzi 3
assaawo 3
atanula 3
awali 3
ayanjuluza 3
ayima 3
baddu 3
bafuuwa 3
bagenda 3
bajjajja 3
bajjajjaffe 3
bajjajjange 3
bakuŋŋaanira 3
bakwata 3
balyoka 3
bamansira 3
banoonya 3
bawala 3
bawasizza 3
bayimba 3
bayingira 3
bayingiza 3
bbanga 3
bigere 3
bitaano 3
bokka 3
bookya 3
busibe 3
bwakabaka 3
ddene 3
ebikomo 3
ebiragiro 3
ebugwanjuba 3
ebyawandiikibwa 3
ebyawongebwa 3
eggye 3
egyali 3
ekifaananyi 3
ekikambwe 3
ekiruyi 3
ekisasi 3
ekkubo 3
ekyali 3
emisituliro 3
emiti 3
emizizo 3
emmeeza 3
engabo 3
enjuyi 3
enkomera 3
ennanga 3
ennongoofu 3
entongooli 3
entukuvu 3
eryeza 3
eryo 3
etteeka 3
ezaalagirwa 3
immeri 3
kasookedde 3
kawumpuli 3
ki 3
kisenge 3
kituuka 3
kityo 3
konaniya 3
kuteekebwateekebwa 3
kutyo 3
kyenda 3
libeere 3
malukiya 3
mattaniya 3
mesullamu 3
mirembe 3
muganda 3
mulimu 3
mulungi 3
munda 3
mwenda 3
naffe 3
nnongoofu 3
ntikko 3
nzimbidde 3
obugagga 3
obukiika 3
obulungi 3
obutuukirivu 3
obuzito 3
obwa 3
okukirawo 3
okunoonya 3
okusinga 3
okusobya 3
okutendereza 3
okuterekeramu 3
okuweerayo 3
okuwonya 3
okuwulira 3
okuzimbira 3
okwa 3
okwebaza 3
okwonoona 3
omugabo 3
omuleevi 3
omuntu 3
omuwandiisi 3
sekeri 3
tewabangawo 3
wakati 3
waliwo 3
wanaabanga 3
yaliko 3
yayagala 3
yeetoowaza 3
yeremoosi 3
yo 3
yowa 3
yozadaki 3
zaayo 3
zabadi 3
zebbulooni 3
zekkaliya 3
zerubbaberi 3
abaakamaze 2
abaakola 2
abaalabika 2
abaalina 2
abaasigalawo 2
abaava 2
ababazzi 2
abakibeeramu 2
abalabirizi 2
abangi 2
abatukuvu 2
abatumye 2
abatuula 2
abaweereza 2
abazira 2
abeere 2
abifuula 2
abireeta 2
abiwandiika 2
abudi 2
abumpadde 2
addayo 2
afuga 2
agenda 2
ago 2
akagga 2
akawungeezi 2
akubiriza 2
akwata 2
akyusa 2
alayira 2
aleme 2
alina 2
amakubo 2
amaliya 2
amatu 2
amozi 2
amuddira 2
amuleeta 2
anaasabanga 2
ankuutidde 2
asaba 2
asakeri 2
asinga 2
ateesa 2
ateri 2
atwala 2
atya 2
awaayo 2
awangayo 2
awayingirirwa 2
aweesa 2
awulira 2
ayambuka 2
ayambuke 2
ayingira 2
azibikkako 2
baamala 2
baatoolera 2
baatula 2
baawaayo 2
babayamba 2
bafuta 2
baggyamu 2
bajje 2
bakazi 2
bakuŋŋaanya 2
bakwonoonye 2
balagira 2
baleetera 2
baluzirayi 2
bamala 2
bamanye 2
bambadde 2
bamenyaamenya 2
bamuttira 2
banaasabanga 2
bani 2
bannabbi 2
bassaawo 2
bateesa 2
batuuka 2
batuula 2
bavuunama 2
baweerayo 2
bebayi 2
beeteekerateekera 2
besukolooni 2
bika 2
bikompe 2
boogerera 2
bubeera 2
bubiri 2
bulungi 2
bungi 2
bwabyo 2
byaffe 2
byayo 2
byo 2
ebbaluwa 2
ebikondo 2
ebirabo 2
ebiriko 2
ebisaanuuse 2
ebisena 2
ebitaano 2
ebitone 2
ebitono 2
ebyasooka 2
ebyenkanidde 2
ebyokunywa 2
egyakaboneka 2
ekibira 2
ekifisseewo 2
ekigazi 2
ekigwa 2
ekikomo 2
ekinene 2
ekire 2
ekisa 2
ekiwandiike 2
ekizuuliddwa 2
embu 2
emikuufu 2
emirimu 2
emitoogo 2
emmeeme 2
empeese 2
empologoma 2
emu 2
endwadde 2
enfuufu 2
engeri 2
enjala 2
enju 2
enjuba 2
enkya 2
ennene 2
ennungi 2
ennya 2
ennyingi 2
ensiisira 2
ensonyi 2
entamu 2
enzige 2
eriwenayi 2
eriya 2
eriyasibu 2
erye 2
essowaani 2
ettabaaza 2
ettutumo 2
etya 2
eyaleetebwa 2
eyali 2
eyayinza 2
ezo 2
eŋŋaano 2
eŋŋamira 2
gammwe 2
gazibukenga 2
ggaali 2
gidderi 2
gikoni 2
gityo 2
golokoka 2
guno 2
gwabyo 2
gyali 2
iddo 2
isaaya 2
kadumyeri 2
kagga 2
kakumi 2
kamasi 2
kanani 2
kasanvu 2
kasumu 2
kemani 2
kiba 2
kibiina 2
kigambo 2
kigwa 2
kikyuke 2
kintu 2
kitaawo 2
kitundu 2
kituukirire 2
kiweebwayo 2
kiwonvu 2
kkubo 2
ko 2
kukungubaga 2
kuli 2
kumpi 2
kuyimirira 2
kwolesebwa 2
kwonna 2
kyayo 2
kyokka 2
lingi 2
luggya 2
lusozi 2
lwenda 2
makasi 2
makya 2
malikebu 2
mangu 2
masiro 2
mawanga 2
merali 2
mitwe 2
muba 2
mugo 2
mulaba 2
mulyango 2
musajja 2
muweereze 2
mwalimu 2
mwetukuze 2
myumba 2
naawe 2
nakyo 2
nange 2
nasani 2
ndi 2
ndireeta 2
nebo 2
neeko 2
neerobozezza 2
nekoda 2
nesaneri 2
nneerobozezza 2
nnimiro 2
nnungi 2
ntadde 2
ntumbwe 2
nzimbye 2
obo 2
obugwagwa 2
obukulu 2
obwo 2
ofiri 2
ogwalagirwa 2
okubikka 2
okubunya 2
okubuuza 2
okuddaabiriza 2
okufa 2
okugobereranga 2
okulaba 2
okulabirira 2
okulaga 2
okulangira 2
okuleka 2
okulya 2
okumala 2
okumuzimbira 2
okusaasirwa 2
okusanyusa 2
okusibibwa 2
okutambuliranga 2
okuteesa 2
okutuukiriza 2
okutuula 2
okuwandiika 2
okuweerezanga 2
okuweza 2
okwetukuza 2
olwo 2
omugo 2
omukaaga 2
omulala 2
omulyango 2
omunda 2
omunnaggwanga 2
omuwanika 2
omwaka 2
omwenge 2
owozanga 2
owulidde 2
pakasumowaabu 2
palosi 2
pasukuli 2
seerobozanga 2
sefatiya 2
sekaniya 2
sesubazzali 2
seyalutyeri 2
si 2
simyoni 2
ssabo 2
ssanduuko 2
talusiisi 2
tewaakubulenga 2
tuli 2
va 2
waayo 2
wabula 2
wamusuubiza 2
weema 2
weeroboza 2
weetoowaza 2
weewaawo 2
yagambako 2
yakolanga 2
yakwata 2
yalaba 2
yalagaana 2
yasaba 2
yateeka 2
yateekateeka 2
yatukuza 2
yatuuka 2
yawa 2
yawulira 2
yayogera 2
yazimbira 2
yedusuni 2
yeebazibwe 2
yeefunira 2
yeegayirirwa 2
yekokanani 2
yekoyakaazi 2
yekoyakimu 2
yekoyakini 2
yeyeri 2
yoweeri 2
zaayawulibwa 2
zattu 2
zeddekiya 2
