mu 461
num 415
era 233
ku 223
nga 194
ne 177
nnali 147
nti 142
nnyo 121
yakuwa 121
bayibuli 117
bwe 114
na 107
ba 98
naye 76
no 75
kkumi 69
olwa 64
abantu 58
okuba 55
katonda 54
gye 53
obulamu 51
abajulirwa 49
bwange 47
wa 47
okuyiga 45
omu 41
ekyo 39
nze 37
bbiri 35
bye 35
kye 35
emu 34
ya 34
nnyumba 33
buli 32
ebya 32
nnya 32
yali 30
ate 29
engeri 29
lukumi 29
lwenda 29
oluvannyuma 29
emyaka 28
za 28
abo 27
ekiseera 27
nnatandika 27
wange 27
baali 26
ebyo 26
ekya 26
nnalina 26
nge 25
njagala 25
ngo 24
maama 23
abiri 22
kiseera 22
musanvu 22
poliisi 22
bulamu 21
bya 21
munaana 21
ndi 21
wadde 21
aba 20
kya 20
mukaaga 20
mwenda 20
myaka 20
eza 19
gwe 19
okukola 19
tena 19
abalala 18
abasirikale 18
bingi 18
ebikwata 18
ebiragalalagala 18
kati 18
owa 18
awo 17
bwa 17
ebintu 17
ennyo 17
kyonna 17
nsi 17
okusoma 17
olwo 17
bajulirwa 16
bo 16
eyo 16
lumu 16
lya 16
nnakiraba 16
nneeyongera 16
okuva 16
okwagala 16
omuzannyo 16
ssatu 16
bulungi 15
ennaku 15
ensi 15
essanyu 15
joseph 15
kubanga 15
okukozesa 15
ababuulizi 14
awaka 14
bikolwa 14
byonna 14
empaka 14
lwa 14
okuzannya 14
amaanyi 13
ayagala 13
bwali 13
ebiri 13
egya 13
emirembe 13
enkyukakyuka 13
kibuga 13
mukyala 13
obo 13
twali 13
gwa 12
nkola 12
omujulirwa 12
pikipiki 12
we 12
abaana 11
bange 11
be 11
bwaffe 11
ekintu 11
emirundi 11
erinnya 11
kyenda 11
kyokka 11
ngeri 11
nnabanga 11
nnayiga 11
okugenda 11
ssente 11
ttaano 11
waliwo 11
zange 11
amateeka 10
asatu 10
ekyokulabirako 10
eyali 10
gyange 10
kyali 10
lukuŋŋaana 10
mpaka 10
nnina 10
obulungi 10
ogu 10
okusoomoozebwa 10
omuntu 10
taata 10
yange 10
yesu 10
ataano 9
ddala 9
ebikolwa 9
emikwano 9
empisa 9
mingi 9
ndowooza 9
njiga 9
nkimanyi 9
nnakitegeera 9
nnanyumirwanga 9
nnasalawo 9
nneetaaga 9
nsobole 9
obukulu 9
obwakabaka 9
okufuna 9
okumala 9
okutuuka 9
okwenyigira 9
tuli 9
yakyusaamu 9
ze 9
abamu 8
agali 8
ako 8
amawulire 8
bantu 8
e 8
emmotoka 8
esatu 8
eya 8
gu 8
kimu 8
lwaki 8
mikwano 8
nkuŋŋaana 8
nnagenda 8
nnazaalibwa 8
obanga 8
okubuulira 8
okukolera 8
okulaba 8
okulekera 8
omulimu 8
tayikondo 8
zabbuli 8
zzaala 8
ana 7
anyuddwamu 7
babiri 7
basanyufu 7
baŋŋamba 7
bizinga 7
bungi 7
byali 7
ebibi 7
ebitabo 7
ebyafaayo 7
eri 7
ezaali 7
kungufu 7
kwa 7
kwe 7
lwe 7
mirundi 7
mukambwe 7
muntu 7
ntandika 7
oba 7
obubaka 7
obukambwe 7
okubeera 7
okwo 7
olwekyo 7
sakkiriza 7
si 7
sirina 7
ye 7
abaali 6
agamba 6
ali 6
amalungi 6
amazima 6
awagamba 6
bagenda 6
bangi 6
bintu 6
bwenkanya 6
ebirala 6
eggwanga 6
emibi 6
emmundu 6
enjawulo 6
ensonga 6
kinaana 6
kiraabu 6
kitono 6
kugasa 6
leero 6
lunaku 6
maaso 6
maka 6
mexico 6
mpulira 6
nabo 6
nange 6
nfuna 6
nkyali 6
nnafuna 6
nnyanja 6
obudde 6
obwo 6
okukuba 6
olunaku 6
omuwala 6
singa 6
timoseewo 6
wiiki 6
yannyamba 6
yatandika 6
abakristaayo 5
abava 5
amerika 5
annyambe 5
baatandika 5
baganda 5
banjigiriza 5
basobodde 5
batya 5
bazadde 5
boolekagana 5
buto 5
ebimu 5
ekibuga 5
ekikulu 5
ekitiibwa 5
ekyali 5
ekyawandiikibwa 5
emizannyo 5
emyezi 5
endala 5
enteekateeka 5
erya 5
eryo 5
ga 5
gya 5
kampuni 5
kazinga 5
kibiina 5
kifo 5
kisa 5
kitundu 5
kityo 5
kiwanvu 5
kyannyamba 5
kyeyagalire—mu 5
luno 5
matayo 5
meeya 5
mmaze 5
mujulirwa 5
musanyufu 5
nguudo 5
nkaaga 5
nnabatizibwa 5
nnaddamu 5
nnagendanga 5
nnakozesanga 5
nnalaba 5
nnalekera 5
nnamaddala 5
nnawereza 5
nnaweza 5
nnyingi 5
nnyinza 5
nsanvu 5
obugwenyufu 5
okubba 5
okufuuka 5
okunoonya 5
okusobola 5
okuvuga 5
okuyimba 5
okuzannyira 5
okwolekagana 5
omubiri 5
omukuumi—ogu 5
omulungi 5
omwenge 5
omwoyo 5
oyo 5
pacific 5
tiimu 5
twafuna 5
twamala 5
yazaalibwa 5
yokaana 5
zonna 5
abakkolinso 4
abamenyi 4
adel 4
aga 4
amaka 4
awamu 4
ayitibwa 4
baagala 4
bandaga 4
bannange 4
bansaba 4
bifo 4
bonna 4
bumu 4
butono 4
bwangu 4
costa 4
date 4
ebizibu 4
ebyawandiikibwa 4
egamba 4
ekimu 4
ekirala 4
ekiri 4
ekiyitibwa 4
enda 4
ennyumba 4
eriri 4
essuubi 4
evija 4
ewaka 4
eyigiriza 4
eziwerako 4
gaffe 4
gange 4
gumu 4
gwali 4
ka 4
kabi 4
katono 4
kibiinabeewaayo 4
kisoboka 4
kkereziya 4
kumpi 4
kutuwa 4
kwange 4
kyangu 4
kyankwatako 4
latvia 4
lebanooni 4
lingi 4
micronesiaabo 4
mpolampola 4
muganzi 4
mukwano 4
munnange 4
muwendo 4
mwe 4
nfunye 4
nicaragua 4
njawulo 4
nkumi 4
nnafunanga 4
nnafuuka 4
nnakkiriza 4
nnakola 4
nnakolanga 4
nnakoma 4
nnakulira 4
nnasaba 4
nnawulira 4
nneebaza 4
nneegatta 4
nneenyigiranga 4
nsobola 4
nzannya 4
obumenyi 4
obusungu 4
obutali 4
obuyambi 4
okukyusa 4
okumpi 4
okunjigiriza 4
okunywa 4
okutendeka 4
okuwulira 4
okuyigiriza 4
okwefuga 4
okwemalira 4
okweyongera 4
olunene 4
oluusi 4
omubuulizi 4
omulala 4
rica 4
saddamu 4
sisobola 4
tebwali 4
tubutwale 4
twakola 4
twazaalibwa 4
wabula 4
wagamba 4
yafa 4
yagamba 4
yatugamba 4
yaŋŋamba 4
yonna 4
zaabwe 4
zzaabu 4
abaasiima 3
abato 3
abawola 3
agenda 3
aggulawo 3
ajja 3
akabonero 3
alina 3
amaduuka 3
amagezi 3
amanene 3
annunziato 3
baabasiibula 3
baabuuza 3
baafa 3
baagamba 3
baalemerako 3
baambuuliranga 3
baanyumirwa 3
baatwaniriza 3
baava 3
bafuba 3
bafunye 3
bagamba 3
bakutte 3
bali 3
bamutwale 3
bandikubye 3
basatu 3
basobole 3
bawerekera 3
bazannyi 3
bibiri 3
bikwata 3
bizibu 3
bulijjo 3
bungereza 3
butuufu 3
bwonna 3
byankwatako 3
canada 3
ddiini 3
ebibuuzo 3
ebigambo 3
ebiseera 3
ebitundu 3
eddiini 3
egwa 3
ekifo 3
ekigendererwa 3
ekisinga 3
ekisuubizo 3
ekyavaamu 3
emirimu 3
enjuba 3
enkomerero 3
ensimbi 3
enviiri 3
esinga 3
essaawa 3
estonia 3
ettutumu 3
etutuuse 3
eyimirira 3
ezisigaddeyo 3
ezo 3
eŋŋombe 3
ggwanga 3
gwabaseball 3
gwange 3
gyonna 3
kari 3
kaseera 3
kibinja 3
kino 3
kintu 3
kkomera 3
kubunyisa 3
kugaana 3
kugenda 3
kuvuga 3
kuzannya 3
kyalo 3
kyandeetera 3
kyanneewuunyisa 3
lottery 3
lyange 3
maanyi 3
magezi 3
makulu 3
mangu 3
mbeera 3
mbuulira 3
micronesia 3
mirembe 3
mizannyo 3
mmanyi 3
mpeereza 3
muliro 3
mumalirivu 3
muto 3
muvubuka 3
muzannyo 3
mwannyinaze 3
nakyo 3
nkonkonye 3
nnabagamba 3
nnakizuula 3
nnaku 3
nnakubanga 3
nnalabanga 3
nnalimu 3
nnalowoozanga 3
nnamala 3
nnamalanga 3
nnannyini 3
nnasanga 3
nnasobola 3
nnasooka 3
nnateranga 3
nnawasa 3
nnayitibwa 3
nneetaba 3
nneewuunya 3
nnyamba 3
nsaba 3
nsoma 3
nsula 3
ntyo 3
nzekka 3
nzikiriza 3
obugenda 3
obukodyo 3
obunene 3
obuseegu 3
obutiini 3
ogwo 3
oku 3
okuddayo 3
okufa 3
okufuga 3
okujja 3
okukumpanya 3
okukyusiza 3
okulaga 3
okulekayo 3
okulwanyisa 3
okumanya 3
okumuyigiriza 3
okusaba 3
okusabira 3
okusanyusa 3
okusatu 3
okusinga 3
okutambula 3
okutandika 3
okutulabirira 3
okutuukako 3
okutuukirira 3
okuweereza 3
okuwuliriza 3
okuyamba 3
olunyiriri 3
olwali 3
omukisa 3
omukyala 3
omulundi 3
omunaala 3
omusajja 3
omuto 3
omuzannyi 3
omwaka 3
osigazza 3
oyinza 3
riga 3
simanyi 3
ssaawa 3
ssuubi 3
tannatuukako 3
tekyali 3
tewabaawo 3
tubuulira 3
tufuuka 3
tukutwale 3
tunaatera 3
tuyamba 3
twabanga 3
twabatizibwa 3
twafumbiriganwa 3
twagaba 3
twagala 3
twasobola 3
waali 3
waka 3
wakyasigaddeyo 3
yandyagadde 3
yayita 3
ababayigganya 2
abagaba 2
abakazi 2
abakulira 2
abalabe 2
abana 2
abaruumi 2
abawagizi 2
abaweereza 2
abeera 2
aboogera 2
abutwala 2
agimuleetera 2
akaakubibwa 2
akafaananyi 2
akakonge 2
akalaga 2
akaliko 2
akamu 2
akazinga 2
akoze 2
akubiriza 2
alabika 2
alise 2
alwalalwala 2
amagulu 2
amakulu 2
amasaawa 2
ampe 2
anita 2
anjagala 2
anjigiriza 2
anzizaayo 2
ateabaruumi 2
awasimbibwa 2
ayogera 2
baabagaana 2
baabanga 2
baafiira 2
baafuuka 2
baatuuka 2
babuulira 2
babuulizi 2
bakakafu 2
bakatoliki 2
bakiggala 2
bakkakkamu 2
bakkondo 2
bakolera 2
bakuwerekerako 2
bamalaaya 2
bambula 2
bammwe 2
bannantameggwa 2
bannyaniriza 2
bannyinyonnyola 2
bantumye 2
bavudde 2
bayimba 2
bbanka 2
bbomu 2
binnyambye 2
binoomunaala 2
biragalalagala 2
birowoozo 2
biseera 2
bisiigiddwako 2
bitaano 2
bitegeerekeka 2
bitundu 2
bivvulu 2
boogerako 2
bubi 2
bubiri 2
bufalansa 2
bukambwe 2
buwa 2
buweereza 2
bwakabaka 2
bwalinnakulira 2
byaffe 2
byakolebwa 2
byannakuwaza 2
byansanyusa 2
china 2
claudia 2
cuba 2
ddoola 2
ebbiri 2
ebidduka 2
ebikomo 2
ebikulu 2
ebiwerako 2
ebyabanga 2
ebyesudde 2
effujjo 2
egimu 2
egiwera 2
ekibi 2
ekiro 2
ekiruubirirwa 2
ekisa 2
ekisangibwa 2
ekitono 2
ekyandeetera 2
ekyannyamba 2
ekyasinga 2
embeera 2
embi 2
emikono 2
emingi 2
emisango 2
empanvu 2
empeta 2
empya 2
ena 2
enfuna 2
enkizo 2
enkolagana 2
ennamba 2
ennyimba 2
eno 2
ensawo 2
enzimbi 2
erimu 2
erye 2
etali 2
ettabi 2
eyajja 2
ffembi 2
gaafuna 2
gamba 2
gunfuukidde 2
gwokka 2
gyokka 2
isaaya 2
jjajja 2
jjulaayi 2
jorge 2
kaakano 2
kenda 2
ki 2
kijja 2
kikumi 2
kirala 2
kiteeka 2
kizimbe 2
kubba 2
kugifuna 2
kukozesa 2
kulaba 2
kusoma 2
kusooka 2
kusula 2
kutendekebwa 2
kuyiga 2
kuzingiramu 2
kyatuuka 2
kyaviirangako 2
kyawandiikibwa 2
london 2
lubalama 2
lugar 2
luggi 2
lukaaga 2
lutalo 2
lwali 2
lwange 2
makya 2
mateeka 2
mazima 2
mba 2
mbadde 2
mbikkiriza 2
mbitunda 2
mbiyolako 2
mbizzaawo 2
mitindo 2
mmala 2
mmulabirira 2
montreal 2
mubuulizi 2
muggalanda 2
mugumiikiriza 2
mukakafu 2
mukisa 2
mukozi 2
mulamu 2
mulungi 2
mumatayo 2
munakuwavu 2
museegu 2
mutima 2
mututumufu 2
mutwalo 2
muwala 2
muwendomu 2
muyimbi 2
muze 2
muzibizi 2
mwaka 2
mwebiri 2
mwennyamivu 2
mweyongere 2
mwoyo 2
naawe 2
ndaba 2
ndisasula 2
njegoyego 2
njize 2
nkizo 2
nkula 2
nkulembeza 2
nkuze 2
nkyanyumirwa 2
nkyazannyira 2
nkyukakyuka 2
nnabbanga 2
nnabeeranga 2
nnadduka 2
nnagambanga 2
nnaganzanga 2
nnagulanga 2
nnajjukira 2
nnakimanya 2
nnakolagananga 2
nnakolako 2
nnakwatibwako 2
nnakyewa 2
nnalekayo 2
nnalimbanga 2
nnalowooza 2
nnamenyanga 2
nnandibadde 2
nnanoonya 2
nnanywanga 2
nnasabibwa 2
nnasalako 2
nnasanyuka 2
nnasoma 2
nnatendekebwanga 2
nnava 2
nnavumanga 2
nnawangula 2
nnayagala 2
nnazannyako 2
nnazannyira 2
nneebuuza 2
nneegezaamu 2
nneenyigira 2
nneeraliikirira 2
nneeyisangamu 2
nsobi 2
nsonga 2
ntandise 2
ntendekebwa 2
ntisitaani 2
ntya 2
nve 2
nyumirwa 2
obubonero 2
obuto 2
obuulira 2
obuvune 2
obwa 2
offisi 2
ogutazikira 2
okubafera 2
okubatizibwa 2
okubikkulirwa 2
okubiri 2
okubuulirako 2
okudda 2
okudduka 2
okufaayo 2
okufera 2
okugamba 2
okukolagana 2
okukuza 2
okulowooza 2
okulwana 2
okulya 2
okumpa 2
okunzita 2
okusalawo 2
okusiiba 2
okusiima 2
okussa 2
okutegeera 2
okutendekebwa 2
okuvanga 2
okuvuganya 2
okuvugira 2
okuwangula 2
okuweerereza 2
okuwoolera 2
okuyomba 2
okuzivuga 2
okuzuukira 2
okwebuuza 2
okwenoonyezanga 2
okwetaba 2
okweyisa 2
okwonoona 2
oli 2
olumu 2
olusuku 2
olutata 2
omuddiriŋŋanwa 2
omugabi 2
omukulu 2
omululu 2
omulyolyomi 2
omunda 2
omuntumulamu 2
omutwe 2
omuvubuka 2
omwami 2
omwesigwa 2
osobola 2
pakipiki 2
quebec 2
rooma 2
saalwa 2
saddayo 2
sanna 2
sikomyewo 2
sikoze 2
sikyabitwala 2
siri 2
ssanyu 2
ssaza 2
ssomero 2
tagenda 2
talibeerawo 2
tallinn 2
tebaakisanyukira 2
temuwooleranga 2
ttabi 2
ttuntu 2
tufuba 2
tulina 2
twasisinkana 2
tweyongera 2
waffe 2
wamu 2
wayiseewo 2
yabasisinkana 2
yaddamu 2
yafiira 2
yagizuula 2
yakiraba 2
yakola 2
yakolanga 2
yakuwabanjigirize 2
yalina 2
yambuulirako 2
yambuuza 2
yampa 2
yamubulako 2
yandaga 2
yandeetera 2
yankubiriza 2
yannonanga 2
yatukuza 2
yatulekawo 2
yitale 2
zabaseballnnyingi 2
zeero 2
ziyinza 2
