mu 181
ku 137
nga 112
nti 89
era 79
ne 73
na 54
kyagulanyi 42
e 39
bwe 37
bwa 36
ye 35
kya 34
no 32
ono 32
kino 30
bano 29
akalulu 26
wa 26
museveni 21
abantu 20
be 20
ekibiina 20
ya 20
abadde 19
olwo 19
poliisi 19
ke 18
naddala 18
kkooti 17
mbu 17
oluvannyuma 17
lwo 16
abe 15
akakiiko 15
okulonda 15
pulezidenti 15
agambye 14
ba 14
ebyokwerinda 13
nati 13
naye 13
o 13
onal 13
wamu 13
agamba 12
ate 12
awamu 12
bye 12
ebyokulonda 12
omulamuzi 12
wano 12
agenda 11
bannamawulire 11
buli 11
bya 11
enjawulo 11
kuba 11
kyo 11
leero 11
uganda 11
wadde 11
aba 10
ebyo 10
guno 10
kalangala 10
kampala 10
kye 10
okusobola 10
opi 10
platform 10
ttiimu 10
unity 10
ekyo 9
gavumenti 9
kkampeyini 9
kwe 9
mpozzi 9
nge 9
obululu 9
okusinziira 9
okuva 9
za 9
ze 9
bantu 8
bino 8
c 8
eno 8
ka 8
kalulu 8
kano 8
kkaadi 8
lunaku 8
lwa 8
lwe 8
waliwo 8
we 8
abaana 7
abawagizi 7
abo 7
babadde 7
bobi 7
corona 7
gwa 7
gya 7
kibiina 7
luno 7
nrm 7
ssennyiga 7
wine 7
zo 7
alina 6
amawulire 6
anoonya 6
ategeezezza 6
bagenda 6
boodabooda 6
disitulikiti 6
eggwanga 6
ggoolo 6
ggwanga 6
gwe 6
gye 6
gyo 6
kkumi 6
ngeri 6
ngo 6
nnyo 6
okuli 6
olwa 6
omu 6
robert 6
ssente 6
wabula 6
yabadde 6
zaabwe 6
zino 6
abamu 5
bagamba 5
bonna 5
byabakama 5
byo 5
ekirwadde 5
ekitundu 5
emirimu 5
eri 5
eze 5
kulonda 5
kuno 5
mawejje 5
obubaka 5
okugenda 5
okutuusa 5
si 5
ssentamu 5
yategeezezza 5
zebra 5
abapoliisi 4
abiri 4
ali 4
ayogerako 4
bannayuganda 4
bategeezezza 4
bbiri 4
bitundu 4
buno 4
buteera 4
dokita 4
ebintu 4
ebiragiro 4
eggulo 4
ekya 4
emikutu 4
emirembe 4
emisango 4
enanga 4
ensi 4
gwo 4
kamyufu 4
kati 4
kiddiridde 4
kifo 4
kikumi 4
kitundu 4
kkampuni 4
kyazze 4
lwaki 4
mmande 4
munnakibiina 4
nsi 4
oba 4
obuyinza 4
okuba 4
okubeera 4
okuggyako 4
okukola 4
okutwala 4
omuntu 4
omusango 4
omusumba 4
omutimbagano 4
rukungiri 4
ssenyange 4
turinawe 4
yagambye 4
yo 4
yonna 4
abakungu 3
abalala 3
abasabye 3
abavuzi 3
abayizi 3
abeesimbyewo 3
agasseeko 3
akulira 3
amaanyi 3
amagye 3
amanyiddwa 3
amuriat 3
asuubizza 3
ataano 3
ategeeza 3
azze 3
baagala 3
bangi 3
bannannyini 3
bapoliisi 3
basobole 3
batunuulidde 3
bbendera 3
bifo 3
bo 3
buganda 3
buweekula 3
bwenkanya 3
ddala 3
ebitundu 3
ebyenjawulo 3
ekikopo 3
ekiragiro 3
ekirala 3
embeera 3
emitwalo 3
emmotoka 3
emmundu 3
empapula 3
emu 3
enkola 3
ennaku 3
ennyonyi 3
ensonga 3
eyeesimbyewo 3
ezo 3
frank 3
gino 3
henry 3
kaabwe 3
katikkiro 3
katonda 3
kayunga 3
kibuga 3
kigambibwa 3
kimu 3
kinajjukirwa 3
kisaawe 3
kubanga 3
kuteesa 3
kwongera 3
lulwe 3
lumu 3
lwokuna 3
lya 3
ma 3
maaso 3
mayiga 3
mazima 3
mikutu 3
minisita 3
mpaka 3
mukaaga 3
mukama 3
muntu 3
nakayiza 3
nnya 3
nsonda 3
nsonga 3
ntebe 3
obujulizi 3
obulumbaganyi 3
obwapulezidenti 3
okufuna 3
okugezaako 3
okukuba 3
okukuuma 3
okulaba 3
okunoonya 3
okutumbula 3
okuwa 3
okwerinda 3
okwesimbawo 3
olusirika 3
omukolo 3
omukutu 3
omuli 3
omuzannyo 3
omwaka 3
omwezi 3
singa 3
ssatu 3
ssembabule 3
ssettendekero 3
tujja 3
warren 3
yali 3
yattiddwa 3
yeesimbyewo 3
yenna 3
yoweri 3
ababadde 2
abagenda 2
abajaasi 2
abakozi 2
abakulira 2
abakulu 2
abakwatiddwa 2
abalamuzi 2
abalwanirizi 2
abangi 2
abasatu 2
abasawo 2
abayeekera 2
afuna 2
age 2
agendayo 2
ajja 2
aka 2
akakasizza 2
akakwate 2
akoze 2
akwata 2
akwatidde 2
alagidde 2
alemererwa 2
alliance 2
alumiriza 2
amalwaliro 2
amawanga 2
america 2
ana 2
annyonnyodde 2
asabye 2
atalina 2
atambula 2
avuganya 2
ayagala 2
ayita 2
ayongeddeko 2
baali 2
baana 2
babyakwerinda 2
bagaziyizza 2
bakimanyi 2
bakola 2
bakozesa 2
bakwata 2
bakwatiddwa 2
balina 2
balonde 2
balowooza 2
balumiriza 2
bannamateeka 2
bannansi 2
basobola 2
battibwa 2
bawakanya 2
bayimbuddwa 2
bayunguddwa 2
besigye 2
bingi 2
bitongole 2
booda 2
buddu 2
bululu 2
bulumbaganyi 2
butaano 2
buwanguzi 2
buyinza 2
buzibu 2
bwakwatiddwa 2
bwangu 2
bwannamunigina 2
bwapulezidenti 2
byonna 2
catherine 2
center 2
chapter 2
daily 2
david 2
ddakiika 2
ddembe 2
democratic 2
dp 2
ebbanga 2
ebidduka 2
ebikolwa 2
ebinaava 2
ebirala 2
ebiri 2
ebitabo 2
ebizibu 2
ebweru 2
ebyava 2
eddembe 2
eddiiro 2
egiyise 2
ekifo 2
ekigendererwa 2
ekyali 2
emirundi 2
endala 2
engeri 2
enkolagana 2
enkungaana 2
enkya 2
ennusu 2
ennyo 2
ensimbi 2
ensukkulumu 2
esatu 2
essaza 2
essimu 2
eyasoose 2
eyo 2
ezeesigika 2
eziwera 2
faridah 2
fdc 2
four 2
ga 2
gano 2
ge 2
ingrid 2
kaali 2
kabaliddwa 2
kaguta 2
kajuga 2
kakalu 2
kakiiko 2
kamwokya 2
kaseera 2
kidyeri 2
kigenda 2
kikoleddwa 2
kiseera 2
kisekka 2
kisobola 2
kizinga 2
kizza 2
kkamera 2
ko 2
kubeera 2
kuddukira 2
kukola 2
kukuuma 2
kulaba 2
kunoonyereza 2
kusaba 2
kyabwe 2
kyalo 2
kyokka 2
lugenda 2
lukumi 2
lukuŋŋaana 2
lwokusatu 2
makya 2
masaka 2
mateeka 2
mawanga 2
mikono 2
mirembe 2
misango 2
mpanga 2
mpiima 2
mukono 2
mukutu 2
mukyala 2
mulimu 2
mutimbagano 2
muwagizi 2
muwonge 2
mwaka 2
myezi 2
nabo 2
nakasozi 2
nakweede 2
namasuba 2
namayingo 2
nicholas 2
njawulo 2
nkola 2
nkumi 2
nkungaana 2
nyanzi 2
obukulembeze 2
obutakkaanya 2
obutali 2
okubaawo 2
okubala 2
okujeemera 2
okukendeeza 2
okukolera 2
okukuma 2
okukwata 2
okulondoola 2
okumala 2
okunoonyereza 2
okusaasaanya 2
okusigala 2
okutabangula 2
okutambula 2
okutulugunyizibwa 2
okuvaayo 2
okuwagira 2
okuwangula 2
okuwedde 2
okuzuula 2
okuzza 2
okwa 2
okwekalakaasa 2
okwetaba 2
okweyambisibwa 2
okwogera 2
oludda 2
olukiiko 2
olukwe 2
olwe 2
olwekyo 2
omubaka 2
omukuumi 2
omuliro 2
omumyuka 2
omunwe 2
omupiira 2
omwogezi 2
oweekitiibwa 2
r 2
salim 2
sam 2
ssentebe 2
ssenteza 2
ssenyonyi 2
talina 2
tebaagala 2
tebayinza 2
tewali 2
ttaano 2
tumwiine 2
twagala 2
u 2
vote 2
waabwe 2
wakiso 2
wo 2
yaabwe 2
yafuna 2
yalangiridde 2
yaliko 2
yasabye 2
yasalawo 2
yasinzidde 2
yasoose 2
yasuubizza 2
yategeeza 2
yawangula 2
yintaneeti 2
zitwalibwa 2
