mu 440
ku 340
nga 282
n 251
e 156
nti 156
ne 109
ng 109
y 88
era 76
ya 70
wa 64
bw 60
w 59
bwe 54
kkooti 51
abantu 50
eno 40
minisita 39
poliisi 38
omulamuzi 34
kino 33
kya 33
omu 33
ye 33
gw 32
okuva 31
uganda 31
za 30
ate 29
by 27
guno 27
lw 27
maaso 27
ono 27
gye 26
oluvannyuma 26
olw 26
kampala 25
ky 24
lwa 24
ssente 24
eby 23
eggwanga 23
enjawulo 23
z 23
ba 22
gavumenti 22
abadde 21
abamu 21
abayizi 21
eri 21
wabula 21
bano 20
bino 20
ennyumba 20
g 20
gwe 20
agamba 19
b 19
kubanga 19
asabye 18
lugoloobi 18
makerere 18
oba 18
omusango 18
abaana 17
ategeezezza 17
ga 17
okubeera 17
okufuna 17
ebintu 16
gwa 16
kye 16
nnyo 16
obulungi 16
okulaba 16
yagambye 16
zino 16
be 15
buli 15
emirimu 15
ensonga 15
ey 15
kyokka 15
mukono 15
nsonga 15
abasiraamu 14
bwa 14
gy 14
kawempe 14
naddala 14
okukola 14
omuntu 14
we 14
yategeezezza 14
abatuuze 13
bannamawulire 13
bonna 13
ensi 13
ez 13
gya 13
nandutu 13
omubaka 13
wamu 13
amasomero 12
ebirala 12
ekibiina 12
ggwanga 12
kuba 12
luwalira 12
lya 12
ngeri 12
wano 12
2023 11
ab 11
akulira 11
amabaati 11
ategeeza 11
bantu 11
bya 11
ebyenjigiriza 11
eky 11
kcca 11
kiseera 11
naye 11
nnyumba 11
ofiisi 11
okutuusa 11
omulabirizi 11
omwaka 11
owa 11
yali 11
10 10
aba 10
abalala 10
agambye 10
ayogera 10
embeera 10
essimu 10
gano 10
ka 10
kayondo 10
kkomera 10
male 10
musoke 10
okwongera 10
palamenti 10
wakati 10
20 9
200 9
abakristaayo 9
annyonnyola 9
babadde 9
bannaabwe 9
bayizi 9
ekifo 9
emisinde 9
emu 9
fred 9
kuno 9
kw 9
luzira 9
lwe 9
masomero 9
namirembe 9
okuba 9
okubba 9
okuli 9
omulimu 9
sheikh 9
ssaayansi 9
ssentebe 9
st 9
100 8
abo 8
akakiiko 8
akola 8
balina 8
bulungi 8
bye 8
ebweru 8
egy 8
ekika 8
ekya 8
emisango 8
empaka 8
emyaka 8
ennyonyi 8
ensawo 8
k 8
kakiiko 8
karamoja 8
kigambibwa 8
kwe 8
kyalo 8
langi 8
leero 8
mbeera 8
mmita 8
munisipaali 8
museveni 8
mwe 8
nawangwe 8
obukadde 8
ogwa 8
okuzimba 8
omugenzi 8
ow 8
pulasita 8
ssinga 8
yaabwe 8
zzooni 8
19 7
2022 7
abaabadde 7
abakozi 7
abavubuka 7
africa 7
alina 7
amasomo 7
asaba 7
bali 7
bitundu 7
bo 7
bp 7
ddala 7
disitulikiti 7
ebyensimbi 7
enguudo 7
ensimbi 7
eya 7
finisingi 7
ge 7
kirya 7
kuliko 7
luno 7
lwaki 7
misinde 7
musango 7
nkola 7
obubbi 7
ogw 7
okutuuka 7
okuwa 7
okuyamba 7
okwagala 7
olwo 7
omulundi 7
omusomo 7
omutuuze 7
ttiimu 7
yabadde 7
1 6
24 6
aana 6
abakulembeze 6
abali 6
abalonzi 6
abasomesa 6
abeera 6
amos 6
amyuka 6
bagamba 6
bagenda 6
bangi 6
dizayini 6
east 6
ebibiina 6
ebitundu 6
eggulo 6
ekintu 6
ekizimbe 6
engeri 6
enkola 6
enkolagana 6
ennaku 6
ennyo 6
galabuzi 6
gayaza 6
ggombolola 6
kabaka 6
kaduukulu 6
katonda 6
kitundu 6
kutendekebwa 6
makindye 6
may 6
musa 6
na 6
obudde 6
obutonde 6
okujja 6
okukozesa 6
okukuba 6
olina 6
omuli 6
ossa 6
rev 6
school 6
ssaako 6
ssekabembe 6
ssekandi 6
waliwo 6
yayongeddeko 6
yenna 6
yonna 6
yunivaasite 6
ze 6
zonna 6
3 5
9 5
abasaba 5
akabenje 5
ali 5
aliko 5
amazzi 5
and 5
athletics 5
atyo 5
ayogerako 5
bakozesa 5
bannayuganda 5
banne 5
batuuze 5
bayita 5
bbanka 5
bodaboda 5
budde 5
covid 5
diviizoni 5
dr 5
ebikozesebwa 5
ebimu 5
ebinnya 5
ebiri 5
empisa 5
endala 5
enjiri 5
essaawa 5
eyali 5
fc 5
fuso 5
gubadde 5
henry 5
jjuuko 5
joseph 5
juma 5
kakooza 5
kaweefube 5
kcb 5
kibadde 5
kifo 5
kisiibo 5
kituufu 5
kkono 5
kkwaaya 5
kololo 5
kwa 5
kyazze 5
ldc 5
luguudo 5
ly 5
mabaati 5
masanafu 5
mayanja 5
mbarara 5
minisitule 5
mulimu 5
mw 5
mwezi 5
nabo 5
nakato 5
nasur 5
national 5
nnamunkanga 5
obujjanjjabi 5
obw 5
ogusoose 5
okuddaabiriza 5
okujjukira 5
okusitula 5
okuvaayo 5
oludda 5
olwa 5
omubeezi 5
omuzannyo 5
pulezidenti 5
puliida 5
south 5
ssaawa 5
tibesigwa 5
ttaka 5
yadde 5
yasiimye 5
yekka 5
00 4
000 4
11 4
17 4
28 4
ababaka 4
abakozesa 4
abakugu 4
abakulira 4
abaserikale 4
abasuubuzi 4
abatunda 4
abazannyi 4
abbey 4
abeetabye 4
agenda 4
akawungeezi 4
alaze 4
allah 4
amalala 4
amateeka 4
among 4
aronda 4
asimbiddwa 4
asomerwa 4
atongozza 4
ayagala 4
ayingira 4
azze 4
baana 4
baategese 4
babeera 4
bakola 4
bakozi 4
baryomunsi 4
basimbuddwa 4
bazze 4
bbanga 4
benon 4
bingi 4
bintu 4
bitongole 4
boda 4
bukulembeze 4
byonna 4
clinic 4
club 4
cup 4
dduyiro 4
ddwaaliro 4
ddwaliro 4
ddyo 4
ebifaananyi 4
ebya 4
ekiseera 4
ekisiibo 4
ekitiibwa 4
emiti 4
emitwalo 4
eng 4
enjigiriza 4
enkuba 4
ennungi 4
ennyimba 4
esangibwa 4
eza 4
family 4
gen 4
gino 4
gyonna 4
hajji 4
iii 4
john 4
kano 4
kasangati 4
katikkiro 4
kikoni 4
kiwanuka 4
kkiraabu 4
limanda 4
lwanga 4
lyabwe 4
macho 4
mazzi 4
mbalirira 4
mbiro 4
mi 4
mirimu 4
mukama 4
mukolo 4
muliro 4
musomo 4
mwannyina 4
nssf 4
ntambi 4
nup 4
obujjanjabi 4
obulamu 4
obusiraamu 4
obusobozi 4
obuwumbi 4
of 4
ogubadde 4
oguwedde 4
okufaayo 4
okumala 4
okusinziira 4
okusomesa 4
okusooka 4
okutaasa 4
okuyita 4
okwetooloola 4
okweyimirira 4
okwogera 4
omukolo 4
omuserikale 4
omutendesi 4
paul 4
road 4
russia 4
shadir 4
si 4
solomon 4
ssekonda 4
ssemateeka 4
ssewungu 4
tayebwa 4
tebalina 4
tewali 4
university 4
wadde 4
wiiki 4
yakola 4
yeebazizza 4
27 3
4 3
5 3
aanya 3
abaami 3
ababadde 3
ababiri 3
abafumbo 3
abakenuzi 3
abakungu 3
abalina 3
abalyake 3
abasinga 3
abasoba 3
abatalina 3
abayimbi 3
abazze 3
abdullah 3
addukira 3
ag 3
agenze 3
agnes 3
ajja 3
akabonero 3
akalulu 3
akeezimbira 3
alabudde 3
alagidde 3
alimu 3
amaaso 3
amaguzi 3
amala 3
amayuuni 3
annyonnyole 3
april 3
arua 3
asiimye 3
asindikiddwa 3
atalina 3
attermo 3
atwala 3
avunaanyizibwa 3
awamu 3
ayota 3
baasazeewo 3
baasoose 3
babba 3
babiri 3
bakulembeddwa 3
baminisita 3
baminista 3
bamusigansimbi 3
bannalotale 3
basabiddwa 3
basiraamu 3
basobole 3
basomesa 3
batandise 3
bavubuka 3
bawadde 3
baweereddwa 3
beeyambisa 3
betty 3
binnya 3
biology 3
bokka 3
buganda 3
bukadde 3
bungi 3
buno 3
busobozi 3
buwumbi 3
bwabwe 3
bwaise 3
bwereere 3
byekwaso 3
byogeddwa 3
byuma 3
cape 3
central 3
county 3
david 3
dda 3
ddiini 3
ddoola 3
dunstan 3
ebifo 3
ebisomesebwa 3
ebyamaguzi 3
eddagala 3
egenda 3
eid 3
ekigendererwa 3
ekikula 3
ekisangibwa 3
ekitongole 3
ekizibu 3
ekyo 3
emabega 3
emitendera 3
empeera 3
engoye 3
enguzi 3
enkulu 3
ennanga 3
ennongoosereza 3
enteekateeka 3
entuufu 3
enzigi 3
erinnya 3
esatu 3
essuubi 3
ewa 3
ewozesa 3
facebook 3
fine 3
geoffrey 3
gumu 3
gyabwe 3
high 3
jackson 3
july 3
kaguli 3
kaitesi 3
kakungulu 3
katende 3
katosi 3
kenneth 3
kibeera 3
kibinja 3
kibuga 3
kibuyaga 3
kigenda 3
kijja 3
kimu 3
kiri 3
kirungi 3
kiteetikka 3
kityo 3
kkampuni 3
kubba 3
kusalawo 3
kusomesa 3
kyerere 3
lawrence 3
linda 3
looni 3
lt 3
lubaga 3
lugolobi 3
lulwana 3
lunaku 3
lwakusatu 3
magumba 3
maneja 3
march 3
martins 3
mateeka 3
matsika 3
mazuukira 3
misango 3
misomo 3
mituba 3
mmotoka 3
mpaka 3
mukenenya 3
mulago 3
mulamu 3
mulundi 3
munda 3
munne 3
musipi 3
mutabani 3
mwaka 3
mwoyo 3
myaka 3
najjeera 3
namujju 3
nkobazambogo 3
nnamba 3
nnamwandu 3
nnyingi 3
noah 3
nrm 3
nsubuga 3
ntake 3
nteekateeka 3
ntege 3
nzigi 3
obujulizi 3
obusoba 3
obuvunaanyizibwa 3
obuzibu 3
ogujja 3
okubaako 3
okubongera 3
okudda 3
okudduukirira 3
okugenda 3
okukung 3
okukuuma 3
okukwata 3
okulonda 3
okulongoosa 3
okumanya 3
okumanyisa 3
okunnyikiza 3
okunoonyereza 3
okusaba 3
okusiibulula 3
okusinga 3
okusobola 3
okusobozesa 3
okusoma 3
okutendeka 3
okutendekebwa 3
okuwulira 3
okuzimbira 3
okw 3
okwanguyiza 3
olulwana 3
olunaku 3
oluwaabi 3
omubuulizi 3
omukisa 3
omukugu 3
omukulu 3
omumyuka 3
omunda 3
omusawo 3
omuvubuka 3
omuwandiisi 3
omuzimbi 3
omwami 3
omwana 3
pdm 3
proheli 3
rdc 3
rotary 3
sesemat 3
so 3
spinners 3
ssaabadinkoni 3
ssempala 3
ssenfuma 3
sserunkuma 3
ssomero 3
town 3
tumwiine 3
uae 3
ven 3
waabwe 3
waggulu 3
wakiso 3
walugembe 3
wampeewo 3
wilson 3
wooteeri 3
world 3
yaakava 3
yabba 3
yagibba 3
yamenya 3
yasabye 3
yasangibwa 3
12 2
13 2
150 2
1992 2
2 2
2021 2
23 2
25 2
30 2
300 2
500 2
6 2
7 2
80 2
800 2
abaabaddeyo 2
abaafunye 2
abaakwatiddwa 2
abaali 2
ababbooda 2
abaffamire 2
abagenda 2
abalambuzi 2
abanaku 2
abanoonyereza 2
abanoonyerezebwako 2
abasaale 2
abasiibi 2
abatanneetuuka 2
abatendesi 2
abatwala 2
abawagizi 2
abazadde 2
abazimba 2
abbamu 2
abuuliridde 2
abuuza 2
abyogedde 2
addukanya 2
afrika 2
aga 2
agaali 2
agamu 2
ageetabye 2
ago 2
ak 2
akabinkano 2
akagenda 2
akalondoola 2
akebera 2
akiikiridde 2
akiikirira 2
akimanyi 2
akkaatiriza 2
akoze 2
akutte 2
alaajanidde 2
alabika 2
alaga 2
alagira 2
alangiridde 2
albert 2
alex 2
amaanyi 2
amagye 2
amaloboozi 2
amannya 2
amannyo 2
amanyiddwa 2
amasimu 2
amawanga 2
amayumba 2
amusomedde 2
amutegeeza 2
andrua 2
ankole 2
annyonnyodde 2
asambazze 2
asiibula 2
asiima 2
asiimwe 2
asinzidde 2
asuubiza 2
atakkaanya 2
atenderezza 2
atontoma 2
august 2
awa 2
awangaalira 2
awatali 2
aweze 2
awuliriza 2
ayongedde 2
baabadde 2
baagala 2
baakuvunaanibwa 2
baamusuula 2
baasimbye 2
baategeezezza 2
babaddenga 2
babawa 2
baddusi 2
bafunye 2
bagambye 2
bagenderedde 2
bajja 2
bakitte 2
bakung 2
bakwata 2
balabuddwa 2
balala 2
baleese 2
bamale 2
bank 2
bannamateeka 2
banoonyerezebwako 2
banyumirwa 2
bapooca 2
basazeewo 2
baserikale 2
basibe 2
basiimye 2
basuubuzi 2
bategeeza 2
bawala 2
bbale 2
bbiri 2
bbulooka 2
beewale 2
bibiina 2
bigambibwa 2
bikonde 2
bimu 2
binywezeddwa 2
birimu 2
bisenge 2
bizinensi 2
bombers 2
bongere 2
brandon 2
bubaka 2
buddo 2
bugema 2
bugingo 2
bugwanjuba 2
bujulizi 2
bulabirizi 2
bulemu 2
bulumi 2
bulwadde 2
bumala 2
bumanyirivu 2
busia 2
butale 2
buvuddeko 2
bwetaavu 2
bwogi 2
byakulya 2
byalo 2
byobulamu 2
byokwerinda 2
charles 2
choir 2
city 2
college 2
cranes 2
crossers 2
curriculum 2
development 2
dp 2
ebalirirwamu 2
ebbanga 2
ebeera 2
ebibbe 2
ebigezo 2
ebikolwa 2
ebipya 2
ebirowoozo 2
ebisenge 2
ebisomooza 2
ebisookerwako 2
ebitali 2
ebituli 2
ebiyitiridde 2
ebyenjawulo 2
ebyogerwa 2
ebyokwerinda 2
eddaala 2
eggombolola 2
ekibinja 2
ekibira 2
ekibuga 2
ekigenda 2
ekikomera 2
ekitundu 2
ekkanisa 2
ekola 2
ekyagenda 2
ekyokulabirako 2
emboozi 2
emiriraano 2
emyezi 2
ena 2
enguumi 2
enkalu 2
enkomeredde 2
enkulaakulana 2
enkumbi 2
enkya 2
enkyukakyuka 2
ennamba 2
ennwanyi 2
ennyangu 2
ensobi 2
ereese 2
erisooka 2
ery 2
erya 2
esobola 2
essomo 2
etaddewo 2
etandise 2
ettaka 2
ettu 2
ettwale 2
ewedde 2
eyafudembye 2
eyambako 2
eyawummula 2
eyazze 2
eyebyenjigiriza 2
eyo 2
ezigwanidde 2
ezimu 2
ezisembye 2
ezisoba 2
ezo 2
february 2
foundation 2
fund 2
guli 2
gyabadde 2
gyokka 2
harriet 2
hejnu 2
horizon 2
id 2
international 2
iv 2
ivan 2
jambula 2
jane 2
jc 2
jinja 2
johnson 2
jordan 2
joyce 2
juliet 2
julius 2
june 2
kaawa 2
kaducu 2
kagwawo 2
kakodyo 2
kaloli 2
kalungu 2
kamugisha 2
kanisa 2
kansanga 2
kasaija 2
kasenge 2
kasooli 2
kati 2
kattikiro 2
kayunga 2
ki 2
kigezi 2
kikajjo 2
kikko 2
kikolebwa 2
kikooza 2
kira 2
kisaawe 2
kisembo 2
kitebe 2
kitiibwa 2
kits 2
kiva 2
kiyambeko 2
kizaala 2
kkanisa 2
kubulankanya 2
kudduka 2
kukendeeza 2
kukola 2
kukosa 2
kukuba 2
kulonda 2
kulwanyisa 2
kusaba 2
kutonnya 2
kwongera 2
kyabwe 2
kyagulanyi 2
kyakusatu 2
kyali 2
kyandibadde 2
kyelima 2
kyengera 2
kyesirikidde 2
kyo 2
kyobe 2
kyongera 2
laama 2
lc 2
lubega 2
lugenda 2
luggya 2
lukung 2
lumu 2
luwero 2
luzungu 2
lwokaano 2
lwokutaano 2
lwomukaaga 2
lye 2
makubo 2
malwaliro 2
mannyo 2
mary 2
masannyalaze 2
masekkati 2
masjid 2
masomo 2
mateeriyo 2
matia 2
matovu 2
matu 2
mawerere 2
mayumba 2
mbabazi 2
mbeeya 2
mbi 2
mia 2
middleweight 2
miguwa 2
mitendera 2
mmeeya 2
morley 2
mpaaba 2
mpisa 2
mugerwa 2
mugezi 2
mugisha 2
mulamwa 2
muluka 2
munnayuganda 2
musanvu 2
musingi 2
mutaasa 2
mutuba 2
mutuuze 2
muwonge 2
muyingo 2
muyomba 2
muzamiru 2
muzigo 2
muzimbi 2
mwalo 2
myala 2
myezi 2
nabatizibwa 2
nabbanja 2
nakawuki 2
nakibinge 2
nakimu 2
nakitokota 2
nakwero 2
namanda 2
namawejje 2
nanziri 2
nateete 2
nathan 2
ndala 2
ndwadde 2
nelson 2
netball 2
new 2
ngalo 2
nguudo 2
nju 2
nnannyini 2
nninga 2
north 2
nsaasaanya 2
nsalessale 2
nsi 2
ntambuza 2
obukugu 2
obulabirizi 2
obulala 2
obuli 2
obululu 2
obutamanya 2
obuwanguzi 2
obuweereza 2
obuyisi 2
obwa 2
obwasseruganda 2
obwereere 2
ogumuvunaanibwa 2
ogwabatwala 2
oija 2
okolamu 2
okubadde 2
okubaka 2
okubangula 2
okubawa 2
okubawaayo 2
okubiri 2
okuddukira 2
okufaananako 2
okugaba 2
okuganyulwa 2
okuganza 2
okugeza 2
okugwa 2
okujjumbira 2
okukkakkana 2
okukomya 2
okukwatibwa 2
okulambulanga 2
okulinda 2
okumaliriza 2
okumenya 2
okumpi 2
okumukuba 2
okumusindika 2
okumutwala 2
okumweyimirira 2
okunyaga 2
okunyweza 2
okusaala 2
okusangibwa 2
okusenda 2
okusigala 2
okusimba 2
okusimbibwa 2
okusitukira 2
okussa 2
okutambuza 2
okutandika 2
okutumbula 2
okutuukiriza 2
okutwala 2
okuwaayo 2
okuwandulwa 2
okuwenja 2
okuwera 2
okwabadde 2
okwanga 2
okwenyigira 2
okwetaba 2
okwetereeza 2
okwewandiisa 2
okwewozaako 2
okweyambisibwa 2
okweyimirirwa 2
okwonooneka 2
oli 2
olukiiko 2
olutuula 2
omuceere 2
omuggunzi 2
omukazi 2
omukozi 2
omukubiriza 2
omukwano 2
omukyala 2
omulambo 2
omulwadde 2
omunene 2
omupiira 2
omuvubi 2
omuyizi 2
omuzannyi 2
omuze 2
omwezi 2
osobola 2
pakasa 2
pathogens 2
patrick 2
pookino 2
pulojekiti 2
ronald 2
rose 2
s 2
samuel 2
sandra 2
sarah 2
science 2
sente 2
she 2
sipiika 2
sitetimenti 2
slate 2
special 2
ss 2
ssebalunzi 2
ssegirinya 2
ssemwanje 2
sss 2
ssukaali 2
sudan 2
sukhoi 2
sulaiman 2
tagenda 2
tebajja 2
tebamanyi 2
tegasobola 2
tekinologiya 2
the 2
title 2
tonziriranga 2
trade 2
tteeka 2
tumwine 2
twesigye 2
unit 2
updf 2
wabweru 2
wadhuba 2
waffe 2
wandera 2
wantoni 2
west 2
wiikendi 2
wilberforce 2
william 2
yaakamala 2
yaakatuuka 2
yafuna 2
yakwatibwa 2
yamubuuzizza 2
yamusindise 2
yandibadde 2
yannyonnyodde 2
yasaliddwa 2
yasimbibwa 2
yasinzidde 2
yavuganyizza 2
yeeweze 2
yesu 2
