mu 928
num 826
nti 517
ku 407
ne 300
ebintu 254
nga 236
bayibuli 223
ensi 172
bannassaayansi 150
no 138
era 137
gye 137
ekyo 135
bye 128
emu 126
ebyo 123
na 117
bwe 101
engeri 99
nsi 98
olubereberye 98
semmelweis 97
yali 96
ebiri 93
ssaayansi 91
abantu 89
kya 87
obwengula 86
bya 85
katonda 79
nnya 79
waliwo 74
nnyo 73
bo 72
bwengula 72
abakazi 71
egamba 67
okuba 66
oluvannyuma 66
nge 65
naye 64
omu 64
abiri 62
bagamba 62
ebya 61
woodi 61
bbiri 60
ekirwadde 59
byatondebwa 58
kye 55
ekya 54
abaali 53
ddala 52
ekimu 51
ekiseera 51
emyaka 50
gya 49
kikumi 49
oba 49
tegamba 47
ya 47
ttaano 45
mukaaga 43
kkumi 42
nnaku 42
butonde 41
eggulu 41
obulungi 41
bubiri 40
byajjawo 40
kiba 40
olwa 40
ekika 39
embuto 39
kiseera 39
byonna 38
gu 38
musanvu 38
abasawo 37
bazudde 37
buli 37
bulungi 37
ekitangaala 36
kusooka 36
lukumi 36
lwa 36
eza 35
ga 35
we 35
kati 34
ngeri 34
obulamu 34
aba 33
ebiramu 33
ekyali 33
ennyanyaagize 33
lwaki 32
ssatu 32
abamu 31
bino 30
ekitabo 30
gumu 30
mutwalo 30
butondebwa 29
ali 28
bafa 28
etubuulira 28
eya 28
kyali 28
bangi 27
bingi 27
ebirala 27
enjawulo 27
ensolo 27
wagamba 27
eyo 26
okunoonyereza 26
abalala 25
abanoonyereza 25
byokka 25
ebigambo 25
kyonna 25
tebisobola 25
abaana 24
bimu 24
ebitali 24
ekiyitibwa 24
essaawa 24
lowooza 24
mazzi 24
mwe 24
amaanyi 23
ennyo 23
maanyi 23
okumanya 23
omuwendo 23
basoma 22
eraga 22
kwe 22
nsonga 22
olwekyo 22
abazaala 21
ba 21
bakazi 21
ebibuuzo 21
enkola 21
okubiri 21
tewali 21
yazuula 21
zeero 21
baali 20
bakkiriza 20
bintu 20
bukadde 20
ekintu 20
ekyokulabirako 20
kakaaga 20
kifo 20
kinaana 20
okufuna 20
univ/art 20
univ_sqr_xl 20
url 20
kukyukamuko 19
nfaanana 19
okutonda 19
olwo 19
yaabyo 19
zokka 19
bibaddengawo 18
biyinza 18
byasooka 18
ebika 18
ebyennyanja 18
ebyuma 18
ejjudde 18
ekigambo 18
endwadde 18
ki 18
obuwuka 18
okusinziira 18
okutondebwa 18
okutuuka 18
olufu 18
omukaaga 18
azudde 17
ddwaliro 17
kiri 17
kubanga 17
leero 17
lunaana 17
ngo 17
okusinga 17
tebyatondebwa 17
ye 17
abalalaweereza 16
bonna 16
eno 16
ensonga 16
eri 16
jpg 16
kunoonyereza 16
lubereberye 16
olowooza 16
omuntu 16
abavuzi 15
ayitibwa 15
baagala 15
bantu 15
esooka 15
ezo 15
ignaz 15
kigamba 15
kulabibwa 15
mingi 15
nkumi 15
obusirikitu 15
obutonde 15
okuzuula 15
omwezi 15
tebategeera 15
wa 15
alina 14
baabwe 14
baleme 14
batyo 14
bisobola 14
bizuuliddwa 14
bwa 14
ebiseera 14
kufiirwa 14
olunaku 14
oluusi 14
wansi 14
yakuwa 14
banoonyereza 13
bikwatagana 13
ekwatagana 13
ekyewuunyisa 13
enjigiriza 13
eyali 13
gamba 13
obo 13
obukakafu 13
okutegeera 13
otya 13
agamba 12
bannasayansi 12
bina 12
bujjuvu 12
bukolamu 12
eddagala 12
emirambo 12
enna 12
guno 12
ka 12
mbeera 12
mirambo 12
mubiri 12
muntu 12
obuleeta 12
obutoffaali 12
okubaawo 12
omubiri 12
omututumufu 12
oyo 12
tebiyinza 12
vi 12
wayise 12
weereza 12
yagamba 12
abo 11
amerika 11
ana 11
biba 11
biri 11
ebitundu 11
emmotoka 11
erabika 11
gwali 11
gyokka 11
kitundu 11
kiviirako 11
kyokka 11
magazini 11
mulimu 11
obusawo 11
obuzaalisa 11
okumala 11
okusobola 11
okusoma 11
wadde 11
yatandika 11
yawandiika 11
akasingayo 10
asatu 10
ate 10
atuganyulamu 10
ayogerwako 10
baatendekerwanga 10
bakola 10
bakoma 10
bwali 10
bwonna 10
enkulaakulana 10
eyogera 10
gwa 10
gwe 10
kityo 10
kolletschka 10
kutegeera 10
mitwalo 10
mukwano 10
munnassaayansi 10
obutono 10
obuzibu 10
okuddamu 10
okukola 10
omuwandiisi 10
owa 10
oyinza 10
singa 10
tebikwatagana 10
wakati 10
waliyo 10
yakola 10
za 10
abagamba 9
alex 9
ataano 9
atonda 9
baabaawo 9
baba 9
balyoka 9
batondebwa 9
bbanga 9
bbulu 9
bibaddewo 9
bikkiriziganya 9
biraga 9
birina 9
biryoka 9
britannicakigamba 9
bubi 9
buwanvu 9
byokulabirako 9
ebikwatagana 9
ebinyonyi 9
ebiwuka 9
efaanana 9
ekinoonyereza 9
ekitongole 9
ekitonotono 9
ekozesa 9
ekwata 9
encyclopædia 9
enjuba 9
enkyukakyuka 9
ennyangu 9
ennyonnyola 9
ensibuko 9
entandikwa 9
erabikamu 9
eriyitibwa 9
erya 9
eryetoolodde 9
essuula 9
etegeerekeka 9
etya 9
eyaliwo 9
eyatonda 9
ezoogerwako 9
hospital 9
hungary 9
kiki 9
kikwatagana 9
kimu 9
kintu 9
kiraga 9
kiwanvu 9
kiyinza 9
kubikabyazo 9
kulaga 9
kulunakuyakuwaakatonda 9
kutuuka 9
kwaliwo 9
kyagamba 9
kyandiba 9
kyasookera 9
kyenkana 9
kyennyini 9
lirabika 9
lubereberyekatonda 9
lukalu 9
lumu 9
luvannyuma 9
luziyiza 9
lwaggwaawo 9
lwe 9
lwenda 9
makulu 9
mazima 9
mitendera 9
munaana 9
muolubereberye 9
mwenda 9
nabo 9
njereere 9
nkyukakyuka 9
obudde 9
okubaamu 9
okubaamuko 9
okulabibwa 9
okutegeeza 9
okwagala 9
okwakakolebwa 9
olwali 9
tebyajjawo 9
teginnatuuka 9
tekisobola 9
tekwatagana 9
teraga 9
tesobola 9
tewaaliwo 9
tulabye 9
waaliwo 9
waayitawo 9
walaga 9
yaakatondebwa 9
yamala 9
yatonda 9
yatonderako 9
yeetabuddetabudde 9
zaatondebwa 9
ze 9
zibaawo 9
ago 8
baafanga 8
bakuuma 8
bayibulikya 8
date 8
eddamubayibuli 8
eddamuddala 8
ekifaananyi 8
emirundi 8
etagamba 8
kuba 8
kyakubibwa 8
linnya 8
lya 8
lye 8
mutonzi 8
obuyonjo 8
okubwatuka 8
okukkiriza 8
pulintaweereza 8
robert 8
yakakasa 8
abasajja 7
agali 7
amazzi 7
bakyalemereddwa 7
bamaama 7
bigambo 7
bitondebwa 7
bumaze 7
byafaayo 7
byatonderwa 7
ekibuuzo 7
ekitta 7
ennyumba 7
kitono 7
malwaliro 7
mumalirivu 7
ndi 7
okulowooza 7
okumalawo 7
sindika 7
yajjawo 7
zikola 7
abaabaanga 6
abaabanga 6
abaateranga 6
abaayamba 6
abababulooni 6
abafiripi 6
abajulirwa 6
abayisirayiri 6
addayo 6
agalimu 6
agasangibwa 6
agasika 6
akkiriza 6
amagi 6
amakulu 6
amangu 6
ani 6
anywerera 6
ataddewo 6
baafiirwa 6
baakebererwanga 6
baakwasanga 6
baava 6
baazaaliranga 6
bakimanyi 6
bazaala 6
bazze 6
bekitaboencyclopædia 6
bikwataganamu 6
britannicabwe 6
britannicatekiwagira 6
bukakanyavu 6
bukozesaamu 6
butamanya 6
bwabwe 6
bwammwe 6
bweyawulamu 6
bweyoleke 6
byabwe 6
cause 6
childbed 6
concept 6
ebikulu 6
ebiriisa 6
ebiyitibwaproteins 6
ebyafaayo 6
ebyetaagibwa 6
eddembe 6
egisukka 6
ekikyasinzeeyo 6
ekiseerakiki 6
ekitaasanyusa 6
ekyavaamu 6
emabega 6
encyclopedia 6
enkobe 6
ennaku 6
erikozesebwa 6
ezireetebwa 6
fever 6
gabizza 6
gakusika 6
gakuzza 6
gayambamu 6
gisaanidde 6
gravity 6
gwakendeerera 6
gwetooloola 6
gyali 6
kibuga 6
kifundikira 6
kikwata 6
kiwa 6
kkubo 6
kubitwala 6
kugamba 6
kukendeereza 6
kulaba 6
kumanyibwa 6
kumpi 6
kuva 6
kuvumbula 6
kyakakasibwa 6
kyayamba 6
kyenda 6
lyagwo 6
mugaso 6
mukama 6
mulundi 6
mumateeka 6
musa 6
musingi 6
mutono 6
ngalo 6
nkaaga 6
nkola 6
nsolo 6
oboolyawo 6
obukwata 6
obulabe 6
obulagirizi 6
obuli 6
obutagoberera 6
obutali 6
obutawaba 6
obuuka 6
of 6
oguli 6
okugatta 6
okujjanjaba 6
okukeberebwa 6
okukitegeera 6
okukkiririzaamu 6
okukolera 6
okukulira 6
okukwatibwamu 6
okulowoozanti 6
okunaabanga 6
okutta 6
okuva 6
okuyamba 6
okwekebejja 6
okwekenneenya 6
okwesalirawo 6
omujiji 6
omukuumi 6
pest 6
rochus 6
st 6
tebaasanyukira 6
tebaasooka 6
tebamanyidde 6
tebannagenda 6
tebannakwata 6
tebannategeerera 6
tebeekebejjanga 6
temanyiddwa 6
tufuba 6
tukukubiriza 6
tuli 6
wiiki 6
yagobwa 6
yakulamu 6
yalagira 6
yalondebwa 6
yawa 6
yayamba 6
abafirosoofo 5
abaganyulwa 5
abagezi 5
abakkiriza 5
abakozesa 5
abangi 5
abatambula 5
abatutumufu 5
abeesaawo 5
aczel 5
aga 5
aganywa 5
akasanduuko 5
akasengejja 5
akayitibwa 5
akolera 5
alemererwa 5
amadiini 5
amalirira 5
amir 5
anaatera 5
aristotle 5
asobodde 5
atomu 5
atuganyudde 5
awaba 5
awakanya 5
ayogera 5
baakola 5
babayibuli 5
bafiira 5
baganyulwa 5
bakkiriziganya 5
balina 5
balyoke 5
bamala 5
bandimuzudde 5
basobole 5
batannamanya 5
batayinza 5
bateebereza 5
bategedde 5
batya 5
bawunzike 5
bayizeebikwata 5
beeyongedde 5
bifo 5
bifuukafuuka 5
bikozesa 5
bikozesebwamu 5
bikuganyula 5
binaabyo 5
birungi 5
biviirako 5
bufaananako 5
bufuusa 5
bukakafu 5
bukodyo 5
bukozesebwa 5
bulaaya 5
bulaga 5
bulumi 5
bulwadde 5
bungereza 5
butaka 5
butuufu 5
buva 5
byali 5
byandituleetedde 5
d 5
ddi 5
ebbiri 5
ebiba 5
ebikolwa 5
ebimu 5
ebisinga 5
ebitabo 5
ebitalabika 5
ebivudde 5
ebiyitibwasatellitesebiyamba 5
egisinga 5
ekisoboka 5
ekituufu 5
ekiwundu 5
ekyabaawo 5
ekyamutta 5
ekyatta 5
ekyayamba 5
emitendera 5
emmeeri 5
empanvu 5
emyezi 5
enkuluze 5
ennyonyi 5
eriwo 5
eryo 5
etaano 5
ewa 5
ewala 5
eyagamba 5
eyamba 5
eyayita 5
eyitibwaglobal 5
ezaali 5
eŋŋendo 5
gaba 5
gakkiriza 5
gatya 5
guba 5
haiti 5
jakob 5
kabeere 5
kakensa 5
kampuni 5
kantu 5
kasobola 5
katoffaali 5
kika 5
kimuviirako 5
kino 5
kirwadde 5
kisse 5
kitabo 5
kitta 5
kituyamba 5
kiva 5
kiviireko 5
kristendomu 5
kubinoonyerezaako 5
kubuusabuusa 5
kugezesa 5
kugwa 5
kukozesebwa 5
kukwatibwa 5
kumanya 5
kuzuulira 5
kwabwe 5
kwongera 5
kyanakuwaza 5
kyandibadde 5
laba 5
lipoota 5
magezi 5
magye 5
makanisa 5
makkati 5
makyafu 5
martin 5
mirundi 5
munne 5
musajja 5
musawo 5
musisi 5
muwendo 5
mwaka 5
mwalimu 5
naawe 5
nnyingi 5
nukiriya 5
obubonero 5
obujjanjabi 5
obulaga 5
obulimba 5
obungi 5
obusengejja 5
obusobozi 5
obutakkiririza 5
obutyabaga 5
obwaguuga 5
obwo 5
odical 5
okubaayo 5
okubuusabuusa 5
okudibya 5
okufuba 5
okujja 5
okukendeeza 5
okukirwanyisa 5
okulaba 5
okupima 5
okusengejja 5
okuyigirizibwa 5
okuyita 5
okwetegereza 5
okwo 5
olaba 5
oli 5
omulambo 5
omulembe 5
omusomesa 5
oyitira 5
rees 5
semmelweisnaye 5
steven 5
systemgps 5
taliiyo 5
tayinza 5
tebakkiririza 5
tebalibitegeera 5
tebannabitegeera 5
tekontana 5
tekyasoboka 5
tetusobola 5
thomoluvannyuma 5
towulirangako 5
tulabe 5
tumanyi 5
tutamanyi 5
waggulu 5
wagudde 5
wayinza 5
weinberg 5
wennyini 5
yafa 5
yakiraba 5
yakozesa 5
yaliko 5
yanoonyereza 5
yasoma 5
yategekebwa 5
yatondebwa 5
yeekebejja 5
yokka 5
zaatandika 5
ziyita 5
atuganyulamuluganda 4
b 4
batasobola 4
binoebibuuzo 4
ebiwuniikiriza 4
eddamukatonda 4
emiti 4
enkulu 4
ennyanyaagizeluganda 4
enoengeri 4
eyagikola 4
kibira 4
kukola 4
mutonzilugandabayibuli 4
nkiraba 4
nnakoma 4
obukadde 4
omulala 4
semmelweislugandaignaz 4
ssaayansissaayansi 4
ttaka 4
wayita 4
yeetaaga 4
zifa 4
zimala 4
zuukukaaristotleenjigiriza 4
abadde 3
abatakkiriza 3
abayibuli 3
abebbulaniya 3
abeekenneenya 3
afuna 3
amyuka 3
atabuddwa 3
atuganyulamuomunaala 3
ayinza 3
baabayigiriza 3
babayigiriza 3
baganyuddwa 3
bakikkiriza 3
bakiwaako 3
bakyebuuza 3
balala 3
batera 3
bazaalira 3
bigamba 3
bikikakasa 3
biseera 3
bubeewuunyisa 3
buda 3
budapest 3
bulamu 3
bulijjo 3
busawo 3
cicadane 3
diguli 3
e 3
ebikwata 3
ebimatiza 3
egambazuukukabayibuli 3
ekikola 3
ekola 3
ekyakuleetawo 3
enkula 3
ennyanyaagizezuukuka 3
eyabireetera 3
eyagizimba 3
eyakola 3
eziyitibwaperi 3
general 3
ggwe 3
kikikyewandikoze 3
kikola 3
kikulu 3
kiruwa 3
kitakola 3
kitategeerekeka 3
kitegeeza 3
kwawukana 3
kyennyamiza 3
maaso 3
masinzizo 3
nnyumba 3
nze 3
obuntu 3
oku 3
okugamba 3
okukiwakanya 3
okukula 3
okulowoozaakobayibuli 3
okutuusa 3
okwanguyiriza 3
okwogera 3
omukulu 3
omulimu 3
omunaala 3
omusawo 3
s 3
semmelweiszuukukaignaz 3
ssomero 3
tamanyiddwa 3
tayagala 3
tebamanyi 3
tebulina 3
tekikola 3
thom 3
tuba 3
tusobola 3
wabaawo 3
wandimaze 3
yabitondakye 3
yafuna 3
yagambye 3
yagizimba 3
yalaba 3
yaleetawo 3
yasomera 3
yazaalibwa 3
yeewuunyisa 3
yunivasite 3
zuukuka 3
zuukukabayibuli 3
zuukukaignaz 3
abalalabazadde 2
abaruumi 2
abatwalibwa 2
abayivu 2
afubye 2
aganaavaamu 2
agawaawaaza 2
akafaananyi 2
akaseera 2
akatono 2
akugambye 2
amagezi 2
amaloboozi 2
amatu 2
annyonnyola 2
antarctica 2
anthony 2
awamu 2
baabagamba 2
bakkirizaabantu 2
bakkiriziganyaako 2
bakubagana 2
bakubira 2
bamanyi 2
bamaze 2
bameka 2
bange 2
bannaddiini 2
baŋŋamba 2
be 2
bigwa 2
bikola 2
bikolamu 2
bikulira 2
binozuukukaalhazenoyinza 2
binuuna 2
bisangibwa 2
bisenge 2
bisima 2
biwuka 2
biyingira 2
bonnaabalala 2
bubobbya 2
bwino 2
bwo 2
byewandiika 2
byo 2
cicada 2
ebaawo 2
ebifaanana 2
ebiika 2
ebinnyanyaagize 2
ebisenge 2
ebitegeerekeka 2
ebito 2
ebyaggattibwa 2
eddamu 2
egitali 2
egiwera 2
ekibaawo 2
ekikugu 2
ekisangibwa 2
ekiyitibwaperi 2
ekukubiriza 2
ekyamufuula 2
emirandira 2
emirimu 2
empawa 2
enkazi 2
ennyinnyonnyola 2
enokyajjawo 2
ensajja 2
enzige 2
erasmuserasmus 2
erimu 2
erina 2
eyabakola 2
eyitibwanature 2
gaalula 2
gatonnya 2
gimu 2
gulabika 2
gulyoka 2
gwaffe 2
gwen 2
gwewuunyisa 2
gyabyo 2
gyekolamu 2
gyetema 2
jpgg 2
jpgw 2
julia 2
kaseera 2
katono 2
ke 2
kennyini 2
kibe 2
kibiina 2
kiggwaako 2
kinowadde 2
kirina 2
kituufu 2
kitya 2
kizimbe 2
kukitegeera 2
kukolamu 2
kumala 2
kungi 2
kyewuunyisa 2
kyeyoleka 2
lukaaga 2
lup 2
mba 2
mbagirawo 2
mbeeramu 2
miti 2
mukyamu 2
mututumufu 2
muzigo 2
ndowooza 2
nkazi 2
nkirabirawo 2
nkyamu 2
ntono 2
ntonotono 2
ntunuulira 2
nzikiririze 2
obadde 2
obutiti 2
obuyinza 2
ogu 2
oguddako 2
oka 2
okubaako 2
okuggyako 2
okugibuusabuusa 2
okukiraba 2
okukozesa 2
okulabika 2
olowoozandowooza 2
omugaso 2
omutonzi 2
omutwe 2
osaanidde 2
osanga 2
osinziira 2
otambula 2
otyo 2
richard 2
saalina 2
ssemazinga 2
tegunnalabika 2
teresa 2
tetukitegedde 2
tosaanidde 2
tusaanidde 2
twandikkirizza 2
waabaddewo 2
wandikikkirizza 2
wandikkirizza 2
wandirowoozezza 2
weeziri 2
yasamukidde 2
zeegatta 2
zeeyubula 2
ziba 2
zibiika 2
zibuuka 2
zifubutuka 2
zijja 2
zikula 2
zikuze 2
zimaze 2
zirabise 2
zizaala 2
zonna 2
zuukukaalhazenoyinza 2
zuukukadesiderius 2
