num 398
mu 363
yesu 303
ku 226
nga 142
na 137
era 105
bo 100
ne 98
bwe 84
nti 74
no 71
katonda 69
naye 63
abaana 59
omusajja 59
abantu 56
kkumi 56
lwa 54
be 52
za 51
awo 50
ba 47
peetero 46
ekya 45
ajja 40
kino 40
abayigirizwa 39
ye 38
agamba 37
ebya 37
abatume 36
emu 36
yerusaalemi 36
bayibuli 35
kwa 35
nnya 35
abiri 33
kabaka 33
munaana 33
okuyigiriza 33
oluvannyuma 32
abalala 31
okukola 31
olwekyo 31
suteefano 31
abasajja 30
engero 28
kyange 28
okuva 28
kya 27
olugero 27
bino 26
ggulu 26
gwe 26
nkaaga 26
nnyo 26
pawulo 26
bano 25
kisenge 25
kkomera 25
ssatu 25
yokaana 25
date 24
wa 24
eddiini 23
abakulembeze 22
ebibuuzo 22
ekitabo 22
ekyo 22
ennungi 22
gu 22
gye 22
nsi 22
gya 21
okutuuka 21
olwa 21
ono 21
abo 20
amazima 20
c 20
ebinyuma 20
ebyesigamiziddwa 20
empisa 20
images/syn_placeholder_sqr 20
kati 20
url 20
ali 19
ebintu 19
malyamu 19
mukaaga 19
enjigiriza 18
eri 18
musanvu 18
omu 18
oyinza 18
atyo 17
bya 17
e 17
kusibibwa 17
kye 17
okuzuukira 17
ya 17
abalalaweereza 16
abato 16
bagamba 16
bagenda 16
bayibuliabaanakozesa 16
bbiri 16
emyaka 16
lwaki 16
omanyi 16
yeekaalu 16
abamu 15
asatu 15
ayagala 15
bakabona 15
kubanga 15
abagamba 14
ekintu 14
gwa 14
okubeera 14
okusoma 14
okwagala 14
omwoyo 14
oyo 14
ttaano 14
bafu 13
buli 13
eyo 13
okulaba 13
abagoberezi 12
amaanyi 12
batyo 12
bwa 12
ebitundu 12
ekibi 12
kiseera 12
kityo 12
matayo 12
omusamaliya 12
piraato 12
png 12
si 12
weereza 12
yakuwa 12
yesu​—ekkubo 12
abali 11
abalwadde 11
bamalayika 11
bye 11
ennaku 11
eza 11
maaso 11
ngo 11
ogwa 11
olusuku 11
waggulu 11
aba 10
abadde 10
abalabe 10
addamu 10
ka 10
kabona 10
kkubo 10
lwe 10
mwenda 10
omulambo 10
omutukuvu 10
owa 10
ssabbiiti 10
yee 10
agenda 9
amayinja 9
ana 9
baagala 9
bangi 9
bonna 9
ddyo 9
ekiseera 9
engeri 9
ennyo 9
gaabwe 9
kifo 9
kikumi 9
lukka 9
lumu 9
muliraanwa 9
okwogera 9
olaba 9
ssente 9
abakazi 8
awonya 8
babiri 8
baibuli 8
batandika 8
bawulira 8
ebikolwa 8
ekitalo 8
emirundi 8
endogoyi 8
eya 8
ga 8
kyenda 8
luguudo 8
lunaku 8
malayika 8
mukama 8
obulamu 8
okufa 8
okumala 8
olwo 8
pngmy 8
pulintaweereza 8
sindika 8
tulabe 8
wano 8
yakola 8
ababi 7
ababiri 7
amawulire 7
ani 7
ataano 7
ate 7
babuuza 7
bwakabaka 7
ki 7
maanyi 7
mwana 7
nkomerero 7
oba 7
obulimba 7
okuyiga 7
oluggi 7
tuyinza 7
abalabikira 6
abaserikale 6
abuulira 6
abuuza 6
ago 6
akomawo 6
akubibwa 6
akwata 6
alaba 6
alina 6
amangu 6
amateeka 6
atambula 6
atandika 6
atya 6
ayinza 6
baana 6
balaba 6
bali 6
bayibuliayagala 6
bayibuliyesu 6
binoyesu​—ekkubo 6
bwonna 6
ekitala 6
empewo 6
ensi 6
esatu 6
kinyiiza 6
kiri 6
lusozi 6
lusuku 6
mmwe 6
ngeri 6
nnimi 6
ntaana 6
ntenvu 6
obubi 6
obwakabaka 6
okufuga 6
okumpi 6
omubiri 6
omukazi 6
omuliro 6
omuntu 6
omuppya 6
omuyudaaya 6
tebajja 6
waakayitawo 6
waffe 6
waliwo 6
yali 6
yonna 6
zeyituuni 6
akabanga 5
akiraga 5
akozesa 5
alabikira 5
amaaso 5
amugamba 5
ayingira 5
ayita 5
ayitibwa 5
ayogera 5
bajja 5
bamukuba 5
bamuzibe 5
basumululwa 5
bava 5
bayibulimu 5
bayigirizwa 5
bazze 5
beewuunya 5
beeyongera 5
bingi 5
bitaano 5
boogera 5
byonna 5
ebikumi 5
ebikwata 5
ekibuga 5
ekikulu 5
ekyamagero 5
emabega 5
endowooza 5
enjawulo 5
entaana 5
eyawukana 5
katono 5
kugoba 5
kwagala 5
lye 5
mangu 5
mugende 5
mukono 5
mulamu 5
nabo 5
obunnabbi 5
obwawandiikibwa 5
okubuulira 5
okulindirira 5
okumanya 5
okumukola 5
okumutta 5
omulenzi 5
omulungi 5
abaddamu 4
abagenyi 4
abalema 4
abana 4
abatolugandaayagala 4
abayudaaya 4
abazibe 4
akimanyi 4
akoze 4
akyalira 4
alifuga 4
alowooza 4
amagero 4
amalungi 4
asaba 4
awa 4
ayigirizaamu 4
ayimirira 4
baakuba 4
baba 4
baddamu 4
bagoberezi 4
bakubye 4
bamukwata 4
bamutwala 4
basanga 4
basobola 4
batambula 4
batume 4
batwala 4
batya 4
bawoggana 4
bayigiriza 4
ddala 4
ebimu 4
ebyamagero 4
eddoboozi 4
ekibaawo 4
ekisa 4
ekyewuunyisa 4
emisota 4
endogoyiatuukiriza 4
enjala 4
enkumi 4
ento 4
erigenda 4
eyakwatibwa 4
guno 4
kabakalugandayesu 4
kibaawo 4
kifaananyi 4
kituuse 4
kkomeraluganda 4
koluneeriyo 4
kozesa 4
kubuulira 4
kukomya 4
kumulaba 4
kusobola 4
laba 4
limenyekera 4
lubereberye 4
lugero 4
lya 4
magudaleene 4
mulambo 4
nnamaddalayesu 4
nsonga 4
obulamuebikwata 4
obulamukabaka 4
obulamuomusamaliya 4
obulungi 4
okuba 4
okumukwata 4
okusaba 4
okusinga 4
okutegeeza 4
okutunula 4
okuwonya 4
okuwuuma 4
oluganda 4
olukwata 4
olulimi 4
olunaku 4
omukulu 4
omuleevi 4
omunaku 4
omutwe 4
teguliimu 4
tomasi 4
tujja 4
wadde 4
walibaawo 4
we 4
yalaga 4
yeeyongera 4
yeriko 4
yuda 4
zaabwe 4
ze 4
abaali 3
abakakafu 3
abasinga 3
abatoekitabo 3
afuga 3
agakwata 3
agera 3
akyuka 3
alaga 3
amakooti 3
amanyi 3
asaanidde 3
asinga 3
asumulula 3
atunuulira 3
ayigiriza 3
baali 3
babateeka 3
badduka 3
bange 3
bantu 3
basaanidde 3
basabiriza 3
bawakana 3
bibuga 3
bigenda 3
bintu 3
byambalo 3
ddamasiko 3
ebibi 3
ebweru 3
edda 3
ekibiina 3
ekibinja 3
ekikolwa 3
ekiro 3
ekitundu 3
ekkomera 3
ekyesudde 3
eryato 3
eyazuukiza 3
ge 3
gesusemane 3
ggaliraaya 3
kerode 3
kirungi 3
kizinga 3
kulaba 3
kyalo 3
linnya 3
luno 3
makya 3
mujja 3
muti 3
nate 3
nedda 3
nge 3
nnyumba 3
obukulu 3
obungi 3
ogu 3
okukwata 3
okusatu 3
okusumulula 3
olukiiko 3
omufuzi 3
omulala 3
omulundi 3
omutume 3
omuweereza 3
otulo 3
tebaagala 3
timoseewo—omuyambi 3
tulabye 3
waggululugandamu 3
wala 3
wange 3
yalonda 3
yatuma 3
abaabayisa 2
ababuulira 2
ababuuza 2
abafu 2
abagenda 2
abaisira 2
abakkolinso 2
abakulu 2
abaleka 2
abalumwa 2
abannyonnyola 2
abasaba 2
abasanga 2
abasatu 2
abeegattako 2
abulawo 2
adda 2
adduka 2
adeni 2
afa 2
afuka 2
afukamidde 2
afukamira 2
afuse 2
aga 2
agajja 2
agakola 2
agenze 2
aggya 2
agitwala 2
aguddewo 2
akangula 2
akaseera 2
akkirira 2
akola 2
akomyewo 2
akukola 2
akuwonya 2
akyali 2
alibeera 2
aliisa 2
alikolera 2
alikomawo 2
alireeta 2
alirwala 2
amagezi 2
amala 2
amalala 2
amanene 2
amanya 2
amawanga 2
amaze 2
amazzi 2
amubuuza 2
amukole 2
amuli 2
amunywegera 2
amuteekako 2
anaafuga 2
andereya 2
asembayo 2
asigalawo 2
asiiga 2
asobola 2
asobole 2
asowolayo 2
atandike 2
atategeera 2
atema 2
attibwa 2
attiddwa 2
atunuddemu 2
atuuka 2
atwala 2
ava 2
avuunama 2
awagamba 2
awali 2
awonye 2
ayamba 2
ayambadde 2
ayambala 2
ayimiridde 2
ayimuka 2
ayimusa 2
ayitawo 2
azaaye 2
azuukire 2
azuukiza 2
azuukiziddwa 2
baagezezzaako 2
baakola 2
baakyawamu 2
baalaga 2
baatidde 2
baatwala 2
babadde 2
babakwata 2
babaleeta 2
babategeeza 2
babatizibwa 2
babuguumirira 2
babuzaabuziddwa 2
baddayo 2
bafuuka 2
bagaaliirira 2
bagambe 2
bagawa 2
baggyamu 2
bakiggala 2
bakitegeera 2
bakoze 2
bakyaye 2
bakyayogera 2
baleeta 2
baleetebwa 2
balinda 2
balirumwa 2
balirwala 2
balweyagaliremu 2
bamanyi 2
bamubuuza 2
bamufulumya 2
bamugondedde 2
bamukkirize 2
bamulaba 2
bamuleeta 2
bamuleetera 2
bamutadde 2
bamututte 2
banaakola 2
banaatera 2
banakuwala 2
banakuwavu 2
bannabbi 2
banyiivu 2
basajja 2
basamaliya 2
basanyuka 2
basembera 2
basigala 2
batayinza 2
bateeka 2
bategeeza 2
bategeka 2
batendereza 2
batuma 2
batunula 2
batunuulira 2
batuuka 2
bavaawo 2
bavaayo 2
bawummulamu 2
bawummulirako 2
bayimirira 2
bayinza 2
bayita 2
beebase 2
bibaawo 2
bikolebwe 2
binoenjigiriza 2
biruwa 2
biseera 2
biswaza 2
bitundu 2
bituufu 2
bituukirizibwa 2
biwundu 2
boolekera 2
bulamu 2
buliba 2
bulwadde 2
bumenyi 2
bwammwe 2
byalo 2
ddi 2
ddoboozi 2
ebikomererayo 2
ebikulu 2
ebinkwatako 2
ebiribaawo 2
ebitala 2
ebyeru 2
ebyetooloddewo 2
ebyo 2
eddagala 2
egisukka 2
ejja 2
ekabiki 2
ekibuuzo 2
ekifaananyi 2
ekigenda 2
ekire 2
ekisenge 2
ekitali 2
ekitono 2
ekituuka 2
ekunta 2
ekuumibwe 2
ekyabaviirako 2
ekyatuuka 2
ekyokulabirako 2
emawo 2
embeera 2
emboozi 2
emeka 2
emiggo 2
emikono 2
emmere 2
engalo 2
enkeera 2
ennyumba 2
entalo 2
eribeera 2
erinnya 2
eriringa 2
erya 2
eryo 2
essuula 2
ettendo 2
etya 2
eyali 2
eyamubuuzizza 2
eyeeyisa 2
ezo 2
ffe 2
gabuulirwa 2
gaffe 2
galibuulirwa 2
gavumenti 2
genda 2
ggwanga 2
gubadde 2
gubaleetera 2
gwafukibwa 2
gwateekebwa 2
gweweseemu 2
kasobozesa 2
kata 2
kayaafa 2
kibaleetera 2
kibi 2
kibinja 2
kibula 2
kikwasaamu 2
kimusiikiriza 2
kiriba 2
kitaawe 2
kitange 2
kitemeko 2
kitundu 2
kituufu 2
kituuka 2
kiwanvu 2
kkomeralaba 2
kubabonereza 2
kubaleka 2
kubba 2
kubeera 2
kufuuka 2
kugenda 2
kukakasa 2
kukomyawo 2
kukuwa 2
kumpi 2
kumuweereza 2
kutu 2
kutwala 2
kuva 2
kuwulirwa 2
kuyamba 2
kuzuukizibwa 2
kwammwe 2
kwe 2
kwegolola 2
kweyongera 2
kyabwe 2
kyaffe 2
kyakulabirako 2
kyakyo 2
kyali 2
kyonna 2
lagira 2
lijjula 2
liringa 2
ludda 2
lukumi 2
lulabika 2
lusibe 2
luuyi 2
lwali 2
lwennyini 2
lyonna 2
makko 2
mangi 2
mateeka 2
matu 2
mawanga 2
mazima 2
mbaga 2
mbakolere 2
mbuulira 2
mimwa 2
mmulabye 2
mubatizibwe 2
mubiri 2
mujjuzizza 2
mukulukusa 2
mukuumi 2
mukwano 2
mulabye 2
mulamuomukazi 2
mulifuna 2
mulinga 2
mulwadde 2
munda 2
munnaddiini 2
musajja 2
museenene 2
musigale 2
musisi 2
mutegeeze 2
mutuufu 2
mutwe 2
mutya 2
muwakanya 2
muwulira 2
muyinza 2
muyudaaya 2
mwagala 2
mwatta 2
mwe 2
mwetaaga 2
mwongere 2
naawe 2
nakyo 2
ndaba 2
nja 2
nkalu 2
nkiwulira 2
nnaku 2
nnina 2
nnyinza 2
nsanvu 2
nsozi 2
ntalo 2
ntandikwa 2
nze 2
obamanyi 2
obulamuomwana 2
obumenyi 2
obutaddamu 2
ogezaako 2
ogwasuubizibwa 2
ojjukira 2
okaaba 2
okubannyonnyola 2
okubikkulirwa 2
okuddako 2
okuddayo 2
okufaananako 2
okugakuuma 2
okugenda 2
okugera 2
okugezaako 2
okugoberera 2
okugondera 2
okujja 2
okukikola 2
okukima 2
okukomawo 2
okukoppa 2
okukuba 2
okukuuma 2
okukyusa 2
okulaga 2
okulya 2
okumponya 2
okumubuuza 2
okumwogerako 2
okunoonya 2
okunywa 2
okusabiriza 2
okusigala 2
okusindika 2
okutaano 2
okutambula 2
okuteekebwa 2
okutegeera 2
okutendereza 2
okuttibwa 2
okuttirwa 2
okutu 2
okutuusa 2
okutuziyiza 2
okuweebwayo 2
okuwona 2
okuwonyezebwamu 2
okuwulira 2
okuwummulira 2
okuyamba 2
okuyingira 2
okuyoogaana 2
okuzuukizibwa 2
okwa 2
okwambuka 2
okwebaka 2
oli 2
olowooza 2
oluddako 2
oluguudo 2
olukuŋŋaana 2
olulabika 2
olulala 2
olulungi 2
olunene 2
oluppya 2
oluyita 2
olweggulo 2
omugongo 2
omujaajaamya 2
omukisa 2
omukono 2
omulema 2
omulwadde 2
omutadde 2
omuto 2
omututte 2
omuvubuka 2
omuyigirizwa 2
onoonya 2
osaba 2
otambule 2
owulira 2
oyise 2
pentekoote 2
rooma 2
sawulo 2
setaani 2
simanyi 2
singa 2
sirina 2
so 2
tagenda 2
tamulwaniriddeeko 2
tannaleka 2
tasaba 2
tasobola 2
tebaakola 2
tebabasangamu 2
tebaddamu 2
tebakyagala 2
tekinnabaawo 2
tekinnatuuka 2
temugondedde 2
temusomangako 2
tewali 2
tewalibaawo 2
teyandiwonyezeddwa 2
teyayimirira 2
teyazuukiza 2
tobabonereza 2
tolowooza 2
toyagala 2
ttuntu 2
tugenda 2
tugezeeko 2
tukole 2
tukoze 2
tumanyi 2
tunuulira 2
tusaanidde 2
tutaano 2
tuteekwa 2
tuva 2
tuwuliriza 2
tuyambe 2
tuyiga 2
tuyigira 2
tuyize 2
twabalagira 2
twagala 2
twamaze 2
waayo 2
wagguluekitabo 2
wayiseewo 2
yaakalabikira 2
yaayo 2
yabadde 2
yabaddeko 2
yabalabikidde 2
yabatiza 2
yafa 2
yafiiramu 2
yagamba 2
yakobo 2
yaleetera 2
yamuzuukiza 2
yasala 2
yattibwamu 2
yatutte 2
yawa 2
yayingira 2
yayise 2
yazuukizibwa 2
yazze 2
yeebagadde 2
yeeyagalire 2
yekka 2
yennyini 2
yimirira 2
zeero 2
zibula 2
zino 2
ziyitawo 2
zzaayo 2
