nti 521
num 467
mu 382
ku 283
munno 219
ne 184
bufumbo 176
bya 166
nga 158
era 149
wange 149
agamba 143
no 138
mukyala 137
omwami 137
bwe 135
oba 119
bo 118
naye 115
na 110
ekitiibwa 107
obufumbo 105
obwasooka 97
aba 84
eyasooka 79
ebyo 76
akola 71
bayibuli 71
buli 71
oyinza 69
nnyo 68
omu 68
bye 64
engeri 64
kkumi 64
ebirungi 62
mikwano 62
munne 61
omukyala 61
okuba 60
okuwasa 57
bbiri 53
bwo 51
gye 51
ssatu 51
okulaga 50
ya 50
ayitibwa 49
ngo 49
oli 48
we 48
kya 46
emu 45
amagezi 44
ate 43
gwe 42
okukola 42
gya 41
kati 40
nnali 40
ndowooza 39
nge 39
okufumbirwa 39
wadde 39
bannaabwe 38
ekyo 38
emyaka 38
kye 38
wo 38
ebintu 37
abalala 35
yali 35
kiyinza 34
abasajja 33
munaana 33
okuva 33
bwa 32
ekiseera 32
essira 32
kino 32
okwagala 31
otya 31
za 31
andrew 30
essanyu 30
gu 30
gyo 30
olwa 30
gezaako 29
okusoomoozebwa 29
lwa 28
nnya 28
oluusi 28
omulala 28
singa 28
asiima 27
kiri 27
kuba 27
nkola 27
okwogera 27
amaka 26
bwange 26
emirimu 26
ndi 26
oluvannyuma 26
abantu 25
bangi 25
emikwano 25
nneewulira 25
obo 25
birungi 24
egamba 24
mwesigwa 24
okukolako 24
owa 24
oyo 24
riley 24
ddala 23
herman 23
wabula 23
waggulu 23
ye 23
amaaso 22
ayogera 22
bakola 22
ennyo 22
baagala 21
bintu 21
eraga 21
eyo 21
kiseera 21
maka 21
obulungi 21
okumanya 21
olwekyo 21
ttaano 21
wa 21
abafumbo 20
endowooza 20
eyagattululwa 20
kiki 20
njawulo 20
obanga 20
okubaamu 20
okussibwamu 20
bulungi 19
bwabwe 19
kikulu 19
okunyweza 19
osiima 19
waliwo 19
weebuuze 19
bubiri 18
essatu 18
gumu 18
kikumi 18
kityo 18
kubanga 18
mba 18
mutwalo 18
okubiri 18
abakazi 17
alina 17
asaanidde 17
awaka 17
bubi 17
ebigambo 17
engero 17
gammwe 17
kwe 17
linda 17
mukaaga 17
muyinza 17
okubaawo 17
ossaamu 17
batera 16
ekyokulabirako 16
kimu 16
ono 16
osaanidde 16
addamu 15
ayinza 15
bonna 15
bwasasika 15
ebizibu 15
ekintu 15
eyaddamu 15
ggwe 15
kiba 15
mussaamu 15
toba 15
yakolanga 15
eri 14
ian 14
nsonga 14
okukuyamba 14
osobola 14
abaana 13
abakkolosaayi 13
afube 13
bibiri 13
bwammwe 13
enkolagana 13
gyange 13
kituufu 13
kulowooza 13
kyo 13
mbeera 13
musanyufu 13
nnagamba 13
okunywera 13
oyogera 13
yaabwe 13
abiri 12
asatu 12
atakola 12
baabwe 12
baali 12
butuufu 12
ebiri 12
ekinaakuyamba 12
emirala 12
ensobi 12
er 12
eyayogeddwako 12
faayo 12
javi 12
kikuzibuwalira 12
okufuna 12
okukolagana 12
okulabirira 12
okuteesa 12
okwesigaŋŋana 12
sabine 12
teyali 12
wandiika 12
yeeyongera 12
abeefeso 11
ayogeddwako 11
ba 11
bisatu 11
ebirala 11
eya 11
muli 11
mwami 11
nkumi 11
okuddamu 11
okusinga 11
okussa 11
okwetegereza 11
omusajja 11
si 11
akkiriziganya 10
akole 10
amannya 10
busobola 10
bwaffe 10
gakyusiddwa 10
ka 10
kasanvu 10
ki 10
kitiibwa 10
kyokka 10
kyonna 10
mmwe 10
munnange 10
muyisaamu 10
mwenda 10
nfaayo 10
ngeri 10
njogera 10
okubaako 10
okwongera 10
omuntu 10
omutwe 10
oyagala 10
ozzeemu 10
waddamu 10
wiiki 10
yayiga 10
yeewulira 10
zaali 10
ze 10
abazzeemu 9
bafuna 9
basanyufu 9
bba 9
bino 9
bujja 9
bukadde 9
buyinza 9
bwasooka 9
el 9
eyinza 9
gaabwe 9
gifuule 9
jpg 9
kisobola 9
kiyitawo 9
kusoomoozebwa 9
kwa 9
lowooza 9
lubeerera 9
mirundi 9
mpisa 9
naawe 9
obutwala 9
okimanyi 9
okukuyambamu 9
okulaba 9
okulifuna 9
okutaali 9
okutera 9
okuyamba 9
olimu 9
osuubira 9
tamara 9
univ/art 9
univ_sqr_xl 9
url 9
waakafumbirwa 9
wayiseewo 9
yafumbirwa 9
yagamba 9
yagattululwa 9
yo 9
zuukuka 9
abalalaweereza 8
abamu 8
abatera 8
abeera 8
africa 8
ajja 8
akugeraageranya 8
ataakolanga 8
ayoleka 8
baasooka 8
bakyala 8
bayise 8
beesanze 8
bifo 8
bulijjo 8
century 8
egiyise 8
ekinaabayamba 8
ekya 8
ekyanfuula 8
ellen 8
embeera 8
ennungi 8
erinnya 8
gamba 8
kaitlyn 8
kakaaga 8
kibi 8
kimuyamba 8
kindeetera 8
kiwanvu 8
kwerabirira 8
kyangu 8
lisse 8
luuyi 8
lwaki 8
lya 8
mufumbo 8
musanvu 8
muwulirize 8
naddala 8
new 8
ngeraageranyizza 8
nkoze 8
nnaddala 8
nnagendangamu 8
nneesanga 8
oboolyawo 8
obubi 8
obulimu 8
ogamba 8
okola 8
okubeera 8
okubuusa 8
okukuyisa 8
okulowooza 8
okusoomooza 8
okutegeera 8
okuwulira 8
okuwummulirako 8
okwewala 8
olina 8
olinakatibya 8
olulala 8
omuwuliriza 8
on 8
peetero 8
south 8
tasiima 8
tasuubira 8
teyakitwalanga 8
toyanguyiriza 8
tugenze 8
versi 8
wasooka 8
wayinza 8
weetegereze 8
yabumalamu 8
yakitwalanga 8
yasooka 8
abaggalatiya 7
akiraga 7
ati 7
ayogerwako 7
baayagalanga 7
baayogeranga 7
bulwadde 7
buuza 7
edmond 7
eggonjebwa 7
ekiyitibwa 7
ekyasinganga 7
emirundi 7
emoti 7
empisa 7
gitafaanagana 7
jared 7
kijja 7
kimuyisa 7
kookolo 7
kubwogerako 7
kukuyamba 7
kunjagala 7
manya 7
mpasa 7
mulala 7
nnaakafumbirwa 7
obunkenke 7
okukakasa 7
okumunyiiza 7
onal 7
otasaanidde 7
siima 7
tebayinza 7
tebufaanagana 7
tekinyiiza 7
tomugeraageranya 7
twakamala 7
yafa 7
abaagamba 6
abaddamu 6
afuna 6
aleme 6
ali 6
atali 6
awo 6
baabyogera 6
baafuba 6
bafunye 6
balekera 6
bamugezesa 6
batamanyidde 6
batandika 6
batandise 6
beera 6
biba 6
bigere 6
biwonya 6
bulala 6
bwemuba 6
bweyongedde 6
ebikusanyusa 6
ebikwatagana 6
ebikweraliikiriza 6
ebitundu 6
egimu 6
egiyinza 6
ekifumita 6
ekkomo 6
emikadde 6
emikolo 6
ensonga 6
fuba 6
gyabwe 6
intaneeti 6
kale 6
kibayambye 6
kibazibuwalira 6
kibeere 6
kifo 6
kintu 6
kirabika 6
kitala 6
kozesa 6
kubuulira 6
kutwawukanya 6
kuyisibwa 6
kwayamba 6
kyagenda 6
kyandeetera 6
kyatuyamba 6
le 6
lup 6
michel 6
mpuliziganya 6
muba 6
mugumiikiriza 6
mukakanyavu 6
mukakase 6
mukkakkamu 6
munyumya 6
musisinkanye 6
mwogere 6
myaka 6
nakyo 6
ndiba 6
nneebuuzanga 6
nneeraliikiriranga 6
nnina 6
ntidde 6
o 6
obubwo 6
obutasanyusa 6
ofuba 6
okubatwalira 6
okufumiitiriza 6
okukubiriza 6
okumala 6
okumanyiira 6
okumwesiga 6
okundekawo 6
okusoma 6
okwesiga 6
okweyongera 6
oluganda 6
omala 6
siryawukana 6
so 6
ssa 6
ssaawo 6
ssimu 6
takyalina 6
talowoozezza 6
tetwagala 6
teyandibadde 6
tito 6
totya 6
tufunye 6
tuliba 6
tumaze 6
wali 6
wammanga 6
weekebere 6
weemanyi 6
weendi 6
weereza 6
wesse 6
yakakasa 6
yalongooka 6
yankakasa 6
yawasa 6
yonna 6
zino 6
abajulirwa 5
abakkolinso 5
abali 5
abassa 5
abatali 5
abo 5
agamu 5
agwanidde 5
akozesezza 5
akussaamu 5
alicia 5
alowooza 5
amangu 5
antwala 5
apuli 5
asanze 5
atassaamu 5
awa 5
awandiise 5
ayogeramu 5
ayoza 5
babeesiga 5
babo 5
baddamu 5
bakiraba 5
bakiraga 5
balina 5
basinga 5
be 5
bingi 5
bisobola 5
bulagirizi 5
bulamu 5
bunafu 5
byo 5
carlosagamba 5
corrine 5
dani 5
ddamu 5
ddoboozi 5
ebibaawo 5
ebibuuzo 5
ebikyafu 5
ebiseera 5
ebyeraliikiriza 5
ekikulu 5
ekirimi 5
ekiruubirirwa 5
ekitundu 5
enkyukakyuka 5
enneewulira 5
es 5
eyafiirwa 5
eyakubibwa 5
eyalina 5
eyawukanira 5
ezo 5
gasobola 5
katonda 5
kennyini 5
kibasanyusa 5
kiganyula 5
kimuganyula 5
kiraga 5
kisoboka 5
kitegekeddwa 5
kitundu 5
kulagaŋŋana 5
kwagala 5
kwalaga 5
kyalaga 5
laba 5
laga 5
lunaku 5
lye 5
magazini 5
mmala 5
mmuwuliriza 5
mpisaamu 5
mpulira 5
mugambe 5
mukazi 5
muwa 5
muwandiise 5
muwanyise 5
muwendo 5
nange 5
njogeramu 5
nkiraga 5
nkozesa 5
nkulu 5
nkyamu 5
nnakulira 5
nnalina 5
nnamaddala 5
nneeyisaamu 5
nnyinza 5
ntya 5
nze 5
nzitwala 5
obawa 5
obudde 5
obumala 5
of 5
ogugamba 5
okuddirira 5
okukuzaamu 5
okulagaŋŋana 5
okuleetera 5
okulongoosa 5
okumu 5
okundaga 5
okunoonyereza 5
okunyiiza 5
okusala 5
okussaamu 5
okusuulasuula 5
okutegeezanga 5
okuwa 5
okuwaamu 5
okuwaŋŋana 5
okuwaŋŋanamu 5
okwa 5
okwagalanga 5
okwagalibwa 5
okwawukana 5
okwebuuza 5
olowooze 5
omukazi 5
owandiise 5
secrets 5
sitegedde 5
stepfamili 5
tanzisaamu 5
tasobola 5
teekawo 5
tekyali 5
teraga 5
twafumbiriganwa 5
twalina 5
twayogereranga 5
waakiri 5
wansi 5
weeyisaamu 5
yaawake 5
yakuliramu 5
yakuwa 5
yeewala 5
yeeyagala 5
zaffe 5
zombi 5
abaami 4
abadde 4
abafiripi 4
abakyala 4
abaruumi 4
akanise 4
akiraba 4
akoze 4
akyanjagala 4
aliko 4
amaze 4
ansiima 4
awulira 4
babuusa 4
bajjukira 4
balala 4
balissa 4
bammwe 4
bandibadde 4
bandifunyenga 4
basajja 4
bayitamu 4
bibe 4
binene 4
bitono 4
bugambi 4
bungi 4
bwandibadde 4
bwonna 4
e 4
ebikulu 4
ebiyambye 4
egyo 4
ekibadde 4
ekisoboka 4
ekitabo 4
enoobufumboobufumbo 4
erika 4
esatu 4
essanyumukolere 4
etukubiriza 4
eziddako 4
ffenna 4
fi 4
gigenda 4
giyitawo 4
infidelitykigamba 4
james 4
kabi 4
kimpisa 4
kinkubiriza 4
kirage 4
kumwebaza 4
kusiima 4
kwawukana 4
luganda 4
micha 4
mikulu 4
mwo 4
nabo 4
ngitwala 4
nkomerero 4
nnaku 4
obadde 4
obuzibu 4
okuggwaawo 4
okugikola 4
okukikola 4
okukiraganti 4
okulissa 4
okusobozesa 4
okutambula 4
okutandika 4
okuteeka 4
okutwalirizibwa 4
okuyonja 4
okwebazanga 4
okweraliikirira 4
olukalala 4
omukuumi 4
omulungi 4
omunaala 4
omusanvu 4
ona 4
onoonese 4
osiimaluganda 4
otandika 4
otwalidde 4
pulintaweereza 4
tebandirowoozezzanga 4
tebusasika 4
tetugamba 4
teweebaza 4
tofaayo 4
totwala 4
tukola 4
tusiima 4
valeri 4
watya 4
abasinga 3
baba 3
basiima 3
batakola 3
beemulugunya 3
ennaku 3
infidelity 3
kigenda 3
kimalawo 3
kitabo 3
kwemulugunya 3
mutya 3
obungi 3
okujja 3
okukolawandiika 3
okumanyaabasajja 3
okunneebuuzaako 3
okusiima 3
okusingira 3
omukugu 3
osiimazuukuka 3
sindika 3
tebasiima 3
binoamaka 2
binoobufumbo 2
eno 2
okukolafuba 2
