mu 105
ku 69
nga 40
abantu 36
ne 35
nnyo 26
abaana 25
ssente 18
katale 16
kasooli 15
kati 14
abamu 13
embizzi 12
gwe 11
buli 10
omwana 10
sukaali 10
alina 9
bwe 9
nti 9
tulina 9
waliwo 9
zino 9
ani 8
ddwaliro 8
ki 8
no 8
omuntu 8
poliisi 8
wa 8
ye 8
akatale 7
ate 7
bye 7
ebintu 7
ejjoogo 7
ennaku 7
muntu 7
omulwadde 7
abalala 6
batunda 6
emmere 6
emu 6
mbeera 6
na 6
naye 6
nnyaanya 6
okukola 6
okulya 6
olina 6
omu 6
omusajja 6
yali 6
abakyala 5
abazadde 5
amataba 5
amazzi 5
bakasitoma 5
bakola 5
bingi 5
bulungi 5
bwo 5
bya 5
ekimyula 5
enkola 5
eno 5
kino 5
kye 5
lwaki 5
maama 5
mbi 5
mbizzi 5
mulimu 5
munno 5
obulamu 5
okuva 5
omuvubuka 5
osobola 5
sikirungi 5
ssomero 5
wo 5
yasalawo 5
za 5
ababbi 4
abakola 4
akola 4
bali 4
basobola 4
be 4
bizinensi 4
bwa 4
emmotoka 4
essomero 4
gwa 4
kirungi 4
kizibu 4
mmere 4
obuvunaanyizibwa 4
okuba 4
okufuna 4
olwo 4
omubisi 4
talina 4
aba 3
abalimi 3
abasawo 3
abavubuka 3
afudde 3
amaaso 3
babadde 3
babeera 3
bajjooga 3
balina 3
bazadde 3
bubbi 3
bulamu 3
ddala 3
dduuka 3
ebirungo 3
ebyo 3
ebyokulya 3
ekitundu 3
embeera 3
embuzi 3
ennaanansi 3
ennyaanya 3
ensi 3
ensonga 3
entambula 3
era 3
eriyo 3
ffe 3
foyiro 3
gwo 3
gye 3
kibi 3
kibiina 3
kiseera 3
lino 3
lwa 3
mangu 3
nnaanansi 3
nnimiro 3
obulwadde 3
okubeera 3
olunaku 3
omutindo 3
otya 3
oyinza 3
tusaba 3
wiiki 3
ya 3
yo 3
zo 3
abakambwe 2
abalina 2
abalwadde 2
abato 2
abo 2
adduka 2
akaze 2
amaanyi 2
ava 2
ayinza 2
baabwe 2
baana 2
badduka 2
bagamba 2
bagwamu 2
baloga 2
bamusanga 2
bamutta 2
banabwe 2
baserikale 2
basinga 2
basse 2
batya 2
bawamba 2
birala 2
biri 2
bisatu 2
biseera 2
bo 2
budde 2
buna 2
byonna 2
ddagala 2
dduyiro 2
e 2
ebikoola 2
ebirala 2
ebyalo 2
ekibbo 2
ekikolwa 2
ekirooto 2
ekirungo 2
ekutte 2
ekyama 2
emirimu 2
emisinde 2
endiirwa 2
engeri 2
ennaanasi 2
ennimiro 2
ennungi 2
ennyanya 2
ennyumba 2
esatu 2
essimu 2
eyo 2
eyongere 2
eza 2
faayo 2
gavumenti 2
gya 2
kali 2
kassoli 2
kayunga 2
kibuga 2
kigaji 2
kiki 2
kikulu 2
kirimu 2
kiruubirirwa 2
kkubo 2
kkumi 2
kolamu 2
kozesa 2
kufuna 2
kutambula 2
kya 2
kyaffe 2
kyo 2
kyokka 2
limu 2
lunaku 2
lususu 2
lwe 2
lya 2
magezi 2
maka 2
mataba 2
mingi 2
mmotoka 2
mugguwa 2
mukwano 2
mwana 2
naawe 2
nayo 2
nguzi 2
nnyama 2
nnyanya 2
nnyumba 2
nywa 2
nze 2
oba 2
obujjanjabi 2
obukadde 2
obulungi 2
obungi 2
obuyinza 2
obuyonjo 2
obuzibu 2
obwana 2
obweyagaza 2
ofune 2
okubaako 2
okujooga 2
okulwanyisa 2
okumala 2
okusomesa 2
okutunda 2
okutuusa 2
oluggya 2
olulungi 2
olumu 2
olususu 2
oluwombo 2
oluyi 2
omanyi 2
omubbi 2
omuceere 2
omuddo 2
omulimu 2
omuliro 2
omulyango 2
omusomesa 2
omusujja 2
omuwala 2
omuyizi 2
omuzannyo 2
oteekwa 2
oyagala 2
oyo 2
tebamanyi 2
teri 2
ttaka 2
ttivi 2
tuyiga 2
twamubuuza 2
twebaza 2
twetaaga 2
uganda 2
wali 2
waliyo 2
wange 2
wetangire 2
yabadde 2
yagamba 2
yalina 2
zirina 2
