mu 462
n 327
ku 319
nga 299
nti 196
ne 143
era 121
e 120
ng 115
y 89
bwe 71
abaana 66
bw 60
w 57
ya 56
wa 52
kino 44
kya 44
uganda 40
eno 37
abayizi 36
agamba 34
olw 34
wabula 34
ate 33
by 33
guno 33
gw 33
gye 33
ttiimu 33
ye 33
kyokka 32
lya 32
ategeezezza 31
gavumenti 31
okuva 30
poliisi 30
abantu 29
abazadde 29
lw 29
buli 28
kubanga 28
ky 28
ssente 28
we 28
kuba 26
ssomero 26
b 25
ba 25
bano 25
omu 24
embizzi 23
eri 23
essomero 23
okulaba 23
be 22
gwa 22
oba 22
yagambye 22
ey 21
masomero 21
ono 21
z 21
eby 20
kkampuni 20
nnyo 20
obulungi 20
okukola 20
s 20
january 19
minisita 19
naye 19
2022 18
oluvannyuma 18
yategeezezza 18
ab 17
abadde 17
abamu 17
bino 17
bulungi 17
eddagala 17
ekya 17
gwe 17
lwa 17
okusoma 17
aba 16
eggwanga 16
gy 16
maaso 16
okuli 16
omulamuzi 16
2 15
abatuuze 15
akulira 15
bye 15
emmere 15
ensimbi 15
000 14
amasomero 14
disitulikiti 14
kiseera 14
kw 14
wakiso 14
za 14
alina 13
asaba 13
embeera 13
emirimu 13
gya 13
ka 13
kampala 13
kye 13
omugenzi 13
omukyala 13
wakati 13
yabadde 13
zino 13
1 12
akakiiko 12
amaanyi 12
baabwe 12
babadde 12
bagenda 12
basobole 12
dr 12
ebyuma 12
ekitongole 12
ez 12
k 12
kisaawe 12
myda 12
okubeera 12
omusajja 12
omwaka 12
yali 12
3 11
abasomesa 11
ebintu 11
ensi 11
ghana 11
kitundu 11
kkooti 11
kwe 11
mpaka 11
ngeri 11
ofiisi 11
okuba 11
okusinziira 11
okusobola 11
okutuuka 11
okutuusa 11
owa 11
ssentebe 11
world 11
yonna 11
10 10
abazannyi 10
bali 10
bonna 10
ebikozesebwa 10
ebitone 10
fufa 10
leero 10
lino 10
lunaku 10
mbeera 10
mizannyo 10
nabo 10
okwongera 10
omupiira 10
si 10
ssinga 10
vision 10
wamu 10
abalunzi 9
abo 9
acheng 9
amateeka 9
baagala 9
balina 9
bukedde 9
covid 9
ebirala 9
empaka 9
emu 9
emyaka 9
enjawulo 9
group 9
kano 9
kirabo 9
kyalo 9
league 9
masaka 9
obuwumbi 9
omuntu 9
omusango 9
19 8
8 8
abalala 8
abawagizi 8
abawala 8
asabye 8
ategeeza 8
bangi 8
batandise 8
bbasale 8
cranes 8
cricket 8
cup 8
ddala 8
ddwaaliro 8
ekibiina 8
ekirwadde 8
ekitundu 8
eky 8
engeri 8
ennaku 8
erya 8
eya 8
ga 8
kiprotich 8
kkooko 8
luguudo 8
lwe 8
mukono 8
musango 8
muyingo 8
nakiwala 8
nrm 8
obubonero 8
obujulizi 8
ogw 8
okugema 8
olwo 8
omutuuze 8
palamenti 8
ssatu 8
wiiki 8
yadde 8
zonna 8
00 7
80 7
abakulira 7
amazzi 7
ayagala 7
baali 7
babby 7
class 7
ddifiri 7
ebiri 7
ennyanja 7
ennyo 7
ensonga 7
ettaka 7
ewa 7
eza 7
g 7
galiwango 7
ggoolo 7
kifo 7
kirumira 7
kyabwe 7
lubaga 7
lukululana 7
ly 7
mabeere 7
master 7
mmeeya 7
musa 7
mwala 7
nsonga 7
obudde 7
obulamu 7
obusika 7
ogwa 7
okudda 7
okuwa 7
olina 7
olwa 7
omukulu 7
omuli 7
omulimu 7
omutendesi 7
omuwendo 7
omwana 7
prosper 7
saluuni 7
school 7
singa 7
tebalina 7
waliwo 7
15 6
5 6
ababadde 6
abakulembeze 6
abasaba 6
abasajja 6
africa 6
agambye 6
agenda 6
akakadde 6
akatale 6
ali 6
awaka 6
bagamba 6
banne 6
basatu 6
bert 6
booda 6
buno 6
bya 6
byonna 6
city 6
covid-19 6
dee 6
ebifo 6
emisinde 6
endala 6
enduulu 6
jinja 6
kati 6
kayunga 6
kigambibwa 6
kikulu 6
kitongole 6
kugenda 6
kukola 6
kyengera 6
lc 6
luno 6
malaba 6
mbarara 6
muntu 6
mutendera 6
mwaka 6
naddala 6
obulambuzi 6
okunoonyereza 6
okuyingira 6
omuliro 6
omusomo 6
otucet 6
richard 6
road 6
town 6
ura 6
wansi 6
zombi 6
zzaabu 6
14 5
20 5
4 5
a 5
abakugu 5
abakulu 5
abalina 5
abeera 5
baana 5
balumba 5
bamusaayimuto 5
bh 5
big 5
bitundu 5
boda 5
bookisi 5
buddo 5
buganda 5
buvuddeko 5
bwa 5
byabwe 5
commonwealth 5
council 5
ebbanga 5
ebimu 5
ebyobulamu 5
ekifo 5
ekika 5
ekkubo 5
emisango 5
emmotoka 5
endwadde 5
enteekateeka 5
etandika 5
ggombolola 5
guli 5
gyabwe 5
kaabuyonjo 5
kafeero 5
kira 5
kiro 5
kkomera 5
kuliko 5
kwa 5
liigi 5
lutalo 5
lwokubiri 5
mikono 5
mirembe 5
musoke 5
musomo 5
mutwe 5
myaka 5
national 5
nemo 5
nyakaisiki 5
obuvunaanyizibwa 5
okufuna 5
okukula 5
okuleeta 5
okusomesa 5
okutangira 5
okuwangula 5
okuyimba 5
okwewala 5
oludda 5
olusooka 5
omukadde 5
omulabirizi 5
omulunzi 5
omuwaabi 5
omwezi 5
omwogezi 5
onyango 5
ow 5
p/s 5
pulezidenti 5
ragga 5
sizoni 5
south 5
ssebaggala 5
ttaka 5
ttakisi 5
tv 5
yasabye 5
zaabwe 5
25 4
28 4
7 4
ababaka 4
abagenyi 4
abaho 4
abaliko 4
abaserikale 4
abasoba 4
abavuga 4
afuna 4
aka 4
akasawo 4
akuumye 4
amagezi 4
amaze 4
amyuka 4
anti 4
atyo 4
awamu 4
awo 4
ayiet 4
baabadde 4
bafuna 4
basabye 4
batwala 4
bazze 4
bbaluwa 4
beera 4
bombo 4
boodabooda 4
brown 4
budde 4
butereevu 4
butongole 4
buwembo 4
bwabwe 4
calvary 4
championships 4
dda 4
de 4
ebigambo 4
ebika 4
ebyensimbi 4
egenda 4
eggulo 4
egya 4
ekif 4
ekisoboka 4
ekiteeso 4
ekyuma 4
emipiira 4
emirundi 4
empapula 4
empisa 4
ena 4
engabana 4
enjuyi 4
enkulu 4
eriri 4
essaawa 4
essanyu 4
etwala 4
eva 4
ezigenda 4
fc 4
ffaamu 4
florence 4
ggwanga 4
giants 4
gonna 4
iganga 4
iv 4
jong 4
kabaka 4
kafiika 4
kamu 4
kasangati 4
kcca 4
kitebe 4
kitende 4
kulunda 4
kulwana 4
kusalawo 4
lukiiko 4
lwaki 4
lwokutaano 4
lye 4
maama 4
male 4
medical 4
micheal 4
mikutu 4
mingi 4
minisitule 4
mmotoka 4
mulimu 4
munisipaali 4
muwonge 4
nange 4
nassali 4
njeru 4
nkola 4
nsangi 4
nsi 4
obubi 4
obulemu 4
obulwadde 4
obuwuka 4
obw 4
okello 4
oku 4
okubikka 4
okuddamu 4
okugemebwa 4
okukozesa 4
okulaga 4
okulonda 4
okumala 4
okunoonya 4
okusobozesa 4
okusunsulamu 4
okutta 4
okutumbula 4
okutuukiriza 4
okuwerennemba 4
okuyamba 4
okuzzaayo 4
okwerinda 4
oluguudo 4
olunnyo 4
oluwawaabirwa 4
olwaleero 4
olympics 4
omara 4
omubiri 4
omugagga 4
omuggalo 4
omukka 4
omukugu 4
omusawo 4
omutindo 4
omutwe 4
patrick 4
petwa 4
poloti 4
pooliyo 4
saul 4
ssande 4
ssi 4
stars 4
talina 4
u20 4
wadde 4
wano 4
wokulira 4
women 4
17 3
2013 3
2018 3
2021 3
6 3
60 3
abaffamire 3
abafu 3
abakola 3
abakyala 3
abalambuzi 3
abali 3
abalongo 3
abapya 3
abasaabaze 3
abatalina 3
abatasussa 3
academy 3
afudde 3
afunye 3
agambibwa 3
ajja 3
akamu 3
akaseera 3
akayumba 3
akwatiddwa 3
alaajanidde 3
amagulu 3
amangu 3
asimbiddwa 3
asobola 3
atandise 3
atuuka 3
awa 3
ayita 3
azaala 3
azze 3
baakola 3
baakusomesebwa 3
babawadde 3
badda 3
bajjumbidde 3
bakola 3
bakolera 3
bakyalina 3
baleme 3
balo 3
balumiriza 3
bantu 3
basaba 3
basomesa 3
bawadde 3
bazadde 3
bazannyi 3
bbiri 3
bbo 3
beetegefu 3
bibiina 3
bifo 3
bisale 3
biseera 3
bitone 3
bongere 3
booluganda 3
bubi 3
budaaki 3
buikwe 3
bukenya 3
bukulembeze 3
busiro 3
bwokka 3
byabadde 3
byammwe 3
byenjigiriza 3
cheptegei 3
committee 3
ddembe 3
ddereeva 3
ddwaliro 3
desire 3
east 3
ebikwekweto 3
ebisale 3
ebiseera 3
ebitabo 3
ebitongole 3
ebizimbe 3
ebyenjigiriza 3
ebyokwerinda 3
edward 3
efunye 3
egy 3
egyali 3
ekigendererwa 3
ekikolwa 3
ekikomera 3
ekikomo 3
ekiro 3
ekitiibwa 3
ekizibu 3
ekyo 3
embi 3
embuto 3
emidaali 3
emisolo 3
emisomo 3
emitwalo 3
emmwaanyi 3
endagaano 3
engabi 3
enguudo 3
enkola 3
ennamba 3
ennyingi 3
ensolo 3
entabwe 3
entuufu 3
enviiri 3
erigema 3
erimu 3
ewatali 3
ewedde 3
ezaabaweebwa 3
fayinolo 3
fayiro 3
february 3
frank 3
gaba 3
gabona 3
gamba 3
gayaza 3
ge 3
gen 3
ggwe 3
gino 3
godfrey 3
gulagibwa 3
gumu 3
gwabwe 3
harvest 3
hd 3
hema 3
japan 3
kaboozi 3
kato 3
katuramu 3
kawempe 3
kenya 3
kibuga 3
kids 3
kimala 3
kinawattaka 3
kiraabu 3
kituufu 3
kkiraabu 3
kkiro 3
kkwaya 3
kololo 3
koudjis 3
kunihira 3
kwongera 3
kwossa 3
kyabaggu 3
kyewalabye 3
kyonna 3
landiroodi 3
lugogo 3
lutikko 3
luzannya 3
luzira 3
lwanga 3
lyabwe 3
lyonna 3
maka 3
makya 3
massomero 3
mazzi 3
mbalangu 3
meeya 3
mipiira 3
misinde 3
ml 3
money 3
mpigi 3
mpisa 3
mugambe 3
muggalo 3
mukolo 3
mulungi 3
musaayi 3
musana 3
mutuuze 3
muwendo 3
mwine 3
na 3
nakawa 3
nama 3
nangabo 3
natukunda 3
nazigo 3
ndeeba 3
nfudde 3
ngalo 3
nnamba 3
nnamwandu 3
nnannyini 3
nnungi 3
nnyanja 3
nnyingi 3
ntuuka 3
nyeko 3
nyina 3
nyumba 3
nze 3
obubaka 3
obubizzi 3
obujjanjabi 3
obukadde 3
obusobozi 3
obussa 3
obwakabaka 3
obwenkanya 3
october 3
ogujja 3
oguwedde 3
okozesa 3
okubadde 3
okubba 3
okufuba 3
okuganja 3
okugenda 3
okuggala 3
okuggulawo 3
okugula 3
okukkiriza 3
okukolagana 3
okukulaakulanya 3
okukuza 3
okumanya 3
okumpi 3
okusaba 3
okusazaamu 3
okussa 3
okutambuza 3
okutandika 3
okutuula 3
okuwulira 3
okwagala 3
okwegera 3
okwekubira 3
okwewozaako 3
okweyongera 3
oluvanyuma 3
oluzannya 3
omubaka 3
omudaali 3
omukisa 3
omukono 3
omulambo 3
omusujja 3
omuyizi 3
omuzzukulu 3
osanga 3
oyo 3
paul 3
primary 3
saako 3
scotland 3
secondary 3
shivon 3
sipiriti 3
sport 3
ssekandi 3
st 3
teri 3
tom 3
ttaano 3
ttivvi 3
tugenda 3
urban 3
waakiri 3
waggulu 3
wange 3
wooteeri 3
yafuna 3
yakkirizza 3
yasoose 3
ziri 3
1-1 2
12 2
18 2
2010 2
2015 2
2017-2018 2
2021/2022 2
22 2
24 2
30 2
300 2
33 2
500 2
9 2
abaabadde 2
abaafa 2
abaami 2
ababbooda 2
ababoogerera 2
abaddusi 2
abakadde 2
abakatoliki 2
abakazi 2
abakebera 2
abakozesa 2
abakozi 2
abakristaayo 2
abakuumi 2
abalaba 2
abaliwo 2
abalyetaba 2
abanaasangibwa 2
abasawo 2
abasusse 2
abatuula 2
abava 2
abavuggirizi 2
abayimbi 2
abayingirira 2
aceng 2
adam 2
adda 2
addamu 2
adong 2
afa 2
afiiridde 2
agaana 2
agaanyi 2
aggyako 2
agugumbudde 2
aguwanise 2
airlines 2
ajunguludde 2
ak 2
akabasa 2
akabenje 2
akaboozi 2
akakubirizibwa 2
akakwasisa 2
akankwasa 2
akatambaala 2
akawuka 2
akediimo 2
akola 2
akoona 2
akukkulumidde 2
akuutidde 2
akwasiddwa 2
alabe 2
alaga 2
alagira 2
alagire 2
alaje 2
alaze 2
alemesa 2
alex 2
aliko 2
alondoola 2
alwana 2
amabaati 2
amabanga 2
amafuta 2
amagoolo 2
amagye 2
amalala 2
amangi 2
amassomero 2
amazaalibwa 2
america 2
amya 2
anaaza 2
and 2
ani 2
ann 2
ashraf 2
asiimye 2
asindana 2
asonyiwa 2
asooka 2
asuubizza 2
atalina 2
atamanyi 2
atandika 2
atera 2
athletics 2
atulugunyizibwa 2
atwala 2
ava 2
avuddeyo 2
avuganya 2
avumiridde 2
awebwa 2
aweze 2
ayitibwa 2
azzibwe 2
baasazeewo 2
baatandika 2
baategeezezza 2
baatuuse 2
babaka 2
babiri 2
bafune 2
bagaanyi 2
bagambye 2
bagende 2
bagezaako 2
bakasitoma 2
bakizudde 2
bakolerawo 2
bakuba 2
bakungu 2
balaze 2
balemeddwa 2
balinda 2
bamanyi 2
bamaze 2
bamenya 2
bamu 2
bamuwereekereza 2
bannanyinni 2
banoonya 2
basajja 2
basale 2
basanyufu 2
basimattuse 2
basimbiddwa 2
basobeddwa 2
basome 2
batagenda 2
batale 2
bateebye 2
batuuse 2
bawaguza 2
bawakanya 2
baweerere 2
bayizi 2
bazisasule 2
beekalakaasizza 2
beeyiwa 2
bibazaalidde 2
bigere 2
bigoma 2
bingi 2
bintu 2
birabwa 2
birivumbika 2
bisattiza 2
bitatuule 2
bizinensi 2
bj 2
blacks 2
bo 2
boogera 2
boolekeza 2
brian 2
bubadde 2
bubiri 2
bugerere 2
buggya 2
bugoloobi 2
bukadde 2
bungi 2
busingye 2
buvunaanyizibwa 2
buwumbi 2
buyinza 2
bwo 2
byaggweera 2
byalyo 2
canada 2
center 2
charles 2
clinic 2
collins 2
competitions 2
daniel 2
ddakiika 2
ddifiiri 2
ddundiro 2
denis 2
dennis 2
disciplinary 2
divizoni 2
doora&hellip 2
ebaddemu 2
ebbaluwa 2
ebeera 2
ebidduka 2
ebinyonyi 2
ebirowoozo 2
ebisomesebwa 2
ebisongovu 2
ebissi 2
ebituli 2
ebitundu 2
ebyobulambuzi 2
ebyobusuubuzi 2
eddakiika 2
eddene 2
eddundiro 2
edinansi 2
edith 2
eduumirwa 2
effujjo 2
eggaali 2
egibadde 2
ejja 2
eka 2
ekibuga 2
ekiddako 2
ekikeesezza 2
ekinnya 2
ekiragiro 2
ekiri 2
ekirooto 2
ekiseera 2
ekisooka 2
ekitigi 2
ekitone 2
ekiwandiiko 2
ekiyumba 2
ekola 2
ekozesebwa 2
ekulembedde 2
ekutte 2
ekwebedde 2
ekyakeesezza 2
ekyatabula 2
ekyazizza 2
emigattabantu 2
emigugu 2
emikisa 2
emirala 2
emiriraano 2
emisana 2
emizannyo 2
enfu 2
engatto 2
engulu 2
enkalu 2
enkoko 2
enkolagana 2
enkuba 2
ennene 2
ensamba 2
ensobi 2
entalo 2
entambula 2
entereka 2
enyumba 2
erina 2
erirung 2
ery 2
esaziddwaamu 2
esinga 2
esooka 2
essira 2
essuubi 2
esther 2
etadde 2
etteeka 2
evelyn 2
everest 2
executive 2
eyagiteebye 2
eyakubiddwa 2
eyali 2
eyita 2
eyongere 2
ezannyira 2
ezikwata 2
ezikwatiddwa 2
ezimu 2
ezisoba 2
eziva 2
fd 2
feeds 2
ffamile 2
ffe 2
ffeeza 2
ffiizi 2
fifa 2
fiizi 2
ft 2
gaabwe 2
gakoma 2
gano 2
gashumba 2
georgre 2
gibadde 2
gitta 2
greater 2
gubeera 2
gugenda 2
gwali 2
gwonna 2
gyonna 2
health 2
hellip 2
henry 2
hj 2
hom 2
ivan 2
jackson 2
jane 2
jjajja 2
john 2
joseph 2
july 2
kabuyojo 2
kakiiko 2
kalagidde 2
kale 2
kalisoliso 2
kanjuki 2
kaputeeni 2
kasasiro 2
kasibante 2
kasooli 2
katanzizza 2
kateregga 2
katonda 2
katono 2
katumba 2
kaweefube 2
kibiina 2
kigenda 2
kika 2
kikulwe 2
kikyamu 2
kimu 2
kindergarten 2
king 2
kinyoozi 2
kirungi 2
kirungo 2
kisanja 2
kitaawe 2
kitandikira 2
kiteeso 2
kitegeeza 2
kiti 2
kitiibwa 2
kitimbwa 2
kiyingi 2
kizimbibwa 2
kookolo 2
kooti 2
kubudaabudibwa 2
kukyagenda 2
kulonda 2
kunnyika 2
kuno 2
kunoonyereza 2
kusasula 2
kusiiwuuka 2
kusoma 2
kutaataaganyizibwa 2
kutendekebwa 2
kuwangula 2
kuyimba 2
kuyitamu 2
kwogera 2
kyadondo 2
kyakuwa 2
kyangu 2
kyankima 2
laawundi 2
land 2
leediyo 2
libadde 2
liragira 2
looni 2
looya 2
lt 2
ltd 2
ludda 2
luke 2
luvannyuma 2
luwombo 2
lwomukaaga 2
maanyi 2
magoola 2
makanga 2
makindye 2
maneja 2
mannya 2
margaret 2
masiki 2
mathew 2
mawulire 2
mazima 2
mbalirira 2
mbi 2
memorial 2
mmande 2
mmita 2
molly 2
moses 2
mpingu 2
mugezi 2
mukimanye 2
mukulu 2
mukyala 2
mulala 2
mulindwa 2
mulundi 2
munnaabwe 2
musajja 2
musanyufu 2
musiita 2
musiitwa 2
mutabani 2
mutungo 2
muwala 2
muyambi 2
muyizzi 2
mwami 2
mwasirizi 2
mwe 2
mwenda 2
nabaziza 2
nabukenya 2
nakasinde 2
nakyo 2
nangoye 2
nankindu 2
nassif 2
ncs 2
ndawula 2
ndi 2
nema 2
nguudo 2
njawulo 2
nju 2
nkambi 2
nnaku 2
nnali 2
nnyindo 2
norman 2
nsasaanya 2
ntebe 2
ntuufu 2
nze&hellip 2
o 2
obeera 2
obubbi 2
obubenje 2
obuganda 2
obukakafu 2
obusookerwako 2
obusungu 2
obuvune 2
obuyambi 2
obuyinza 2
obwassemugayaavu 2
ofunye 2
ogenda 2
oggyeeko 2
ogutegekebwa 2
ogwatandise 2
ogwel 2
okubaako 2
okubasomesa 2
okubawuliriza 2
okubiri 2
okubongera 2
okuddukanya 2
okufiira 2
okufiirwa 2
okugguka 2
okuggya 2
okugibala 2
okugoba 2
okugootaana 2
okugwa 2
okujjanjaba 2
okukituukiriza 2
okukolera 2
okukoma 2
okukuuma 2
okukwataganira 2
okukwatibwa 2
okulabika 2
okulabirira 2
okulemesa 2
okulinnya 2
okulunda 2
okulwala 2
okulwanyisa 2
okumegga 2
okumenya 2
okumukuba 2
okumusikira 2
okumutwala 2
okumuwa 2
okunaaba 2
okunoonyeza 2
okusala 2
okusalawo 2
okusannyalala 2
okusigala 2
okusomera 2
okusooka 2
okusookera 2
okusuzibwa 2
okutambula 2
okuteekako 2
okutereeza 2
okuttunka 2
okutwala 2
okuwagira 2
okuyita 2
okuyonja 2
okuzza 2
okwaaza 2
okwekwata 2
okwemulugunya 2
okwerekereza 2
okwetaba 2
okwetabamu 2
okwetangira 2
okwetegeka 2
okweyita 2
okweyiwa 2
old 2
olunaku 2
olususu 2
oluusi 2
oluyimba 2
omugoba 2
omukazi 2
omukozi 2
omumyuka 2
omusaabaze 2
omusomesa 2
omuto 2
omuwandiisi 2
omuzannyo 2
omwala 2
osobola 2
ossa 2
otuuka 2
otya 2
owoyesigyire 2
oziwa 2
paradise 2
peter 2
piki 2
power 2
ppamba 2
puliida 2
ronald 2
sabbuuni 2
seed 2
sharon 2
simon 2
so 2
soccer 2
sops 2
sports 2
ssaabasumba 2
ssaako 2
ssaawa 2
ssekatawa 2
ssemateeka 2
ssembeguya 2
ssenga 2
ssennyonjo 2
ssenyonga 2
ssenyonjo 2
sserubiri 2
ssesanga 2
taata 2
takisi 2
tasubwa 2
tawulo 2
tebagenda 2
tebannakomawo 2
tebayinza 2
tetulina 2
tewali 2
todwong 2
tokkiriza 2
tokyo 2
tteeka 2
tubasaba 2
tulina 2
tusasudde 2
twebaza 2
university 2
waakuddamu 2
waakyo 2
waduro 2
waka 2
wandegeya 2
wanzaala 2
wo 2
wulira 2
yaabwe 2
yabasabye 2
yabwe 2
yagasseeko 2
yagenze 2
yakakasizza 2
yakomekkerezeddwa 2
yakozesa 2
yakubye 2
yakuleetedde 2
yalagidde 2
yatabukidde 2
yatandise 2
yatunula 2
yatuuse 2
yatuwadde 2
yavudde 2
yayise 2
yeeraliikiriza 2
yeetaaga 2
yeetegekera 2
yeeyamye 2
yeeyita 2
yona 2
zaakutandika 2
ze 2
zeetaaga 2
zibadde 2
zokka 2
zzooni 2
