mu 473
ku 309
nga 267
n 245
nti 227
ne 196
ng 128
e 106
era 92
wa 74
y 63
bwe 55
abantu 54
kkooti 44
kyokka 44
kino 42
w 41
kya 39
bw 38
ssegirinya 38
ya 36
ye 36
gy 35
gye 35
uganda 35
wabula 34
yagambye 34
ate 33
agamba 32
bano 30
by 30
buli 29
ky 29
poliisi 29
ssente 29
gavumenti 28
be 27
naye 27
bya 26
eby 26
okuva 26
000 25
abayizi 25
b 25
eno 25
magufuli 25
olw 25
ono 25
s 25
okukola 24
we 24
aba 23
z 23
2021 22
ba 22
ga 22
lya 22
amaka 21
kubanga 21
kye 21
ttiimu 21
bye 20
owa 20
abaana 19
emipiira 19
kuba 19
lw 19
lwe 19
okufuna 19
oluvannyuma 19
omu 19
yategeezezza 19
abadde 18
eri 18
gw 18
gwe 18
march 18
minisita 18
yabadde 18
abalala 17
bantu 17
eky 17
ensonga 17
kwe 17
pulezidenti 17
abamu 16
ali 16
enjawulo 16
gwa 16
kiseera 16
lwa 16
okulaba 16
omusango 16
amazzi 15
ly 15
oba 15
omulamuzi 15
omupiira 15
akulira 14
bino 14
bonna 14
disitulikiti 14
eddagala 14
ez 14
kifo 14
kkomera 14
mulimu 14
omulambo 14
omwana 14
ssentebe 14
wakati 14
yali 14
akakiiko 13
alina 13
bwa 13
dr 13
ebibuuzo 13
ebigezo 13
ebika 13
ebiwandiiko 13
guno 13
kampala 13
kati 13
kyalo 13
maaso 13
omutindo 13
palamenti 13
abazigu 12
babadde 12
eggwanga 12
emirimu 12
mayiga 12
nnyo 12
okutuusa 12
omuwala 12
road 12
1 11
10 11
4 11
abanyarwanda 11
ayagala 11
ebirala 11
g 11
guloba 11
kano 11
saka 11
17 10
afrika 10
biwandiiko 10
buganda 10
bulungi 10
eddembe 10
emyaka 10
eya 10
jpg 10
kasango 10
kawempe 10
kiwanuka 10
kw 10
maka 10
museveni 10
okufa 10
okumala 10
olwo 10
omuli 10
omuntu 10
wiiki 10
akafuba 9
awaka 9
baali 9
bakola 9
bangi 9
cranes 9
ekitongole 9
engeri 9
engoye 9
ey 9
february 9
katikkiro 9
lino 9
mbeera 9
nsonga 9
obulwadde 9
okuba 9
okuli 9
omuyizi 9
ow 9
sabbuuni 9
ssebuliba 9
tanzania 9
wadde 9
ze 9
ab 8
baabadde 8
bannayuganda 8
bududa 8
ekya 8
emisango 8
emu 8
ennyo 8
essomero 8
ggoolo 8
k 8
lwokubiri 8
mugaya 8
mwe 8
nabo 8
obudde 8
oku 8
okubeera 8
okutuuka 8
olukwe 8
omwaka 8
omwogezi 8
ssande 8
ssomero 8
talina 8
wamu 8
za 8
2 7
5 7
6 7
abaabadde 7
abajaasi 7
agenda 7
asaba 7
baabwe 7
baagala 7
bagenda 7
balumba 7
bba 7
bitundu 7
bizinensi 7
ebintu 7
ekyo 7
endiboota 7
ente 7
eyali 7
ffamire 7
gano 7
gya 7
kadaga 7
kamuli 7
kibiina 7
kibuga 7
kitongole 7
kitundu 7
kuliko 7
lye 7
mmotoka 7
mukyala 7
mutabani 7
nabadda 7
nkola 7
obukadde 7
ofiisi 7
okusaba 7
okusinziira 7
okuyita 7
oluvanyuma 7
omubaka 7
omukulu 7
ssabbuuni 7
ssentongo 7
tewali 7
100 6
30 6
500 6
7 6
abagenda 6
abakozi 6
abakyala 6
abasomesa 6
abawagizi 6
abazannyi 6
abo 6
afuna 6
amaanyi 6
amanyiddwa 6
bali 6
bbiri 6
bifo 6
bintu 6
bruce 6
byabwe 6
byonna 6
cameroon 6
corona 6
ebbanga 6
ebisago 6
ekimu 6
ekizimbe 6
emikolo 6
etuttumu 6
gen 6
ggwanga 6
kigambibwa 6
luno 6
meddie 6
musango 6
musanvu 6
nnamba 6
nsi 6
nup 6
obubonero 6
obulamu 6
obulungi 6
okugemebwa 6
okunoonyereza 6
okutandika 6
okweyimirirwa 6
omugagga 6
omulimu 6
omulonde 6
omumyuka 6
omuserikale 6
omutendesi 6
omuwandiisi 6
omuzannyi 6
ramsey 6
si 6
simon 6
ssaawa 6
ssekabembe 6
ssentamu 6
wakiso 6
waliwo 6
yaabwe 6
yasabye 6
yonna 6
2019 5
2020 5
3 5
abakulembeze 5
abalamuzi 5
abanene 5
abasajja 5
abatuuze 5
abazadde 5
akamalirizo 5
amabaati 5
amagye 5
asabye 5
asobola 5
baana 5
babiri 5
balina 5
bamaze 5
basaba 5
basobole 5
biseera 5
bo 5
bweyategezezza 5
covid 5
daniel 5
dda 5
ddala 5
ebijambiya 5
ebiri 5
ebyo 5
eggulo 5
ekibiina 5
ekisero 5
emyezi 5
endwadde 5
ennaku 5
ensi 5
enteekateeka 5
esatu 5
ggombolola 5
gino 5
gumu 5
john 5
katonda 5
kimu 5
kwa 5
kyonna 5
lt 5
luguudo 5
lwaki 5
maama 5
majuva 5
makindye 5
manu 5
moses 5
mukwano 5
munisipaali 5
mwaka 5
nampiima 5
nayikondo 5
njagala 5
obwakabaka 5
okugema 5
okukyusa 5
olukiiko 5
olunaku 5
omugenzi 5
omuliro 5
osobola 5
pakistan 5
pimbas 5
sipiika 5
siriimu 5
south 5
sulaiman 5
tebalina 5
the 5
uneb 5
updf 5
wano 5
yategezezza 5
zaabwe 5
00 4
19 4
20 4
23 4
ababadde 4
ababeera 4
abakungu 4
abali 4
abasibe 4
abasinga 4
abavubuka 4
abazanyi 4
ag 4
agambye 4
akola 4
akozesa 4
akyali 4
alaga 4
aleme 4
amagezi 4
amateeka 4
amayonjo 4
amaze 4
amerika 4
amyuka 4
april 4
arsenal 4
asp 4
baategeezezza 4
balooya 4
bannamawulire 4
banne 4
bapulezidenti 4
bizimbe 4
boodabooda 4
bubonero 4
bulamu 4
buno 4
burkina 4
byuma 4
central 4
choupo-moting 4
ddwaaliro 4
ebibye 4
ebigambibwa 4
ebimu 4
ebiragiro 4
ebirowoozo 4
ebisaawe 4
ebyemizannyo 4
ebyobulamu 4
edda 4
egy 4
ekibonerezo 4
ekifo 4
ekika 4
ekintu 4
ekirala 4
ekiro 4
ekisaawe 4
ekiseera 4
ekyalo 4
elwelu 4
enkola 4
enkulu 4
enkumi 4
ettaka 4
ewedde 4
ezisoba 4
faso 4
ferdinand 4
ge 4
godfrey 4
hassan 4
henry 4
kamasanyu 4
karamoja 4
katale 4
kenya 4
kiba 4
kiige-bugaga 4
kijazi 4
kira 4
kisaawe 4
kubeera 4
kulekulira 4
kuno 4
kyotera 4
makya 4
mengo 4
mmande 4
mmengo 4
mubiru 4
mukolo 4
muntu 4
mutima 4
muzeeyi 4
myaka 4
na 4
nafuna 4
nakatsi 4
ndiga 4
north 4
odegaard 4
ofuna 4
okubba 4
okukwata 4
okukwatibwa 4
okulima 4
okulwanyisa 4
okutema 4
okutuula 4
okuyimbula 4
olutalo 4
olwekyo 4
omujaasi 4
omukyala 4
omwezi 4
orono 4
patrick 4
premier 4
robert 4
rose 4
ruhindi 4
sarah 4
ssemateeka 4
standard 4
twagala 4
umubano 4
usaid 4
wakayima 4
yafa 4
yafudde 4
yafuna 4
yatuukiriddwa 4
yenna 4
zino 4
zisinga 4
12 3
13 3
14 3
18 3
200 3
25 3
27 3
50 3
60 3
700 3
8 3
9 3
a 3
abaali 3
ababaka 3
abaguzi 3
abakaayanira 3
abakulira 3
abakungubazi 3
abalimi 3
abalina 3
abangi 3
abasaba 3
abasuubuzi 3
abazze 3
abeera 3
agali 3
agambibwa 3
akatale 3
akayiso 3
akkiriza 3
akolera 3
aliko 3
alipoota 3
amasaati 3
amasasi 3
amasimu 3
amasomero 3
amawanga 3
arteta 3
asobole 3
ategeeza 3
ava 3
awakanya 3
awamu 3
awo 3
ayogera 3
ayogerako 3
baafunye 3
baakwatibwa 3
baba 3
bafa 3
bagamba 3
bakasitoma 3
bakozesa 3
bakulembeddwa 3
bamutadde 3
bana 3
basabye 3
basisinkanye 3
basobola 3
batandike 3
bateekako 3
bawona 3
bayern 3
bayinza 3
bbeeyi 3
beek 3
beetaaga 3
bill 3
biri 3
bobi 3
budde 3
bukya 3
bungi 3
butaka 3
buwambe 3
buwumbi 3
bwatyo 3
bwekyabeeranga 3
bwokka 3
bwonna 3
byabashaija 3
byaliwo 3
castle 3
charles 3
ddagala 3
de 3
derrick 3
dpp 3
east 3
ebifo 3
ebikozesebwa 3
ebisero 3
ebitongole 3
ebya 3
ebyetaagisa 3
ebyuma 3
ekifaananyi 3
ekikula 3
ekiragiro 3
ekiri 3
ekirwadde 3
ekitegeeza 3
ekitundu 3
ekyomusanvu 3
embeera 3
empapula 3
endala 3
ensimbi 3
erinnya 3
erya 3
etaano 3
etteeka 3
eyafiira 3
eyasobezebwako 3
eza 3
for 3
frank 3
gaabwe 3
george 3
gladys 3
gwabadde 3
gyabwe 3
hajji 3
index 3
jane 3
juliet 3
julius 3
juventus 3
ka 3
kakira 3
kalina 3
kasangati 3
kcca 3
khainza 3
kiddiridde 3
kinene 3
kirunda 3
kisero 3
kitaawe 3
kitebe 3
kugenda 3
kukola 3
kusigala 3
kuva 3
kyetaagisa 3
liverpool 3
looya 3
lunaku 3
lyabwe 3
mahiga 3
malende 3
mannya 3
maria 3
masomero 3
masomo 3
mateeka 3
mawanga 3
mawulire 3
mike 3
mikutu 3
mikwano 3
mirimu 3
mityana 3
mpigi 3
mukasa 3
mulago 3
mutindo 3
mwana 3
mwandhuzi 3
naddala 3
naikondo 3
nakiwala 3
nakiyingi 3
nayo 3
nelson 3
new 3
newcastle 3
ngeri 3
nkata 3
nnaku 3
nnannyini 3
nnina 3
nnyingi 3
nnyumba 3
nsaba 3
ntebe 3
nteekateeka 3
nze 3
obugagga 3
obulabirizi 3
obuwanguzi 3
obuyigirize 3
obw 3
oggyeeko 3
oguwedde 3
ogw 3
okubeerawo 3
okubuulirira 3
okuddirira 3
okugemwa 3
okugeza 3
okuggyako 3
okugoba 3
okujaguza 3
okukuuma 3
okuleeta 3
okulumba 3
okumaliriza 3
okumanya 3
okumukuba 3
okumutuusaako 3
okusisinkana 3
okutuukiriza 3
okutya 3
okutyoboola 3
okuwangula 3
okuyiga 3
okuzimba 3
okuzzaawo 3
okwagala 3
okwekalakaasa 3
olugoye 3
olumu 3
omuguwa 3
omukambwe 3
omukono 3
omukungu 3
omulabirizi 3
omulundi 3
omusajja 3
omusamize 3
omusuubuzi 3
omuzadde 3
peter 3
pombe 3
rdc 3
richard 3
rights 3
sente 3
shamim 3
ssenyiga 3
sso 3
sudan 3
suluhu 3
ttaka 3
tukaikiriza 3
van 3
waggulu 3
wandegeya 3
wange 3
wiikendi 3
workers 3
yagasseeko 3
yakozesa 3
yalaze 3
yamufunamu 3
yasoma 3
yasooka 3
yategeeza 3
yawadde 3
yayongeddeko 3
yintaneeti 3
zaffe 3
zziwa 3
110 2
15 2
2009 2
2018 2
22 2
250 2
28 2
3-1 2
3/8/2020 2
300 2
328 2
35 2
40 2
450 2
584 2
66358 2
80 2
aana 2
abaagemeddwa 2
abaamawulire 2
abaganda 2
abajja 2
abakugu 2
abalungi 2
abasawo 2
abategeeza 2
abawera 2
abazungu 2
abeebyokwerinda 2
abuuzibwa 2
acanga 2
adam 2
addamu 2
adduka 2
aduumira 2
afa 2
africa 2
agenze 2
ajja 2
akabenje 2
akabinja 2
akapiira 2
akaseera 2
akateekebwawo 2
akatono 2
akitegedde 2
akubirizza 2
akwata 2
akwatibwa 2
akyasigaddeyo 2
alabudde 2
alex 2
allah 2
alliance 2
aluka 2
alumiriza 2
amabanda 2
amagoba 2
amakomera 2
amasannyalaze 2
amasaza 2
amawulire 2
amaziga 2
amendment 2
amuggulako 2
amusobyako 2
amutuusaako 2
amuyambe 2
andrew 2
asanze 2
asisinkanye 2
asoma 2
association 2
atabuse 2
atandise 2
ateebereza 2
atemwako 2
athieno 2
atuuka 2
atuuse 2
atwala 2
atwalibwe 2
augustine 2
ave 2
awa 2
awaabadde 2
awangudde 2
awedde 2
ayamba 2
azannyira 2
baagambye 2
baakwatibwamu 2
baalabidde 2
baasooka 2
baasoose 2
baatuuse 2
baatwala 2
baazitwala 2
babateeke 2
babbe 2
babbeyo 2
babeere 2
badda 2
badru 2
baffe 2
bafudde 2
bafuna 2
bagende 2
bagezaako 2
bakama 2
bakolera 2
bakozi 2
bakwatibwa 2
balala 2
bammemba 2
bamubuuza 2
bamukkirize 2
bamusaba 2
bamwebuuzaako 2
bannaffe 2
bannansi 2
bannasayansi 2
banyarwanda 2
basanyukidde 2
basatu 2
basobodde 2
basoma 2
basooke 2
basuubuzi 2
batebereza 2
bateebereza 2
bato 2
batunda 2
batutte 2
bava 2
bawalampa 2
bawangula 2
bawannyondo 2
bayiseemu 2
bayita 2
bayitamu 2
bazadde 2
bazannyi 2
bazze 2
bbaala 2
bbanga 2
bbanja 2
bbo 2
bbulawuzi 2
beekalakaase 2
bibiina 2
bibooge 2
biddemu 2
bika 2
bingi 2
biraga 2
birina 2
bisaawe 2
bitarabeho 2
bob 2
bokka 2
brian 2
bubage 2
bufalansa 2
bukedde 2
bukyanga 2
bulange 2
bulijjo 2
busazizzaamu 2
busobozi 2
busoga 2
butale 2
buvuddeko 2
buwanguzi 2
buzibu 2
bwaffe 2
bwakabaka 2
bwangu 2
bwebabadde 2
bwebalina 2
bwegyaali 2
bwenkanya 2
bwetukola 2
bweyagaseeko 2
bweyayogedde 2
bweyisibwa 2
bweyogerere 2
byaabwe 2
byabadde 2
byava 2
caleb 2
city 2
congo 2
covid-19 2
david 2
dayirekita 2
ddamuzi 2
dduwa 2
diso 2
dodoma 2
drone 2
ebbaluwa 2
ebbeeyi 2
ebigenge 2
ebikolwa 2
ebikyukamu 2
ebisooka 2
ebitundu 2
ebyamateeka 2
ebyokulonda 2
efunira 2
egenda 2
eggye 2
egibadde 2
egiyise 2
ejulirwamu 2
ekibuga 2
ekigwo 2
ekikomera 2
ekikulu 2
ekinene 2
ekirime 2
ekirowoozo 2
ekitone 2
ekituufu 2
ekiyinza 2
ekoze 2
ekulembedde 2
ekyakubwa 2
ekyaviiriddeko 2
elgon 2
emabega 2
embooko 2
embuto 2
emiriraano 2
emisomo 2
emizannyo 2
emmanuel 2
emmotoka 2
employment 2
enddala 2
engatto 2
engulu 2
enkalakkalira 2
ennungi 2
ennyanya 2
enseneene 2
ensobi 2
ensonda 2
ensujju 2
entegeka 2
enyingi 2
eppipa 2
erigema 2
erimu 2
eryetegerezebwa 2
eryo 2
esobola 2
essaala 2
essimu 2
essuubi 2
eteekebwe 2
ewa 2
ewangula 2
eyabadde 2
eyabasomera 2
eyabatuusizza 2
eyaliko 2
eyo 2
ezigambibwa 2
ezitwetolodde 2
fayiro 2
finance 2
florence 2
fred 2
frederick 2
fund 2
gali 2
galiwango 2
gange 2
gashumba 2
ggye 2
giddemu 2
giraze 2
gutti 2
gwabwe 2
gwatinta 2
gwazo 2
gyange 2
gyatandika 2
gyegiviriddeko 2
gyeguli 2
human 2
jacob 2
james 2
january 2
jeshi 2
jjuuko 2
jonas 2
jordan 2
joseph 2
joshua 2
june 2
junior 2
kaabuyonjo 2
kaakukola 2
kaala 2
kaalangirirwa 2
kabadde 2
kabaka 2
kabenje 2
kabineti 2
kabugo 2
kadde 2
kaguli 2
kakalu 2
kakiiko 2
kakugenda 2
kakulemberwa 2
kaleebu 2
kaliisa 2
kalungu 2
kamisona 2
kamya 2
kapafu 2
kasiringi 2
kasitoma 2
kasozi 2
kasumba 2
katabira 2
katiba 2
katungi 2
kaweefube 2
kawuka 2
kayitana 2
kayo 2
kayondo 2
kenneth 2
kenyatta 2
kevin 2
ki 2
kibadde 2
kiberu 2
kidandala 2
kidiba 2
kijja 2
kikyamu 2
kirabika 2
kirina 2
kiro 2
kisenge 2
kitegeeza 2
kiyamba 2
kiyingi 2
kizimbe 2
kkaadi 2
kkiro 2
kololo 2
kuddemu 2
kukuba 2
kulaga 2
kuluka 2
kumulabako 2
kumulabirira 2
kunoonyezebwa 2
kusasira 2
kutongole 2
kutuukiriza 2
kuvunaanibwa 2
kuyamba 2
kuyitibwa 2
kwekalakaasa 2
kwogera 2
kyaddirira 2
kyagulanyi 2
kyambadde 2
kyebando 2
ldu 2
leero 2
liigi 2
limanda 2
linnya 2
lower 2
lubowa 2
lukalala 2
luke 2
lumu 2
lungereza 2
luwum 2
lwabwe 2
lwategekebwa 2
lwokusatu 2
lwokutaano 2
lyonna 2
machari 2
magala 2
maj 2
makomera 2
makubo 2
malawi 2
mangu 2
mara 2
margaret 2
mariam 2
masaka 2
may 2
mbaga 2
mbi 2
mbibatuusaako 2
mikono 2
mingi 2
mini 2
mipiira 2
misango 2
misolo 2
mmeeya 2
mmemba 2
mmuwe 2
monitoring 2
mpaaba 2
mpiima 2
mpoza 2
mubaka 2
mugagga 2
mugaso 2
mugenzi 2
muhammad 2
mujjabi 2
mukama 2
mulamba 2
munda 2
munnaabwe 2
munnamateeka 2
munnayuganda 2
munne 2
musamize 2
muti 2
mutimbagano 2
mutuluza 2
mwezi 2
mwize 2
myezi 2
nabyo 2
nago 2
nakwo 2
nannyini 2
nansana 2
natandika 2
national 2
nfuna 2
ngako 2
ngitunda 2
ngobi 2
nguudo 2
njawulo 2
nkolera 2
nnyina 2
noolwekyo 2
nsiike 2
nsisinkano 2
nsooba 2
nte 2
ntinda 2
o 2
obukodyo 2
obukugu 2
obulabe 2
obulagajjavu 2
obuntu 2
obutalangirira 2
obutali 2
obutono 2
obuvune 2
obwa 2
obwegendereza 2
obwenkanya 2
obwesige 2
ochan 2
of 2
okello 2
okozesa 2
okubaka 2
okubakakasa 2
okubeeramu 2
okudda 2
okuddira 2
okufiirwa 2
okufunira 2
okugata 2
okugenda 2
okujjanjabibwa 2
okukebera 2
okukka 2
okukuba 2
okukulaakulanya 2
okukuma 2
okulabirako 2
okulaga 2
okulagira 2
okulekulira 2
okulonda 2
okulondebwa 2
okuluka 2
okulya 2
okumuta 2
okumutema 2
okumutwala 2
okumuwa 2
okumuwasa 2
okumuzaalamu 2
okunoonya 2
okusabira 2
okusala 2
okusereba 2
okusiima 2
okusika 2
okusinga 2
okusinziirira 2
okusobola 2
okusoma 2
okusooka 2
okusoomoozebwa 2
okussa 2
okussaamu 2
okutandikawo 2
okuteebwa 2
okuteeka 2
okutemezebwako 2
okutikkirwa 2
okutunda 2
okuvaamu 2
okuvuluga 2
okuwa 2
okuwulira 2
okuyambibwa 2
okuyitibwa 2
okuzuula 2
okuzza 2
okwegatta 2
okwenyigira 2
okwewala 2
okwogera 2
okwoza 2
olina 2
olubuto 2
oludda 2
olungereza 2
oluusi 2
oluwabula 2
olwa 2
olwaleero 2
omanya 2
ompiyo 2
omuduumizi 2
omukisa 2
omukolo 2
omukwano 2
omulala 2
omulwanirizi 2
omupya 2
omusanvu 2
omutuuze 2
omuwaabi 2
omuwuwuttanyi 2
osanga 2
oswald 2
oteekamu 2
otwa 2
oulanyah 2
overseas 2
owoyesigyire 2
oyagala 2
oyongera 2
p7 2
pawundi 2
pc 2
ple 2
poloti 2
president 2
price 2
psg 2
pulovinsi 2
real 2
rebecca 2
rogers 2
ronald 2
room 2
rwanda 2
sajjabi 2
sam 2
samia 2
samuel 2
school 2
she 2
sheikh 2
sizoni 2
sooda 2
spiika 2
ssaayansi 2
ssanyu 2
ssatu 2
ssejjengo 2
ssekimpi 2
ssekinnoomu 2
ssematiko 2
ssempijja 2
ssenninde 2
sserwadda 2
ssiga 2
ssimu 2
stadium 2
stephen 2
street 2
suzan 2
takisi 2
tasobola 2
tasoose 2
tayitika 2
tb 2
tebaayambibwa 2
tebamulina 2
tebayinza 2
tejja 2
tekasisinkananga 2
teopista 2
teri 2
teririna 2
tezigunjula 2
ttaano 2
tteeka 2
tulukira 2
tusobola 2
ueb 2
uhuru 2
uwera 2
voice 2
waabwe 2
waaliwo 2
waayo 2
waffe 2
wairaka 2
wakabi 2
wannyondo 2
wateekwa 2
wayise 2
wo 2
yabalagidde 2
yabasabye 2
yaffe 2
yagenda 2
yaguzza 2
yajja 2
yakwatiddwa 2
yaliko 2
yalina 2
yalondebwa 2
yamugaana 2
yasimbiddwa 2
yasisinkana 2
yavumiridde 2
yawa 2
yawawaabira 2
yeegaana 2
yeekalakaasa 2
yeetaaga 2
yeewuunya 2
yeewuunyizza 2
yennyini 2
ying 2
zaategeezezza 2
