mu 670
nga 482
ku 437
nti 376
ne 298
era 211
bwe 142
ye 113
e 99
kubanga 93
gye 92
abantu 88
kye 86
wa 80
poliisi 79
22 75
kya 72
ago 70
2025-11-06 69
html 69
https 69
watchdoguganda 69
www 69
years 69
kino 66
naye 65
we 63
yagambye 60
ya 56
gavumenti 53
ggwanga 53
ba 52
yali 50
be 49
saako 49
eno 48
mukono 46
6 45
kyokka 45
bagenda 42
ate 41
buli 40
bagamba 36
kati 36
bano 34
bugingo 34
bye 34
emirimu 33
maaso 33
nabo 33
kampala 32
kitatta 32
7 31
aba 31
kkooti 31
agamba 30
museveni 30
bannamawulire 29
nnyo 29
okuva 28
wabula 28
disitulikiti 27
ekitongole 27
gwa 27
kiseera 27
pulezidenti 27
lya 26
mbeera 26
yabadde 26
bino 25
omulimu 25
ono 25
uganda 25
yadde 25
bantu 24
gwe 24
lwa 24
obukadde 24
abadde 23
emisango 23
ensimbi 23
kyagulanyi 23
naddala 23
okulaba 23
baali 22
buvuddeko 22
minisita 22
nrm 22
okugenda 22
banne 21
bodaboda 21
kwe 21
okuli 21
abatuuze 20
babadde 20
guno 20
katonda 20
nsonga 20
nze 20
oluvanyuma 20
omu 20
palimenti 20
yategezezza 20
eri 19
nagamba 19
abakulembeze 18
abalala 18
baabwe 18
bangi 18
kitundu 18
kyalo 18
abaana 17
bobi 17
mwaka 17
okukola 17
okusobola 17
okwogera 17
ssentebe 17
ttaka 17
wine 17
agambye 16
embeera 16
kibiina 16
kuba 16
muntu 16
omubaka 16
omuli 16
rwanda 16
ssente 16
yonna 16
ze 16
bulungi 15
ddala 15
ekibiina 15
ettaka 15
nantaba 15
omulamuzi 15
teddy 15
wakati 15
za 15
2 14
4 14
abakulira 14
ga 14
ka 14
wano 14
basobole 13
ekifo 13
lwe 13
nsimbi 13
okufuna 13
okusinziira 13
olwo 13
omwaka 13
ssi 13
waliwo 13
000 12
20 12
2010 12
29 12
ababaka 12
abagoberezi 12
abakadde 12
abamu 12
amawulire 12
bakola 12
bali 12
bya 12
ekya 12
ennaku 12
gya 12
kano 12
kibuga 12
kitongole 12
kyagamba 12
maka 12
ngeri 12
oba 12
okusobozesa 12
okutuuka 12
omuntu 12
omwana 12
omwezi 12
robert 12
27 11
abakozi 11
abavubuka 11
baba 11
bagenze 11
balina 11
bilala 11
bonna 11
byabwe 11
byonna 11
ebintu 11
ennyo 11
fred 11
katale 11
kukola 11
kwotadde 11
luguudo 11
mirimu 11
mwe 11
okubeera 11
y’e 11
zaabwe 11
23 10
25 10
ababadde 10
akulira 10
amazzi 10
bakozi 10
biseera 10
bisolo 10
boda 10
bwa 10
cbs 10
ebbanga 10
eggwanga 10
ekisangibwa 10
embalirira 10
emmotoka 10
ensalo 10
essaawa 10
kibuule 10
kifo 10
kigambibwa 10
kkanisa 10
lino 10
lye 10
mulimu 10
munnamawulire 10
myaka 10
na 10
nnyina 10
obulungi 10
obuzibu 10
ofiisi 10
okudda 10
omusumba 10
zonna 10
100 9
21 9
28 9
3 9
30 9
abaali 9
agenda 9
alina 9
ayagala 9
baagala 9
bamaze 9
busega 9
dda 9
eddembe 9
ekkanisa 9
enguudo 9
entekateeka 9
gombolola 9
gyabwe 9
ki 9
kkampuni 9
kooti 9
mukasa 9
okuba 9
okwongera 9
oluguudo 9
omusango 9
tewali 9
yanyonyodde 9
yasabye 9
yoweri 9
24 8
abalamazi 8
akatale 8
bajjo 8
bingi 8
buvuma 8
buyinza 8
ddwaliro 8
division 8
eby’enjawulo 8
ekyo 8
engeri 8
eyali 8
famire 8
ge 8
gen 8
kaguta 8
klesia 8
kusaba 8
kuziika 8
kwa 8
lubaga 8
maama 8
maneja 8
mawulire 8
mubaka 8
namugongo 8
obuwumbi 8
offiisi 8
okujja 8
okutuusa 8
omwogezi 8
ronald 8
tebalina 8
wadde 8
wamu 8
zi 8
10 7
2019 7
26 7
akakiiko 7
amaanyi 7
baffe 7
bitundu 7
bp 7
bubi 7
budde 7
bwabadde 7
bwonna 7
dr 7
ebisolo 7
ebyo 7
ekiseera 7
emabega 7
emyaka 7
enkuba 7
eya 7
gaabwe 7
kale 7
kayihura 7
kcca 7
ke 7
kiggundu 7
kitebe 7
kwogera 7
mr 7
munda 7
naggalama 7
naluswa 7
namata 7
nsereko 7
n’agamba 7
obubi 7
okulonda 7
olukiiko 7
olumu 7
olunaku 7
oluvannyuma 7
olw’okuba 7
omubeezi 7
patrick 7
paul 7
sebulime 7
sente 7
tulina 7
wakiso 7
yategeezezza 7
8 6
abali 6
abalina 6
abalongo 6
abasuubuzi 6
abatemu 6
abo 6
agaba 6
agasangibwa 6
amagezi 6
amaze 6
bannabyabufuzi 6
basazeewo 6
bategezezza 6
bizinga 6
bulijjo 6
bwatyo 6
centre 6
chakig 6
east 6
ebitundu 6
egenda 6
ekiwandiiko 6
enanga 6
ensonga 6
fresh 6
gino 6
gumu 6
kagimu 6
kid 6
kiddiridde 6
kkubo 6
kudda 6
kugenda 6
kulaba 6
kusooka 6
kutandika 6
kyadondo 6
kyali 6
leero 6
lusanja 6
luzira 6
makubo 6
mateeka 6
meeya 6
munne 6
mutabazi 6
nantume 6
ngenda 6
nnyumba 6
obutali 6
okukozesa 6
okunonyereza 6
okutambuza 6
okuyisa 6
oluva 6
olwaleero 6
omulabirizi 6
omulambo 6
omuliro 6
si 6
sipiika 6
siteegi 6
ssomero 6
takisi 6
talina 6
tamale 6
tugenda 6
tuli 6
yasalawo 6
yayongeddeko 6
zino 6
06 5
08 5
14 5
32 5
40 5
abaliko 5
abalonzi 5
abaselikale 5
abayambi 5
ajja 5
akaseera 5
akolera 5
amaka 5
amangu 5
amasasi 5
amateeka 5
andrew 5
awo 5
ayogera 5
bafa 5
bakolera 5
baliruno 5
banange 5
batambula 5
bava 5
bavuddeyo 5
bayita 5
bbanka 5
bbo 5
bukadde 5
byalo 5
by’obufuzi 5
by’omunsiko 5
col 5
embi 5
enjiri 5
ennugu 5
eyo 5
for 5
gw’okuzimba 5
hill 5
katumba 5
katuna 5
kayunga 5
kenya 5
kidiba 5
kkansala 5
kufa 5
lt 5
lukiiko 5
luwalira 5
lw’okutaano 5
lyabwe 5
ly’obuntu 5
mayumba 5
mikutu 5
mirundi 5
mmotoka 5
mukama 5
mukyala 5
munisipaari 5
mutabani 5
muyingo 5
nakisunga 5
nama 5
ndi 5
nkola 5
nkuba 5
ntagali 5
ntakke 5
ntekateeka 5
ntono 5
n’abamu 5
obukuumi 5
obulemu 5
obwedda 5
odoi 5
of 5
okubawa 5
okukolagana 5
okukomya 5
okusalawo 5
okusoma 5
okutandika 5
okuvaayo 5
okuwa 5
okwemulugunya 5
omukulu 5
omukuumi 5
omukyala 5
owa 5
palamenti 5
rebecca 5
sebuguzi 5
ssentamu 5
ssenyonga 5
taata 5
tanga 5
teri 5
waabwe 5
waninda 5
wansi 5
water 5
west 5
yagamba 5
yayogedde 5
zokka 5
03 4
11 4
2015 4
2021 4
46 4
5 4
50 4
ababbi 4
abalwadde 4
abasawo 4
abawala 4
akasente 4
ali 4
amaggye 4
amakaage 4
asobola 4
asuman 4
atya 4
avuddeyo 4
awamu 4
baagambye 4
bafuna 4
bajeti 4
bajja 4
bakaleke 4
bakozesa 4
bambega 4
basalawo 4
basalirwa 4
basawo 4
batandise 4
batuuka 4
batuuze 4
bazadde 4
bazze 4
bigambo 4
bugiri 4
bulamu 4
bumativu 4
butongole 4
ddembe 4
ddumba 4
ebibiina 4
ebimu 4
ebinyonyi 4
ebiwandiiko 4
ebizibu 4
ebyali 4
ekikola 4
ekizibu 4
ekkuumiro 4
eky’okulabirako 4
emisota 4
emitwalo 4
empisa 4
enkola 4
enkulu 4
eyawamu 4
ganjaala 4
gy’amawulire 4
hajji 4
james 4
john 4
kadaga 4
kamoga 4
kigenda 4
kigendererwa 4
kimu 4
kintu 4
kituufu 4
kiyinza 4
kizito 4
kkanso 4
kkomera 4
kufuna 4
kukuba 4
kulannama 4
kyagambye 4
kyetagisa 4
kyonna 4
leediyo 4
looya 4
luno 4
lw’okufuna 4
madhvani 4
magere 4
makaage 4
mannya 4
masomero 4
mbabazi 4
mbonye 4
mikolo 4
moses 4
mpereerwe 4
mukazi 4
mukwano 4
mulago 4
mumbere 4
mwanje 4
nakalema 4
nakoosi 4
nange 4
nasaba 4
nasalawo 4
nateete 4
ndeeba 4
njagala 4
nnaku 4
nnali 4
nsawo 4
ntaana 4
n’atandika 4
n’olumu 4
obujjanjabi 4
obwavu 4
ochan 4
oguwedde 4
okuggulawo 4
okujjako 4
okukolera 4
okukwata 4
okumala 4
okumanya 4
okumpi 4
okusala 4
okutegeeza 4
okutuukiriza 4
olukulu 4
olukungaana 4
oluvuganya 4
olwa 4
omugga 4
omukono 4
omukulembeze 4
omukwano 4
omusinga 4
one 4
opendi 4
rights 4
s 4
sacco 4
sebuufu 4
seeta 4
ssabalabirizi 4
ssebulime 4
tajja 4
ubc 4
yaabwe 4
yagasseeko 4
yattibwa 4
yenna 4
ziri 4
00 3
18 3
2016 3
44 3
500 3
51 3
54 3
57 3
abajja 3
abakkiriza 3
abakolera 3
abangi 3
abasodokisi 3
abazadde 3
abeera 3
abenjawulo 3
ab’enjawulo 3
afudde 3
aka 3
akamu 3
akiikirira 3
akimanyi 3
akola 3
akwatiddwa 3
ak’okuntikko 3
alabudde 3
alipoota 3
aloysius 3
and 3
asabye 3
asiimwe 3
asobole 3
ategezezza 3
awatali 3
awereza 3
awulira 3
ayimbuddwa 3
ayogedde 3
baakola 3
baana 3
baategezezza 3
babaka 3
babba 3
babitwala 3
bagaana 3
bagala 3
bagudde 3
bakama 3
bakungu 3
balimu 3
balinga 3
balowooza 3
balyoke 3
bamala 3
basanga 3
batandika 3
bavubuka 3
bbulooka 3
beetaaga 3
betty 3
bigere 3
bintu 3
biri 3
bitongole 3
bivvulu 3
budaama 3
buganda 3
bugaya 3
bulwadde 3
busabala 3
butale 3
butya 3
buzibu 3
bwabwe 3
byaruhanga 3
by’obulambuzi 3
by’okulonda 3
b’amateeka 3
b’ekibiina 3
chibita 3
cpl 3
ddereeva 3
ddoboozi 3
dp 3
ebigambo 3
ebikozesebwa 3
ebili 3
ebinnya 3
ebirala 3
ebituli 3
eddagala 3
egendereddwamu 3
egibadde 3
ekibinja 3
ekibuga 3
ekiddako 3
ekigatta 3
ekikulu 3
ekilamuzi 3
ekimu 3
ekiri 3
ekisoboka 3
ekitundu 3
ekituufu 3
ekivvulu 3
ekiwugirwamu 3
ekola 3
elisangibwa 3
emirambo 3
emisolo 3
emmere 3
empapula 3
enduulu 3
endwadde 3
enkya 3
entebbe 3
essanyu 3
etteeka 3
express 3
eyafa 3
eziba 3
fdc 3
ffe 3
gaba 3
george 3
gonna 3
gugenda 3
guyita 3
gwali 3
gyonna 3
house 3
human 3
jinja 3
jjumba 3
joseph 3
journalists 3
kadde 3
kakalu 3
kakiiko 3
kame 3
kawefube 3
kazambi 3
kiba 3
kibazo 3
kiconco 3
kikolwa 3
kinajjukirwa 3
kinnya 3
kiro 3
kitaawe 3
kiwandiiko 3
kkansa 3
koorinako 3
kubo 3
kuliko 3
kulonda 3
kumala 3
kumpi 3
kusalawo 3
kuyamba 3
kuyambako 3
kwabaddeko 3
kwanukula 3
kwogerakwe 3
kyabwe 3
kyadaaki 3
kyamaanyi 3
kyarenga 3
ky’obubaka 3
lubowa 3
ludda 3
lugazi 3
lukungaana 3
lukwago 3
luweero 3
lwaki 3
lweza 3
lw’okubiri 3
lw’okuna 3
lyavaala 3
makindye 3
makula 3
martin 3
massomero 3
maureen 3
mbalala 3
mbasaba 3
mbi 3
media 3
migadde 3
mikwano 3
mingi 3
ministries 3
miriraano 3
misango 3
misinde 3
mpisa 3
mpitirivu 3
mukaaga 3
mukadde 3
mukomye 3
munene 3
musanyufu 3
mutebile 3
muwala 3
mwezi 3
nabalala 3
nabasaba 3
nabategeeza 3
ndeete 3
network 3
ng’enda 3
nnyingi 3
northern 3
ntebe 3
nzikiriza 3
n’abaana 3
n’abalala 3
n’ebitongole 3
n’obukadde 3
n’okufuna 3
n’olwekyo 3
obubenje 3
obukulembeze 3
obulwadde 3
ogwa 3
okubanjulira 3
okubba 3
okubongera 3
okuddamu 3
okufuluma 3
okugeza 3
okulambula 3
okumutwala 3
okusasula 3
okutambula 3
okutereeza 3
okuttibwa 3
okutwala 3
okuyamba 3
okuyita 3
okuzimba 3
okwabadde 3
okwekulakulanya 3
okwenyigira 3
okwononeka 3
olwamala 3
olwe 3
omugagga 3
omugoba 3
omukazi 3
omulala 3
omumyuka 3
omuwendo 3
omuyimbi 3
omwagaanya 3
omwali 3
owe 3
people 3
pikipiki 3
power 3
prayer 3
pulayimale 3
puliida 3
rev 3
road 3
sabiiti 3
salt 3
samuel 3
sande 3
sarah 3
sheikh 3
simanyi 3
singa 3
siraj 3
songa 3
ssaawa 3
ssali 3
ssemakula 3
sso 3
tasobola 3
tasuubira 3
tebamanyi 3
ttivvi 3
tusaba 3
twagala 3
waayo 3
wabweru 3
waggulu 3
waka 3
wala 3
wange 3
way 3
wiiki 3
w’ekibiina 3
yafa 3
yagenze 3
yasooka 3
yatuuse 3
yatwaliddwa 3
yayise 3
yekka 3
z’ettaka 3
05 2
07 2
1 2
13 2
15 2
1538 2
158 2
164 2
17 2
179 2
195 2
200 2
2006 2
2008 2
2017 2
2018 2
2019-2020 2
203 2
207 2
252 2
28/05/2019 2
284 2
300 2
36 2
39 2
394 2
48 2
49 2
53 2
55 2
56 2
85 2
9 2
96 2
a 2
abagenda 2
abakola 2
abakozesa 2
abakugu 2
abakulu 2
abakungu 2
abakuze 2
abakyala 2
abakyali 2
abalabirira 2
abalowozebwa 2
abamenyi 2
abamuleetako 2
abapoliisi 2
abapunta 2
abasajja 2
abasinga 2
abasomera 2
abatalina 2
abategesi 2
abattiddwa 2
abatunda 2
abawadde 2
abayekera 2
abayizi 2
abayonjo 2
abazze 2
abbey 2
abitex 2
ab’oluganda 2
aduukiridde 2
africa 2
afuna 2
agagenda 2
agamu 2
agenze 2
agiwoze 2
ag’esudde 2
akaaliwo 2
akabinja 2
akakulirwa 2
akali 2
akanene 2
akkiriziddwa 2
akuba 2
akubye 2
akulembeddemu 2
akyali 2
akyaliddeko 2
alangidde 2
alayidde 2
aligaweesa 2
aliko 2
aloysias 2
amafu 2
amaggya 2
amakubo 2
amanene 2
amanya 2
amanyi 2
amanyiddwa 2
amanyiddwanga 2
amasomero 2
amon 2
amusabye 2
anyonyodde 2
anzitiramu 2
asimattuse 2
asoma 2
asse 2
atandise 2
ategeeze 2
atenderezza 2
atwaliddwa 2
authority 2
aveeyo 2
avudde 2
awakuumirwa 2
ayanukudde 2
ayanukula 2
ayinza 2
azze 2
baabadde 2
baagenda 2
baakuba 2
baalina 2
baatuuka 2
babagaana 2
babakaka 2
babasasula 2
babawa 2
babeera 2
babisanga 2
babuvunanyizibwa 2
badda 2
bafubye 2
bafunye 2
bafuuse 2
bagambye 2
bagezaako 2
bagezezaako 2
baggyayo 2
bagigula 2
bagoberezi 2
bajulizi 2
bakansala 2
bakazi 2
bakedde 2
bakimanyi 2
bakira 2
bakoleramu 2
bakondakita 2
bakubye 2
bakulembeze 2
bakyalina 2
balabe 2
balabika 2
balaze 2
balinda 2
balungi 2
bamaliriza 2
bamunanika 2
bamuwa 2
bannauganda 2
barnabas 2
basaakaanya 2
basaana 2
basaba 2
basabye 2
basimbiddwa 2
basobodde 2
basobola 2
basomera 2
basusse 2
bataano 2
batandikira 2
batandiseewo 2
batemu 2
batono 2
batta 2
battiddwa 2
batuuse 2
batwalibwa 2
batya 2
bave 2
bawakanya 2
bawamba 2
bayambibwako 2
bayinza 2
bayitamu 2
bba 2
bbaale 2
bbaluwa 2
bbanga 2
bbasale 2
bbiri 2
beesomye 2
beeyagale 2
besigye 2
bifo 2
bigenda 2
bilamu 2
bili 2
bisago 2
bisooto 2
book 2
bugenderevu 2
buliwo 2
bumu 2
bungi 2
butaano 2
buterevu 2
butunuzi 2
buva 2
buwerero 2
buwunga 2
bwagenda 2
bwategezezza 2
byali 2
byobufuzi 2
byokka 2
bypass 2
by’abantu 2
by’obulimi 2
by’obusuubuzi 2
by’okwerinda 2
canaan 2
catherine 2
ccc 2
cec 2
cheap 2
commission 2
cutekisi 2
david 2
ddene 2
ddoola 2
dduka 2
dduuka 2
doola 2
doreen 2
easter 2
ebakutte 2
ebbaluwa 2
ebigendererwa 2
ebigere 2
ebikajjo 2
ebikwekweto 2
ebilala 2
ebimotoka 2
ebinene 2
ebirungi 2
ebisingawo 2
ebisongovu 2
ebitongole 2
ebityoboola 2
ebiwojjolo 2
ebiwuka 2
ebyamaguzi 2
ebyetaago 2
ebyobulamu 2
eby’amaanyi 2
eby’enfuna 2
eby’obulambuzi 2
eccupa 2
echo 2
echo-tourism 2
eddene 2
edith 2
edward 2
effujjo 2
eggulo 2
egyenjawulo 2
egy’ekuusa 2
ejja 2
ekiddiridde 2
ekika 2
ekilwanirira 2
ekimanyiddwanga 2
ekintu 2
ekirungi 2
ekisaawe 2
ekitiibwa 2
ekitta 2
ekivunanyizibwa 2
ekiwummulo 2
ekiyinza 2
ekkirizza 2
ekkomera 2
ekkubo 2
ekwata 2
ekyaddiridde 2
ekyama 2
ekyamazima 2
ekyemirembe 2
ekyewunyisa 2
eliyeza 2
emidaala 2
emigga 2
emiggo 2
emilala 2
emisinde 2
emmanuel 2
empenda 2
empitirivu 2
empologoma 2
empya 2
emyera 2
endala 2
enfuufu 2
engendo 2
engo 2
enguzi 2
enkolagana 2
enkulakulana 2
ensi 2
entabwe 2
entegeka 2
entuufu 2
esazeemu 2
essira 2
esther 2
etonnye 2
eva 2
eveeyo 2
ewedde 2
ewozesa 2
extra 2
eyabadde 2
eyakafubo 2
ezeemu 2
ezibasasulwa 2
eziraga 2
ezitali 2
ezo 2
ez’ebitundu 2
ez’ekiro 2
face 2
famile 2
fayiro 2
gano 2
gattako 2
gavana 2
ggombolola 2
givunanibwa 2
godfrey 2
goma 2
group 2
gujja 2
gusalwa 2
gusangiddwa 2
gwabwe 2
gwokka 2
gw’amazzi 2
gw’okutaano 2
gyabadde 2
gyaffe 2
gyamaze 2
gy’akuumirwa 2
g’omulamuzi 2
haji 2
hardware 2
high 2
hospital 2
hrnju 2
iganga 2
ihk 2
international 2
isaac 2
junior 2
kaadi 2
kabangali 2
kabinja 2
kabuga 2
kabuyonjo 2
kalangala 2
kalulu 2
kambe 2
kasangati 2
kasese 2
katono 2
kattu 2
katushabe 2
kenyini 2
kibangirizi 2
kibuli 2
kigambo 2
kiggwa 2
kiibi 2
kijja 2
kikulu 2
kireka 2
kisenyi 2
kitaffe 2
kitegeeza 2
kitegekeddwa 2
kitegerekese 2
kitende 2
kitiibwa 2
kituuti 2
kityo 2
kiwanuka 2
kiwedde 2
kiziba 2
kizibu 2
kizimbe 2
kizinga 2
kkamera 2
kko 2
korea 2
kubaako 2
kubagoba 2
kubba 2
kuboca 2
kugendayo 2
kuggyamu 2
kukkiriza 2
kukwasisa 2
kuluno 2
kunzita 2
kutambula 2
kutandikirawo 2
kuteekawo 2
kutulugunya 2
kutumbula 2
kutunula 2
kuwa 2
kuyingira 2
kwawukana 2
kwetikka 2
kyakikirira 2
kyamaze 2
kyampisi 2
kyamwetaaza 2
k’ebidduka 2
k’eddembe 2
k’ekibiina 2
lamunu 2
lc 2
love 2
lukujjukujju 2
lulwe 2
lutandise 2
lutikko 2
lwabwe 2
lw’okukizuula 2
lw’omukaaga 2
lyonna 2
ly’omusaalaba 2
ma 2
mabega 2
magulu 2
makuumiro 2
makya 2
mande 2
mangi 2
march 2
matereke 2
mawanga 2
mazzi 2
mboozi 2
mbu 2
mbuga 2
medard 2
mike 2
milala 2
mirembe 2
mitimbagano 2
mmere 2
monday 2
mpanvu 2
ms 2
muganda 2
mugoya 2
muhamad 2
mujja 2
muka 2
mukisa 2
mukoddomi 2
mukolo 2
mukulembeze 2
mukutu 2
muky 2
mulamba 2
mulamwa 2
muli 2
mulwadde 2
muno 2
musango 2
musinguzi 2
musumba 2
mutabaazi 2
mutindo 2
muto 2
muwonge 2
muyanja 2
muyenga 2
mweezi 2
mwetegefu 2
mwoyo 2
naabo 2
naasaba 2
nabamweyimiridde 2
naffe 2
nagenda 2
nagyo 2
nakirya 2
nakyanzi 2
nalaga 2
naliko 2
nambayo 2
namirembe 2
nammwe 2
namukose 2
nangoba 2
nansana 2
nasuubiza 2
natangaaza 2
nayo 2
ndabani 2
ngalo 2
ngoye 2
nguudo 2
nguzi 2
ng’asinziira 2
ng’ate 2
nkoona 2
nkulakulana 2
nnamwandu 2
nnungi 2
nnyingo 2
nsaba 2
nsalo 2
nsi 2
nteekateeka 2
nudipu 2
nyakecho 2
n’abantu 2
n’abapunta 2
n’abawa 2
n’agenda 2
n’akatale 2
n’amaanyi 2
n’amaggye 2
n’amuggya 2
n’amusaba 2
n’amutwala 2
n’asaba 2
n’ategeeza 2
n’ebattirawo 2
n’ebibiina 2
n’ebimu 2
n’ebintu 2
n’ekigendererwa 2
n’ensimbi 2
n’okubba 2
n’okujaguza 2
n’okulaba 2
n’okulwanyisa 2
n’okwonoona 2
n’omwana 2
obudde 2
obujulizi 2
obukenuzi 2
obulamu 2
obuli 2
obuliwo 2
obusobozi 2
obutaba 2
obuvunanyizibwa 2
obuwunga 2
ochola 2
ogujja 2
ogw’okubiri 2
okoth 2
okubaako 2
okubaayo 2
okubakaka 2
okubategeeza 2
okubatulugunya 2
okubulankanya 2
okugezaako 2
okuggala 2
okugula 2
okugulamu 2
okugwa 2
okukakasa 2
okukakkana 2
okukendeeza 2
okukkiriza 2
okukuba 2
okulima 2
okumanyika 2
okumukuuma 2
okumuwa 2
okumuyambako 2
okusaba 2
okusazaamu 2
okusimattuka 2
okusisinkana 2
okusondera 2
okusooka 2
okutabangula 2
okutandikawo 2
okutegeka 2
okutekawo 2
okutiisatiisa 2
okutta 2
okutumbula 2
okututulugunya 2
okutuukirira 2
okutuuza 2
okutya 2
okuvaako 2
okuvuganya 2
okuwamba 2
okuwandiisa 2
okuwandiisibwa 2
okuwulira 2
okuyimba 2
okuziika 2
okuzza 2
okwali 2
okwawukana 2
okwaza 2
okwebuuza 2
okwegobako 2
okwekobaana 2
okwekulaakulanya 2
okwekulakulanyamu 2
okwesimbawo 2
okwetaba 2
okwetikka 2
okwetuga 2
okwewala 2
okwewozaako 2
okweyanjula 2
okweyimirirwa 2
okweyimrirwa 2
ol 2
oludda 2
olugatta 2
olulala 2
olumbe 2
oluvanyuama 2
olwamaze 2
olwatudde 2
olw’alondebwa 2
olw’embeera 2
olw’obufunda 2
olw’okutya 2
omuguwa 2
omukisa 2
omukubiriza 2
omulamba 2
omupoliisi 2
omusajja 2
omusawo 2
omuselikale 2
omuserikale 2
omusolo 2
omutindo 2
omutuufu 2
omutuuze 2
omuwala 2
omuwandiisi 2
omuwanika 2
omuyindi 2
omwenzi 2
onyango 2
ow’e 2
oyo 2
pc 2
pine 2
ppaaka 2
press 2
pulaani 2
pulogulaamu 2
ramathan 2
rdc 2
revenue 2
rt 2
rugambwa 2
rwenziruru 2
seeta-nazigo 2
sewungu 2
sifaayo 2
sisobola 2
sitaani 2
so 2
ssabakabona 2
ssabiiti 2
ssande 2
ssanyu 2
ssawa 2
ssebaggala 2
ssekikubo 2
ssemateeka 2
ssenteza 2
ssinga 2
stephen 2
steven 2
susan 2
tadeo 2
tagenda 2
tawuni 2
tayagala 2
tayinza 2
tebafaayo 2
tebasasuddwa 2
tebasobola 2
tekinologiya 2
tekyali 2
tetusobola 2
teyagenze 2
teyalina 2
theodore 2
tinkasimire 2
tino 2
tonnya 2
tororo 2
tourism 2
ttendo 2
tujja 2
tukola 2
tukooye 2
tukuletedde 2
tumaze 2
twamuzaala 2
twetaaga 2
ubd 2
vision 2
waakyo 2
waaliwo 2
wabaawo 2
waffe 2
wamala 2
watchdog 2
william 2
wooteeri 2
wooteri 2
world 2
w’abavubuka 2
w’e 2
w’ekyuma 2
w’okwagala 2
w’olukiiko 2
w’omubaka 2
yabatutte 2
yabula 2
yaffe 2
yagaana 2
yagaanibwa 2
yagenda 2
yakkaatirizza 2
yakulira 2
yakwatagana 2
yalabiseeko 2
yalaze 2
yaliko 2
yalimu 2
yalina 2
yalwala 2
yamala 2
yamalawo 2
yamuwa 2
yasiimye 2
yasoose 2
yatandika 2
yategeeza 2
yatonda 2
yatuuma 2
yatuuza 2
yava 2
yaweze 2
yayita 2
yayitibwa 2
yayogeddeko 2
yeetuze 2
yette 2
yewunya 2
y’akatale 2
y’eggwanga 2
y’emirimu 2
y’emu 2
y’ensonga 2
y’omugenzi 2
y’omukka 2
zabwe 2
zaffe 2
ziba 2
zibadde 2
z’abantu 2
