mu 437
ku 291
nga 285
n 269
nti 183
ne 175
e 139
ng 108
wa 86
era 82
y 78
bwe 55
w 55
abantu 51
poliisi 48
kino 44
ya 44
bw 42
ye 39
kya 37
kyokka 35
ate 34
ssentebe 33
uganda 33
ba 32
olw 32
by 31
okuva 31
we 31
ssente 29
bino 27
guno 27
gye 27
ky 27
ono 27
lwa 26
akulira 25
be 25
buli 25
kkooti 25
kye 25
nrm 25
abadde 23
agamba 23
bano 23
eno 23
gavumenti 23
oluvannyuma 23
asabye 22
wabula 22
lw 21
omugenzi 21
abaana 20
bye 20
dr 20
gw 20
naye 20
abakristu 19
abatuuze 19
ebintu 19
enjaga 19
ly 19
nnyo 19
2022 18
abamu 18
akakiiko 18
gwa 18
z 18
eky 17
naddala 17
okukola 17
omulambo 17
palamenti 17
yagambye 17
agambye 16
emirimu 16
kubanga 16
omu 16
ekisiibo 15
kuba 15
lya 15
bangi 14
ebirala 14
enjawulo 14
kiseera 14
mulago 14
omubaka 14
omulamuzi 14
town 14
wakiso 14
aba 13
ategeezezza 13
balina 13
bwa 13
ddala 13
eby 13
ey 13
kifo 13
okuli 13
wano 13
yabadde 13
za 13
b 12
baagala 12
ekibiina 12
ekitongole 12
ekitundu 12
ekya 12
emisango 12
eri 12
katonda 12
lady 12
march 12
ngeri 12
okulaba 12
olwo 12
omusango 12
ttaka 12
wakati 12
yonna 12
ab 11
abalala 11
ategeeza 11
babadde 11
buno 11
ettaka 11
ggwanga 11
gwe 11
gy 11
ka 11
kati 11
kw 11
kwe 11
mwe 11
nabo 11
obukadde 11
obw 11
okumala 11
okutuusa 11
omuli 11
salabwa 11
yategeezezza 11
bonna 10
byonna 10
ennyo 10
fc 10
ggoolo 10
kasangati 10
kigambibwa 10
kisaawe 10
kuliko 10
lukiiko 10
makindye 10
oba 10
okufuna 10
okukozesa 10
okusaba 10
okutandika 10
olukiiko 10
ow 10
ssimbwa 10
2 9
asaba 9
bagenda 9
council 9
ensi 9
ensonga 9
evvu 9
eyali 9
february 9
gya 9
kkampuni 9
kkansala 9
maaso 9
na 9
ntebe 9
obubonero 9
okubeera 9
omuntu 9
owa 9
ssaako 9
waliwo 9
weyonje 9
abali 8
abaserikale 8
agenda 8
ayagala 8
budde 8
buganda 8
bya 8
david 8
disitulikiti 8
doves 8
ebiwandiiko 8
eggwanga 8
embeera 8
emmere 8
emmwanyi 8
ez 8
fr 8
k 8
kakiiko 8
kigongo 8
kitandwe 8
leero 8
nnyumba 8
nsubuga 8
obulungi 8
okusiiga 8
okwagala 8
omupiira 8
prisons 8
she 8
ssaawa 8
wiiki 8
yali 8
00 7
3 7
abaliko 7
abalina 7
abasuubuzi 7
abawala 7
bakola 7
bali 7
bantu 7
bitundu 7
city 7
clerk 7
ebiri 7
ebisolo 7
ebitundu 7
emitwalo 7
emu 7
enteekateeka 7
frank 7
heroin 7
juliet 7
kampala 7
kimu 7
kisitu 7
kukola 7
kyalo 7
lino 7
minisitule 7
mmisa 7
mmotoka 7
moses 7
mukolo 7
mutabani 7
obulemu 7
obuvunaanyizibwa 7
ofiisi 7
ogw 7
okuba 7
okunoonyereza 7
okwogera 7
olwaleero 7
omukungu 7
omuliro 7
omumyuka 7
robert 7
sipiika 7
tebalina 7
tooro 7
villa 7
wadde 7
zaake 7
zzaake 7
1 6
18 6
28 6
4 6
40 6
abakkiriza 6
abakola 6
abakolera 6
abakulu 6
abazadde 6
abeera 6
agnes 6
alaga 6
alhaj 6
amasomero 6
asinzidde 6
bagamba 6
bakozesa 6
bannakibiina 6
basobole 6
bba 6
east 6
ebimu 6
ebyobulamu 6
eggulo 6
ekika 6
ekintu 6
emyaka 6
engeri 6
ennaku 6
ennyama 6
esatu 6
eya 6
francis 6
ge 6
grams 6
kabaka 6
kamya 6
katuntu 6
ke 6
kiddiridde 6
kitaawe 6
kitundu 6
kizito 6
kkanisa 6
kkono 6
kyengera 6
lwe 6
minisita 6
mipiira 6
mukyala 6
munisipaali 6
nakitende 6
ncs 6
nsonga 6
obwakabaka 6
okufa 6
okutta 6
okutuuka 6
okwongera 6
omusumba 6
omwaka 6
omwami 6
patrick 6
paul 6
rev 6
st 6
united 6
vipers 6
waabwe 6
zaabwe 6
000 5
19 5
20 5
2021 5
30 5
5 5
ababadde 5
abaffamire 5
abavubuka 5
abayizi 5
abo 5
agasirwe 5
alina 5
amateeka 5
ava 5
awatali 5
ayongedde 5
baabwe 5
bakkansala 5
basabye 5
batandise 5
bizimbe 5
boodabooda 5
bp 5
bulungi 5
bumativu 5
corporate 5
covid 5
drake 5
ebadde 5
ebbaluwa 5
ebifo 5
ebyana 5
eggombolola 5
ekigo 5
ekirwadde 5
embuto 5
emirembe 5
emirimo 5
emmotoka 5
empaka 5
ennyumba 5
entalo 5
entebe 5
ewedde 5
eza 5
fufa 5
g 5
john 5
joseph 5
kaggo 5
kalulu 5
kano 5
kasasiro 5
kasibante 5
kasirye 5
kcca 5
kkamera 5
kyonna 5
league 5
liigi 5
lubega 5
luwalira 5
luweero 5
lwokusatu 5
masaka 5
mawanga 5
mayiga 5
misuzulu 5
mmande 5
mpigi 5
mugga 5
mugisha 5
munene 5
musango 5
nabbosa 5
nnamba 5
nsambya 5
ntandikwa 5
nup 5
obulamu 5
obutali 5
obwesige 5
oku 5
okubaako 5
okukomya 5
okukuba 5
okulya 5
okunyweza 5
okusiiba 5
okusinziira 5
okusooka 5
okuwulirwa 5
olunaku 5
omutendesi 5
omutindo 5
omwogezi 5
pikipiki 5
police 5
pulezidenti 5
pulojekiti 5
sarah 5
sc 5
si 5
singa 5
ucu 5
unesco 5
wamu 5
wange 5
yo 5
ze 5
10 4
100 4
2-1 4
26 4
50 4
58 4
6 4
7 4
abaabadde 4
abadigize 4
abasaba 4
abasabye 4
abasoba 4
abatalina 4
abazannyi 4
african 4
agambibwa 4
akatale 4
akulembeddemu 4
akuutidde 4
alex 4
ali 4
amagye 4
amazaalibwa 4
amyuka 4
ana 4
and 4
annyonnyola 4
bafuna 4
bagende 4
bajja 4
balimwezo 4
bannaabwe 4
bannannyini 4
banne 4
batyo 4
bayinza 4
bbiri 4
bingi 4
biseera 4
bo 4
bosco 4
bright 4
bukenya 4
bungi 4
bwabwe 4
bwatyo 4
bwonna 4
byabwe 4
coffee 4
ddyo 4
december 4
diviizoni 4
ebalirirwamu 4
ebbanga 4
ebibiina 4
ebiragalalagala 4
ebizimbe 4
ebyo 4
eddagala 4
ekifo 4
ekkanisa 4
emabega 4
endala 4
enduulu 4
enkulu 4
erya 4
ffamire 4
ga 4
gaabwe 4
ggombolola 4
ggwanika 4
group 4
gutandike 4
ibrahim 4
international 4
jazmine 4
kakalu 4
kalungu 4
katikkiro 4
kawaala 4
kazo 4
kiberu 4
kibiina 4
kujjanjaba 4
kuno 4
kusooka 4
kwa 4
kyabwe 4
kyotera 4
lumbe 4
lutuula 4
lye 4
maama 4
medical 4
mityana 4
muntu 4
mwaka 4
mwezi 4
mwoleso 4
myaka 4
nabyo 4
nakaayi 4
namara 4
north 4
nsawo 4
ntikko 4
obukugu 4
obusumba 4
obutakkaanya 4
ogwa 4
okubongeza 4
okujaguza 4
okukakasa 4
okuleeta 4
okulonda 4
okusalawo 4
okutuula 4
okuwa 4
okuyamba 4
okwegayirira 4
okwetaba 4
okwewala 4
okwokya 4
oluguudo 4
oluwalo 4
omugagga 4
omukisa 4
omusaayi 4
omuzannyo 4
omwana 4
omwoleso 4
ossa 4
queens 4
russia 4
sam 4
sizoni 4
south 4
southsudan 4
ssegawa 4
ssinga 4
stars 4
ttiimu 4
unit 4
vitals 4
wabweru 4
wt 4
yategezezza 4
yayongeddeko 4
zino 4
12 3
14 3
15 3
2018 3
21 3
800 3
9 3
90 3
aanye 3
abaakwatibwa 3
ababaka 3
abakristaayo 3
abakulembeze 3
abalongo 3
abasinga 3
abasodokisi 3
abavuzi 3
afiiridde 3
akabenje 3
akabinja 3
akakasizza 3
akakwasisa 3
akola 3
alangirira 3
amagezi 3
amasasi 3
amazzi 3
among 3
atandika 3
atongoza 3
atyo 3
avumiridde 3
baabadde 3
baggoolokippa 3
bakedde 3
bakung 3
balaga 3
balumiriza 3
bammemba 3
bange 3
banna 3
bannantameggwa 3
banyagamu 3
basipiika 3
basobola 3
batabukidde 3
batandika 3
bategeeza 3
bategeezezza 3
bato 3
batuuze 3
batuuzizza 3
bava 3
bavubuka 3
bawakanya 3
baweebwe 3
bbebi 3
ben 3
binyumirwa 3
bokka 3
booda 3
bukedde 3
bulaaya 3
bwannamukulu 3
byogeddwa 3
cardinals 3
coporal 3
daize 3
dda 3
ddagala 3
ddakiika 3
dennis 3
dit 3
dpc 3
ebigambo 3
ebikolwa 3
ebipande 3
ebiwayi 3
ebweru 3
ebyenjigiriza 3
ebyokwerinda 3
eddwaliro 3
egy 3
ekigenda 3
ekiri 3
ekisa 3
ekisusse 3
ekitebe 3
emipiira 3
emirundi 3
emisinde 3
emmundu 3
empagi 3
empisa 3
ena 3
enjiri 3
ensambaggere 3
ensawo 3
ensimbi 3
erimu 3
erina 3
eryanyi 3
esazeewo 3
essaawa 3
essomero 3
ewa 3
ewangula 3
eyaliko 3
eyitibwa 3
eyotu 3
ezimu 3
eziwera 3
faaza 3
federation 3
fred 3
gattako 3
ggiraavuzi 3
godfrey 3
goodwill 3
harvest 3
high 3
house 3
iga 3
iii 3
isaac 3
jjumba 3
kabuga 3
kagimu 3
kagugube 3
kakande 3
kalangala 3
kalema 3
kaseera 3
kasolo 3
katale 3
kaweesi 3
kawempe 3
kiboga 3
kintu 3
kira 3
kitalya 3
kivvulu 3
kiyingi 3
kkolero 3
klesia 3
klezia 3
kubeerawo 3
kyaddondo 3
looya 3
ltd 3
lubaga 3
lubyayi 3
lukubirizibwa 3
lumunye 3
lwokubiri 3
makya 3
masomero 3
matugga 3
mayanja 3
money 3
muggalo 3
mukaaga 3
mukama 3
mukono 3
mulamba 3
munnaabwe 3
musa 3
musoke 3
mutima 3
muzibu-azaalampanga 3
mw 3
mwabaddemu 3
mwana 3
nabiranda 3
nakafeero 3
neville 3
nkola 3
nnyingi 3
november 3
nsaggu 3
nsi 3
nsiko 3
nsimbi 3
nsisinkano 3
ntege 3
obubbi 3
obubi 3
obudde 3
obuggya 3
obutono 3
obuyinza 3
obuzibu 3
odoch 3
okubba 3
okudda 3
okufaayo 3
okugenda 3
okuggyibwamu 3
okugonjoola 3
okukkakkana 3
okukulaakulanya 3
okulondoola 3
okuna 3
okusabira 3
okusinga 3
okuteekawo 3
okutegeka 3
okutunda 3
okuviira 3
okuyambako 3
okuzza 3
okuzzaayo 3
okw 3
okwekalakaasa 3
okwenenya 3
olila 3
olubadde 3
oluvanyuma 3
omuggya 3
omukolo 3
omukubu 3
omukyala 3
omulala 3
omulangira 3
omuwaabi 3
omuwala 3
parish 3
peter 3
pharmacy 3
rdc 3
richard 3
roast 3
rwanda 3
sacco 3
school 3
sheikh 3
ssaabasumba 3
ssaalongo 3
ssaza 3
sseguya 3
ssekyanzi 3
ssimu 3
ssp 3
state 3
taata 3
tonny 3
ukraine 3
ven 3
vision 3
wamala 3
wansi 3
west 3
women 3
world 3
yagasseeko 3
yasabye 3
yasoose 3
yiga 3
yinsuwa 3
zonna 3
1-1 2
11 2
16 2
2007 2
23 2
27 2
300 2
35 2
4-2 2
46 2
600 2
72 2
778 2
8 2
aana 2
aaniddwa 2
aaron 2
abaafuna 2
abaali 2
abaazaala 2
ababbi 2
ababeera 2
abagenda 2
abakadde 2
abakozi 2
abakungu 2
abakuumi 2
abakwate 2
abakyala 2
abapoliisi 2
abas 2
abasawo 2
abasiraamu 2
abasuubiza 2
abatadde 2
abategeeza 2
abawadde 2
abaweereza 2
abawereza 2
abazirakisa 2
abdu 2
abraham 2
abuulira 2
abuuza 2
abyogeredde 2
afa 2
afaanana 2
africa 2
afrika 2
ag 2
agasseeko 2
agenze 2
aggulawo 2
agreement 2
agudde 2
agumizza 2
aisha 2
ajja 2
akabonero 2
akali 2
akalondoola 2
akaseera 2
akatimba 2
akawungeezi 2
akiikirira 2
akikirira 2
akol 2
akooneddemu 2
akubirizza 2
akulembedde 2
akunze 2
al 2
alemererwa 2
alfred 2
alumirizza 2
amaanyi 2
amabaati 2
amagoba 2
amaliri 2
amangu 2
amasannyalaze 2
amasiro 2
amawulire 2
amaze 2
ambasada 2
anib 2
anita 2
annet 2
anthony 2
apea 2
apollo 2
asimbiddwa 2
asindikiddwa 2
asinga 2
asobola 2
asula 2
asuman 2
asuubira 2
ataddemu 2
atalina 2
atemuddwa 2
atemya 2
athletics 2
atukwasa 2
atwala 2
authority 2
avunaanibwa 2
awaka 2
awanjagira 2
aweza 2
ayambibwako 2
ayekoru 2
ayinza 2
ayita 2
azze 2
baali 2
baalina 2
baalondodde 2
baana 2
baba 2
babanja 2
babiri 2
babirye 2
bagabane 2
baggwang 2
bagimennya 2
bakiikirira 2
bakizudde 2
bakkiriza 2
bakomewo 2
bakutte 2
bakwatibwa 2
bakwatiddwa 2
bakyali 2
balaajanidde 2
baleme 2
baliko 2
balya 2
balyoka 2
bamukutte 2
bamulekwa 2
bamulumiriza 2
bana 2
bannamawulire 2
bannansi 2
bannayuganda 2
basaba 2
basalawo 2
basalirwa 2
basinzidde 2
basome 2
batambulira 2
baterana 2
bavunaanibwa 2
bayise 2
bayita 2
baziika 2
bazinone 2
bbanga 2
bbomu 2
bbooda 2
bbugwe 2
bbusu 2
beekalakaasizza 2
beekengedde 2
beetaaga 2
beeyiye 2
besigye 2
bibadde 2
bibiina 2
bifuba 2
bikolwa 2
bintu 2
biragiro 2
bodaboda 2
bombi 2
bongere 2
bubonero 2
bugiri 2
bugweri 2
bukadde 2
bulamu 2
bulange 2
bulijjo 2
bungereza 2
bunnambiro 2
bupangisa 2
busoga 2
butambala 2
buwanguzi 2
buyambi 2
buziba 2
bwanamukulu 2
bwayo 2
bwenkanya 2
bweru 2
bwetaavu 2
bweyali 2
bwongo 2
byakatonda 2
byali 2
byewasubiddwa 2
canon 2
catholic 2
centre 2
charles 2
chisano 2
coalition 2
cocaine 2
commandant 2
complex 2
corona 2
corporates 2
dan 2
ddwaaliro 2
ddwaliro 2
de 2
development 2
dickson 2
dlamini 2
eba 2
ebikozesebwa 2
ebirabo 2
ebiragala 2
ebiragiro 2
ebirungi 2
ebiseera 2
ebisusse 2
ebitaala 2
ebitongole 2
ebwalu 2
ebyuma 2
edda 2
eddaame 2
eddakiika 2
eddembe 2
edith 2
egya 2
egyabadde 2
egyo 2
ekakasa 2
ekigendererwa 2
ekimu 2
ekirabo 2
ekirime 2
ekiseera 2
ekituufu 2
ekiwandiiko 2
ekizimbe 2
ekkiriza 2
ekola 2
ekole 2
ekozesebwa 2
ekulembeddwaamu 2
ekyabadde 2
embi 2
emikolo 2
emikono 2
emiryango 2
emizannyo 2
empya 2
endwadde 2
enfudu 2
enfunda 2
enkaayana 2
enkuba 2
enock 2
ensiko 2
entuufu 2
erikaayanirwa 2
essaza 2
essimu 2
etaddewo 2
etteeka 2
etwala 2
ewaka 2
express 2
eyakwatibwa 2
eyasudde 2
eyawangudde 2
eyayokeddwa 2
ezaakwatibwa 2
ezo 2
first 2
ganafa 2
gayaza 2
general 2
gijzen 2
gubadde 2
gubuna 2
guleeda 2
gumu 2
guzuuliddwa 2
gyonna 2
hajj 2
hajji 2
henry 2
hubert 2
insurance 2
ivan 2
jeronymos 2
jinja 2
joaquim 2
jonathan 2
julius 2
kaali 2
kabanda 2
kabangali 2
kabesiime 2
kafiyu 2
kajjansi 2
kakooza 2
kaleerwe 2
kaliisa 2
kaliko 2
kambagira 2
kanoonyereze 2
kanso 2
kapeesa 2
kaputeeni 2
kasinde 2
kasubi 2
kateshumbwa 2
katono 2
katyabaga 2
kavuya 2
kaweefube 2
kayingiza 2
kayunga 2
kazwelithini 2
kiboyigo 2
kibuga 2
kibuyaga 2
kick 2
kiggundu 2
kikyusa 2
kilak 2
kimbowa 2
kimosho 2
kinoni 2
kiri 2
kirungi 2
kisekulo 2
kitaabwe 2
kitebe 2
kitegeeza 2
kiti 2
kitiibwa 2
kitimbo 2
kitongole 2
kituuka 2
kiwandiiko 2
kiyambeko 2
kizimbe 2
kkando 2
kkanso 2
kkiraabu 2
kkomera 2
kkwiini 2
kono 2
kubaako 2
kubeera 2
kuddamu 2
kugonjoola 2
kukkiriza 2
kukozesa 2
kulaga 2
kulima 2
kulonda 2
kunoonyereza 2
kutuuza 2
kuziika 2
kwawedde 2
kwogera 2
kwolesa 2
kyadondo 2
kyaliwajjala 2
kyama 2
kyendiisa 2
leediyo 2
limanda 2
lukwago 2
luno 2
lutikko 2
lwabadde 2
lwaki 2
lwetabiddwamu 2
lyabwe 2
lyagabanyizibwamu 2
lydia 2
mahad 2
major 2
maka 2
makubo 2
manager 2
mannyo 2
mantfombi 2
mbalirira 2
mbarara 2
mbeera 2
meeya 2
mengo 2
methamphetamine 2
metropolitan 2
ministule 2
misinde 2
mitima 2
mitwalo 2
mivuyo 2
mmengo 2
monitoring 2
mpalanyi 2
mpanga 2
mpiso 2
ms 2
mubiri 2
muganda 2
mugasha 2
mugenzi 2
muhammad 2
muhammed 2
mukago 2
mukazi/amolatar 2
mukazi/butambala 2
mukazi/mbarara 2
mukazi/tororo 2
mukisa 2
mukusaba 2
mulambo 2
mulamu 2
muli 2
mulimu 2
muliro 2
munda 2
munnamateeka 2
munne 2
munyonyo 2
mupiira 2
musika 2
mutuba 2
muwandiisi 2
muzannyo 2
muzeeyi 2
mwesigwa 2
myezi 2
nabbingo 2
nabbumba 2
nakaseke 2
nakibirige 2
nakuya 2
namala 2
namanve 2
namugongo 2
nansana 2
nantege 2
national 2
ndagaano 2
ndawula 2
ndi 2
nelson 2
ngalo 2
nic 2
njaga 2
nju 2
nkaayana 2
nnamwandu 2
nnannyini 2
nnyingiza 2
noolwekyo 2
nsaba 2
ntembo 2
ntiisa 2
nyamitanga 2
nyombi 2
nyongesa 2
nze 2
o 2
obujulizi 2
obukulembeze 2
obukulu 2
obulimi 2
obulunzi 2
obupya 2
obusolosolo 2
obusolya 2
obutagezaako 2
obuto 2
obuwanguzi 2
obuyambi 2
obuyigirize 2
obwegassi 2
obwenkanya 2
oc 2
ogwabadde 2
ogwel 2
oketch 2
okubakkaanyisa 2
okubayamba 2
okubayita 2
okubazzaayo 2
okubbisa 2
okubulwa 2
okubuulira 2
okudduka 2
okufunirako 2
okugamba 2
okuggyako 2
okugoberera 2
okugula 2
okuguzikiza 2
okugwaamu 2
okukolera 2
okukubiriza 2
okukuza 2
okukyusa 2
okulabirako 2
okulambula 2
okulayira 2
okulemererwa 2
okulima 2
okulimira 2
okulunda 2
okulwala 2
okulwanagana 2
okumanya 2
okumegga 2
okumenya 2
okumpi 2
okumukebera 2
okumutaasa 2
okunguudo 2
okunywa 2
okusasula 2
okusika 2
okusikira 2
okusobola 2
okusoma 2
okusonyiwa 2
okusonyiwagana 2
okusoomoozebwa 2
okussaawo 2
okutambula 2
okutegeeza 2
okutereeza 2
okutikkula 2
okutumbula 2
okutuukiriza 2
okuvaako 2
okuweebwa 2
okuwulira 2
okuyita 2
okuzimba 2
okwekulaakulanya 2
okwemulugunya 2
okwenyigira 2
okwetaasa 2
okwetegereza 2
okwewozaako 2
okwezza 2
olukusa 2
olutuula 2
oluvannyama 2
oluyi 2
olwa 2
olwekyo 2
omuguwa 2
omukama 2
omukulu 2
omukwano 2
omulabirizi 2
omulimu 2
omusaala 2
omusajja 2
omuvubuka 2
omuyiggo 2
omuzadde 2
omuze 2
omuziki 2
opendi 2
operations 2
owookubiri 2
oyo 2
pamiti 2
pax 2
pc 2
peters 2
plaza 2
polof 2
premier 2
rhyme 2
ritah 2
road 2
rose 2
rubaga 2
rukundo 2
s 2
saako 2
sb 2
semuto 2
sente 2
serverus 2
sheema 2
siipika 2
silvester 2
simanyi 2
siteegi 2
so 2
solutions 2
soroti 2
special 2
ssaabawandiisi 2
ssande 2
ssemambo 2
ssempa 2
ssenfuka 2
ssentongo 2
star 2
sudan 2
sulaiman 2
super 2
talabiseeko 2
tawuni 2
tebanneetuuka 2
tekalina 2
tewali 2
teyanyumiddwa 2
tindiwegyi 2
tinka 2
tulakita 2
tuzuulire 2
ucda 2
uefa 2
victoria 2
waasinzidde 2
waayo 2
wabaawo 2
waggulu 2
wankulukuku 2
warren 2
wfc 2
yaakamala 2
yaakava 2
yabba 2
yadde 2
yafiiriddwa 2
yagenze 2
yagwegaanyi 2
yalagirwa 2
yandiba 2
yasangibwa 2
yasinzidde 2
yasobodde 2
yeetabiddwaamu 2
yeeyambisa 2
yeyasinga 2
yiika 2
yokka 2
zaid 2
zarugaba 2
ziri 2
ziriko 2
zulu 2
zzooni 2
