mu 528
ku 319
n 294
nga 289
ne 198
nti 185
era 132
ng 130
e 109
bwe 97
y 88
w 83
ye 71
wa 68
kya 62
ate 57
abantu 53
kino 48
ya 48
bw 46
nrm 44
nup 43
we 41
gye 38
poliisi 38
yagambye 38
kyokka 37
ky 36
z 36
by 34
eno 34
ekibiina 33
be 32
kuba 32
obululu 32
wabula 32
alina 31
owa 31
ttiimu 31
kye 30
omu 30
kcca 28
kubanga 28
000 27
buli 27
kkansala 27
aba 26
b 26
fc 26
lwa 26
olw 26
uganda 26
ba 25
gavumenti 25
kkooti 25
okuva 25
ono 25
abadde 24
ey 24
gy 24
naye 24
pulezidenti 24
agamba 23
amagye 22
eby 22
gen 22
oluvannyuma 22
ssente 22
gw 21
emmwaanyi 20
kampala 20
kati 20
lukwago 20
yabadde 20
yategeezezza 20
za 20
abamu 19
akalulu 19
amaanyi 19
bwa 19
eggwanga 19
balina 18
ebirala 18
emu 18
kibiina 18
lw 18
museveni 18
oba 18
10 17
abatuuze 17
akulira 17
bye 17
ekifo 17
myaka 17
nsonga 17
okulonda 17
abalala 16
abavubuka 16
emmotoka 16
nnyo 16
okufuna 16
yali 16
abaana 15
agenda 15
bangi 15
kifo 15
kw 15
nze 15
palamenti 15
ssentebe 15
abakristaayo 14
akakiiko 14
apo 14
bulungi 14
dr 14
ebifo 14
ekkanisa 14
enjawulo 14
ensonga 14
eri 14
ez 14
lwe 14
maaso 14
mukono 14
okubeera 14
wamu 14
amasasi 13
amawulire 13
ayagala 13
bantu 13
bino 13
bya 13
eky 13
ekya 13
k 13
kitundu 13
ly 13
okuba 13
okukola 13
okuli 13
st 13
ab 12
abalonzi 12
abazannyi 12
ali 12
bagenda 12
cranes 12
ddala 12
disitulikiti 12
emirimu 12
g 12
ggombolola 12
ggwanga 12
kulonda 12
lukiiko 12
okutuusa 12
omusumba 12
wano 12
wiiki 12
2021 11
abakulembeze 11
amagezi 11
baabwe 11
bakansala 11
bonna 11
ebyokulonda 11
gwe 11
kwe 11
mmotoka 11
mukyala 11
naddala 11
nambooze 11
okujja 11
omuntu 11
omwaka 11
sipiika 11
ssenyonga 11
ze 11
4 10
abakozi 10
baabadde 10
babadde 10
bagamba 10
bakkansala 10
bano 10
bazadde 10
bitundu 10
ebintu 10
ensimbi 10
eyafunye 10
gya 10
kigambibwa 10
kiseera 10
kuliko 10
kyagulanyi 10
kyalo 10
lt 10
muntu 10
obulemu 10
olwo 10
omukyala 10
ow 10
vipers 10
wakati 10
yafunye 10
yawangudde 10
zino 10
ababadde 9
babiri 9
bukedde 9
ebiri 9
ebitongole 9
emyaka 9
kitaawe 9
kkanisa 9
lino 9
luwagga 9
meeya 9
mulimu 9
muwala 9
obulamu 9
obulungi 9
okugenda 9
okulaba 9
omulimu 9
omutendesi 9
omwogezi 9
uhuru 9
wadde 9
waliwo 9
3 8
abaliko 8
abalimi 8
addirirwa 8
agambye 8
akatale 8
baagala 8
bammemba 8
banne 8
buganda 8
ebibiina 8
ebitundu 8
ebyobufuzi 8
ekiseera 8
endala 8
endokwa 8
engeri 8
enkola 8
ensi 8
eya 8
ge 8
gwa 8
joshua 8
ka 8
kibuga 8
maama 8
na 8
ngeri 8
ofiisi 8
okwongera 8
omubaka 8
sc 8
tamale 8
tanzania 8
tulina 8
yonna 8
20 7
abawagizi 7
abayizi 7
amateeka 7
bamunanika 7
bbiri 7
blick 7
bobi 7
bombi 7
brig 7
byekwaso 7
byobufuzi 7
chan 7
charles 7
corona 7
dp 7
ekitundu 7
emabega 7
embeera 7
empaka 7
enkizo 7
ennaku 7
ga 7
guno 7
ivan 7
james 7
january 7
kuno 7
liigi 7
lya 7
nnamba 7
obuwanguzi 7
okubba 7
okutuuka 7
omuli 7
omusajja 7
omutindo 7
robert 7
si 7
ssekitoleko 7
tekinologiya 7
wansi 7
1 6
14 6
19 6
25 6
5 6
500 6
abakazi 6
abangi 6
abasajja 6
abazadde 6
afrika 6
afuna 6
aka 6
atalina 6
awamu 6
awo 6
baali 6
bifo 6
buwanguzi 6
byonna 6
ebibala 6
ebidduka 6
ebyo 6
ekiragiro 6
ekirala 6
ekisanja 6
emmundu 6
esatu 6
ettaka 6
ettendekero 6
famire 6
fdc 6
godfrey 6
gumu 6
joan 6
kabonge 6
katonda 6
kavuma 6
kawempe 6
ke 6
kimu 6
kisaawe 6
kisanja 6
kugenda 6
kwa 6
l 6
mateeka 6
mckinstry 6
mpaka 6
mutabani 6
mwaka 6
nabo 6
obungi 6
obuyambi 6
oguwedde 6
okubala 6
okumala 6
okunoonya 6
okusobola 6
okutumbula 6
okuvuganya 6
okwewala 6
olwa 6
omusango 6
patrick 6
paul 6
sizoni 6
sserunjogi 6
ssloa 6
talina 6
tugenda 6
tumwine 6
uoc 6
waabwe 6
wakiso 6
wine 6
100 5
2 5
2016 5
300 5
ababbi 5
abakyala 5
abalina 5
abasuubuzi 5
abo 5
afcon 5
ag 5
aliko 5
amakungula 5
amannya 5
amayumba 5
amaze 5
bakola 5
bali 5
bamaze 5
basinga 5
bogere 5
buno 5
bwatyo 5
byabwe 5
col 5
committee 5
council 5
david 5
ebimu 5
egy 5
ekika 5
ekyo 5
emitto 5
enduulu 5
enkulu 5
entambula 5
enteekateeka 5
eva 5
ewa 5
eziruma 5
fr 5
gaabwe 5
gano 5
george 5
hippos 5
kaadi 5
kalulu 5
kano 5
kasaali 5
kayemba 5
kulaba 5
luweero 5
lwanga 5
magye 5
maj 5
maka 5
minisita 5
mukaaga 5
myezi 5
national 5
ndeeba 5
ndi 5
nkeera 5
nkola 5
ntebe 5
obudde 5
obukadde 5
obukugu 5
obumanyirivu 5
obuvunaanyizibwa 5
of 5
okulya 5
okutwala 5
okweddiza 5
oluvanyuma 5
omuduumizi 5
omuggya 5
omukazi 5
omulembe 5
omulenzi 5
omupiira 5
omuti 5
omuyaga 5
omwana 5
omwawule 5
omwezi 5
sam 5
sentamu 5
singa 5
united 5
university 5
wange 5
yagasseeko 5
yasabye 5
yatandika 5
15 4
2020 4
400 4
9 4
abaami 4
abaayiseemu 4
ababa 4
ababaka 4
abagambibwa 4
abagenda 4
abasawo 4
abaserikale 4
abasinga 4
abawala 4
agattako 4
alonze 4
amaka 4
amazzi 4
amyuka 4
ani 4
asio 4
asobola 4
baana 4
baba 4
balikuddembe 4
bamutta 4
bazannyi 4
bingi 4
bokka 4
bulijjo 4
bululu 4
bungi 4
buvunaanyizibwa 4
bwabwe 4
byabufuzi 4
city 4
dda 4
eba 4
ebbanga 4
ebijanjaalo 4
ebiseera 4
ebisinga 4
ebizibu 4
ebyabadde 4
ekibumba 4
ekirime 4
ekitongole 4
ekkubo 4
emikono 4
emirundi 4
emivuyo 4
emizannyo 4
emmanuel 4
enkolagana 4
enkuba 4
ennyo 4
entebe 4
esobola 4
ezimu 4
ezo 4
ffamire 4
five 4
fufa 4
guba 4
gusobola 4
isi 4
jackson 4
john 4
kansala 4
kawanda 4
kenya 4
kimera 4
kitongole 4
kizito 4
kunsonga 4
kwongera 4
kyabwe 4
loodi 4
lwokutaano 4
lye 4
makindye 4
management 4
masaka 4
mirundi 4
moses 4
mukolo 4
munisipaali 4
mushengyezi 4
mutindo 4
muzardi 4
mwe 4
nakisunga 4
nakyo 4
namaiba 4
nange 4
ncs 4
nguudo 4
obuggya 4
obujjanjabi 4
obujulizi 4
obusobozi 4
obuwumbi 4
obuzibu 4
obw 4
obwedda 4
ofi 4
okufuuka 4
okugeza 4
okukakasa 4
okukiikirira 4
okukozesa 4
okukuba 4
okukyusa 4
okulima 4
okusaba 4
okuteeka 4
okutegeeza 4
okutta 4
okuwa 4
okuwangula 4
okuyamba 4
okuyita 4
okuzannya 4
olaba 4
olukiiko 4
omukulu 4
omulamuzi 4
omumyuka 4
omuwala 4
onyango 4
osobola 4
ossa 4
peter 4
pool 4
prof 4
s 4
saako 4
ssaako 4
ssegawa 4
ssemateeka 4
ssempeebwa 4
ssennyonga 4
star 4
tewali 4
the 4
town 4
ttaka 4
updf 4
wanno 4
yaliko 4
yoweri 4
zedde 4
11 3
2011 3
2018 3
2019/20 3
250 3
28 3
30 3
325 3
34 3
41 3
6 3
7 3
8 3
851 3
abaagala 3
abaalondeddwa 3
abagisu 3
abakadde 3
abali 3
abatono 3
abazira 3
adda 3
afande 3
afunye 3
ajja 3
ak 3
akeediimo 3
akiikirira 3
akola 3
amanyiddwa 3
amasaasi 3
amataala 3
anna 3
asiimwe 3
asiimye 3
ategeeza 3
awangudde 3
ayinza 3
azze 3
babwe 3
bafunye 3
bagenero 3
bagenze 3
bakadde 3
bakulembeze 3
baleme 3
balinda 3
bamu 3
bannaddiini 3
bannaffe 3
bannamawulire 3
basaba 3
basabira 3
basazeewo 3
batandika 3
bavubuka 3
bawagizi 3
bayita 3
bbanga 3
betty 3
bibadde 3
big 3
bigere 3
bintu 3
bob 3
bubi 3
busoga 3
butereevu 3
buvuddeko 3
buzibu 3
bwongo 3
byabakama 3
cameroon 3
christian 3
church 3
covid-19 3
daniel 3
denis 3
derrick 3
diguli 3
district 3
dusingizimana 3
ebadde 3
ebbaluwa 3
ebika 3
ebweru 3
ebyobulamu 3
ebyobulimi 3
ebyuma 3
edward 3
egenda 3
eggombolola 3
eggye 3
ekibinja 3
ekiri 3
ekirwadde 3
ekyasooka 3
elections 3
emipiira 3
emiranga 3
emiti 3
emotoka 3
empeta 3
emyezi 3
endwadde 3
enguudo 3
enkulaakulana 3
erinnya 3
essanyu 3
essira 3
etaano 3
ewedde 3
eyali 3
february 3
ffe 3
ffuuti 3
francis 3
gino 3
go 3
henry 3
ii 3
jjajja 3
joseph 3
kabale 3
kakiiko 3
kamuli 3
kataabu 3
ki 3
kibala 3
kibeera 3
kibinja 3
kisa 3
kisekka 3
kizza 3
kkamera 3
kkanso 3
kkono 3
kubaawo 3
kubeera 3
kudda 3
kuddamu 3
kukuba 3
kulima 3
kuweereza 3
kuzimba 3
kyagala 3
kyaliko 3
luberenga 3
ludda 3
lupapula 3
luyirika 3
lwabenge 3
mauritania 3
mbarara 3
mbeera 3
minisitule 3
mityana 3
mubiru 3
mukasa 3
mukisa 3
mulindwa 3
musango 3
mutebi 3
muti 3
muto 3
mutwe 3
muwanga 3
muyingo 3
mwana 3
nabyo 3
nakiweewa 3
nge 3
nkambi 3
november 3
nsenseebuse 3
nsereko 3
obulunzi 3
obulwadde 3
obuwagizi 3
obuweereza 3
obuyinza 3
obwesige 3
ocakacon 3
odoi 3
ofuna 3
ogenda 3
ogujja 3
ogwa 3
okisuubuza 3
oku 3
okuddamu 3
okukakana 3
okukula 3
okukuuma 3
okumalawo 3
okumenya 3
okusinga 3
okusoma 3
okutambula 3
okutandika 3
okutuukiriza 3
okuvuga 3
okuwangulwa 3
okuwanirira 3
okuwasa 3
okuweereza 3
okuyingira 3
okwongeza 3
olukugaana 3
oluvuganya 3
omugenzi 3
omukubiriza 3
omukulembeze 3
omulonde 3
omulundi 3
omutendeke 3
omuzannyi 3
omuzannyo 3
owe 3
pamiti 3
pau 3
rdc 3
rev 3
richard 3
rugby 3
samuel 3
simon 3
sipongi 3
south 3
ss 3
sseeti 3
ssekikuubo 3
ssentongo 3
ssewankambo 3
ssimu 3
susan 3
sylvia 3
ttabamiruka 3
tuli 3
tunisia 3
twetaaga 3
twinomujuni 3
u-20 3
ucu 3
umukuuka 3
victoria 3
yaabwe 3
yaffe 3
yatandise 3
yategeezeza 3
yazze 3
yiika 3
yinsuwa 3
yunifoomu 3
zaabwe 3
zaayo 3
ziba 3
zombi 3
037 2
0756090377 2
17 2
200 2
2006 2
2013 2
2017 2
2019 2
23 2
29 2
298 2
31 2
40 2
42 2
44 2
475 2
50 2
55 2
56_5824456 2
58 2
64 2
700 2
83 2
abaakwatibwa 2
abaddukanya 2
abagalwa 2
abajjukiza 2
abakiikirira 2
abakulu 2
abakwata 2
abakwate 2
abalondeddwa 2
abamagye 2
abana 2
abapya 2
abasatu 2
abasoba 2
abatasussa 2
abateebi 2
abategeezza 2
abatema 2
abavuganya 2
abavujjirizi 2
abeere 2
abeesimbawo 2
abeesimbyewo 2
addako 2
africa 2
aga 2
agalina 2
agambibwa 2
agende 2
agenze 2
ago 2
agumizza 2
ak47 2
akaabira 2
akaakubiddwa 2
akatebe 2
alabye 2
alangirirwa 2
algeria 2
alondebwa 2
aludde 2
amabanga 2
amabwa 2
amagulu 2
amakolero 2
amalala 2
amaluma 2
amangu 2
amanyi 2
amasomero 2
amawanga 2
amayinja 2
america 2
amulonda 2
amwanjulira 2
ana 2
and 2
andrew 2
anenyeza 2
anthony 2
asaba 2
asisinkanye 2
asp 2
atambulira 2
atandise 2
ateekateeka 2
atutte 2
atuula 2
august 2
ava 2
ave 2
avuganya 2
awabudde 2
awali 2
awangula 2
ayaniriza 2
ayogera 2
ayogerwako 2
aziikiddwa 2
baabuganye 2
baafunye 2
baagamye 2
baalabaganira 2
baamutegeezezza 2
baasangiddwa 2
baasinzidde 2
baawakanya 2
baayo 2
babade 2
babakutte 2
babale 2
badde 2
baddemu 2
baddereeva 2
bafuuka 2
bagende 2
bainababo 2
bajja 2
bakikoze 2
bakozesa 2
bakulu 2
bakwatiddwa 2
baliko 2
balonzi 2
balumiriza 2
bamaama 2
bamugoba 2
bamulesa 2
bamutunuulira 2
banna-mikaggo 2
bannaabwe 2
bannamityana 2
bannansi 2
bannayuganda 2
baryabakabo 2
basaanye 2
basabye 2
basatu 2
basobole 2
bataddewo 2
bataddeyo 2
batandise 2
batendesi 2
bato 2
battaka 2
batuuka 2
batuuse 2
bavuganya 2
bavujjirizi 2
bawangulwa 2
bawera 2
bayimirizza 2
bazitunda 2
bazze 2
bbosa 2
beebaza 2
bidduka 2
bigenda 2
bikolwa 2
bimu 2
biri 2
birina 2
biseera 2
bitongole 2
bobosi 2
bongere 2
bosco 2
bright 2
bubaka 2
bukadde 2
bulwadde 2
bumanyirivu 2
buvanjuba 2
bwakkansala 2
bwakoze 2
bwangu 2
bwebabadde 2
byaffe 2
byaggweeredde 2
byalo 2
byaruhanga 2
byawanguddwa 2
cecafa 2
center 2
central 2
charity 2
christine 2
comfarnet 2
company 2
ddembe 2
ddiiru 2
ddwaliro 2
ddyo 2
december 2
development 2
dorset 2
ebbiri 2
ebibiri 2
ebiddukanya 2
ebifaananyi 2
ebigendererwa 2
ebikolwa 2
ebiragiro 2
ebisaanyizo 2
ebisuubizo 2
ebyamateeka 2
ebyenguudo 2
ebyenjigiriza 2
ebyokwerinda 2
eddala 2
eddy 2
egganda 2
egyekuusa 2
egyo 2
ekigendererwa 2
ekikolwa 2
ekikopo 2
ekikugira 2
ekikulu 2
ekintu 2
ekipya 2
ekirungi 2
ekisekererwa 2
ekisinga 2
ekisuubizo 2
ekiwuggwe 2
ekiyitibwa 2
ekizibu 2
eklezia 2
ekola 2
ekoleddwa 2
elly 2
emikutu 2
emisolo 2
emisomo 2
emitwalo 2
empya 2
endabika 2
engoye 2
enjiri 2
enjuyi 2
enkaayana 2
enkadde 2
enkalala 2
enkiiko 2
enkya 2
ennamba 2
ennima 2
ennono 2
ennungi 2
ensala 2
ensigo 2
ensonda 2
eremesezza 2
erias 2
eriddugavu 2
eringa 2
esazewo 2
essaawa 2
essimu 2
eyabadde 2
eyakalondebwa 2
eyamenyebwa 2
eyawangudde 2
eyazimbiddwa 2
eyeesimbyewo 2
eyitibwa 2
eyo 2
eza 2
ezibadde 2
ezisangibwa 2
eziteekebwa 2
eziwera 2
ezzizza 2
febuary 2
ffiizi 2
figure 2
full 2
gagenda 2
galasius 2
galina 2
gasudde 2
gattako 2
gawona 2
ggaba 2
ggalagi 2
ggoolokipa 2
give 2
golden 2
group 2
gwabwe 2
gwawulira 2
gwebamanyi 2
gwetabiddwako 2
gyonna 2
hall 2
hussein 2
ibrahim 2
innocent 2
institute 2
juliet 2
juma 2
kajoba 2
kakuyege 2
kalangala 2
kale 2
kaleerwe 2
kalemeera 2
kalungu 2
kamwokezza 2
kamyufu 2
kanyanya 2
kasasiro 2
katikkiro 2
katosi 2
katwe 2
kavule 2
kaweefube 2
kayondo 2
kcc 2
kiba 2
kibanyi 2
kiddiridde 2
kijja 2
kikolwa 2
kikopo 2
kimwanyi 2
kings 2
kinnya 2
kiplangat 2
kiraabu 2
kiraasi 2
kirimanyaga 2
kirime 2
kiruddu 2
kirungi 2
kisoro 2
kitala 2
kitegeeza 2
kituufu 2
kiyinza 2
kkiro 2
kkomera 2
kufa 2
kufuna 2
kugezesa 2
kukola 2
kukoma 2
kulya 2
kunoonya 2
kusomesa 2
kutambula 2
kutuuka 2
kuvuganya 2
kwesimbawo 2
kyakuyamba 2
kyali 2
kyatandikibwa 2
kyonna 2
langi 2
lc 2
league 2
lejjalejja 2
life 2
liita 2
ltd 2
lubaga 2
lulwe 2
lungereza 2
lutaakome 2
luvannyuma 2
lwaki 2
lwengo 2
lwomukaaga 2
maanyi 2
maate 2
magogo 2
makerere 2
malwaliro 2
margret 2
mark 2
mary 2
matikkira 2
mayiga 2
mbalirira 2
mengo 2
michael 2
mikutu 2
mikwano 2
mirimu 2
misiri 2
misomo 2
mitendera 2
mizannyo 2
mmande 2
mmeeya 2
mmeeza 2
mmengo 2
morley 2
mpisa 2
mubaka 2
mugisha 2
muhoozi 2
muka 2
mulajje 2
muluka 2
mulyo 2
mumbeera 2
munaana 2
munkola 2
mushikori 2
mutabaani 2
mutendera 2
mutumba 2
mutuuze 2
mutuuzo 2
mw 2
mwamula 2
mwanje 2
mzee 2
nakabago 2
nakaggwa 2
nakate 2
nakuba 2
namayumba 2
namba 2
nambayo 2
nandawula 2
nantege 2
natandika 2
nategezza 2
ndaba 2
ndabe 2
ndagire 2
ndawula 2
ndowooza 2
nebatandiika 2
nekesa 2
never 2
nfunye 2
nigeria 2
njagala 2
nkobazambogo 2
nkoona 2
nkozesa 2
nnakavundira 2
nnaku 2
nnina 2
nno 2
nnyumba 2
nsaba 2
nsensebuse 2
nsimbi 2
nsobi 2
ntalo 2
ntambula 2
nteekateeka 2
ntono 2
ntumwa 2
nuwabiine 2
obeera 2
obuddukiro 2
obukola 2
obukulu 2
obulala 2
obutawa 2
obwa 2
obwakabaka 2
obwakkansala 2
ogufunako 2
ogumu 2
okubadde 2
okubawa 2
okubiri 2
okubiwa 2
okudda 2
okuddayo 2
okuganyulwa 2
okuggwa 2
okuggya 2
okuggyako 2
okuggyamu 2
okukomya 2
okukubwa 2
okulangirira 2
okuleeta 2
okulondebwa 2
okulondera 2
okulwanira 2
okumanya 2
okumyumyula 2
okunonyereza 2
okunonyeza 2
okunoonyereza 2
okusala 2
okusalawo 2
okusigala 2
okusikiriza 2
okusooka 2
okussaawo 2
okusunsulamu 2
okutaasa 2
okutambulira 2
okutandikira 2
okutegeka 2
okutegera 2
okutigomya 2
okutuwa 2
okuviira 2
okuvujjirira 2
okuwagira 2
okuwuliriza 2
okuyambako 2
okuyigga 2
okuyimirira 2
okuzimba 2
okuzza 2
okwabadde 2
okwakaggwa 2
okwambala 2
okwanjulira 2
okwekolamu 2
okwekubira 2
okwenyigira 2
okwetaba 2
okwewozaako 2
okweyamba 2
okwogera 2
okwongezaayo 2
olina 2
oludda 2
olwaleero 2
olwatuuse 2
olympic 2
omugaso 2
omugenyi 2
omukisa 2
omukolo 2
omulala 2
omusobyo 2
omuto 2
omutuufu 2
omutwe 2
omuwandiisi 2
omuwanika 2
omuyigirize 2
omwaana 2
omwogeezi 2
oscar 2
owoyesigyire 2
people 2
piki 2
pol 2
power 2
prime 2
project 2
proline 2
rosemary 2
rwanda 2
sa 2
sarah 2
satifikeeti 2
sekabira 2
sentebe 2
shaban 2
shamim 2
sipeeya 2
so 2
sofa 2
sound 2
sports 2
ssa 2
ssaabasumba 2
ssaalongo 2
ssaawa 2
ssali 2
ssande 2
ssanyu 2
sseggona 2
ssegirinnya 2
ssempebwa 2
ssempijja 2
ssemugooma 2
ssentamu 2
sserugo 2
ssi 2
ssinga 2
ssk 2
steven 2
super 2
taata 2
tanga 2
tavuganyiziddwa 2
tayebwa 2
tebalina 2
teri 2
trubish 2
tuba 2
tujja 2
tulonda 2
tumbiiza 2
u20 2
ug 2
up 2
ura 2
uyd 2
villa 2
waabulijjo 2
waayo 2
waffe 2
waggulu 2
wakonyi 2
wamala 2
wasswa 2
weetaaga 2
william 2
yaayo 2
yabanjulidde 2
yaddukira 2
yafulumira 2
yagasseko 2
yakoze 2
yakutandika 2
yakyukidde 2
yalabudde 2
yalangiridde 2
yanga 2
yange 2
yannyonnyodde 2
yasemba 2
yasoma 2
yasooka 2
yasoose 2
yasuubiza 2
yavudde 2
yaweereddwa 2
yayanjudde 2
yayogedde 2
yayongeddeko 2
yeekazizza 2
yeewuunya 2
yemu 2
yenna 2
zahara 2
zeetaaga 2
zibala 2
zibeera 2
zimu 2
zitandika 2
zooni 2
zzooni 2
