mu 498
nga 328
ku 324
n 320
nti 231
ne 157
ng 147
e 126
era 112
wa 85
y 78
bwe 76
w 67
bw 59
ya 58
ate 53
buli 52
kkooti 49
naye 44
kya 42
ye 42
z 41
gye 39
ky 39
kino 38
poliisi 36
wabula 36
ssente 35
za 35
by 34
eno 33
kuba 33
gavumenti 31
lw 30
omusango 30
bano 29
abantu 28
agamba 28
ba 28
olw 28
yategeezezza 28
aba 27
amatama 27
guno 27
gw 27
uganda 27
alina 26
kyokka 26
yagambye 26
balina 25
kubanga 25
omulamuzi 25
abaana 24
ekibiina 24
oluvannyuma 24
zino 24
be 22
ono 22
palamenti 22
kye 21
okuva 21
omu 21
ze 21
2022 20
dr 20
ez 20
gy 20
kampala 20
abadde 19
abalala 19
bwa 19
kati 19
kcca 19
minisita 19
omusajja 19
ategeeza 18
bukedde 18
eby 18
eri 18
okuli 18
okutuusa 18
ssentebe 18
town 18
ab 17
february 17
okufuna 17
ategeezezza 16
bino 16
emirimu 16
kwe 16
lwa 16
nsonga 16
omukyala 16
we 16
abakyala 15
abasuubuzi 15
abavubuka 15
agambye 15
b 15
g 15
ggwanga 15
gwe 15
nnyo 15
oba 15
obukadde 15
ofiisi 15
okukola 15
ow 15
ddala 14
gwa 14
kasasiro 14
kayunga 14
lya 14
omuntu 14
akulira 13
ali 13
bye 13
eggwanga 13
ekiro 13
ekitundu 13
ekya 13
embeera 13
enjawulo 13
enkola 13
ensonga 13
k 13
kaabuyonjo 13
katale 13
lino 13
march 13
noella 13
okuba 13
okulaba 13
ssenyonga 13
abamu 12
abasajja 12
bali 12
bitundu 12
bulungi 12
emisinde 12
essomero 12
kiseera 12
kitundu 12
liigi 12
lwe 12
maaso 12
naddala 12
obudde 12
takisi 12
wadde 12
yali 12
ababaka 11
abeera 11
asaba 11
bazze 11
buno 11
disitulikiti 11
ebibiina 11
ekitongole 11
ennaku 11
ffamire 11
ly 11
na 11
obukyala 11
obulungi 11
omumyuka 11
pulezidenti 11
waabwe 11
wakati 11
100 10
2 10
abazadde 10
bantu 10
byonna 10
clerk 10
emyaka 10
enteekateeka 10
gino 10
kyabazinga 10
maka 10
musango 10
namwirya 10
okusinziira 10
olwo 10
omuwala 10
yabadde 10
abakazi 9
baagala 9
baali 9
babadde 9
bakola 9
bangi 9
busoga 9
bya 9
council 9
ebintu 9
ebitundu 9
ebyapa 9
empaka 9
eya 9
kkomera 9
lubaga 9
mbeera 9
nze 9
of 9
okuyingira 9
omuserikale 9
omwaka 9
omwana 9
omwezi 9
omwogezi 9
owa 9
si 9
sipiika 9
ssaawa 9
wambuzi 9
000 8
10 8
3 8
5 8
abalangira 8
abalina 8
akakiiko 8
amateeka 8
amyuka 8
baabwe 8
bagamba 8
bakkansala 8
bannayuganda 8
bba 8
egy 8
ekirwadde 8
ekitiibwa 8
engeri 8
ettaka 8
ga 8
kakiiko 8
kifo 8
kitebe 8
kw 8
leero 8
makindye 8
metropolitan 8
muntu 8
nansana 8
okukuba 8
okwongera 8
omukazi 8
omuliro 8
wansi 8
11 7
abakozi 7
abatuuze 7
ag 7
agenda 7
akola 7
asimbiddwa 7
baza 7
budde 7
charles 7
ebbanga 7
ebimu 7
ebyo 7
ebyuma 7
ekifo 7
enkadde 7
erya 7
ey 7
gabula 7
ge 7
ka 7
kazambi 7
kintu 7
kuno 7
kwa 7
minsa 7
mpaka 7
mutendera 7
namutebi 7
ncs 7
nup 7
okudda 7
olubalaza 7
omuwaabi 7
school 7
ssaalongo 7
ssempijja 7
tewali 7
wamu 7
yonna 7
zaake 7
1 6
16 6
abasodokisi 6
abayizi 6
akatale 6
amafuta 6
arabia 6
asabye 6
atayo 6
ayagala 6
babeera 6
bagenda 6
bbaala 6
bbiri 6
ben 6
cross 6
dda 6
ebadde 6
ebirala 6
ebyobulamu 6
ekika 6
eky 6
ekyo 6
enkuba 6
gutandike 6
gya 6
jeronymos 6
jinja 6
kigambibwa 6
kityo 6
masiki 6
misinde 6
miss 6
muzeeyi 6
nabo 6
national 6
ngeri 6
nkola 6
obubonero 6
obulabe 6
obuwumbi 6
ogw 6
ogwa 6
okugereka 6
okunoonyereza 6
okusobola 6
oludda 6
omubaka 6
omulangira 6
omuzannyo 6
ppaaka 6
rukare 6
saudi 6
ssomero 6
tebalina 6
waliwo 6
yagenda 6
yenna 6
zooni 6
13 5
17 5
19 5
2021 5
ababadde 5
abakulembeze 5
abalwadde 5
agambibwa 5
agattako 5
akakukufa 5
alumizibwa 5
amakubo 5
amannya 5
amawulire 5
amaze 5
among 5
asindikiddwa 5
asobola 5
asobole 5
ava 5
baba 5
bafuna 5
bigambibwa 5
bk 5
bobi 5
bungi 5
bwatyo 5
chemutai 5
colombus 5
congo 5
country 5
dp 5
ebidongo 5
ebiri 5
ebyokulonda 5
edward 5
egenda 5
egya 5
ekintu 5
ekisulo 5
ekivundu 5
ekyapa 5
emirundi 5
emmotoka 5
emyezi 5
ensimbi 5
gano 5
gumu 5
gwabwe 5
henry 5
kanso 5
kiba 5
kibiina 5
kkampuni 5
kukola 5
kunoonyereza 5
kyalo 5
kyonna 5
mateeka 5
mirimu 5
mmisa 5
mmotoka 5
mulago 5
munaana 5
munisipaali 5
mutuuze 5
nakyo 5
nju 5
nsamba 5
obukugu 5
obulimi 5
obwagazi 5
okubeera 5
okufa 5
okugenda 5
okusangibwa 5
okutolontoka 5
okutuuka 5
okwebaza 5
okwewala 5
olunaku 5
omugenzi 5
omulambo 5
omuvuzi 5
omuwendo 5
omuyizi 5
oxygen 5
patrick 5
rozella 5
ssaabasumba 5
ssenga 5
ssimu 5
ssinga 5
waggulu 5
wano 5
zzaake 5
00 4
15 4
23 4
29 4
4 4
7 4
70 4
abadigize 4
abaffamire 4
abakulira 4
abali 4
abasinga 4
abasoba 4
abawala 4
abayimbi 4
adf 4
afune 4
ago 4
aleese 4
allan 4
amaanyi 4
amabbaala 4
amagezi 4
amanda 4
amanyiddwa 4
anguyo 4
anita 4
avudde 4
awamu 4
awo 4
babiri 4
bakansala 4
bakozesa 4
basabye 4
basobola 4
bbaasi 4
bifo 4
blick 4
bumativu 4
buvunaanyizibwa 4
buzito 4
bwabwe 4
bwangu 4
byapa 4
covid 4
covid-19 4
ddiguli 4
ebbaala 4
ebigambo 4
ebyalo 4
ebyokwerinda 4
eddembe 4
ekirungi 4
ekisoboka 4
ekissi 4
ekyalo 4
emabega 4
emiruka 4
emitwalo 4
emizannyo 4
emu 4
enduulu 4
enkulaakulana 4
ennyimba 4
ennyumba 4
ensi 4
ettama 4
ettofaali 4
eyagenda 4
fdc 4
geoffrey 4
gubadde 4
gwonna 4
hajat 4
jamal 4
kabale 4
kaboozi 4
kabowa 4
kano 4
katende 4
katonda 4
kaweefube 4
kimu 4
kiraabu 4
kirabira 4
kitongole 4
kituufu 4
kkanso 4
kojja 4
lightning 4
loughborough 4
lukwago 4
lumunye 4
lye 4
makerere 4
malwaliro 4
maneja 4
mangu 4
mapenduzi 4
mary 4
masomero 4
mathias 4
mazzi 4
mengo 4
mmeeya 4
mpuuga 4
mugezi 4
muhammad 4
muhwezi 4
mukisa 4
mulimu 4
mwaka 4
mwana 4
mwe 4
mwesige 4
nateete 4
nnamba 4
nnyumba 4
nrm 4
nsimbi 4
obujjanjabi 4
obujulizi 4
obulamu 4
obungi 4
obutali 4
okubaawo 4
okubaka 4
okugula 4
okukozesa 4
okumala 4
okutandika 4
okuteekawo 4
okuvaayo 4
okuwulirwa 4
okuzimba 4
olusoggo 4
olwa 4
omulundi 4
oyo 4
peace 4
primary 4
s 4
sembabule 4
singa 4
sports 4
ssaako 4
ssenkatuuka 4
time 4
ttabamiruka 4
ttiimu 4
walakira 4
walukagga 4
wiiki 4
wine 4
yasabye 4
zaabwe 4
zijja 4
ziri 4
zzooni 4
12 3
2020 3
24 3
31 3
6 3
a 3
aanya 3
abaakaligibwa 3
abaddukanya 3
abagagga 3
abakungu 3
abalimi 3
abalongo 3
abasaba 3
abasiraamu 3
abasomesa 3
abawerako 3
abazannyi 3
abooluganda 3
afiiramu 3
afiiridde 3
ajja 3
ak 3
akabenje 3
akaboozi 3
akolera 3
akomezebwewo 3
akozesa 3
akuuma 3
alimu 3
alumiriza 3
alupo 3
amaka 3
amanene 3
amanya 3
amasomero 3
amatuufu 3
amazima 3
amazzi 3
anadda 3
and 3
annet 3
annyonnyola 3
app 3
asiimye 3
atambula 3
athletics 3
atwine 3
avuddeyo 3
avunaanyizibwa 3
ayita 3
babaka 3
bakyala 3
balaga 3
balooya 3
bamaze 3
bannaabwe 3
bannamateeka 3
basanze 3
basatu 3
basinziira 3
basobole 3
bategeeza 3
bavudde 3
bazadde 3
bazannyi 3
bbanga 3
biba 3
bingi 3
biraze 3
biri 3
birivumbuka 3
bisatu 3
biwandiiko 3
bokka 3
bonna 3
bukyala 3
bulamu 3
bungereza 3
busatu 3
buzibu 3
bwawedde 3
bwonna 3
byali 3
byansi 3
byobufuzi 3
church 3
david 3
ddereeva 3
ddigi 3
diana 3
dipu 3
division 3
donald 3
doreen 3
dorothy 3
east 3
ebbugumu 3
ebifo 3
ebika 3
ebirina 3
ebirowoozo 3
ebisongovu 3
ebya 3
ebyensimbi 3
eddakiika 3
ekibinja 3
ekibonerezo 3
ekibuga 3
ekikwekweto 3
ekiseera 3
ekitebe 3
ekivvulu 3
ekiwandiiko 3
ekizibu 3
elizabeth 3
embuto 3
emikono 3
emisango 3
emmanuel 3
empya 3
endwadde 3
engatto 3
enkaayana 3
enkulu 3
ensala 3
ensawo 3
enteebereza 3
esatu 3
essira 3
essuubi 3
ewa 3
eyali 3
eza 3
eziri 3
famire 3
gayaza 3
house 3
i 3
iganga 3
ii 3
international 3
ipod 3
ivan 3
john 3
jonathan 3
joseph 3
kaba 3
kabenje 3
kabugo 3
kabuyonjo 3
kafeero 3
kalungu 3
kamwokya 3
kibira 3
kibuga 3
kigenda 3
kika 3
kinnya 3
kirina 3
kisaka 3
kitalya 3
kitonsa 3
kizibu 3
kkopi 3
kkubo 3
kubeera 3
kwongera 3
kyengera 3
kyoka 3
lc1 3
ldc 3
luguudo 3
lukaya 3
lwaki 3
lwokutaano 3
lyonna 3
maanyi 3
masaka 3
matama 3
mayuge 3
misango 3
mitwe 3
mmere 3
moses 3
motor 3
mpapula 3
mubiru 3
mufumba 3
muhanga 3
mukazi 3
mukolo 3
mukyala 3
muliro 3
munene 3
munnaabwe 3
munnayuganda 3
munne 3
musa 3
muwonge 3
mwezi 3
nabyo 3
namungoona 3
nantege 3
nninga 3
nnungi 3
nsalessale 3
ntandikwa 3
ntono 3
ntungamo 3
nuba 3
obucaafu 3
obumu 3
obusoba 3
obuzibu 3
obw 3
obwesige 3
obwetaavu 3
oguwedde 3
okubayamba 3
okuddamu 3
okufiira 3
okufuluma 3
okukuuma 3
okulaga 3
okulonda 3
okulondoola 3
okumanya 3
okusaba 3
okusooka 3
okutulugunya 3
okutyoboola 3
okuweebwa 3
okuzuula 3
olubuto 3
oluvuganya 3
omuggya 3
omugugu 3
omukaaga 3
omukka 3
omukuumi 3
omukwano 3
omusuubuzi 3
omutindo 3
omutuufu 3
omutuuze 3
omutwe 3
omuvubuka 3
omuwandiisi 3
paasita 3
peruth 3
poloti 3
proscovia 3
prossy 3
road 3
sarah 3
sewa 3
speaker 3
ssedduvutto 3
ssegirinya 3
ssekakegga 3
ssekindi 3
ssemateeka 3
ssembabule 3
ssewanyana 3
storm 3
sulaiman 3
surrey 3
tafuna 3
tebakola 3
tekinologiya 3
tour 3
turyasingura 3
updf 3
wonna 3
yaabwe 3
yafiira 3
yafunye 3
yakutte 3
yategezezza 3
yeenyigira 3
yeetaaga 3
zokka 3
zulaikah 3
14 2
20 2
200 2
2014 2
21 2
22 2
25 2
27 2
28 2
38 2
43 2
485 2
50 2
500 2
55 2
8 2
800 2
81 2
88 2
9 2
90 2
abaanyagibwa 2
abaayitiddwa 2
ababiri 2
abaddusi 2
abakolera 2
abakugu 2
abakulu 2
abamabbaala 2
abanaamweyirira 2
abanene 2
abangi 2
abannanfuusi 2
abapangisa 2
abasawo 2
abatakisi 2
abazirakisa 2
abo 2
acamudde 2
africa 2
afudde 2
afunye 2
agaana 2
agaanyi 2
agakola 2
agasseeko 2
agava 2
agende 2
agenze 2
agezaako 2
agudde 2
agumizza 2
aidah 2
aka 2
akaggi 2
akapima 2
akatwala 2
akayimba 2
akolamu 2
akuba 2
akutamya 2
akwasa 2
akwata 2
akyagenda 2
akyali 2
alaajana 2
alaba 2
alabudde 2
alaga 2
alex 2
alimanda 2
allah 2
alule 2
amaaso 2
amakolerere 2
amalala 2
amalidde 2
amalwaliro 2
amangu 2
amazina 2
american 2
amina 2
amizza 2
amon 2
amukwata 2
amusindika 2
amusomera 2
amutwala 2
amuwe 2
amwekengera 2
ansaba 2
asanga 2
asatu 2
asindise 2
asomerwa 2
asula 2
atalina 2
atc 2
ateeketeeke 2
attiddwa 2
attunka 2
atulugunya 2
atuuzibwa 2
atuuziddwa 2
atwala 2
augustine 2
avumiridde 2
avunaanibwa 2
awa 2
awaka 2
awali 2
awangudde 2
ayinza 2
ayogera 2
azze 2
baabalagira 2
baagambye 2
baalina 2
babawa 2
babbibwa 2
babeeko 2
babirye 2
bafana 2
bafuba 2
bafunye 2
bagatta 2
bagoberera 2
bagula 2
bajja 2
bakanyama 2
bakazi 2
bakimanyi 2
bakolamu 2
bakomye 2
bakulembeddwa 2
bakulembeddwamu 2
bakung 2
bakutte 2
bakwatagane 2
bakwatamu 2
bakyagenda 2
bakyalina 2
balaba 2
balaze 2
balongo 2
balumbye 2
bamukomyewo 2
bamukozesa 2
bamukuba 2
bamulumiriza 2
bamuteeke 2
bamutwala 2
banannyini 2
bandikomyawo 2
bannamawulire 2
bannannyini 2
banyumirwa 2
baryomunsi 2
basalawo 2
basazeewo 2
basemera 2
bashir 2
basimattuse 2
basomye 2
basuubuzi 2
bataddewo 2
batambulira 2
batandika 2
bategeezezza 2
batera 2
batunula 2
batuuka 2
batuule 2
bavubuka 2
bawakanya 2
bawuliziganya 2
bayitamu 2
bbaluwa 2
bbeeyi 2
bbo 2
beatrice 2
beerema 2
belgium 2
bettanira 2
betty 2
bibalirirwamu 2
bigenda 2
bikonde 2
bisambi 2
bo 2
bombi 2
boodabooda 2
boxing 2
bubi 2
buganda 2
bujjanjabi 2
bukadde 2
bukendeera 2
bukenya 2
bukutiya 2
bukyaliwo 2
bulambulukufu 2
bunkenke 2
busega 2
bushenyi 2
busolwe 2
butalejja 2
butongole 2
buwanguzi 2
buyinza 2
bwange 2
bwetaavu 2
bweyategeezezza 2
byabwe 2
byenfunidde 2
championship 2
championships 2
cooperation 2
cranes 2
ddene 2
ddwaaliro 2
ddwaliro 2
diguli 2
dipulooma 2
diviizoni 2
divizoni 2
dugo 2
duku 2
ebbaluwa 2
ebbeeyi 2
ebidduka 2
ebigamba 2
ebikolwa 2
ebikonde 2
ebisaanyizo 2
ebiseera 2
ebisinga 2
ebituufu 2
ebizibu 2
ebizimbe 2
ebongeramu 2
ebyana 2
ebyenda 2
ebyenjawulo 2
eddoboozi 2
eddwaliro 2
eggulo 2
eggye 2
ejja 2
ekifuba 2
ekigero 2
ekikula 2
ekimu 2
ekirala 2
ekisaanikidde 2
ekituufu 2
ekivuddeko 2
ekiyondo 2
eklesia 2
eklisia 2
ekyakutte 2
ekyamuviirako 2
ekyeru 2
ekyeyo 2
eligenda 2
elly 2
emiggo 2
emipiira 2
emirambo 2
emugga 2
endongo 2
endowooza 2
enfo 2
engoye 2
enguudo 2
enkalu 2
enkya 2
ennume 2
ennyanja 2
ennyo 2
ensaasaanya 2
entebe 2
enteekateka 2
entuula 2
envunyu 2
eririwo 2
eriwera 2
essanyu 2
essimu 2
ettaano 2
etteeka 2
eva 2
ewadde 2
experito 2
eyabbye 2
eyakula 2
eyalwala 2
eyawangula 2
eyo 2
eyookubiri 2
ezimu 2
ezimukomyawo 2
eziteevunya 2
faridah 2
federation 2
ffayiro 2
fr 2
fred 2
gaabwe 2
gaba 2
gali 2
garuga 2
gattako 2
gav 2
gerald 2
ggeeti 2
ggwanika 2
gibadde 2
giri 2
good 2
gugenda 2
guliko 2
gulu 2
guwedde 2
guwulirwa 2
gyakubeera 2
gyonna 2
half 2
health 2
hon 2
iv 2
january 2
jeema 2
jeff 2
jim 2
kabagambe 2
kabanda 2
kabina 2
kadde 2
kaguli 2
kakembo 2
kakumiro 2
kalenda 2
kalyango 2
kampuni 2
kapiteeni 2
kasangati 2
kaseera 2
kasita 2
katanga 2
katatumba 2
katetemera 2
kawaala 2
ke 2
kenya 2
kibadde 2
kibbululwa 2
kibi 2
kibirige 2
kibongerako 2
kibumbiro 2
kibuzizzaako 2
kikendedde 2
kikomera 2
kikyamu 2
kiri 2
kiro 2
kisanja 2
kiva 2
kiyambako 2
kizimbe 2
kizito 2
kkalenda 2
kkanisa 2
klesia 2
koma 2
kubaako 2
kugonza 2
kukomezebwawo 2
kulabako 2
kuli 2
kuliko 2
kulonda 2
kulondebwa 2
kumpi 2
kunoonya 2
kutulugunya 2
kutuusa 2
kuwulira 2
kuyambako 2
kuyiwa 2
kuzaala 2
kwakolebwa 2
kwenyigira 2
kweyongeddeko 2
kyabwe 2
kyaddirira 2
kyaddondo 2
kyakusatu 2
kyangu 2
kyazuuliddwa 2
kyeyo 2
laawundi 2
liweza 2
looya 2
luba 2
lubuto 2
lukung 2
luno 2
lusaze 2
luwero 2
lwakuba 2
lwanga 2
ma 2
magezi 2
magulu 2
makumbi 2
marathon 2
martin 2
masaza 2
master 2
masters 2
may 2
mbaddenga 2
mbarara 2
mbi 2
mbu 2
miguel 2
mikono 2
min 2
minisitule 2
mityana 2
mmande 2
mmemba 2
mmuudu 2
mpeereza 2
mpulira 2
mubaka 2
mubi 2
muguluma 2
mukaaga 2
mulala 2
mulamba 2
muli 2
munnakenya 2
museveni 2
musoke 2
mutesaasira 2
muto 2
mutuuzo 2
mutwe 2
mutyaba 2
muvubuka 2
muwala 2
muyimbi 2
muyiwe 2
muyizi 2
muzannyo 2
mw 2
mwannyina 2
mweyannyonnyoledde 2
mwota 2
myaka 2
myezi 2
nabbi 2
nadiope 2
nagenda 2
nakaseke 2
nakato 2
nakawa 2
nakulabye 2
nassozi 2
natandise 2
nayo 2
ndagire 2
ndi 2
nguudo 2
nigiina 2
nkaayana 2
nkomerero 2
nkulu 2
nnagenda 2
nsaba 2
nsiima 2
nsobi 2
nsubuga 2
ntebe 2
ntikko 2
ntuufu 2
ntuumu 2
nyamuhanga 2
nyanga 2
o 2
obadde 2
obeera 2
obua 2
obubbi 2
obubuga 2
obujanjabi 2
obulunzi 2
obulwadde 2
obuntu 2
obusungu 2
obutagoberera 2
obutemu 2
obuva 2
obuvunanyizibwa 2
obuwagizi 2
obuyambi 2
obwakyabazinga 2
obwegendereza 2
obwekyusizo 2
obwenkanya 2
oguntu 2
ojara 2
okubatendeka 2
okubuulirirwa 2
okugamba 2
okugeza 2
okuggalawo 2
okuggulawo 2
okuggyamu 2
okuggyayo 2
okugifunamu 2
okugulu 2
okukabasanya 2
okukendeeza 2
okukung 2
okukunga 2
okukwasa 2
okukyusa 2
okulabirako 2
okuleeta 2
okuleetebwa 2
okulumba 2
okulya 2
okumakya 2
okumukwata 2
okumumanya 2
okumuwa 2
okumweyimirira 2
okunoonya 2
okunyumirwa 2
okusika 2
okusobya 2
okutaasa 2
okutalaaga 2
okutegeka 2
okutendekebwa 2
okutulugunyizibwa 2
okutundira 2
okutuukira 2
okutuula 2
okutuuza 2
okuvuganya 2
okuwangula 2
okuwanyisiganya 2
okuwulira 2
okuwulirirwa 2
okuyamba 2
okuyimirizibwa 2
okuyisa 2
okuyitamu 2
okuyoola 2
okuzaala 2
okwagala 2
okwatuukiriza 2
okweddiza 2
okwekubira 2
okwetoloola 2
okwetooloola 2
okweyambisa 2
okweyanjula 2
okwonoona 2
olukiiko 2
olukubakuba 2
olumu 2
olutalo 2
oluva 2
oluvanyuma 2
olwokubiri 2
ommutwe 2
omubeezi 2
omubiri 2
omudaali 2
omuduumizi 2
omugagga 2
omuggalo 2
omugongo 2
omukisa 2
omuko 2
omukolo 2
omukulu 2
omulala 2
omulembe 2
omuli 2
omulimu 2
omunnanfuusi 2
omupiira 2
omusaabaze 2
omusasi 2
omusibe 2
omusirikale 2
omutima 2
omuwalabu 2
omwegendereza 2
otucet 2
p 2
paaka 2
pikipiki 2
prison 2
promotion 2
puleesa 2
pulida 2
pulojekiti 2
reynold 2
richard 2
roland 2
rose 2
round 2
rwakakooko 2
sag 2
salama 2
salim 2
sama 2
satifikeeti 2
sekonda 2
september 2
serve 2
she 2
sheikh 2
sigenda 2
simon 2
siriimu 2
sitayiro 2
so 2
sojah 2
source 2
ssande 2
ssempereza 2
ssi 2
ssuuna 2
steven 2
super 2
t 2
talina 2
talwetegekedde 2
tamale 2
tanzania 2
tawuni 2
tayinza 2
tebamanyi 2
tebamuwa 2
tekuli 2
terina 2
tewaabadde 2
the 2
times 2
timothy 2
tower 2
ttaka 2
ttakisi 2
tteeka 2
ttumbi 2
tuba 2
tukolera 2
tumwiine 2
tuzikwate 2
twitter 2
uoc 2
upc 2
vent 2
victoria 2
vincent 2
wabaddewo 2
waffe 2
waka 2
wange 2
waninda 2
watuufu 2
wazira 2
wiikendi 2
william 2
wofiisi 2
world 2
yabaategeezezza 2
yabiteeka 2
yagamba 2
yagasseeko 2
yagukkiriza 2
yagweganyi 2
yagyiddwayo 2
yajjula 2
yakolera 2
yalaze 2
yalondebwa 2
yamusanga 2
yannyonnyodde 2
yasangibwa 2
yasemba 2
yasimbiddwa 2
yasooka 2
yasoose 2
yatandika 2
yategeeza 2
yatwalibwa 2
yavudde 2
yawadde 2
yawambye 2
yawangula 2
yeemulugunyizza 2
yeeraliikiriza 2
yenyoola 2
young 2
zimu 2
ziweddeyo 2
zonna 2
zziwa 2
