mu 515
ku 344
nga 336
n 310
ne 200
nti 181
e 153
ng 135
era 97
y 94
wa 81
bwe 68
w 67
ye 63
ya 59
abantu 52
kino 50
poliisi 49
kkooti 47
gye 44
ky 42
we 39
ba 38
kya 37
gwe 36
bw 35
lw 35
eno 33
olw 33
ekibiina 31
omu 31
naye 30
oluvannyuma 30
guno 29
omubaka 29
by 28
bano 27
agamba 26
be 25
gw 25
kuba 25
ono 25
uganda 25
z 25
ate 24
gy 24
yali 24
2 23
abaana 23
abalala 23
abatuuze 23
buli 23
wabula 23
abadde 22
yagambye 22
2022 21
b 21
ly 21
palamenti 21
ssentebe 21
gwa 20
okuva 20
omulamuzi 20
ssente 20
kampala 19
kyokka 19
lwa 19
okulaba 19
omusango 19
1 18
africa 18
bino 18
kamyuka 18
kubanga 18
lya 18
sipiika 18
okuli 17
omumyuka 17
owa 17
pulezidenti 17
aba 16
abamu 16
ali 16
buganda 16
bwa 16
lyato 16
nrm 16
yategeezezza 16
ababaka 15
disitulikiti 15
eby 15
essaza 15
kigambibwa 15
okutuusa 15
asabye 14
bukedde 14
ddwaaliro 14
ebintu 14
ez 14
kitundu 14
kkomera 14
lino 14
naddala 14
oba 14
okukola 14
ow 14
south 14
ttabamiruka 14
zino 14
ategeezezza 13
bye 13
emmotoka 13
ensonga 13
essimu 13
gavumenti 13
gya 13
ka 13
obukadde 13
omulambo 13
wakiso 13
wamu 13
8 12
bp 12
emirimu 12
ensimbi 12
eri 12
ey 12
jinja 12
kakiiko 12
kasasiro 12
lugazi 12
maaso 12
okufuna 12
omwaka 12
zaake 12
000 11
ab 11
alina 11
amasasi 11
bali 11
banne 11
davis 11
emyaka 11
minisita 11
nnyo 11
okuba 11
wakati 11
waliwo 11
za 11
4 10
bagenda 10
bannakibiina 10
bonna 10
eky 10
embeera 10
eya 10
ggwanga 10
kiseera 10
kwe 10
kye 10
lwe 10
mayanja 10
mwe 10
nakawa 10
omugenzi 10
omukazi 10
omuliro 10
omuntu 10
ppaaka 10
ttiimu 10
waabwe 10
yabadde 10
3 9
abaagalana 9
abali 9
ategeeza 9
baabwe 9
babadde 9
babiri 9
bayita 9
brovad 9
ddala 9
ebikonde 9
ebiri 9
egy 9
ekitundu 9
enjawulo 9
essomero 9
kitebe 9
march 9
mulimu 9
na 9
nalubega 9
namubiru 9
oku 9
okubaka 9
okubeera 9
okutuuka 9
omulimu 9
singa 9
abakiise 8
among 8
awaka 8
bagamba 8
bannayuganda 8
basatu 8
bba 8
council 8
ennyama 8
ennyo 8
enteekateeka 8
eyali 8
famire 8
february 8
john 8
kakooza 8
kawempe 8
kisitu 8
leero 8
lubaga 8
maama 8
maka 8
mbeera 8
mmisa 8
moses 8
mukono 8
mukula 8
mukyala 8
munisipaali 8
musango 8
nansikombi 8
ngeri 8
of 8
ofiisi 8
olwo 8
omuli 8
omusajja 8
ssomero 8
walusimbi 8
wano 8
17 7
5 7
ababadde 7
abakulembeze 7
abasirikale 7
abo 7
agambibwa 7
agambye 7
akola 7
akulira 7
amyuka 7
attiddwa 7
babirye 7
balina 7
bantu 7
bitundu 7
bulungi 7
bya 7
ebirala 7
eggwanga 7
ekifo 7
ekiro 7
ekyalo 7
emberenge 7
eyo 7
ge 7
kati 7
kifo 7
mukazi 7
mutuuze 7
mwanda 7
nabo 7
nsonga 7
obuuma 7
okugenda 7
okwongera 7
omukyala 7
omutuuze 7
omwana 7
omwogezi 7
si 7
ssaawa 7
ssembalirwa 7
tebalina 7
town 7
wasswa 7
yasabye 7
10 6
12 6
30 6
7 6
80 6
abakazi 6
abayizi 6
akakiiko 6
amalala 6
amateeka 6
amaze 6
baabadde 6
bakola 6
bamaze 6
bannaabwe 6
basobole 6
batuuze 6
bukenya 6
byabwe 6
church 6
ebisolo 6
eklezia 6
ekya 6
embwa 6
emizannyo 6
empisa 6
engeri 6
ennaku 6
ennyumba 6
erya 6
essaawa 6
ettaka 6
gumu 6
kasenge 6
kibiina 6
kibuli 6
kitalya 6
kkanisa 6
klezia 6
leb 6
limanda 6
mizannyo 6
mmotoka 6
mpaka 6
mugezi 6
mukasa 6
munnaabwe 6
nansana 6
nnamba 6
obulungi 6
obumu 6
okubba 6
okukuba 6
okumala 6
okumpi 6
okusinziira 6
okuzimba 6
omuzannyo 6
pulojekiti 6
rotale 6
ssaza 6
wadde 6
wanyama 6
yenna 6
zaabwe 6
zooni 6
00 5
25 5
6 5
9 5
abakozi 5
abakungu 5
abalina 5
abaserikale 5
abavubi 5
abawanguzi 5
abazadde 5
abeera 5
agenda 5
alabudde 5
alagira 5
anita 5
asaba 5
ayagala 5
baagala 5
baali 5
bangi 5
batandise 5
bazibu 5
bazze 5
bulago 5
byonna 5
christopher 5
club 5
dr 5
ebbanga 5
ekika 5
ekintu 5
ekitiibwa 5
ekizimbe 5
emitwalo 5
emyezi 5
enjaga 5
enju 5
enkadde 5
francis 5
frank 5
g 5
ga 5
ggombolola 5
iganga 5
k 5
kakalu 5
kalangala 5
kaweefube 5
kibuga 5
kkono 5
kwa 5
kyaddondo 5
kyalo 5
laddu 5
lodge 5
meeya 5
mirimu 5
mmande 5
mukolo 5
mulago 5
musa 5
musomo 5
muzannyo 5
mwala 5
myaka 5
nju 5
nkose 5
nsimbi 5
obubaka 5
obubbi 5
obulamu 5
obuzibu 5
ogw 5
okukozesa 5
okusaba 5
okuwulira 5
olunaku 5
omukulu 5
omusumba 5
ouma 5
peter 5
sands 5
sarah 5
sheikh 5
so 5
ssemakadde 5
ssemateeka 5
yonna 5
ze 5
15 4
20 4
28 4
abaagwa 4
ababiri 4
abaffamire 4
abasajja 4
abasawo 4
abasiraamu 4
abazannyi 4
agaana 4
akabenje 4
akakwasisa 4
alex 4
amagye 4
amaka 4
amapenzi 4
amasiro 4
amasomero 4
amawanga 4
amawulire 4
amir 4
amusaba 4
asinzidde 4
atuuka 4
awadde 4
bagambye 4
bakkansala 4
bamu 4
bayinza 4
bazadde 4
bo 4
boxing 4
buno 4
bwaise 4
david 4
ebadde 4
ebisulo 4
ebyo 4
eggombolola 4
ekibadde 4
ekibuga 4
ekkwaano 4
ekyo 4
emikutu 4
emiriraano 4
empaka 4
enkwe 4
enzibe 4
erina 4
eyabadde 4
ffamire 4
gen 4
gino 4
gutandike 4
gyonna 4
hotel 4
jeronymos 4
joseph 4
kaabuyonjo 4
kabaka 4
kaggo 4
kano 4
kanso 4
kasangati 4
kasirye 4
katikkiro 4
katonda 4
kayunga 4
kikaaya 4
kikulu 4
kityo 4
kkansala 4
konteyina 4
kuno 4
kw 4
kwosa 4
life 4
looya 4
lubega 4
luguudo 4
luke 4
lukeman 4
luno 4
luyombya 4
makindye 4
male 4
mapenduzi 4
masomero 4
mberaze 4
media 4
metropolitan 4
muganzi 4
mukaaga 4
muluka 4
mulundi 4
munnayuganda 4
munne 4
muntu 4
muzeeyi 4
myala 4
nnusu 4
nnya 4
nnyanja 4
obubi 4
obulemu 4
obuyinza 4
obwakabaka 4
ojulongo 4
okubadde 4
okuddamu 4
okujulira 4
okukomyawo 4
okuleeta 4
okumaliriza 4
okumukuba 4
okusobola 4
okutandika 4
okuteeka 4
okuwulirwa 4
okuzza 4
okwewozaako 4
okwogera 4
olukiiko 4
olwa 4
omugagga 4
omugenyi 4
omukolo 4
omukono 4
omuwandiisi 4
omwami 4
omwezi 4
paul 4
robert 4
sam 4
segirinya 4
silvester 4
social 4
ssaabasumba 4
ssande 4
ssenyonga 4
st 4
talina 4
ti 4
ttaka 4
unesco 4
wiiki 4
yaabwe 4
14 3
19 3
2018 3
2021 3
21 3
32 3
50 3
500 3
abafuna 3
abafunye 3
abagambibwa 3
abakristu 3
abakulira 3
abakungubazi 3
abakyala 3
abaliko 3
abamyuka 3
abavubuka 3
abavuzi 3
akabira 3
akakadde 3
akiikirira 3
akoze 3
akutte 3
alam 3
allan 3
aludde 3
alumiriza 3
amaaso 3
amagezi 3
amakubo 3
amannya 3
amanyiddwa 3
ambyulensi 3
amon 3
amukuba 3
amutwala 3
asimbiddwa 3
asobola 3
asoose 3
ategezezza 3
atongozza 3
avunaanibwa 3
awaddeyo 3
awatali 3
ayimbulwe 3
ayita 3
ayogera 3
ayongeddeko 3
azirika 3
azze 3
baasoose 3
baba 3
bafiiridde 3
bakama 3
bakolera 3
bakoze 3
bakuba 3
bamala 3
bambega 3
bamukuba 3
bamusiba 3
bana 3
bannaddiini 3
basabye 3
basobola 3
basoose 3
batandika 3
bava 3
bavunaanibwa 3
baweereddwa 3
beeraga 3
beetabye 3
bianco 3
bibiina 3
bilal 3
bintu 3
bukadde 3
bukya 3
buloba 3
butongole 3
buyinza 3
bwali 3
bwatyo 3
bwenkanya 3
bypass 3
collins 3
commonwealth 3
cricket 3
dan 3
ddyo 3
district 3
dl 3
dubai 3
east 3
ebifo 3
ebigambo 3
ebiragiro 3
ebirime 3
ebitabo 3
eddagala 3
eddembe 3
eggulo 3
ekigendererwa 3
ekikwekweto 3
ekiragiro 3
eklesia 3
embizzi 3
emikono 3
emirundi 3
emisango 3
emisinde 3
emmundu 3
emperor 3
empeta 3
emu 3
engoye 3
enguzi 3
enkola 3
enkolagana 3
enkulu 3
enkya 3
ennyanja 3
ensoma 3
entekateeka 3
ery 3
essanyu 3
forest 3
gab 3
galabuzi 3
gano 3
geoffrey 3
gwabwe 3
gyabwe 3
hamza 3
ii 3
isaac 3
ivan 3
june 3
kabenje 3
kaduukulu 3
kafeero 3
kalambi 3
kalenda 3
kaliro 3
kangulumira 3
kansala 3
kanungu 3
kasirivu 3
katende 3
kavule 3
kawalya 3
kcca 3
kibasobozese 3
kibeera 3
kiddiridde 3
kiggundu 3
kimu 3
kireka 3
kiro 3
kitongole 3
kkwaano 3
kkwano 3
kugenda 3
kukuba 3
kuliko 3
kwabwe 3
kwossa 3
kyonna 3
lady 3
ligyoni 3
lt 3
lubuto 3
ludda 3
lumbe 3
lwakataka 3
lwokuna 3
lyabwe 3
mabirizi 3
magada 3
maj 3
makya 3
malwaliro 3
mangu 3
mateeka 3
mengo 3
mikutu 3
misango 3
misinde 3
mityana 3
motors 3
mpuuga 3
mufti 3
mukulonda 3
museveni 3
mutendera 3
muzibu-azaalampanga 3
mw 3
mwaka 3
mwami 3
mwana 3
mwezi 3
nabasirye 3
najjuuko 3
nakaseke 3
namuli 3
nateete 3
nnannyini 3
nnyumba 3
north 3
northern 3
nsaba 3
nsibirwa 3
ntebe 3
nteekateeka 3
ntege 3
nup 3
obukuba 3
obuyonjo 3
obw 3
obwegassi 3
obwenkanya 3
ogwa 3
okufera 3
okufiira 3
okukuza 3
okukwata 3
okukwatibwa 3
okulima 3
okulonda 3
okunoonyereza 3
okusangibwa 3
okutambuza 3
okutumbula 3
okutuuza 3
okuvuma 3
okuwedde 3
okuweebwa 3
okuyamba 3
okuyiwa 3
okuzuula 3
okw 3
okwemulugunya 3
okwenjawulo 3
okweyimirirwa 3
oluguudo 3
olusirika 3
olutuula 3
oluusi 3
oluwaabi 3
olwaleero 3
olyem 3
omukungu 3
omulala 3
omusuubuzi 3
omuwanika 3
omuyiggo 3
our 3
paapa 3
parish 3
park 3
patrick 3
pikipiki 3
rdc 3
rubaga 3
school 3
select 3
shaban 3
siriimu 3
ssekamanya 3
ttivvi 3
waggwa 3
wansi 3
west 3
yagasseeko 3
yategezezza 3
yayongeddeko 3
yekka 3
yit 3
yu 3
zigenda 3
zonna 3
zzaake 3
zzooni 3
100 2
11 2
16 2
200 2
2005 2
22 2
300 2
39 2
45 2
70 2
aana 2
aanyiza 2
abaagala 2
abaawangula 2
abaazimba 2
ababbi 2
abagagga 2
abagamba 2
abagenzi 2
abaggagga 2
abakulu 2
abalokole 2
abalonzi 2
abalwadde 2
abasaba 2
abasatu 2
abasinga 2
abasodokisi 2
abatannakwatibwa 2
abategesi 2
abatwalidde 2
abawagizi 2
abayimbi 2
abazirakisa 2
abazze 2
abdu 2
abdul 2
abe 2
abeetabye 2
abuuza 2
afudde 2
afuna 2
ag 2
agaamuttiddewo 2
agaanyi 2
agali 2
agumizza 2
ajja 2
akaaba 2
akafuzi 2
akagudde 2
akakasa 2
akalulu 2
akawungeezi 2
akkiriza 2
akomezebwewo 2
akuba 2
akubiriza 2
akulembedde 2
akuuma 2
akyaddeko 2
alaba 2
alagidde 2
alaze 2
alimu 2
alonda 2
amaanyi 2
amalwaliro 2
amasabo 2
amayinja 2
amazzi 2
amukkiriza 2
amukwata 2
amusindika 2
amutegeezezza 2
amuvuma 2
anadda 2
andrew 2
anokoddeyo 2
anoonya 2
asindikiddwa 2
atannategeerekeka 2
ategezeeza 2
atwala 2
atwalibwa 2
august 2
authority 2
ave 2
avunanyizibwa 2
awabadde 2
awakanya 2
awamu 2
awera 2
ayitibwa 2
ayokya 2
azaala 2
azzeemu 2
baabasanze 2
baakutte 2
baakwatibwa 2
baamenya 2
baana 2
baasibidde 2
babatwala 2
babawadde 2
baddeyo 2
bafuna 2
bagenze 2
bagezaako 2
baggya 2
baggyewo 2
bakafulu 2
bakazibaggya 2
bakedde 2
bakulembeddwa 2
bakyagenda 2
balagira 2
baliko 2
balimwezo 2
bamubbako 2
bamugamba 2
bamusibidde 2
bamutta 2
bamuwa 2
banyumirwa 2
bapangisa 2
bardege-layibi 2
basaba 2
basamize 2
basonda 2
bassa 2
batandike 2
batebuse 2
bateebereza 2
bategeezezza 2
bawaanyisiganya 2
bawanguzi 2
bayingira 2
bayitamu 2
bazimba 2
bbanga 2
bbiri 2
bemulugunya 2
bibanja 2
bibiri 2
bifaananyi 2
bigenda 2
bigere 2
bimuli 2
bingi 2
bm 2
bongera 2
booza 2
bubenje 2
bubi 2
budde 2
bugweri 2
bukakasizza 2
bukasa 2
bukolwa 2
bukulembeze 2
bukyanga 2
bulamu 2
bulijjo 2
bumenyi 2
busoga 2
butaweera 2
butebi 2
buyambi 2
bwabadde 2
bwakabaka 2
bwangu 2
bwansi 2
bwavu 2
byabufuzi 2
byakare 2
center 2
chelsea 2
chikarito 2
companies 2
cranes 2
cup 2
dayirekita 2
dda 2
ddagala 2
ddwaliro 2
densite 2
development 2
divizoni 2
ebibiina 2
ebifaananyi 2
ebigezo 2
ebikujjuko 2
ebiro 2
ebisongovu 2
ebitongole 2
ebitooke 2
ebiwundu 2
ebweru 2
ebya 2
ebyokwerinda 2
ebyuma 2
eddwaliro 2
egisoba 2
egiwera 2
egya 2
ejulirwamu 2
ekibinja 2
ekigatta 2
ekigenda 2
ekijjulo 2
ekikonde 2
ekikontana 2
ekikula 2
ekiri 2
ekisolo 2
ekisosonkole 2
ekitereke 2
ekitongole 2
ekkanisa 2
ekkomera 2
ekkwano 2
ekola 2
ekyeyo 2
embi 2
emidaali 2
emiggo 2
emiruka 2
emivuyo 2
emmanuel 2
emmwaanyi 2
empeereza 2
empewo 2
empya 2
emumenya 2
emundu 2
emunu 2
enduulu 2
eng 2
enjuyi 2
enkalala 2
enkoko 2
ennamba 2
ensi 2
ente 2
entebe 2
entegeka 2
enzaalwa 2
enzannya 2
eriko 2
eryaato 2
eryato 2
eryo 2
esimbiddwa 2
essuubi 2
esther 2
etaano 2
ettabi 2
ewala 2
ewedde 2
eyakubiddwa 2
eyaliko 2
eza 2
ezitali 2
gaabwe 2
gagenda 2
gaggaddwa 2
gav 2
geeti 2
general 2
george 2
gibadde 2
godfrey 2
group 2
gukola 2
gutti 2
help 2
henry 2
holy 2
hospital 2
hubert 2
iii 2
isa 2
islamic 2
james 2
judith 2
julius 2
july 2
juma 2
justine 2
kabanda 2
kaguli 2
kaleerwe 2
kampuni 2
kamu 2
karuna 2
kasaana 2
kasim 2
kassim 2
kasubi 2
katuntu 2
katuukiro 2
kavuma 2
kayogera 2
ke 2
kefa 2
kenya 2
ki 2
kibadde 2
kibanja 2
kibinja 2
kikwasa 2
kintu 2
kirabo 2
kirima 2
kiromita 2
kitandikidde 2
kitandwe 2
kiteeberezebwa 2
kitegeeza 2
kiva 2
kiyimba 2
kiyitiridde 2
kkampuni 2
kkanso 2
kkubo 2
klesia 2
konsitityusoni 2
kontulakiti 2
kooti 2
kubwa 2
kufuba 2
kujja 2
kukola 2
kumi 2
kusaba 2
kusooka 2
kutunda 2
kutuuka 2
kyabwe 2
kyazze 2
kyebakutika 2
kyengera 2
kyobe 2
lc1 2
liigi 2
liri 2
luggala 2
lugogo 2
luigi 2
lukiiko 2
lukyamuzi 2
lungujja 2
lusaze 2
luzira 2
lwokutaano 2
maanyi 2
mabiriizi 2
macho 2
mafu 2
majeri 2
makubo 2
martin 2
mary 2
masaka 2
mataka 2
matovu 2
matu 2
maziga 2
mbarara 2
mbi 2
mbu 2
mbuya 2
mirundi 2
mitendera 2
mkyakyulu 2
mmeeya 2
mmunye 2
model 2
morocco 2
mpanga 2
mubantu 2
mubiru 2
mugambwa 2
muganda 2
mugema 2
muhammad 2
mukitundu 2
mukwano 2
muliro 2
munnamateeka 2
muteesa 2
mutwe 2
muvawala 2
muwata 2
muyimbwa 2
mwabadde 2
mwalo 2
naads 2
nakajumba 2
nakulabye 2
nalubaale 2
namagunga 2
namayiba 2
namba 2
namutumba 2
national 2
nayo 2
ncs 2
nigeria 2
niwabiine 2
nkola 2
nkumba 2
nnungi 2
nnyini 2
nsaggu 2
nsangi 2
nsubuga 2
ntobazzi 2
nyanzi 2
nze 2
obudde 2
obuduuka 2
obufumbo 2
obuggya 2
obujagalalo 2
obujulizi 2
obukozesebwa 2
obulwadde 2
obuntu 2
obutakkaanya 2
obutujju 2
obuugi 2
obuwanguzi 2
obuyambi 2
obuyumba 2
obwa 2
obwedda 2
obwesige 2
ogubadde 2
ogwakutte 2
ogwel 2
ojara 2
okello 2
okubaako 2
okubagulira 2
okubifunamu 2
okubiri 2
okufuuka 2
okuggulawo 2
okugifuna 2
okugoba 2
okugulu 2
okuguzikiza 2
okugwa 2
okukendeeza 2
okukkakkana 2
okukomya 2
okukoona 2
okukulaakulanya 2
okukuuma 2
okulaga 2
okulumba 2
okulwanyisa 2
okulya 2
okumanya 2
okumusiba 2
okumusibira 2
okuna 2
okunnyonnyola 2
okunyweza 2
okusooka 2
okusunsulamu 2
okusuula 2
okutaasa 2
okutandikira 2
okutyoboola 2
okuviira 2
okuwagira 2
okuwamba 2
okuwangula 2
okuyisa 2
okuzannya 2
okuziteekamu 2
okwegatta 2
okwekebejjebwa 2
okwekumaakuma 2
okwerinda 2
okwesimbawo 2
okwetegeka 2
old 2
olubadde 2
oludda 2
olukwe 2
olumbe 2
oluvanyuma 2
oluvuganya 2
omubeezi 2
omubuka 2
omuggagga 2
omugoberezi 2
omukiise 2
omukka 2
omukuumi 2
omukwano 2
omulongo 2
omulundi 2
omusaabaze 2
omusawo 2
omusenyu 2
omusiguze 2
omutwe 2
omuvubuka 2
omuwala 2
omuwawabirwa 2
omwagalwa 2
omwali 2
owek 2
owesigyire 2
p/s 2
panadol 2
perpetual 2
piki 2
polof 2
poloti 2
prof 2
pulogulamu 2
rally 2
rcc 2
rehema 2
road 2
rt 2
s 2
sacco 2
samuel 2
sebadduka 2
secretariate 2
sewanyana 2
sheema 2
simon 2
sj 2
sm 2
sowedi 2
sports 2
ssanyu 2
sseggwandiisizo 2
ssegirinnya 2
ssegirinya 2
sseguya 2
ssekaana 2
ssekabembe 2
sserebe 2
ssese 2
ssewanyana 2
supreme 2
swaziland 2
t 2
taata 2
tebaliiwo 2
tebasobola 2
teri 2
tewali 2
ttakisi 2
tugenda 2
tukulaze 2
tumusiime 2
twahilah 2
ubf 2
updf 2
victor 2
waabaddewo 2
waakiri 2
waayo 2
wabweru 2
waka 2
wild 2
william 2
wonna 2
world 2
yaakatuuzibwa 2
yafunye 2
yajja 2
yakkaatirizza 2
yakozesa 2
yakubye 2
yalagidde 2
yamaze 2
yannyonnyodde 2
yasanga 2
yasangibwa 2
yasangiddwa 2
yasimbudde 2
yasinzidde 2
yasoose 2
yatulugunyizibwa 2
yatutte 2
yatuuka 2
yatwaliddwa 2
yawangula 2
yeebaza 2
yeetaba 2
yeetegekera 2
yeeyanjudde 2
ziyita 2
zokka 2
zombi 2
