mu 767
nga 464
n 449
ku 432
nti 293
ne 261
e 244
ng 190
era 150
abantu 144
y 128
w 116
wa 105
bw 82
bwe 78
kino 73
kkooti 72
ate 66
eno 66
kya 65
olw 64
ya 61
gavumenti 59
ye 59
buli 56
kubanga 55
abaana 54
bano 53
lw 53
naye 53
katonda 51
omwaka 51
abadde 49
gw 49
ono 48
ba 45
kyokka 45
000 44
gy 44
b 43
be 43
by 42
okuva 42
z 42
2023 41
ky 41
guno 40
we 39
eri 38
ssente 38
lwa 37
maaso 37
agamba 36
dr 36
gwa 36
ettaka 35
kuba 35
wabula 35
uganda 34
okuli 33
omu 33
ssentebe 33
omulamuzi 32
yategeezezza 32
abalala 31
ategeezezza 31
eby 31
gye 31
oluvannyuma 30
enjawulo 29
nnyo 29
omusango 29
za 29
aba 28
abamu 28
bino 28
ensonga 28
yesu 28
ekkanisa 27
balina 25
bwa 25
ey 25
fr 25
poliisi 25
g 24
ggwanga 24
kampala 24
okutuusa 24
2022 23
ez 23
10 22
eky 22
ga 22
lya 22
nabo 22
wamu 22
akulira 21
disitulikiti 21
kwe 21
luzira 21
ly 21
okubeera 21
omwana 21
ow 21
wakati 21
yagambye 21
embeera 20
kw 20
mwaka 20
obulungi 20
okukola 20
okwongera 20
omubiri 20
pulezidenti 20
zakah 20
abatuuze 19
agambye 19
ali 19
bukedde 19
centre 19
emisango 19
ensi 19
kiganda 19
kye 19
naddala 19
olwo 19
wano 19
ab 18
abakulembeze 18
baabwe 18
bya 18
city 18
ekibiina 18
gayaza 18
kati 18
kkomera 18
okufa 18
owa 18
abasuubuzi 17
bangi 17
emyaka 17
kaabuyonjo 17
maka 17
oba 17
obulamu 17
okufuna 17
okulaba 17
rev 17
yabadde 17
abazadde 16
asaba 16
bitundu 16
ebintu 16
emizannyo 16
january 16
kalungu 16
kiseera 16
liigi 16
okusaba 16
st 16
ttaka 16
abakyala 15
amaanyi 15
amazzi 15
asabye 15
babadde 15
bagamba 15
bagenda 15
bali 15
bannayuganda 15
bantu 15
br 15
emmere 15
freedom 15
health 15
jjuuko 15
john 15
kigambibwa 15
kyalo 15
obukadde 15
singa 15
zino 15
2 14
abasawo 14
alina 14
ensimbi 14
kcca 14
kwa 14
mbeera 14
ngeri 14
ogw 14
okulya 14
omubaka 14
omugenzi 14
omuli 14
ssaako 14
ssaawa 14
wadde 14
5 13
abayizi 13
agenda 13
amateeka 13
bro 13
december 13
emu 13
engeri 13
eyali 13
kabaka 13
lino 13
maama 13
malwaliro 13
na 13
tebalina 13
20 12
30 12
abali 12
amasomero 12
ategeeza 12
bonna 12
bye 12
ddala 12
ebirala 12
ekika 12
empaka 12
ennaku 12
kivvulu 12
kuliko 12
kusaba 12
luno 12
miss 12
moses 12
mpigi 12
muwonge 12
obutonde 12
olunaku 12
tewali 12
yali 12
ze 12
1 11
11 11
abitex 11
basaba 11
bwatyo 11
council 11
ebyobulamu 11
emitwalo 11
essimu 11
eya 11
gwe 11
hajji 11
k 11
kkanisa 11
lukwago 11
lwaki 11
minisitule 11
mmisa 11
museveni 11
muzeeyi 11
myaka 11
obulabirizi 11
okudda 11
oludda 11
richard 11
robert 11
sipiika 11
7 10
ababadde 10
abagenzi 10
abasoba 10
abeera 10
akakiiko 10
amalwaliro 10
basobole 10
budde 10
byonna 10
endala 10
enkola 10
enteekateeka 10
famire 10
kakande 10
lukiiko 10
lwe 10
minisita 10
muntu 10
obusiraamu 10
okuba 10
okubba 10
oluwaabi 10
omukisa 10
omuntu 10
suuna 10
town 10
wiiki 10
6 9
8 9
amagye 9
anatoli 9
booda 9
bulamu 9
bulungi 9
ebidduka 9
ebyo 9
eddwaliro 9
egenda 9
ekifo 9
ekya 9
empya 9
endwadde 9
gya 9
kifo 9
kiwanuka 9
lye 9
mulimu 9
mwe 9
obwannannyini 9
okukuuma 9
okunoonyereza 9
okusasula 9
okutuuka 9
okuzimba 9
olukiiko 9
omulabirizi 9
omuziki 9
omuzikiti 9
omwogezi 9
walukagga 9
yonna 9
zaabwe 9
00 8
13 8
31 8
abo 8
ag 8
allah 8
amanyiddwa 8
banne 8
bo 8
bulabirizi 8
bwabwe 8
church 8
ddiini 8
ebbeeyi 8
ebiriroliro 8
eddagala 8
egy 8
ente 8
erya 8
essanyu 8
essomero 8
ffiizi 8
gattako 8
ka 8
kibiina 8
kibuga 8
kisaka 8
kuno 8
limanda 8
makindye 8
metropolitan 8
mugezi 8
mukama 8
mwana 8
namirembe 8
nyanzi 8
obuyambi 8
obw 8
okujjumbira 8
okutandika 8
okutta 8
okwagala 8
omulundi 8
omupya 8
omuwaabi 8
oyinza 8
palamenti 8
patrick 8
saako 8
simon 8
ssekukkulu 8
ttiimu 8
vipers 8
19 7
3 7
4 7
40 7
50 7
9 7
abagenda 7
abakkiriza 7
abakristaayo 7
abato 7
abavuzi 7
akubirizza 7
amawulire 7
asinzidde 7
atyo 7
awagenda 7
baabadde 7
baagala 7
baana 7
babeera 7
bannanyini 7
bbiri 7
bp 7
bwaise 7
can 7
ebyettaka 7
eggwanga 7
ekigendererwa 7
ekikolwa 7
ekirombe 7
ekitongole 7
ekitundu 7
emirimu 7
essuubi 7
ge 7
gen 7
iii 7
joseph 7
kano 7
katale 7
katumba 7
kitundu 7
kufuna 7
kukola 7
kyagulanyi 7
lll 7
looya 7
lukaya 7
lutikko 7
matovu 7
mmande 7
mpaka 7
mr 7
muhammad 7
musango 7
mutendera 7
muwala 7
nabukenya 7
nkola 7
obujjanjabi 7
ofiisi 7
okugenda 7
okumala 7
okumalako 7
okunywa 7
okusinziira 7
okusobola 7
olwa 7
omuceere 7
omuggya 7
omusumba 7
peter 7
samuel 7
ssabadinkoni 7
ssande 7
ssanyu 7
ssekindi 7
stephen 7
yaabwe 7
yayongeddeko 7
100 6
abagagga 6
abakozi 6
abavubuka 6
alaajanidde 6
amaaso 6
amasimu 6
atwala 6
awadde 6
bajja 6
bintu 6
buganda 6
charles 6
dda 6
ddwaliro 6
ebweru 6
ekiro 6
ekiseera 6
ekyo 6
emmanuel 6
emmundu 6
enkya 6
ffamire 6
gaabwe 6
kakiiko 6
kaweesi 6
kayunga 6
kisaakaate 6
kristo 6
kusasula 6
kyengera 6
lubaga 6
lubiri 6
luguudo 6
lyabwe 6
makerere 6
martin 6
mayanja 6
mityana 6
mukono 6
mulago 6
munisipaali 6
nabbi 6
nakawa 6
namyalo 6
ndejje 6
nicholas 6
nnabagereka 6
nnamba 6
nsi 6
obudde 6
obujulizi 6
obuvunaanyizibwa 6
offiisi 6
oguwedde 6
okulambula 6
okunoonya 6
okusabira 6
okuvuganya 6
okuyingira 6
omugagga 6
omukuumi 6
omukyala 6
omulimu 6
omutindo 6
omuwala 6
omuyimbi 6
omuzannyo 6
pamiti 6
ronnie 6
s 6
ssalongo 6
ssaza 6
ssejjemba 6
ssekabembe 6
ssemateeka 6
university 6
waabwe 6
waliwo 6
yunivasite 6
zonna 6
23 5
25 5
27 5
400 5
abakadde 5
abakiise 5
abakola 5
abakulu 5
abalina 5
abamyuka 5
abasomesa 5
abavubi 5
abawa 5
africa 5
agambibwa 5
agamu 5
ak 5
akubiriza 5
akuutidde 5
allan 5
amafuta 5
amagezi 5
amasasi 5
amaze 5
amyuka 5
annyonnyola 5
asindikibwa 5
asobola 5
atwine 5
avunaanibwa 5
awaka 5
ayagala 5
bafuna 5
bagoberera 5
bakansala 5
bakozesa 5
bakulembeddwa 5
balabe 5
batuuze 5
bazadde 5
bazimba 5
besigye 5
bingi 5
bosco 5
brig 5
buchanan 5
busega 5
butto 5
buvuddeko 5
china 5
christian 5
ddwaaliro 5
dickson 5
dorothy 5
ebbanga 5
ebiriisa 5
ebitundu 5
ebyenfuna 5
eggulo 5
ejja 5
ekikwekweto 5
ekisaakaate 5
eklisia 5
ekyaviirako 5
embi 5
emipiira 5
emirala 5
emiti 5
enkalu 5
enkulu 5
ennyama 5
ennyo 5
ensangi 5
entebe 5
erias 5
ewedde 5
ezo 5
faaza 5
february 5
gano 5
jude 5
judith 5
kamwokya 5
kasyate 5
katikkiro 5
kato 5
kawempe 5
kiberu 5
kibuuka 5
kimu 5
kisenyi 5
kitebe 5
kubeera 5
kulonda 5
kyabwe 5
kyonna 5
league 5
lunaku 5
luwalira 5
luweero 5
maria 5
masomero 5
mbi 5
mengo 5
mugabe 5
mukisa 5
mukolo 5
mutuuze 5
naluwooza 5
namazzi 5
nnyingi 5
north 5
nsimbi 5
nsonga 5
obubbi 5
obusabadinkoni 5
of 5
okubatizibwa 5
okufiirwa 5
okufuluma 5
okuggyako 5
okujja 5
okukuba 5
okuleeta 5
okulonda 5
okumutta 5
okuteeka 5
okutwala 5
okuyita 5
okuzimbibwa 5
okwaniriza 5
okweyimirirwa 5
omukazi 5
omutukuvu 5
omuwandiisi 5
pulojekiti 5
school 5
sharon 5
si 5
so 5
trisha 5
updf 5
yakwatibwa 5
yasabye 5
yeebazizza 5
26 4
370 4
abaabadde 4
abaafiiridde 4
abadigize 4
abagoberezi 4
abakulira 4
abapunta 4
abasaba 4
abasibe 4
abatannakwatibwa 4
abawagizi 4
abeetabye 4
abuulira 4
akabenje 4
akola 4
akozesa 4
akulembeddemu 4
alaga 4
amanyi 4
amon 4
among 4
amusindika 4
and 4
ategezezza 4
ayimbye 4
ayita 4
azze 4
baakutandika 4
babba 4
babiri 4
babwe 4
bakira 4
bakkiriza 4
bakuba 4
baleme 4
basazeewo 4
bavunaanibwa 4
bikolwa 4
biseera 4
bishop 4
bucaafu 4
bugoloobi 4
bukenya 4
bulijjo 4
bungereza 4
bunjo 4
bwavu 4
byabwe 4
byogeddwa 4
champions 4
cheptegei 4
clerk 4
david 4
ddagala 4
ddakiika 4
ebigambo 4
ebika 4
ebikolwa 4
ebirabo 4
ebiri 4
ebisago 4
ebivvulu 4
ebyenjigiriza 4
ekimala 4
ekisaawe 4
ekitebe 4
ekitiibwa 4
eklezia 4
embuto 4
emikisa 4
enduulu 4
engoye 4
ennyimba 4
entambula 4
erimu 4
ery 4
esangibwa 4
etaano 4
eyabadde 4
ezitali 4
francis 4
fred 4
freeman 4
galina 4
godfrey 4
gravity 4
gyabwe 4
gyonna 4
ibrahim 4
imam 4
james 4
kasangati 4
kaweefube 4
ke 4
kikoleddwa 4
kintu 4
kisaawe 4
kiyimba 4
kizibu 4
kizito 4
kkampuni 4
kugenda 4
kulaba 4
kusussa 4
leero 4
libadde 4
life 4
lisangibwa 4
lugamba 4
lugoloobi 4
lulenti 4
lwanga 4
lwokubiri 4
lwokutaano 4
lwomukaaga 4
makomera 4
makya 4
masaka 4
maureen 4
mc 4
meeya 4
misango 4
mmeeya 4
mmengo 4
model 4
mpisa 4
mubiri 4
mugalu 4
mugamba 4
muko 4
mukulu 4
mulamu 4
mulundi 4
munnaabwe 4
mutebi 4
mutendesi 4
mwenda 4
nantume 4
nateete 4
nimusiima 4
nnaku 4
nnannyini 4
nnyina 4
nnyumba 4
nrm 4
nsamba 4
nteekateeka 4
obubi 4
obukulembeze 4
obuzibu 4
obwa 4
obwassabalabirizi 4
obwetaavu 4
obwo 4
ogwa 4
oku 4
okubadde 4
okuddamu 4
okugereka 4
okukimanya 4
okukolera 4
okukomya 4
okukozesa 4
okukuza 4
okumanya 4
okusooka 4
okutumbula 4
okuwa 4
okuwulira 4
okuzannya 4
okuzza 4
okw 4
okwebaza 4
okwerula 4
okwetaba 4
okwo 4
okwogera 4
olina 4
oluguudo 4
oluvanyuma 4
omudumu 4
omujulizi 4
omukolo 4
omukono 4
omulembe 4
omulimo 4
omumyuka 4
omusaayi 4
osobola 4
p 4
pulaani 4
road 4
rt 4
sheikh 4
spain 4
spice 4
ssabalabirizi 4
ssemakula 4
sulaiman 4
tulina 4
tv 4
uspa 4
waayo 4
wange 4
wasswa 4
weewale 4
wine 4
yagwegaanyi 4
yasiimye 4
yenna 4
zooni 4
14 3
17 3
18 3
2021 3
22 3
35 3
350 3
42 3
75 3
abaagala 3
abaawule 3
ababatizza 3
ababbi 3
abakazi 3
abakulisitaayo 3
abalabirizi 3
abalwadde 3
abamweyimirira 3
abangereza 3
abangi 3
abasabye 3
abasinga 3
abasiraamu 3
abasodokisi 3
abasumba 3
abawanguzi 3
abawerako 3
abayimbi 3
afoyowoth 3
agugumbudde 3
agumizza 3
aine 3
ajja 3
ajjukirwa 3
ajjukizza 3
akabonero 3
akasawo 3
akatayimbwa 3
akomawo 3
akuba 3
akwatiddwa 3
alabudde 3
aleese 3
amaka 3
amannya 3
amayumba 3
amazaalibwa 3
amaziga 3
amazima 3
amusomedde 3
anaddizibwa 3
anyama 3
asiima 3
asomerwa 3
association 3
athletics 3
ava 3
awamu 3
awangudde 3
ayimbulwe 3
azaaliddwa 3
baafiiridde 3
baakola 3
baasazeewo 3
baasoose 3
baategeezezza 3
baayo 3
baffe 3
bagagga 3
baganda 3
bagenze 3
bajaguza 3
bakama 3
bakulembeddwamu 3
bakyala 3
balinda 3
bannakalungu 3
bannamawulire 3
basaanidde 3
basabye 3
basatu 3
basaze 3
basuubuzi 3
batabukidde 3
bawadde 3
bawala 3
baweebwe 3
bayinza 3
bazze 3
bbaala 3
beebazizza 3
ben 3
birungi 3
bukadde 3
buloba 3
bungi 3
buno 3
busiro 3
busoga 3
busumba 3
bwetaavu 3
bweyategeezezza 3
c 3
canon 3
cansala 3
daniel 3
ddembe 3
dduyiro 3
development 3
diana 3
dpc 3
ebalirirwamu 3
ebibala 3
ebimu 3
ebiragalagala 3
ebiriroriro 3
ebirowoozo 3
ebirungi 3
ebirungo 3
ebonies 3
ebyalo 3
ebyenjawulo 3
ebyokunywa 3
eddakiika 3
eddiini 3
eddwaaliro 3
egya 3
ekigo 3
ekikyamu 3
ekiri 3
ekiyinza 3
ekizibu 3
ekola 3
ekole 3
ekyabadde 3
ekyali 3
ekyapa 3
ekyaviiriddeko 3
elvis 3
emabega 3
embisi 3
emitima 3
emizigo 3
emmotoka 3
enguudo 3
enkoofiira 3
enkuba 3
ennungi 3
ennyumba 3
enviiri 3
enzaalwa 3
esuubulwa 3
ewala 3
eyafiiridde 3
eyawummula 3
eyo 3
ezisoba 3
eziva 3
gali 3
galikwoleka 3
getaaga 3
ggolo 3
ggombolola 3
grace 3
group 3
gutandike 3
gwo 3
haruna 3
jamia 3
jjumba 3
jubilee 3
julius 3
kaala 3
kabenje 3
kakalu 3
kamu 3
kanso 3
kasumba 3
kavvu 3
kazo 3
kiboga 3
kiddiridde 3
kigo 3
kijja 3
kimera 3
kiro 3
kisambira 3
kitaabwe 3
kitintale 3
kituufu 3
kityo 3
kuddamu 3
kujaguza 3
kumpi 3
kusabira 3
kuyita 3
kuzimba 3
kwekuba 3
kyabazinga 3
kyebando 3
lawrence 3
ldc 3
loodi 3
lubega 3
lukusa 3
luwummula 3
lweza 3
lyonna 3
male 3
maneja 3
masjid 3
mateeka 3
mathias 3
matigga 3
mazina 3
mbarara 3
mbuya 3
mesarch 3
mikolo 3
misinde 3
mitendera 3
mizannyo 3
mmere 3
mother 3
mpagi 3
mugambwa 3
mulembe 3
munnayuganda 3
muno 3
murengezi 3
musajja 3
mutabani 3
mutindo 3
mutwe 3
muzikiti 3
mwetegefu 3
nakakabala 3
namanya 3
namasuba 3
namungoona 3
nange 3
nazama 3
ndwadde 3
newankubadde 3
nintunga 3
niwagaba 3
nnalulungi 3
november 3
nsobi 3
nsubuga 3
ntebe 3
nze 3
obuggya 3
obulagajjavu 3
obulala 3
obumenyi 3
obussabalabirizi 3
obususse 3
obuwanguzi 3
obuweereza 3
obwakabaka 3
obwavu 3
okubagerekera 3
okubaka 3
okubatiza 3
okubiri 3
okuddaabiriza 3
okugaba 3
okugabira 3
okuggyawo 3
okugiwa 3
okujjukira 3
okukendeeza 3
okukka 3
okukulwaza 3
okukwatamu 3
okukwatibwa 3
okukyusa 3
okulagajjalira 3
okulengera 3
okumpi 3
okusala 3
okusomesa 3
okusonyiwa 3
okutegeka 3
okutukuza 3
okutuula 3
okuvaayo 3
okuwaayo 3
okuwangula 3
okuwulirwa 3
okuyiga 3
okuyimba 3
okuyimiriza 3
okuziimbwa 3
okwenyigira 3
okwerinda 3
okwetereeza 3
okwettanira 3
okwewala 3
oli 3
oliviera 3
olukusa 3
olusooka 3
olutobazzi 3
olwaleero 3
olwekyo 3
omubeezi 3
omubuliizi 3
omudumo 3
omukulu 3
omulamu 3
omusajja 3
omutendesi 3
omutima 3
omutonzi 3
omutujju 3
omutuuze 3
omuvubuka 3
omuwanguzi 3
omwafiira 3
omwali 3
omwalo 3
omwezi 3
oyo 3
p/s 3
paasita 3
passport 3
prisons 3
prof 3
rdc 3
robinah 3
rubaga 3
sam 3
sekukkulu 3
senyonga 3
ssabasumba 3
ssabbuuni 3
ssatu 3
ssegwanyi 3
ssinga 3
ssomero 3
stephano 3
talina 3
tamale 3
tayinza 3
tebasobola 3
techno 3
tegalina 3
teri 3
tiding 3
tiffen 3
training 3
ttaamu 3
ttivvi 3
ttulakita 3
unra 3
ven 3
vision 3
wala 3
wansi 3
william 3
wofiisi 3
yalabudde 3
yasalawo 3
yasangibwa 3
yasimbiddwa 3
yekka 3
yezu 3
yiika 3
yoweri 3
yunivaasite 3
zigenda 3
zokka 3
zzooni 3
16 2
2017 2
2018 2
2019 2
2020 2
21 2
24 2
29 2
37 2
49 2
500 2
5000 2
60 2
600 2
650 2
750 2
900 2
99 2
abaalagajjalirwa 2
abaali 2
abaalonda 2
ababaka 2
ababeera 2
ababeeyimirira 2
abachina 2
abadda 2
abaddusi 2
abafere 2
abafumbo 2
abagaana 2
abagoba 2
abagumya 2
abajja 2
abajulizi 2
abakristu 2
abakungu 2
abakungubazi 2
abakuumi 2
abalabi 2
abalimi 2
abalonzi 2
abamenyi 2
abanaaba 2
abanaakwata 2
abanene 2
abasakaate 2
abaserikale 2
abasirikale 2
abasukka 2
abasusse 2
abatali 2
abatayagala 2
abategesi 2
abatendesi 2
abatwala 2
abava 2
abavuganya 2
abawawaabirwa 2
abaweebwa 2
abazaalisa 2
abazze 2
abbamu 2
abbey 2
abeebijambiya 2
abeegattira 2
abel 2
abenjawulo 2
abetaavu 2
abtex 2
abudul 2
abutwala 2
adiru 2
afa 2
afaanana 2
african 2
afudde 2
agasangibwa 2
agenkalakkalira 2
agudde 2
aisha 2
akabaga 2
akadde 2
akalombolombo 2
akaseera 2
akateesiteesi 2
akategeka 2
akawungeezi 2
akazibu 2
akenyana 2
akimanyi 2
akolera 2
akwasa 2
akwatibwa 2
alabika 2
alabirira 2
alagira 2
aleeteddwa 2
alese 2
all 2
alondeddwa 2
alupo 2
amaggye 2
amaliriza 2
amasannyalaze 2
amasejjere 2
amayinja 2
amazalibwa 2
amazina 2
amutegeezezza 2
amuvunaana 2
amuyambe 2
anatooli 2
angola 2
anita 2
asiimwe 2
asiimye 2
asimbiddwa 2
asindikiddwa 2
asobole 2
asoose 2
atabukira 2
atandike 2
atenderezza 2
atuuka 2
atuumye 2
atya 2
august 2
avudde 2
avunaanibwe 2
avunaaniddwa 2
awalala 2
awatali 2
aweebwa 2
awo 2
ayamba 2
ayingira 2
ayinza 2
ayogedde 2
baabulijjo 2
baagambye 2
baagenze 2
baagwegaanyi 2
baakuddamu 2
baakutikkirwa 2
baali 2
baalina 2
baami 2
baasimbiddwa 2
baasindikiddwa 2
baategezezza 2
baavuganyizza 2
baba 2
babategeeza 2
badda 2
badde 2
baddemu 2
badduka 2
baddukanya 2
bafune 2
bafunye 2
bagabye 2
baggya 2
bagusuubula 2
bajje 2
bajulizi 2
bakifeesi 2
bakola 2
bakoze 2
bakulembeddwaamu 2
bakungu 2
bakuuma 2
balabula 2
balemereddwa 2
balemererwa 2
baliko 2
balumbye 2
balumiriza 2
balungamya 2
bamanyi 2
bamaze 2
bamubba 2
bamukuba 2
bamulumiriza 2
bamusindise 2
banga 2
bannaabwe 2
bannadiini 2
bannakawempe 2
bannannyini 2
banyumirwa 2
basabiddwa 2
basajja 2
basemera 2
basibyeyo 2
basindikiddwa 2
basisinkanye 2
bassentebe 2
basula 2
basusse 2
basuubirwa 2
batalina 2
batandise 2
batatuukiriza 2
batema 2
batendeka 2
batte 2
batuuka 2
baviiriddeyo 2
bavubuka 2
bavunaaniddwa 2
baweereddwa 2
bayego 2
bayimbulwa 2
bayimiridde 2
bayimirizaawo 2
bayitamu 2
bayizi 2
bazizaako 2
bazzukulu 2
bba 2
bbandwe 2
bbanja 2
bbeeyi 2
bbokisi 2
bbosa 2
bebalondeddwa 2
beekwasa 2
beetegese 2
benon 2
betty 2
bibalirirwamu 2
bibinja 2
bidduka 2
bifo 2
bifuba 2
bigenda 2
bijja 2
bikola 2
bikubwa 2
bikujjuko 2
bikwatagana 2
birimu 2
bisaanyizo 2
bitone 2
bizinensi 2
bobi 2
bokka 2
bombastic 2
bongere 2
boogera 2
booluganda 2
brian 2
brothers 2
bubi 2
bubiri 2
buddo 2
bugabye 2
bugagga 2
buggya 2
bukomansimbi 2
bulabe 2
bulange 2
bumenyi 2
bunene 2
bunjakko 2
bunkenke 2
busia 2
busiraamu 2
butabanguko 2
butaweera 2
butenga 2
butereevu 2
butoolo 2
buvanjuba 2
buwama 2
buwanguzi 2
buwemba 2
buwereza 2
buwi 2
buyondo 2
bwakkondo 2
bwangu 2
bwategeezeza 2
bwategeezezza 2
bwebabadde 2
bwebagenda 2
bwekiri 2
bwo 2
bwonna 2
byaffe 2
byalo 2
caf 2
carol 2
catholic 2
central 2
chairman 2
championships 2
chancellor 2
chesang 2
churches 2
conference 2
covid 2
crude 2
daniella 2
division 2
dominic 2
doreen 2
dubai 2
east 2
ebbaluwa 2
ebbugumu 2
ebigere 2
ebijambiya 2
ebikolobero 2
ebikwekweto 2
ebimalako 2
ebirara 2
ebirime 2
ebisaanyizo 2
ebisongovu 2
ebitiibwa 2
ebitongole 2
ebivuga 2
ebiyigiriza 2
ebiyingira 2
ebizibu 2
ebizimba 2
ebyali 2
ebyamaanyi 2
ebyemizannyo 2
ebyentambula 2
ebyetaago 2
ebyobufuzi 2
ebyokulya 2
ebyuma 2
eddembe 2
eddy 2
education 2
egifuna 2
ejjinja 2
eka 2
ekalambidde 2
ekibuga 2
ekifaananyi 2
ekigatta 2
ekikolebwa 2
ekikulu 2
ekimama 2
ekinene 2
ekinnansi 2
ekirala 2
ekisangibwa 2
ekisinga 2
ekisooka 2
ekisulo 2
ekisumuluzo 2
ekiviiriddeko 2
ekivvulu 2
ekkomera 2
ekkubo 2
eklesia 2
ekolebwa 2
ekyalo 2
ekyeya 2
ekyobulagajjavu 2
emboga 2
embuzi 2
emibiri 2
emikolo 2
emikwano 2
emirundi 2
emisinde 2
emitendera 2
emiyembe 2
endagaano 2
endiima 2
endiirwa 2
endongo 2
enganda 2
engatto 2
enjiri 2
enjogera 2
enkadde 2
enkyukakyuka 2
ennaanansi 2
ennimiro 2
enos 2
ensawo 2
ensobi 2
ensomesa 2
ensukkulumu 2
entalo 2
entekateeka 2
enva 2
enzigi 2
eppya 2
epya 2
eriiso 2
eryanyi 2
eryo 2
esatu 2
esenda 2
esoba 2
essaala 2
essaawa 2
etteeka 2
ettunke 2
evunaana 2
evvanyuma 2
ewa 2
ewalala 2
eyafiiriddwa 2
eyagala 2
eyajjula 2
eyakazibwako 2
eyateekebwawo 2
eyawangudde 2
ezimu 2
ezirina 2
famile 2
faridah 2
fatuma 2
fayinolo 2
fayiro 2
ffaamu 2
fort 2
gatonnya 2
geoffrey 2
ggaba 2
ggeeti 2
gibadde 2
gino 2
giweze 2
glad 2
go 2
gubeera 2
guddemu 2
gugenda 2
guli 2
gumu 2
gumusaze 2
gusuubulwa 2
gutandika 2
hadijah 2
hatuna 2
hellena 2
henry 2
high 2
hilderman 2
hoima 2
igga 2
isaac 2
ivan 2
janet 2
jonah 2
july 2
kabareebe 2
kabenge 2
kabuye 2
kabuyonjo 2
kafumu 2
kagoda 2
kagodo 2
kaiso 2
kakeeka 2
kakodyo 2
kalyango 2
kampeyini 2
kampiringisa 2
kamuli 2
kamya 2
kanisa 2
kanyike 2
kaseera 2
kasooli 2
kasujja 2
kattikiro 2
kauthra 2
kavule 2
kayiira 2
kayondo 2
kaziimba 2
kazimba 2
keita 2
keleziya 2
kerode 2
ki 2
kiba 2
kibeera 2
kibwami 2
kifuba 2
kigagga 2
kigenda 2
kigongo 2
kigundu 2
kika 2
kikontana 2
kikyamu 2
kimala 2
kinene 2
kinyiiza 2
kiragga 2
kiriggwajjo 2
kirina 2
kirombe 2
kirya 2
kisinga 2
kisobozese 2
kitaawe 2
kitalo 2
kitegeeza 2
kitegombwa 2
kiteredde 2
kitono 2
kitto 2
kiwenda 2
kiyamba 2
kizimbe 2
kkampeyini 2
kkansala 2
kkiromita 2
kkono 2
kkooki 2
kkubo 2
komando 2
kontulakita 2
kubunyisa 2
kuggalwa 2
kujja 2
kukosa 2
kulagajjalira 2
kulagibwa 2
kulambula 2
kulembera 2
kulisto 2
kunoonyereza 2
kusigala 2
kusomesa 2
kusomoozebwa 2
kusooka 2
kutataaganya 2
kutoola 2
kutumbula 2
kutuuse 2
kutya 2
kuvuganya 2
kuwa 2
kuyamba 2
kuzikizza 2
kwabaddeko 2
kwabwe 2
kwali 2
kwatandise 2
kwegayirira 2
kwekusalawo 2
kwogera 2
kyaffe 2
kyakulagira 2
kyazze 2
kyekumbya 2
kyobe 2
langi 2
lawundi 2
limited 2
liri 2
lt 2
lubuto 2
lugesera 2
lukka 2
lukubirizibwa 2
lungujja 2
lusiisira 2
luwero 2
lwamukaaga 2
lwengo 2
lwera 2
lwokuna 2
maj 2
makubo 2
management 2
margaret 2
marion 2
mary 2
masabo 2
masejjere 2
masinzizo 2
matu 2
maya 2
mayiga 2
mazinga 2
mazzi 2
mbuga 2
mbuto 2
medical 2
mikono 2
min 2
mingi 2
ministries 2
mitambo 2
miwendo 2
mizigo 2
mmita 2
mpererwe 2
mpolampola 2
mpooya 2
mpya 2
mubaddemu 2
muggwanga 2
muhindo 2
mukaaku 2
mukkiriza 2
mukyala 2
mulambo 2
mulindwa 2
muluka 2
munnabwe 2
munnansi 2
munne 2
munteekateeka 2
munteeseganya 2
mupiira 2
musenero 2
musiitwa 2
musinguzi 2
mutundwe 2
muwandiike 2
muwanguzi 2
muwogo 2
muyige 2
muzza 2
muzzukulu 2
mw 2
mwane 2
mwanje 2
mwesigye 2
nabakooba 2
nabbanja 2
nabitaka 2
nabyewanga 2
nagginda 2
najjuka 2
najura 2
nakakande 2
nakalega 2
nakanwagi 2
nakasero 2
nakatumba 2
nakimati 2
nampiima 2
namugongo 2
namukadde 2
namusera 2
nansana 2
nanyonjo 2
nassaka 2
nathan 2
national 2
nayiga 2
ndi 2
nerima 2
ngabeera 2
ngabi 2
ngenda 2
nguudo 2
nindye 2
nkozi 2
nkuggwa 2
nnamukadde 2
nnamungi 2
nnankulu 2
nnimiro 2
nnyabwe 2
nsaba 2
nsomesa 2
ntalo 2
ntikko 2
ntinda 2
nup 2
nzimba 2
obubaka 2
obubenje 2
obubonero 2
obufuzi 2
obuganda 2
obukambwe 2
obumala 2
obumu 2
obungi 2
obunnabbi 2
obusumba 2
obutoffaali 2
obutungulu 2
obuvune 2
obuwuka 2
obuwumbi 2
obuyinza 2
obuyonjo 2
obwaviirako 2
obwenkanya 2
obwennyamivu 2
obweyamo 2
ogubadde 2
ogumuvunaanibwa 2
ogusooka 2
ogwang 2
ogwokubiri 2
oil 2
okola 2
okoti 2
okubaako 2
okubaawo 2
okubakambuwalira 2
okubangulwa 2
okubasabira 2
okubawa 2
okubawagira 2
okubazimbira 2
okubeerawo 2
okubuulira 2
okufuba 2
okufunayo 2
okugaddaabiriza 2
okugezaako 2
okuggulawo 2
okuggyamu 2
okugoberera 2
okugulira 2
okuguwa 2
okuguza 2
okujjanjaba 2
okukakkanamu 2
okukolagana 2
okukozesebwa 2
okukula 2
okukwata 2
okukwatagana 2
okulabikako 2
okulabirako 2
okulabirira 2
okuliisa 2
okulokola 2
okulowooza 2
okulwanyisa 2
okumubbako 2
okumweyimirira 2
okunaava 2
okunyakula 2
okunyolwa 2
okunyweza 2
okupunta 2
okusalawo 2
okusangibwa 2
okusiba 2
okusinga 2
okusinza 2
okusisinkana 2
okusobozesa 2
okussa 2
okutaasa 2
okutambula 2
okutambuza 2
okuteekawo 2
okutekawo 2
okutendekebwa 2
okutereeza 2
okutikkira 2
okutontoma 2
okutoola 2
okutuukiriza 2
okuvaako 2
okuviira 2
okuvuga 2
okuwandiika 2
okuwerennemba 2
okuyamba 2
okuzaalibwa 2
okuzina 2
okuziyiza 2
okuzuula 2
okwabadde 2
okwebeezaawo 2
okwegobako 2
okwekenneenyezebwa 2
okwemanyiiza 2
okwemulugunya 2
okwesibako 2
okwetegekera 2
okwewaayo 2
okweyanjula 2
okweyongera 2
olivia 2
olumu 2
olusuku 2
oluusi 2
olweggulo 2
omubisi 2
omubuuliizi 2
omudaali 2
omuddo 2
omujaasi 2
omukadde 2
omukubiriza 2
omukungu 2
omulala 2
omulambo 2
omulangira 2
omulenzi 2
omuliro 2
omuluka 2
omumaka 2
omunda 2
omungalo 2
omupiira 2
omuti 2
omutuukirivu 2
omuwawaabirwa 2
omuwendo 2
omuzadde 2
omuze 2
omuzindaalo 2
omwabadde 2
omwaziinyi 2
omwegattira 2
onyango 2
osobole 2
otucet 2
otunule 2
oweekitiibwa 2
oyagala 2
paalamenti 2
party 2
patra 2
patricia 2
paul 2
penati 2
pipeline 2
portal 2
prossy 2
robina 2
ronald 2
rosette 2
royal 2
saints 2
sauda 2
sentebe 2
sfc 2
shafik 2
siipika 2
siiringi 2
siniya 2
siriimu 2
sisita 2
siteegi 2
south 2
ssegirinya 2
ssekitoleko 2
ssemakookiro 2
ssengendo 2
ssentamu 2
ssentongo 2
sseruli 2
ssimu 2
ssonko 2
ssuuna 2
sukaali 2
sylivia 2
taata 2
tajja 2
tanzania 2
tawuni 2
team 2
tebagenda 2
tebagya 2
tebayinza 2
tebeeramu 2
tetukkirizibwa 2
theatre 2
tolya 2
top 2
ttama 2
tubadde 2
tuli 2
twagala 2
twaha 2
twesigye 2
uae 2
ug 2
umeme 2
union 2
universe 2
veronica 2
viola 2
wabaddewo 2
waffe 2
wagenda 2
waggulu 2
wakiso 2
wamala 2
west 2
wilberforce 2
world 2
yaabadde 2
yaagwo 2
yaakava 2
yabategeezezza 2
yabatizibwa 2
yabyogeredde 2
yagasseeko 2
yagenda 2
yagenze 2
yakakasiddwa 2
yakoze 2
yakubwa 2
yalondeddwa 2
yamalidde 2
yamenya 2
yawe 2
yayise 2
yayita 2
yaze 2
yaziddukidde 2
yazisasula 2
yebazizza 2
yeekukumye 2
yeemu 2
yeesunga 2
yeeyama 2
yoludaani 2
yozefu 2
zaabuliwo 2
zalwango 2
zibeera 2
zigobeddwa 2
ziri 2
zisukka 2
zombi 2
