mu 133
ne 59
ku 39
no 36
nga 34
na 33
abaana 30
era 26
ggombolola 23
ebyobugagga 22
ensimbi 21
emboozi 20
abantu 19
ya 19
yaffe 19
abatuuze 18
nnyo 18
wankuyege 18
alipoota 16
emirimu 16
bo 15
mwami 15
wanseenene 15
emirembe 14
okuwandiika 14
oluvannyuma 14
oluyimba 14
omutwe 14
amateeka 13
eddembe 13
ensonga 13
kyalo 13
lya 13
bwe 12
okukuuma 12
ssentebe 12
wamu 12
wa 11
ebiri 10
kino 10
mulimu 10
naye 10
wuliriza 10
bya 9
e 9
ebintu 9
ekikwate 9
enkozesa 9
ki 9
text 9
bintu 8
egireeta 8
ekibuuzo 8
ekyalo 8
enjawulo 8
koomunaku 8
luno 8
ombuulire 8
ssente 8
ye 8
ate 7
basaanye 7
bulungi 7
mwe 7
obudde 7
obwegendereza 7
of 7
okukuba 7
olowooza 7
tulina 7
yali 7
amatoffaali 6
amazzi 6
bantu 6
ddala 6
eggombolola 6
egya 6
emmere 6
ennyonnyola 6
eziri 6
kyaffe 6
mirembe 6
musiitwa 6
okubeera 6
okugula 6
okuyita 6
abalina 5
ba 5
bannaffe 5
bbiri 5
biwandiikibwa 5
buli 5
ebya 5
ekikapu 5
ekirambika 5
engeri 5
eno 5
ensobi 5
funa 5
ga 5
gye 5
mboozi 5
mulina 5
obukulu 5
okugolola 5
okukozesa 5
okutereka 5
olupapula 5
omwami 5
organizer 5
otereeza 5
thematic 5
ttabi 5
type 5
abalala 4
baali 4
bufunze 4
bye 4
ebirala 4
ekinyusi 4
ekirimu 4
ekya 4
emu 4
eri 4
ewagira 4
gwe 4
kasooli 4
kuuma 4
kye 4
lwaki 4
mwalimu 4
nnyaffe 4
nti 4
obubonero 4
obujjanjabi 4
obulemu 4
okusoma 4
okusomesa 4
okuva 4
olukiiko 4
omulungi 4
omuntu 4
sample 4
ssinga 4
ssomero 4
taata 4
tetulwana 4
tetuyomba 4
uganda 4
waliwo 4
wanduli 4
wange 4
yakola 4
yange 4
abakola 3
abali 3
abalimi 3
akambe 3
akola 3
akolera 3
ayi 3
bakola 3
bannaddiini 3
bano 3
bingi 3
bulamu 3
bwalyo 3
ddwaliro 3
ebikolebwa 3
ebyalo 3
ebyensula 3
ebyetaagisa 3
eddoboozi 3
ekifaananyi 3
ekifo 3
ekitundu 3
ekkalaamu 3
ekyaddirira 3
emmotoka 3
enfundikira 3
engoye 3
enku 3
ennyanjula 3
ennyumba 3
entebe 3
enzizi 3
eya 3
kibiina 3
kiki 3
kiswa 3
kitundu 3
kituufu 3
kya 3
lugero 3
lumu 3
lwali 3
mirimu 3
mpandiise 3
mukyala 3
mulamwa 3
nalule 3
ndaze 3
nkola 3
nkozesezza 3
obugaali 3
obugagga 3
obulamu 3
obulungi 3
ogende 3
okukola 3
okukozesaamu 3
okulima 3
okuweebwa 3
okuzannya 3
okwefumiitiriza 3
olina 3
olugero 3
olwa 3
omuli 3
omulimu 3
omusajja 3
omwana 3
tufune 3
tuteeke 3
wakamyu 3
we 3
yagula 3
aba 2
abaakakiiko 2
abaali 2
abaalina 2
abasawo 2
abaserikale 2
abasomesa 2
abavuzi 2
abawala 2
abayamba 2
abazadde 2
agaggawadde 2
agenda 2
aguze 2
akazannyo 2
amaanyi 2
anti 2
atereka 2
aterese 2
awaka 2
awamu 2
aweeredde 2
ayoza 2
baakoleranga 2
baatandika 2
bakuuma 2
balima 2
bamakanika 2
bangi 2
be 2
biggwaawo 2
bombi 2
bonna 2
bwa 2
ddembe 2
dduuka 2
ebibira 2
ebiwera 2
ebyagi 2
ebyo 2
ekiddibwamu 2
ekisambu 2
ekiseera 2
ekyeya 2
emiruka 2
emiti 2
empalana 2
emyaka 2
emyoyo 2
endofterm 2
enjala 2
enkuba 2
enkulaakulana 2
ennaku 2
ennungi 2
ennyiriri 2
ensaalwa 2
enzigi 2
eriko 2
esangibwa 2
ettaka 2
ewa 2
ffe 2
gano 2
gu 2
gyabwe 2
kanene 2
kassanda 2
kati 2
katonda 2
kikapu 2
kintu 2
kisangibwa 2
kitono 2
kukola 2
kutwala 2
kyaleetera 2
loole 2
lukiiko 2
lwa 2
lyaffe 2
magala 2
maka 2
minilesson 2
mpadde 2
mugagga 2
mukwano 2
mulungi 2
munene 2
muntu 2
musanyufu 2
musasule 2
naddala 2
ngeri 2
njogeddeko 2
nnimiro 2
nnyingi 2
nsi 2
obufundikira 2
obumala 2
ogu 2
okola 2
okubuulirira 2
okudduka 2
okukekkereza 2
okukima 2
okukolera 2
okusaka 2
okutta 2
okuwabula 2
okwawula 2
okwoza 2
olufumo 2
olunyiriri 2
omuggya 2
omuyembe 2
oo 2
oyagala 2
puliisi 2
ssatu 2
tekasala 2
term 2
tetubba 2
tetutta 2
tool 2
tukole 2
waabwe 2
yadde 2
yafuna 2
yatereka 2
zino 2
zonna 2
