mu 490
ku 321
n 263
nga 246
nti 211
ne 157
e 110
ng 108
y 99
era 90
wa 80
ssente 69
ya 60
abantu 58
bwe 56
eno 56
w 55
uganda 52
ye 48
kya 41
gye 36
kyokka 36
yagambye 36
z 36
we 35
buli 34
bw 34
okuva 33
2022 31
agamba 31
ttiimu 31
lw 30
by 28
gavumenti 27
gy 27
akulira 26
gw 26
aba 25
ate 25
bantu 25
ey 25
guno 25
oluvannyuma 25
za 25
zino 25
kino 24
kubanga 24
ky 24
yategeezezza 24
bwa 23
eby 23
lwa 23
ono 23
gwe 22
nnyo 22
obukadde 22
eya 21
kuba 21
okukola 21
owa 21
poliisi 21
pulezidenti 21
ze 21
abakulembeze 20
banka 20
olw 20
bino 19
gwa 19
kati 19
kkampuni 19
kkooti 19
of 19
1 18
disitulikiti 18
ez 18
b 17
eggwanga 17
ly 17
okulaba 17
okuli 17
abatuuze 16
akatale 16
asaba 16
bagenda 16
dr 16
emyaka 16
ensonga 16
lino 16
okufuna 16
omu 16
ow 16
3 15
30 15
ba 15
bano 15
byonna 15
enkola 15
minisita 15
olwo 15
ssentebe 15
wabula 15
wamu 15
yonna 15
4 14
abadde 14
be 14
bonna 14
ekibiina 14
ekya 14
july 14
kampala 14
mtn 14
nakawa 14
naye 14
nrm 14
omuzannyi 14
pdm 14
abaana 13
akakiiko 13
balina 13
bya 13
enteekateeka 13
june 13
kasasiro 13
kcca 13
kwe 13
liizi 13
mulinge 13
sacco 13
wano 13
00 12
000 12
10 12
2 12
abalala 12
africa 12
ali 12
alina 12
arsenal 12
bulungi 12
ekitongole 12
enjawulo 12
ensi 12
ga 12
kano 12
manu 12
nabo 12
nkola 12
obuvunaanyizibwa 12
okuba 12
omwaka 12
sudhir 12
waliwo 12
wiiki 12
yali 12
5 11
ab 11
abayizi 11
asabye 11
ategeeza 11
cape 11
club 11
ebibiina 11
emirimu 11
emyooga 11
enkulu 11
eri 11
ggwanga 11
gya 11
ka 11
kawempe 11
kw 11
lya 11
museveni 11
ogwang 11
omuli 11
omwana 11
rotary 11
verde 11
wakati 11
yabadde 11
abakadde 10
abamu 10
abasuubuzi 10
agambye 10
amawanga 10
amazzi 10
babadde 10
eddagala 10
emmotoka 10
k 10
kitundu 10
kye 10
model 10
myaka 10
national 10
nteekateeka 10
oba 10
okwongera 10
omubaka 10
parish 10
yaabwe 10
aanya 9
august 9
bannayuganda 9
basobole 9
bye 9
cup 9
ddala 9
development 9
ebadde 9
ebikwata 9
endala 9
ennimi 9
ensimbi 9
kuno 9
leero 9
maaso 9
mali 9
mmotoka 9
moses 9
ndagaano 9
okulonda 9
okutereka 9
omukolo 9
omumyuka 9
university 9
walakira 9
zonna 9
8 8
ababaka 8
agenda 8
amaanyi 8
ategeezezza 8
bwabwe 8
crane 8
dee 8
ebifo 8
eddembe 8
emidaala 8
erina 8
eyabadde 8
kibinja 8
kifo 8
kushaba 8
ngeri 8
obwannannyini 8
okubeera 8
omuntu 8
sizoni 8
ssomero 8
town 8
ubos 8
abapangisa 7
abasomesa 7
abayimbi 7
ajax 7
alabudde 7
amaduuka 7
baabadde 7
bagamba 7
bannannyini 7
cranes 7
east 7
egy 7
empaka 7
emu 7
ennansi 7
eyagala 7
eyali 7
kabaka 7
kaggo 7
katale 7
katikkiro 7
kibira 7
kiseera 7
luno 7
majwega 7
mk 7
mmisa 7
mukolo 7
muntu 7
nigeria 7
obugagga 7
obulungi 7
obuntu 7
obuzibu 7
okutumbula 7
omulimu 7
omupiira 7
omusango 7
ragga 7
seminario 7
yasooka 7
15 6
200 6
25 6
6 6
ababadde 6
abagenda 6
abakozi 6
abakyala 6
abali 6
abasawo 6
abazannyi 6
afrika 6
america 6
amuria 6
ayagala 6
baagala 6
babalanda 6
bakama 6
bali 6
bank 6
basobola 6
bifo 6
bulamu 6
bungereza 6
byalo 6
charles 6
city 6
council 6
data 6
ebitabo 6
ebitundu 6
ebyo 6
ekikopo 6
ekintu 6
ekiragiro 6
eky 6
embeera 6
emijoozi 6
emmanuel 6
engeri 6
essomero 6
ewedde 6
gayaza 6
ggoolo 6
kasangati 6
kibuga 6
kukola 6
kusoma 6
kwa 6
layisinsi 6
lipooti 6
lwaki 6
lwe 6
munisipaali 6
mwe 6
nabbanja 6
nankinga 6
ncs 6
nnamba 6
ofiisi 6
ogw 6
ogwa 6
oku 6
okutuuka 6
okutwala 6
okuwandiisa 6
olunaku 6
olutalo 6
omulamuzi 6
palamenti 6
paul 6
ronaldo 6
school 6
st 6
ura 6
yabuuzizza 6
yasabye 6
yenna 6
yo 6
zaabwe 6
13 5
16 5
2021 5
9 5
abakulira 5
abaseminario 5
african 5
amagoba 5
amazaalibwa 5
arua 5
awamu 5
bafuna 5
bangi 5
bannalotale 5
barcelona 5
bbanka 5
bizinensi 5
bukedde 5
buno 5
bwannannyini 5
chelsea 5
dda 5
ddwaliro 5
dembele 5
densite 5
ebintu 5
ebyalo 5
ebyempuliziganya 5
ekigendererwa 5
ekyo 5
embereberye 5
emisinde 5
emizannyo 5
endagaano 5
erya 5
essimu 5
essira 5
eyasooka 5
february 5
hilderman 5
john 5
kabuye 5
kenya 5
kisaawe 5
kisaka 5
kiwanuka 5
kkono 5
kuliko 5
kuyamba 5
kyofatogabye 5
l 5
mawanga 5
meeya 5
midaala 5
mpaka 5
mulago 5
mwaka 5
na 5
nketiah 5
obubonero 5
obuduuka 5
obuwumbi 5
obuyambi 5
okukung 5
okumala 5
okusoma 5
okusunsulamu 5
okuvuganya 5
okuwangula 5
okuzimba 5
okwewandiisa 5
okwogera 5
olukiiko 5
olwa 5
omukisa 5
omukono 5
omukwano 5
omulambo 5
omutendesi 5
omwepiskoopi 5
patrick 5
richarlison 5
salah 5
she 5
singa 5
spurs 5
ssaawa 5
ssande 5
ssatu 5
sudan 5
tebalina 5
vanhelleputte 5
wakiso 5
wiini 5
world 5
yalabudde 5
2023 4
28 4
99 4
abakristu 4
abakulu 4
abalina 4
abasuula 4
abavubuka 4
abazadde 4
abeera 4
agende 4
ak 4
akabenje 4
akawunti 4
akolera 4
allan 4
amateeka 4
amayonjo 4
amerika 4
andwala 4
arthur 4
asiimye 4
authority 4
ayogera 4
baabwe 4
bakola 4
balikuddembe 4
bannakampala 4
bannamawulire 4
banne 4
basalirwa 4
batereka 4
bbanga 4
bboodi 4
begisa 4
bodaboda 4
bulungibwansi 4
byayo 4
byokka 4
commonwealth 4
ddyo 4
diguli 4
dorothy 4
ebeera 4
ebimu 4
ebiri 4
ebyenjigiriza 4
ebyensimbi 4
ebyobulamu 4
ebyokulonda 4
ejja 4
ekiro 4
ekiseera 4
ekkanisa 4
emabega 4
embalirira 4
empya 4
emyezi 4
enkambi 4
enkya 4
ennaku 4
ennyo 4
esangibwa 4
fiba 4
francis 4
g 4
gano 4
ggaba 4
ggombe 4
gino 4
gumu 4
gwabadde 4
hag 4
ibrahim 4
isaac 4
ivan 4
kakiiko 4
kaluma 4
kasaija 4
katonda 4
kaweefube 4
kayongo 4
kitebe 4
kitongole 4
kooki 4
kubeera 4
kugenda 4
kukoma 4
kwongera 4
kyabwe 4
languages 4
liverpool 4
luguudo 4
lwokuna 4
lyantonde 4
maama 4
masomero 4
mayiga 4
mbire 4
mizannyo 4
mmeeya 4
mmengo 4
morocco 4
mubaka 4
mukenenya 4
mukono 4
mukwano 4
mulundi 4
musipi 4
nakibirige 4
nannyini 4
nasser 4
nsonga 4
ntikko 4
ntono 4
obumanyirivu 4
obuweereza 4
obw 4
obwa 4
oilers 4
okudda 4
okugula 4
okukakasa 4
okukomya 4
okukozesa 4
okukuza 4
okulaga 4
okunoonya 4
okusaba 4
okusomesa 4
okutuusa 4
okuwa 4
okuyita 4
okwegatta 4
okwenyigira 4
okwetaba 4
omukulu 4
omusaala 4
omuzibizi 4
onyango 4
polof 4
rdc 4
richard 4
rogers 4
senegal 4
september 4
si 4
silverbacks 4
ssloa 4
ten 4
title 4
tulina 4
usa 4
wansi 4
yaffe 4
yaggwaako 4
100 3
12 3
1999 3
2016 3
31 3
40 3
50 3
94 3
a 3
abaali 3
abaami 3
abajulizi 3
abakungu 3
abasinga 3
abategesi 3
afirika 3
agenze 3
agnes 3
ajja 3
aka 3
akakadde 3
akola 3
akoze 3
akunze 3
alese 3
amalala 3
amannya 3
amasomero 3
amaze 3
anaaba 3
andrew 3
atwala 3
awulira 3
baali 3
baana 3
baggulawo 3
bakolera 3
bakulembeddwamu 3
balabula 3
balimwezo 3
balogun 3
bammemba 3
basketball 3
basoma 3
basomeseddwa 3
bataka 3
bazze 3
bbiri 3
bigere 3
bikopo 3
bitundu 3
boston 3
budde 3
bukadde 3
bukya 3
bulijjo 3
bungi 3
bwavu 3
bwebalina 3
church 3
dag 3
ddembe 3
drug 3
ebbanga 3
ebibuuzo 3
ebidduka 3
ebikolwa 3
ebikopo 3
ebikozesebwa 3
ebimukwatako 3
ebitongole 3
ebizibu 3
ebizimbe 3
ebweru 3
edduuka 3
eddwaliro 3
egamba 3
egenda 3
eggulo 3
ekigatta 3
ekika 3
ekikomera 3
ekisooka 3
emiriraano 3
ennyumba 3
ensiike 3
eric 3
esatu 3
essaza 3
ettabi 3
euro 3
eyaru 3
eza 3
ezimu 3
faaza 3
godfrey 3
group 3
gwetabiddwaako 3
herbert 3
human 3
ipswich 3
james 3
jonathan 3
kabali 3
kalina 3
kibiina 3
kigali 3
kimu 3
kitaabwe 3
kitegeeza 3
kkanisa 3
kufuna 3
kukkiriza 3
kusomesa 3
kutendekebwa 3
kutereka 3
kutumbula 3
lang 3
league 3
lubaga 3
lukiiko 3
lutalo 3
luwalira 3
luweero 3
luyinda 3
lwamukaaga 3
lwokubiri 3
lwokusatu 3
maka 3
manyangwa 3
martinez 3
masaka 3
mateeka 3
mbeera 3
misinde 3
mpanga 3
mpya 3
mugambe 3
muganda 3
mukyala 3
mulimu 3
muluka 3
mutendera 3
myala 3
nabulagala 3
naddala 3
naigaga 3
nalumenya 3
namujju 3
nayo 3
nguudo 3
njagala 3
nnannyini 3
nsimbi 3
obukakafu 3
obulala 3
obulamu 3
obutabo 3
odoi 3
oguddako 3
ogujja 3
ogwel 3
okufuba 3
okuganyulwa 3
okugenda 3
okuggwa 3
okukkiriza 3
okukulaakulanya 3
okukulira 3
okulabirako 3
okumalawo 3
okumaliriza 3
okumanya 3
okusasula 3
okusooka 3
okutandika 3
okutegeka 3
okutulugunya 3
okuwagira 3
okuwandiika 3
okuyiga 3
okuzannya 3
okwagala 3
omubalirizi 3
omubeezi 3
omugenzi 3
omulamwa 3
omulimo 3
omusolo 3
omuzungu 3
osasula 3
otim 3
paawundi 3
primary 3
publishers 3
restaurant 3
rev 3
rights 3
samuel 3
sebatta 3
soroti 3
ssaako 3
ssabasajja 3
ssemakula 3
ssempa 3
sso 3
suzan 3
sylvia 3
talina 3
tanga 3
tewali 3
tick 3
uace 3
uce 3
uneb 3
upe 3
waabwe 3
waayo 3
wadde 3
waggulu 3
wainright 3
wala 3
walter 3
william 3
yabyogeredde 3
yafunye 3
yagasseeko 3
yavudde 3
yezu 3
zambia 3
zigenda 3
zimu 3
11 2
115 2
135 2
14 2
140 2
143 2
17 2
1879 2
1994 2
20-00 2
2007 2
2017 2
2019 2
2020/2021 2
26 2
34 2
500 2
53 2
64 2
7 2
79-70 2
abaabadde 2
abaasomerako 2
abaffamire 2
abakola 2
abalamuzi 2
abalowooza 2
abaminsane 2
abaserikale 2
abatalina 2
abatuufu 2
abawagizi 2
abawuzi 2
abayise 2
abazannyira 2
abeesowoddeyo 2
abo 2
abyogeredde 2
academy 2
adda 2
adnan 2
afiiridde 2
afudde 2
afunye 2
agaana 2
agamu 2
aisha 2
akagenda 2
akalulu 2
akawuka 2
akkiriza 2
akozesa 2
akubiriza 2
akwasa 2
alaga 2
all 2
alondeddwa 2
alyoke 2
amagombolola 2
amaka 2
amanyiddwa 2
amawulire 2
amya 2
ana 2
anaatandika 2
and 2
angola 2
anyumyamu 2
aquirinus 2
arena 2
arteta 2
asanga 2
asanze 2
asatu 2
asikidde 2
asinze 2
asinzidde 2
asooka 2
asooke 2
asoose 2
asuman 2
atandike 2
atandise 2
atongoza 2
ava 2
avaayo 2
awa 2
awaka 2
aweerezza 2
aweze 2
awo 2
ayingidde 2
ayogedde 2
ayongera 2
azannyirako 2
baafuna 2
baagenze 2
baaguze 2
baakubiddwa 2
baalyo 2
baamukwatidde 2
baasinzidde 2
baasobyako 2
baatandise 2
baategese 2
babeera 2
babeere 2
bachelor 2
baddamu 2
bagaana 2
bahati 2
bajja 2
bajjukira 2
bajulizi 2
bak 2
bakakase 2
bakansala 2
bakojja 2
balaba 2
balitema 2
bamaanyi 2
bamanyi 2
bamaze 2
bamubuuza 2
bamusaayimuto 2
bange 2
bannaabwe 2
bannakibiina 2
bannamawuliire 2
banoonya 2
bapulo 2
basaana 2
basaanye 2
basabye 2
basisinkanye 2
basitudde 2
basobodde 2
basonze 2
bassita 2
basula 2
batendekebwa 2
batendekeddwa 2
battunka 2
batuuka 2
bavubuka 2
bavunaanibwe 2
bay 2
bayern 2
bayita 2
bayizi 2
bbanja 2
bbebi 2
bbosa 2
beegasse 2
beekolamu 2
beetabye 2
beetegefu 2
beetegekera 2
beeyambisa 2
bemulugunyizza 2
bifa 2
bikolebweko 2
bikolwa 2
bingi 2
birina 2
biseera 2
biyumba 2
bo 2
bombers 2
bongere 2
bosco 2
boxing 2
buganda 2
bugembe 2
bugenda 2
bulwadde 2
butereevu 2
buwumbi 2
buzito 2
bweru 2
bweyali 2
bwonna 2
byabwe 2
byempuliziganya 2
byuma 2
c/u 2
cameroon 2
central 2
champions 2
clerk 2
committee 2
community 2
creighton 2
crested 2
cultural 2
dan 2
daniel 2
dayirekita 2
ddandira 2
ddiiru 2
ddoyi 2
divizoni 2
ebawa 2
ebbugumu 2
ebbula 2
ebigambo 2
ebigezo 2
ebikwekweto 2
ebikyalemeddwa 2
ebirala 2
ebirime 2
ebisago 2
ebisanyiizo 2
ebisolo 2
ebiwandiiko 2
ebiyambako 2
ebyafaayo 2
ebyali 2
ebyobufuzi 2
ebyobugagga 2
ecweru 2
eddakiika 2
eddie 2
eddoboozi 2
efuna 2
egambye 2
eggulawo 2
eggwanika 2
egikkiriza 2
ekansizza 2
ekifaananyi 2
ekijjukizo 2
ekikulu 2
ekirayiro 2
ekiri 2
ekitanda 2
ekitundu 2
ekyafulumiziddwa 2
ekyalo 2
ekyokubiri 2
emisomo 2
emiti 2
emitwalo 2
emmy 2
ena 2
endwadde 2
enfunda 2
enfuufu 2
enguudo 2
enguumi 2
enguzi 2
enjaulo 2
ennyimba 2
enoonya 2
ensaasaanya 2
entandikwa 2
enzaalwa 2
erisangibwa 2
erisooka 2
ery 2
eryakwatibwa 2
essuubi 2
ettaka 2
ettemu 2
etutte 2
ewadde 2
eweta 2
eyafudde 2
eyakolebwa 2
eyakuliddemu 2
eyavudde 2
eyingidde 2
eyo 2
eyogerwako 2
ezijja 2
ezikulembera 2
ezimala 2
eziri 2
ezirina 2
ezo 2
ezze 2
fa 2
farouk 2
fayiro 2
fc 2
first-class 2
folarin 2
fort 2
forum 2
fred 2
gab 2
gali 2
ge 2
general 2
ggwanika 2
giyambye 2
gubadde 2
gulu 2
gwetabiddwako 2
gyali 2
gyonna 2
henry 2
high 2
honours 2
hospital 2
india 2
international 2
irene 2
is 2
ishmail 2
isingiro 2
japan 2
jjajja 2
jude 2
kaamulali 2
kalenda 2
kalungu 2
kamuswaga 2
kanaabe 2
kanso 2
kapeeka 2
kasasa 2
kasawuli 2
kasese 2
katono 2
keediimo 2
keesi 2
kenneth 2
kiba 2
kibeera 2
kibuuka 2
kibuye 2
kiddiridde 2
kigenda 2
kigongo 2
kika 2
kikwekweto 2
kiraabu 2
kiro 2
kirungi 2
kisenge 2
kiteezi 2
kitunzi 2
kiviraako 2
kiwandiiko 2
kiyamba 2
kiyumba 2
kizza 2
kkeesi 2
klezia 2
komagum 2
kuddamu 2
kukung 2
kukwata 2
kulaba 2
kuloopa 2
kumukeeka 2
kunoonyereza 2
kusasula 2
kuvuganya 2
kuwandiisa 2
kwewandiisa 2
kwewola 2
kyalo 2
kyengera 2
kyonna 2
laawundi 2
leon 2
lihanda 2
limu 2
livinhac 2
lokonga 2
lubiri 2
ludda 2
lugendo 2
lukaya 2
lukwe 2
lukyamuzi 2
lulwana 2
lunaku 2
luyima 2
luzira 2
luzzi 2
lwakataka 2
lwakutaano 2
lwamaggwa 2
lye 2
maganjo 2
makya 2
manyangwa-nakwero 2
mary 2
may 2
mayanja 2
mayumba 2
mazima 2
mbura 2
medical 2
mengo 2
mikolo 2
mikwano 2
miruka 2
mitambo 2
mitendera 2
mityana 2
motoka 2
mtn-uganda 2
mubangizi 2
mukago 2
mukalazi 2
mukisa 2
mukulu 2
mukwanaganya 2
mumativu 2
munnakenya 2
munsennyooli 2
mupiira 2
musaala 2
musango 2
musoke 2
musolo 2
mutindo 2
muwonge 2
muyinda 2
muzannyi 2
mw 2
mwala 2
mwannyina 2
mwase 2
mwoyo 2
nabaggala 2
nabisere 2
naffe 2
nairobi 2
nakwero 2
namavundu 2
namirembe 2
nampiima 2
nangabo 2
nantege 2
nations 2
ncf 2
nda 2
ndamira 2
ndowooza 2
nfu 2
ngassi 2
nile 2
nina 2
njawulo 2
nju 2
nkajja 2
nkalala 2
nkozi 2
nnankulu 2
nnanyini 2
nnyanja 2
north 2
nsi 2
nsiike 2
nsisinkano 2
nsobi 2
ntebe 2
nyanzi 2
obubi 2
obucaafu 2
obukiiko 2
obukulembeze 2
obulunzi 2
obulwadde 2
obupya 2
obusaserdooti 2
obusomesa 2
obutale 2
obuyinza 2
october 2
oguwedde 2
ojara 2
ojok 2
okello 2
okin 2
okodel 2
okubaako 2
okubasomesa 2
okubawa 2
okubeerawo 2
okuddamu 2
okufa 2
okufuuka 2
okugyoza 2
okujjukira 2
okukansa 2
okukikomya 2
okukolera 2
okukula 2
okukulakulana 2
okulagira 2
okulamaga 2
okulima 2
okulondoola 2
okuloopa 2
okulwanyisa 2
okumuwa 2
okunona 2
okunoonyereza 2
okuntiko 2
okunyweza 2
okusalawo 2
okusanyawo 2
okusiba 2
okusinga 2
okusinziira 2
okussa 2
okutambula 2
okutendeka 2
okutendekebwa 2
okutuwa 2
okutwalibwa 2
okutwalira 2
okutyoboola 2
okuvaayo 2
okuvuga 2
okuwaayo 2
okuwerekera 2
okuwuga 2
okuyiika 2
okuzaala 2
okuzifuna 2
okuzuula 2
okw 2
okwa 2
okwaniriza 2
okwekalakaasa 2
okwekenneenya 2
okwesimbawo 2
okwetandikirawo 2
okwetoloola 2
olaba 2
olubuto 2
oluganda 2
olukusa 2
olutegeka 2
omudaala 2
omuggalo 2
omugoba 2
omukaaga 2
omukululo 2
omukyala 2
omulala 2
omulembe 2
omuliro 2
omulundi 2
omupangisa 2
omusomo 2
omusumba 2
omuteebi 2
omutindo 2
omutuuze 2
omuvubuka 2
omuwala 2
omuze 2
opong 2
ossa 2
owino 2
oxgyen 2
oyo 2
pamiti 2
pawundi 2
paye 2
philippines 2
phoenix 2
portal 2
prado 2
pulojekiti 2
qualifiers 2
rabat 2
raheva 2
rakai 2
raphinha 2
rashidah 2
road 2
robinson 2
roma 2
ronald 2
rwanda 2
rwemisisi 2
s 2
sacramento 2
safaricom 2
saints 2
science 2
sd 2
sentebe 2
sipiika 2
siriimu 2
sisitiimu 2
so 2
south 2
ssaabawandiisi 2
ssejjoba 2
ssekimbi 2
ssemambo 2
ssenyonga 2
ssetumba 2
sss 2
state 2
supply 2
swimming 2
tamanyi 2
tavares 2
tebamanyi 2
tendo 2
teri 2
tesobola 2
teyaddamu 2
teziriiko 2
the 2
tibatemwa 2
tibemanya 2
timothy 2
todwong 2
tororo 2
tourism 2
tubeere 2
tunisia 2
turinawe 2
ukaristia 2
uma 2
umc 2
updf 2
vhts 2
vincent 2
viola 2
wangutusi 2
washing 2
watch 2
watta 2
week 2
welterweight 2
white 2
wiikendi 2
wofiisi 2
women 2
yabbye 2
yadde 2
yakakasizza 2
yakuutidde 2
yakwatiddwa 2
yalagidde 2
yalondeddwa 2
yamuwa 2
yandiba 2
yannyonnyodde 2
yasasula 2
yasiimye 2
yatadde 2
yatandika 2
yava 2
yawadde 2
yawangula 2
yaweeredde 2
yaweereddwa 2
yeebazizza 2
yeetegekera 2
yeyali 2
yokka 2
yunivasite 2
zaake 2
zaakubaawo 2
zaali 2
zeeyongerayo 2
ziraga 2
zooni 2
