mu 943
num 850
bayibuli 392
ne 255
nga 243
nti 240
era 197
e 195
ku 182
abantu 154
na 128
ekya 117
ekyo 111
ebya 109
kya 99
bwe 95
bya 86
nnyo 86
kkumi 85
ebyo 84
ya 83
ebyawandiikibwa 82
yali 81
baali 77
lukumi 76
ebiwandiiko 75
edda 65
emu 64
katonda 59
no 59
naye 58
ebigambo 56
za 56
ba 55
enkyusa 54
nge 52
bye 50
wa 50
omu 49
emizingo 48
emyaka 48
kyali 48
omuzingo 48
ebitabo 47
eyo 47
musanvu 46
kye 45
oba 45
ssatu 44
ebiri 43
ate 42
gye 42
ddala 40
lya 40
ye 40
ayitibwa 39
gwa 39
okuvvuunula 39
aba 38
sipeyini 38
abaali 37
abayudaaya 37
abiri 37
ekiwandiiko 37
okuba 37
bbiri 36
kiseera 36
nineeve 36
oluvannyuma 36
ennyo 35
ttaano 35
asatu 34
nnya 34
awo 33
ekitabo 33
ekyasa 33
kyasa 33
lwa 33
ogwo 33
wadde 33
gya 32
lefèvre 32
bangi 31
buli 31
we 31
bwasuli 30
enjiri 30
eza 30
lwaki 30
lwe 30
yagamba 30
bedell 29
biwandiiko 29
eya 29
lulimi 29
byawandiikibwa 27
kikumi 27
lulattini 27
mukaaga 27
bo 26
gu 26
ekiseera 25
okubiri 25
oluyonaani 25
bulijjo 24
ekkereziya 24
ga 24
kabaka 24
abo 23
ebirala 23
empya 23
kitabo 23
okusoma 23
okutegeera 23
olwebbulaniya 23
abakristaayo 22
munaana 22
nnimi 22
obubaka 22
t 22
abamu 21
bitaano 21
ein 21
endagaano 21
enfu 21
ennyanja 21
ensobi 21
erinnya 21
gedi 21
mwaka 21
bingi 20
bisatu 20
ebitoogo 20
egya 20
eyali 20
kibuga 20
kwe 20
kyokka 20
lwenda 20
mwenda 20
nsi 20
okumpi 20
okuva 20
waaliwo 20
byali 19
ekigambo 19
ezo 19
ngo 19
nsanvu 19
olwa 19
tewali 19
waliwo 19
yokaana 19
engeri 18
enjigiriza 18
ki 18
abalala 17
ana 17
bulungi 17
ebimu 17
kitundu 17
kityo 17
muzingo 17
olulattini 17
wakati 17
ali 16
eno 16
eri 16
gwali 16
isirayiri 16
kirabika 16
myaka 16
obukadde 16
obuli 16
olusuuli 16
yesu 16
baakoppolola 15
bagamba 15
basobola 15
bibiri 15
ebikolwa 15
ebintu 15
embala 15
kirimu 15
kiwandiiko 15
kugamba 15
kyatuukira 15
kyawandiikibwa 15
leero 15
lup 15
omulimu 15
abakoppolozi 14
abaruumi 14
amateeka 14
bannaddiini 14
biraga 14
ebyali 14
gwe 14
ireland 14
lwabwe 14
mangu 14
okumanya 14
singa 14
amawulire 13
baakozesanga 13
bitundu 13
bwa 13
ekibuga 13
ekitundu 13
ezimu 13
eziri 13
kati 13
kifo 13
lukaaga 13
si 13
tutaano 13
agamba 12
amaliba 12
baazuula 12
bavvuunula 12
bitabo 12
bungereza 12
ebikwata 12
ebitaano 12
jerome 12
mingi 12
misiri 12
nkyusa 12
nsonga 12
nsuwa 12
obulungi 12
obunene 12
olulimi 12
olwayirisi 12
omuwandiisi 12
omwaka 12
wamu 12
abaleevi 11
abavvuunuzi 11
ataano 11
baaguzuula 11
butuufu 11
ebisooka 11
ekyavaamu 11
ensi 11
kitegeeza 11
mulembe 11
nnyingi 11
obungi 11
okusaanawo 11
okusobola 11
okuwandiikibwa 11
pawulo 11
tekinologiya 11
wayiseewo 11
yavvuunula 11
yawandiika 11
zabbuli 11
abakugu 10
abasajja 10
ayagala 10
baagala 10
baagamba 10
bina 10
ebbugumu 10
ebyasa 10
egamba 10
ekyokulabirako 10
kirala 10
lusipeyini 10
nkaaga 10
nkumi 10
ogwali 10
okumala 10
okuvvuunulwa 10
okuyamba 10
olwekyo 10
tekisoboka 10
yonna 10
zaabwe 10
ze 10
abeekenneenya 9
agali 9
amangu 9
bategeera 9
buzibu 9
bwali 9
byonna 9
ebyazuulibwa 9
emaze 9
enkadde 9
eyaliwo 9
ka 9
kubanga 9
kyalimu 9
lufalansa 9
lunaana 9
matongo 9
nabwo 9
obwakabaka 9
obwaliwo 9
okukakasa 9
okuwandiika 9
olungereza 9
omukaaga 9
wabula 9
william 9
yakola 9
yayagala 9
zaali 9
abakulembeze 8
amaanyi 8
amalungi 8
amazima 8
awaali 8
baagezaako 8
bantu 8
bikumi 8
bikyaliwo 8
biwangadde 8
boogera 8
date 8
ebitiibwa 8
ebitukuvu 8
ekintu 8
ekyali 8
ekyasooka 8
ennimi 8
ennyiriri 8
ezaali 8
kiba 8
kimu 8
kopi 8
luyonaani 8
lwali 8
makko 8
mugaso 8
obukwata 8
okulaba 8
okusinga 8
okusinziira 8
okuyigiriza 8
okwogera 8
omuwendo 8
versi 8
yakuwa 8
yawona 8
abawandiisi 7
amerika 7
ati 7
avvuunudde 7
baaterekanga 7
bakugu 7
be 7
beeyongera 7
bible 7
bitoogo 7
bonna 7
bukadde 7
byalaga 7
ebirimu 7
ebisingayo 7
egyazuulibwa 7
ekiyitibwa 7
ekkumi 7
emanyiddwa 7
emirundi 7
endala 7
enkola 7
ensonga 7
eringi 7
eyitibwa 7
gamba 7
james 7
kino 7
lowooza 7
lukka 7
makuŋŋaaniro 7
matayo 7
mwonna 7
nnyiriri 7
okufuna 7
okulemesa 7
roberts 7
vulgate 7
yafuna 7
yatandika 7
yayamba 7
zonna 7
abaakoppolola 6
abakkolinso 6
abasinga 6
abayigirizwa 6
akiraze 6
asuubira 6
awali 6
baakola 6
bakabaka 6
bakoppolola 6
bamanyi 6
bannabyafaayo 6
bino 6
bituufu 6
bombi 6
bruce 6
bwandibadde 6
byafaayo 6
ebigendererwa 6
ebingi 6
ebiwuka 6
ebyasooka 6
eddiini 6
egisukka 6
egiyise 6
ekikulu 6
ekingi 6
ekitangaala 6
ekitasoboka 6
ekyawandiikibwa 6
ezisinga 6
ge 6
gumu 6
gusobola 6
john 6
kiraga 6
kirina 6
kusoma 6
kusomebwa 6
kuvvuunula 6
kwongera 6
kyonooneddwa 6
lusuuli 6
luther 6
lwayirisi 6
lwebbulaniya 6
mbeera 6
munyage 6
myuziyamu 6
nnabbi 6
obanga 6
oboolyawo 6
obugirimu 6
obunnabbi 6
obuyinza 6
oggyeeko 6
ogwa 6
ogwasiriira 6
okutaano 6
okuwangulwa 6
okwongera 6
omulala 6
omusanvu 6
omutume 6
omwekenneenya 6
tegusobola 6
timoseewo 6
yafulumya 6
yalaba 6
yalina 6
yavvuunulwa 6
zeero 6
abaasooka 5
abamasoleti 5
abayiikuula 5
aboogera 5
agenda 5
agnes 5
akimanyi 5
aleppo 5
amadiini 5
awamu 5
baamukozesa 5
bakakensa 5
bali 5
balowooza 5
bayiikuula 5
bazuula 5
bbanga 5
bifo 5
bigambo 5
bigulimu 5
bisinga 5
bukya 5
bulabe 5
busatu 5
bwabwe 5
byokulabirako 5
codexeyawandiikibwa 5
dda 5
dublin 5
eba 5
ebbanga 5
ebibiddirira 5
ebigulimu 5
ebituufu 5
egyasangibwa 5
egyawandiikibwa 5
ekifo 5
ekikuba 5
ekivuddemu 5
ekiyitibwadiatessaron 5
ekiyitibwathe 5
ekkuŋŋaaniro 5
ekyalo 5
ekyuma 5
emabega 5
emingi 5
emirembe 5
empandiika 5
enjawulo 5
ennukuta 5
eryayokebwa 5
eryo 5
ewala 5
ezaalimu 5
ezisooka 5
gil 5
guzuuliddwa 5
gwasiriira 5
gwayo 5
henry 5
jerusalem 5
kasasiro 5
kigambibwa 5
kiki 5
kitono 5
kizikirizibwa 5
kuguzingulula 5
kukozesa 5
kumpi 5
laba 5
liwandiikiddwa 5
ludda 5
lungereza 5
lupapula 5
maanyi 5
makulu 5
mbi 5
mukutu 5
munnabyafaayo 5
muqumran 5
njiri 5
nnukuta 5
nsobi 5
obo 5
obufuzi 5
obwetaavu 5
oguli 5
ogusingayo 5
okubunyisibwa 5
okuddamu 5
okuggya 5
okukola 5
okutuuka 5
okuyiga 5
okwekenneenya 5
okwogerwa 5
olubalama 5
olusipeyini 5
oluyitibwathe 5
olwo 5
omungereza 5
owa 5
oyo 5
syriac 5
tebyakyuka 5
tegunnazuulwa 5
tezaakyusa 5
tulina 5
waali 5
yakiraba 5
yalagira 5
yamala 5
yamaliriza 5
zirimu 5
zohar 5
abaagikoppolola 4
abaawulira 4
abamanyi 4
abamasoreti 4
abanoonyereza 4
abasamaliya 4
abaweereza 4
amanyi 4
baakizuula 4
baawakanya 4
baawandiikanga 4
baba 4
bakozesa 4
banne 4
batya 4
bayinza 4
bayudaaya 4
beatty 4
beegendereza 4
besirekemu 4
bireme 4
bisobola 4
bisopu 4
bityo 4
bulaaya 4
byazuulibwa 4
charles 4
chester 4
college 4
comfort 4
ddi 4
ddiba 4
ebibiri 4
ebigamba 4
ebina 4
egitawera 4
egyo 4
ekikakasa 4
ekikatuliki 4
ekikyasinze 4
ekiri 4
ekyakoppololwa 4
ekyamateeka 4
ennyumba 4
ensolo 4
enzikiriza 4
eriyitibwa 4
esingayo 4
essomero 4
eyeekenneenya 4
ezavvuunulwa 4
francis 4
gerizimu 4
gimaze 4
giri 4
gyali 4
hispana 4
i 4
inci 4
independence 4
katondamu 4
kigo 4
kikaddiye 4
kilmore 4
kinaana 4
kiri 4
kirisoboka 4
kisobose 4
kituufu 4
kitya 4
kwaliko 4
kwonooneka 4
kyapa 4
kyenda 4
latina 4
lewis 4
lumu 4
lusinga 4
martin 4
masedoniya 4
metzger 4
mpuku 4
mpukuphilip 4
mwalimu 4
mwe 4
mwo 4
mwokka 4
nabo 4
nnyanjula 4
obunyiikivu 4
obuvunaanyizibwa 4
obwetwaze 4
of 4
okubikuuma 4
okugamba 4
okukoppolola 4
okukozesa 4
okukuyamba 4
okukyusa 4
okuna 4
okusaanyaawo 4
okuyigganyizibwa 4
omuli 4
omuntu 4
omusuuli 4
otwalidde 4
paris 4
sorbonne 4
ssente 4
states 4
strasbourg 4
tebabeera 4
tebikyalabika 4
tebwakyusibwa 4
trinity 4
tterekero 4
tulabe 4
tusobola 4
twetaaga 4
united 4
university 4
w 4
wajjawo 4
yafuba 4
yafuuka 4
yagenda 4
yamanya 4
yasalawo 4
yawa 4
yeeyongera 4
yerusaalemi 4
yokka 4
yunivasite 4
abaabanga 3
abababulooni 3
abajeemedde 3
abakungu 3
abameedi 3
abangereza 3
abasatu 3
abateeberezebwa 3
abawakanya 3
abayisirayiri 3
abayonaani 3
agakwata 3
agambe 3
agisoma 3
ajja 3
akasanduuko 3
aligolola 3
alikifuula 3
amakulu 3
amanene 3
amaterekero 3
amaze 3
anaakulaba 3
archa 3
archive 3
ashurbanipal 3
austen 3
avvuunula 3
awakanya 3
awannyogovu 3
ayogera 3
baabalanga 3
baabanga 3
baabuulira 3
baabwe 3
baagisaanyaawo 3
baagumira 3
baakitwalanga 3
baakiwandiikanga 3
baalina 3
baanoonya 3
baanyiiga 3
baasalawo 3
baasanga 3
baasinga 3
baatwalibwanga 3
baavumirira 3
babuulira 3
bagiyuza 3
bagyokya 3
bakkiriza 3
bakristaayo 3
bakyerabirira 3
bannabyabufuzi 3
banoonye 3
basanga 3
basobole 3
batayagala 3
bateebereza 3
batta 3
bawakanya 3
bayigiriza 3
bayita 3
biblical 3
biggwaamu 3
bintu 3
birabika 3
birya 3
bitegeerekeka 3
bivunda 3
biyulika 3
bufalansa 3
bugenderevu 3
bujja 3
bukiikakkono 3
bulamu 3
busingayo 3
butandikira 3
butuukira 3
buzingiramu 3
bwasaanawo 3
byakozesebwanga 3
byaliwo 3
byamala 3
byasaanawo 3
dan 3
ddiini 3
ddungu 3
ebbali 3
ebijjukizo 3
ebikontana 3
ebimuli 3
ebinene 3
ebiriko 3
ebitasobola 3
ebugwanjuba 3
ebunyisibwa 3
ebuvanjuba 3
ebyasookera 3
ebyayolebwa 3
eddungu 3
egimu 3
egizuuliddwa 3
egyaddawo 3
ekigendererwa 3
ekinnyogovu 3
ekiragiro 3
ekisingayo 3
ekisooka 3
ekitoogo 3
ekiyitibwasinaitic 3
ekoleddwa 3
ekozesebwa 3
ekyafugibwa 3
ekyaliwo 3
ekyatuuka 3
ekyowadde 3
ekyusizza 3
embiri 3
emmese 3
enkuyege 3
enkyukakyuka 3
ennimiro 3
epifanesi 3
ereetedde 3
erimu 3
esobola 3
etaano 3
etegeerekeka 3
eti 3
ettaano 3
ettaka 3
ety 3
etz 3
eyandisangiddwamu 3
eyayagala 3
eyitibwavulgate 3
ezaasooka 3
ezirabika 3
ffeeza 3
gaabwe 3
gaali 3
gaatuuka 3
galagira 3
ggulu 3
giba 3
giragajjalirwa 3
gisaanyizibwewo 3
giteekebwa 3
giyambye 3
goshengottstein 3
gra 3
gusaanawo 3
guterekebwa 3
guziikibwa 3
gweyongera 3
gyateekebwa 3
gyatuukira 3
gyo 3
gyonna 3
gyonooneka 3
heinrich 3
intaneeti 3
iran 3
kakensa 3
kennyini 3
kibaddewoko 3
kibe 3
kifuuse 3
kigamba 3
kigambo 3
kikalu 3
kirifuuka 3
kirimaanyi 3
kisenge 3
kisigadde 3
kitongole 3
kukudduka 3
kupulo 3
kutuukirira 3
kuwangulwa 3
kuzikirizibwa 3
kyabaawo 3
kyabuutikirwa 3
kyafuuka 3
kyagenda 3
kyaggwaamu 3
kyaggweerako 3
kyagiviirako 3
kyalabika 3
kyaleetawo 3
kyasigala 3
kyennyini 3
kyerabirwa 3
kyereere 3
kyo 3
kyogerwako 3
kyonna 3
langi 3
layard 3
library 3
lukozesebwa 3
luvannyuma 3
matwale 3
migumu 3
mirundi 3
mitono 3
mizingo 3
moshe 3
muokuva 3
naddala 3
nagyo 3
nakkumu 3
nnaggomola 3
ntandikwa 3
ntono 3
obubi 3
obugagga 3
obulamu 3
obuliwo 3
obusingayo 3
obwa 3
ogukoleddwa 3
okubuulira 3
okufaananako 3
okukiraba 3
okukolebwa 3
okukyuka 3
okuliibwa 3
okusaanyizibwawo 3
okusaba 3
okusinza 3
okutukakasa 3
okutuukira 3
okutuukirizibwa 3
okuviirako 3
okuvunda 3
okuwakanya 3
okuwaliriza 3
okuwumba 3
okuyiikuula 3
okuzibunyisa 3
okuzivvuunula 3
okwonooneka 3
ology 3
olumu 3
olwali 3
omukono 3
omukulu 3
omusango 3
omuvvuunuzi 3
on 3
online 3
parkinson 3
peshitta 3
quirke 3
richard 3
rooma 3
so 3
soci 3
st 3
stephen 3
tatian 3
tebaagala 3
tebikyaliwo 3
tebuliiwo 3
tekyewuunyisa 3
tennatandika 3
tetubuulira 3
teyagenda 3
ttaka 3
tyndale 3
wayise 3
yabeerera 3
yabiwandiikira 3
yalatin 3
yaluŋŋamya 3
yasooka 3
yattibwa 3
yayiggannya 3
yayisa 3
yeeyita 3
yenna 3
yona 3
zaalimu 3
zaawerebwa 3
zaayamba 3
zef 3
zeffaniya 3
zoogerwa 3
zookebwa 3
zzaabu 3
a 2
abaagala 2
abaasookera 2
ababuulizi 2
abakazi 2
abakkolosaayi 2
abaliwo 2
abalongo 2
abandiyigirizza 2
abapolotesitanti 2
abasobola 2
abasomi 2
abataali 2
abatume 2
abavvuunula 2
abayizi 2
abeekenneenyanga 2
abeekenneenyezza 2
abikolamu 2
abimanyi 2
abisengeka 2
afuna 2
afune 2
aga 2
agaali 2
agizza 2
agusito 2
agwanidde 2
ajje 2
akali 2
akalombolombo 2
akaseera 2
akola 2
alfonso 2
alina 2
amalungimu 2
anchor 2
antwerp 2
arabic 2
armenian 2
asibibwa 2
atandika 2
atandikawo 2
ateebereza 2
ategeere 2
awagamba 2
awagira 2
awalina 2
ayinza 2
azivvuunudde 2
baabyongera 2
baafa 2
baafuna 2
baagattamu 2
baagenda 2
baagendanga 2
baageraageranya 2
baagiwandiika 2
baagukola 2
baakyalako 2
baalangirira 2
baamuyita 2
baani 2
baasanyuka 2
baatandika 2
baayongeramu 2
baazimba 2
babiri 2
babizza 2
baddukira 2
bafune 2
bafunebayibuli 2
bafuuka 2
bagategeera 2
bagimutwalire 2
bagoberera 2
bagoberere 2
bakakasizza 2
bakiyita 2
bakkirizanga 2
bakoppolole 2
bakoze 2
bakuusa 2
balagira 2
balekere 2
bamuwakanya 2
bamuziyiza 2
banaayigiriza 2
banditegedde 2
bannanfuusi 2
bano 2
basengeka 2
basigale 2
bassaawo 2
batasiima 2
batategeera 2
batono 2
bavvuunudde 2
bayibuliabamu 2
bayibulibedell 2
bayibulimu 2
bayige 2
beekebejja 2
beesigwa 2
beesunga 2
bibuga 2
biggiddwamu 2
bikakasa 2
bikozesebwa 2
biri 2
biriraanyeewo 2
bituyambye 2
bivvuunuddwa 2
biwagira 2
biwagire 2
biyitibwamasoretic 2
bongedde 2
bubaka 2
bubirigi 2
bufirosoofo 2
bugirimaani 2
bukatuliki 2
bukwatagane 2
busuuli 2
butamanya 2
butiitiizi 2
buto 2
buvuddeko 2
buwanvu 2
buyambi 2
buzibuwaza 2
bwakoma 2
bwakoppololwa 2
bwawandiikibwa 2
bwongerwa 2
bwonna 2
byagattibwa 2
byakwata 2
byasa 2
byasooka 2
byatwalibwa 2
byogera 2
byokebwe 2
byongeddwa 2
byonoonye 2
catherine 2
colin 2
coptic 2
dani 2
ddalabayibuli 2
de 2
dicti 2
ebe 2
ebiginnyonnyola 2
ebigirimu 2
ebikirimu 2
ebimala 2
ebimanyiddwa 2
ebimaze 2
ebiseera 2
ebisingawo 2
ebisinzibwa 2
ebitundu 2
ebitundutundu 2
ebulayo 2
ebyaddirira 2
ebyaggibwa 2
ebyaliko 2
ebyavumbulwa 2
ebyongerezeddwako 2
eddembe 2
efuuka 2
eggwanga 2
egula 2
egyali 2
ekipande 2
ekiraga 2
ekirala 2
ekiriko 2
ekirimu 2
ekisoboka 2
ekiyitibwafivefold 2
ekizibu 2
ekkirizibwa 2
ekyakubibwa 2
ekyandireeseewo 2
ekyazuulibwa 2
ekyoto 2
el 2
elizabeth 2
em 2
empisa 2
empula 2
ena 2
encyclopediakigamba 2
endowooza 2
enfuna 2
enkulu 2
enkyamu 2
ennaku 2
ennya 2
ennyingi 2
ensibuko 2
enteekateeka 2
entono 2
entuufu 2
ephra 2
erangirirwe 2
erina 2
eriri 2
erisukka 2
eriyitibwathe 2
erye 2
esooka 2
essaala 2
essatu 2
etandika 2
ethi 2
etterekero 2
etuumibwalatin 2
evvuunulwa 2
evvuunulwe 2
eyafulumizibwa 2
eyakozesebwanga 2
eyalimu 2
eyasooka 2
eyasookera 2
eyavvuunulwa 2
eyayongera 2
eyitibwalatin 2
eyitibwapeshitta 2
eyitibwaprealfonsine 2
eyitibwasyriac 2
ezaakafulumizibwa 2
ezaakolebwa 2
ezaakozesebwa 2
ezaaliwo 2
ezaasinga 2
ezikiikirira 2
ezikulemesa 2
ezisobola 2
eziviira 2
eziwerako 2
eziyitibwatetragrammaton 2
eziyitibwavetus 2
f 2
frederic 2
gakugira 2
gange 2
gavumenti 2
gavvuunulwa 2
gituyamba 2
greek 2
green 2
grenfell 2
gutenberg 2
gwamuwa 2
gwatuyamba 2
gwokka 2
gyawandiikibwa 2
gyazuulibwa 2
gyokka 2
h 2
howard 2
hunt 2
internati 2
jjuuni 2
johannes 2
juan 2
kafuumuulampawu 2
katono 2
kenyon 2
kibayambye 2
kibeerawo 2
kibiina 2
kiganyula 2
kikakasa 2
kikolwa 2
kimusobozesa 2
kinene 2
kiremesa 2
kiruubirirwa 2
kisoboka 2
kisobola 2
kisobozesa 2
kitabofivefold 2
kitaffe 2
kituukana 2
kituuse 2
kiwanvu 2
kiyinza 2
kiyitibwa 2
kkuŋŋaaniro 2
kristo 2
kubunyisa 2
kugisaanyaawo 2
kujeemera 2
kukyuka 2
kulaba 2
kumakko 2
kumanya 2
kumulemesa 2
kunoonyereza 2
kusangibwa 2
kusengeka 2
kutuyamba 2
kuvunaanibwa 2
kuvvuunulwa 2
kuwandiika 2
kuyigiriza 2
kwekenneenya 2
kyabanga 2
kyakatandika 2
kyamwewuunyisa 2
kyangu 2
kyannyamba 2
kyesudde 2
kyetaagisa 2
latin 2
libraryeriri 2
lirimu 2
luba 2
lucinius 2
lujjudde 2
lukaddiwa 2
lusozi 2
lusuuliabakristaayo 2
luwalabu 2
lwaffe 2
lwogerwa 2
maka 2
manchester 2
masiya 2
mayiro 2
mukama 2
mukristaayo 2
mulimu 2
mulunyiriri 2
munaazimba 2
munnaddiini 2
muno 2
muntu 2
mutabani 2
mutima 2
mutonzi 2
muwaatwa 2
muwendo 2
muyokaana 2
muzigo 2
mwekenneenya 2
myezi 2
naffe 2
nea 2
ngavulgateyabuna 2
nile 2
njogere 2
nkomerero 2
nnaabakyala 2
nnagagga 2
nnandyagadde 2
nnyumba 2
nsobole 2
ntuufu 2
ntuumu 2
nze 2
nzijuvu 2
obufirosoofo 2
obugazi 2
obujulizi 2
obukatuliki 2
obulimba 2
obulombolombo 2
obutakkiriza 2
obuwangwa 2
obwali 2
ogigeraageranya 2
ogu 2
okubunyisa 2
okubutegeera 2
okubuzaabuzibwa 2
okuddukira 2
okufa 2
okuggwaako 2
okuggyako 2
okuggyamu 2
okugifuna 2
okugigula 2
okugoberera 2
okugonzaamu 2
okukubibwa 2
okukubiriza 2
okulwogera 2
okumaliriza 2
okusatu 2
okusengeka 2
okusigala 2
okusinzizaamu 2
okusobozesa 2
okusookera 2
okutandika 2
okuteebereza 2
okutendeka 2
okutereeza 2
okutuukiriza 2
okuvvuunulaamawulire 2
okuvvuunulalefèvre 2
okuwandiikibwamu 2
okuzzibwa 2
okwegendereza 2
okwesomera 2
okwewala 2
okweyongerayo 2
olugendo 2
olukalala 2
olulala 2
oluli 2
olulyonaani 2
olupya 2
oluvvannyuma 2
oluzaaliranwa 2
olwayirisibedell 2
omugaso 2
omukatuliki 2
omuoxford 2
omutukuvu 2
omutwalo 2
omwesimbu 2
omwoyo 2
onal 2
onarykigamba 2
oneyafulumizibwa 2
oneza 2
opic 2
orts 2
osaanidde 2
osobola 2
otadde 2
otegeera 2
oxford 2
ozitwala 2
p 2
palesitayini 2
peetero 2
pentateuch 2
peshittaya 2
psalter 2
psalterkyalimu 2
rylands 2
samaritan 2
septuagint 2
septuagintera 2
septuagintnge 2
septuagintye 2
sinaiticusnecodex 2
sir 2
sitaani 2
slavonic 2
smith 2
ssaza 2
standard 2
tabannamaliriza 2
tamanyi 2
tannabaawo 2
tannamaliriza 2
tebaagalabantu 2
tebaasobola 2
tebakyayagalaseptuagint 2
tebannafuna 2
tebasobola 2
tebeefiirayo 2
tebikozesebwa 2
tebiri 2
tebyaleetera 2
tebyali 2
tegikoma 2
tekyatuukirira 2
tekyatuukiriramu 2
terukyategeerekeka 2
text 2
teyabanyega 2
teyaggwaamu 2
teyakkiriza 2
teyavunda 2
teyayingira 2
ttendekero 2
ttendo 2
ttwale 2
tugirina 2
tulabye 2
tusoma 2
twasanyuka 2
twasoma 2
url 2
v 2
valley 2
vaticanus 2
vulgateate 2
vulgatenga 2
waakiri 2
waateekebwawo 2
waffe 2
wycliffe 2
x 2
yaazo 2
yabavumirira 2
yaddukira 2
yageraageranya 2
yagimaliriza 2
yakikola 2
yakizibuwaza 2
yakizuula 2
yakubibwa 2
yakubiriza 2
yalwanirira 2
yamalirira 2
yamusobozesa 2
yamuwa 2
yamuwagira 2
yandirekedde 2
yannyonnyola 2
yaseptuaginteya 2
yasookera 2
yataputangamu 2
yateekebwa 2
yatuma 2
yatuuka 2
yatuumibwagreek 2
yavvuunulira 2
yawagira 2
yayanika 2
yayiiya 2
yazitereeza 2
yeekaalu 2
yeetaagisa 2
yekka 2
yennyonnyoleko 2
zaabunyisibwa 2
zaalowoozebwako 2
zaayongerwamu 2
zaggyamu 2
zavvuunulwa 2
zeeyongera 2
zeeyongeraabantu 2
zigabanyiziddwamu 2
zikwatagane 2
zino 2
zisobole 2
zivvuunuddwa 2
ziweddewo 2
ziyitibwavetus 2
zombi 2
