nga 85
ku 83
mu 45
naye 39
nnyo 35
abaana 28
oyo 26
omwana 21
nze 20
buli 19
abantu 17
lwaki 17
ne 14
nti 14
wa 14
era 13
olina 13
wano 13
bulungi 11
ebintu 11
emmotoka 11
nyo 11
ssente 11
muntu 10
oba 10
omusajja 10
kati 9
ki 9
kuba 9
ndi 9
njagala 9
no 9
wange 9
baana 8
kino 8
na 8
omuntu 8
tewali 8
abadde 7
alina 7
maama 7
okuba 7
okubeera 7
oli 7
omukazi 7
oyagala 7
zino 7
abazadde 6
ani 6
ayagala 6
ekiro 6
enkya 6
gwe 6
olunaku 6
wo 6
abasajja 5
abo 5
ajja 5
ate 5
baabwe 5
balina 5
bantu 5
be 5
bino 5
bintu 5
katonda 5
kibuga 5
kiki 5
kirungi 5
nange 5
obudde 5
omukulu 5
tulina 5
wabula 5
yo 5
abakazi 4
alabika 4
amagi 4
amazima 4
bingi 4
bwe 4
bye 4
ebyo 4
ekintu 4
emmere 4
engatto 4
engoye 4
ennaku 4
eri 4
ggwe 4
kyalo 4
kyo 4
lunaku 4
lwa 4
okulya 4
si 4
simanyi 4
wala 4
waliwo 4
ya 4
abakadde 3
abakozi 3
abato 3
abayizi 3
amakerenda 3
amazzi 3
ayogera 3
ba 3
bato 3
bonna 3
bya 3
byo 3
ddi 3
e 3
eddalu 3
eggulo 3
ekikopo 3
ekitibwa 3
eno 3
essimu 3
guno 3
gye 3
ka 3
kulya 3
lwe 3
mbu 3
mmere 3
ndaba 3
nkole 3
okusoma 3
okusomesa 3
omukadde 3
ono 3
ssomero 3
talina 3
tebaagala 3
teri 3
tuva 3
wadde 3
waffe 3
wali 3
yadde 3
yange 3
zo 3
abafumbo 2
abakyala 2
abalwadde 2
abamu 2
abasawo 2
abasing 2
abasinga 2
abasirikale 2
abawala 2
akabenje 2
akolera 2
akwagala 2
alabirira 2
ali 2
alinga 2
amaka 2
amanyi 2
amasanyalaze 2
amasanyu 2
awo 2
ayambadde 2
babadde 2
bakazi 2
baleekaana 2
bali 2
banange 2
bange 2
bano 2
basatu 2
batandise 2
bazadde 2
bbanka 2
bo 2
bokka 2
bubi 2
buno 2
buzibu 2
bwava 2
bwo 2
byange 2
byonna 2
ebibyo 2
ebikuta 2
ebitabo 2
ebweru 2
egudde 2
ekigwo 2
ekisa 2
embeera 2
empologoma 2
enaku 2
enkoko 2
enkuba 2
ensi 2
essaawa 2
essomero 2
ewaka 2
eyo 2
ffe 2
ga 2
gano 2
gavumenti 2
ge 2
gezaako 2
gokka 2
guluma 2
gwo 2
kadde 2
katuuti 2
ke 2
kimenya 2
kisa 2
kitiibwa 2
kufumba 2
kulabirira 2
kuliko 2
kumakya 2
kusomesa 2
kusooka 2
kya 2
kye 2
leero 2
lubadde 2
luno 2
mangu 2
masomero 2
mazima 2
me 2
mmanyi 2
mmeeza 2
mpaka 2
mpapula 2
mpisa 2
mudaala 2
muganda 2
mugenda 2
mukozi 2
mukwano 2
mulwadde 2
munne 2
musajja 2
musomesa 2
muwendo 2
mwana 2
myaka 2
naddala 2
nali 2
nawe 2
ndabayo 2
ndowooza 2
nfunye 2
nina 2
nnali 2
nsaba 2
nsi 2
nsobola 2
nyangu 2
nyumirwa 2
obadde 2
obaddeko 2
obeera 2
obulamu 2
obulungi 2
obulwadde 2
obutwa 2
obuzibu 2
ogwo 2
ojja 2
okimanyi 2
okufa 2
okufuna 2
okugenda 2
okulaba 2
okumanya 2
okusooka 2
okutambula 2
okutuula 2
okutwala 2
okuva 2
okuwakana 2
omu 2
omukwano 2
omukyala 2
omulimu 2
omulwadde 2
omusawo 2
omutima 2
omutonzi 2
omuzaade 2
osobole 2
otulo 2
otya 2
saagala 2
siyagala 2
ssimu 2
taata 2
tetulina 2
tetutegeera 2
tolina 2
ttaka 2
tudde 2
tukole 2
tuli 2
wabulira 2
wafunye 2
waliyo 2
wattu 2
yatandise 2
yekka 2
yenna 2
