ku 77
mu 74
nga 44
ne 29
abaana 22
abantu 21
ssente 20
omwana 16
nnyo 14
alina 13
waliwo 13
buli 12
olususu 12
ekisubi 11
nti 10
kye 9
mmere 9
ani 8
bangi 8
ki 8
obulungi 8
yo 8
e 7
gwa 7
gwe 7
lwaki 7
lwo 7
na 7
no 7
okulaba 7
olina 7
poliisi 7
ye 7
za 7
bwa 6
engoye 6
ennyonyi 6
ensigo 6
mwana 6
nnyingi 6
okudda 6
omuntu 6
ssomero 6
abalala 5
amazzi 5
bantu 5
bwe 5
ebintu 5
endwadde 5
era 5
kati 5
kiki 5
lwe 5
lya 5
mupiira 5
omu 5
omupiira 5
oyo 5
wa 5
zensujju 5
abakyala 4
abamu 4
abato 4
abazadde 4
amaanyi 4
amaaso 4
ba 4
bali 4
banne 4
bye 4
egenda 4
emmere 4
fuba 4
ge 4
kawunyira 4
kino 4
kozesa 4
maama 4
mulimu 4
naye 4
ngalo 4
nnyonyi 4
obulwadde 4
okubeera 4
okuva 4
olugoye 4
omusajja 4
omuwala 4
osobola 4
taata 4
ttiimu 4
tulina 4
yali 4
ze 4
ababbi 3
abakazi 3
abasomesa 3
amateeka 3
awaka 3
baana 3
bakola 3
balina 3
bingi 3
bulungi 3
ekigaji 3
ekisaawe 3
embuzi 3
enkolagana 3
ennyo 3
ensonga 3
eri 3
essira 3
eyo 3
gwo 3
ka 3
katale 3
katonda 3
kifo 3
kisaawe 3
kiyamba 3
kola 3
kubeera 3
kya 3
liigi 3
lwa 3
mangu 3
mbeera 3
mbuzi 3
ngo 3
nsaba 3
obulamu 3
obulumi 3
okukola 3
okulya 3
okunywa 3
okuzigula 3
omukisa 3
omukyala 3
omutwe 3
otya 3
sukaali 3
talina 3
tugamba 3
villa 3
wange 3
wewale 3
ya 3
zino 3
abadde 2
abakulidde 2
abasajja 2
abasirikale 2
abasuubuzi 2
abatalina 2
abatuuze 2
abavubuka 2
abawe 2
abazannyi 2
abeebyokwerinda 2
abeetaga 2
abo 2
akaaba 2
akasattiro 2
akatale 2
akola 2
akuba 2
amagumba 2
amasasi 2
amasavu 2
amawulire 2
awo 2
babagobye 2
babawa 2
badde 2
baffe 2
bafuna 2
bakaaba 2
bakasitooma 2
balala 2
balinga 2
bamufera 2
basaanye 2
basabye 2
basanga 2
batabukidde 2
bato 2
bebbi 2
bo 2
bodaboda 2
buva 2
bwino 2
bwo 2
byo 2
caayi 2
cranes 2
ddala 2
dduyiro 2
ebadde 2
ebiri 2
ebizibu 2
eddagala 2
ekidyeri 2
ekirala 2
ekizibu 2
emiti 2
emu 2
emyaka 2
enkadde 2
enkoko 2
ennaku 2
ennimu 2
enva 2
essanyu 2
eya 2
ffaamu 2
ggwanga 2
gukyali 2
guno 2
gyabwe 2
gye 2
ke 2
kibi 2
kikopo 2
kikulu 2
kiri 2
kiseera 2
kitiibwa 2
kitundu 2
kkanisa 2
ko 2
kubba 2
kuliko 2
kulya 2
kunene 2
kusoka 2
kyalo 2
kyange 2
kyo 2
kyonna 2
linnya 2
lubuto 2
lyanda 2
maaso 2
mbadde 2
mipiira 2
mmotoka 2
mukamwa 2
mukyala 2
mulembe 2
muntu 2
musanvu 2
nange 2
ndi 2
nfuna 2
ngoye 2
njawulo 2
nnyumba 2
nywa 2
nze 2
oba 2
obucaafu 2
obukadde 2
obuli 2
obuugi 2
obwo 2
ofuna 2
okuba 2
okubba 2
okuferebwa 2
okufuna 2
okumanya 2
okumwogerera 2
olumizibwa 2
omuggaga 2
omukolerere 2
omunnyo 2
omusolo 2
omutindo 2
omwala 2
osobole 2
saagala 2
sagala 2
sipensulo 2
sooka 2
tebalina 2
tugende 2
tuli 2
tusaba 2
uganda 2
vipers 2
waggulu 2
wali 2
wano 2
weewale 2
wo 2
yababuuza 2
yamala 2
yampa 2
yonna 2
zo 2
