num 897
mu 604
ku 229
nga 227
nti 223
era 208
na 194
ne 185
kristo 149
bayibuli 142
kkumi 133
no 115
abantu 114
wa 110
katonda 100
naye 97
ekyo 86
aba 84
bwe 84
yakuwa 82
emu 81
bo 77
okuba 76
ssatu 75
ye 71
kya 68
omu 67
omulabe 66
kye 64
bbiri 63
nnyo 61
yesu 61
yokaana 61
ba 58
ya 58
abalala 57
oba 55
abo 53
ngo 52
obulimba 52
nnya 50
bya 49
ekya 48
omuntu 48
gye 47
ebya 45
eyo 45
mukaaga 45
musanvu 45
owa 45
yali 45
eya 44
munaana 44
akamwenyumwenyu 43
bangi 43
we 40
olwa 39
lya 37
ttaano 36
obulungi 35
endowooza 34
essanyu 34
kiseera 34
arthur 33
ate 33
buli 33
okufuna 33
thomas 33
engeri 32
amagezi 30
enjigiriza 30
mwenda 30
yagamba 30
bannamukadde 29
erinnya 29
bazadde 28
za 28
amaanyi 27
asatu 26
emirundi 25
gu 25
kikumi 25
lukumi 25
abiri 24
alina 24
bulungi 24
ekiseera 24
williams 24
abaana 23
bye 23
ekizibu 23
ennyo 23
eri 23
ka 23
kyonna 23
ngeri 23
omwana 23
bubiri 22
bukadde 22
ebigambo 22
ebiri 22
embeera 22
abakaddiye 21
australia 21
baabwe 21
be 21
ebirowoozo 21
nge 21
okukola 21
olwekyo 21
bannabbi 20
erimu 20
omutume 20
abamu 19
endabika 19
maama 19
wange 19
ze 19
bingi 18
leero 18
oku 18
okusoma 18
oluganda 18
pawulo 18
baba 17
ebyo 17
kibiina 17
kiki 17
mingi 17
okutegeera 17
western 17
bonna 16
ekibiina 16
enkolagana 16
kiba 16
lunaana 16
mulabe 16
okulabirira 16
okumanya 16
okuva 16
si 16
agamba 15
emyaka 15
ennungi 15
eno 15
kubanga 15
lusegere 15
magezi 15
maka 15
okukuyamba 15
oluvannyuma 15
yaabwe 15
abaali 14
abajulirwa 14
abalabe 14
basobola 14
date 14
e 14
nkumi 14
nsi 14
okuwulira 14
ssaza 14
abakristaayo 13
abasaasaanya 13
agatuyamba 13
ayitibwa 13
beebo 13
bintu 13
bugenderevu 13
bwa 13
ebintu 13
egya 13
ekitiibwa 13
ffe 13
ga 13
kwe 13
kyange 13
njigiriza 13
obukulu 13
okusigala 13
oyinza 13
url 13
waliwo 13
abasawo 12
baava 12
bajjajjange 12
balina 12
bantu 12
engero 12
ennuŋŋamu 12
eryo 12
esembayo 12
eza 12
gumu 12
gya 12
kamwenyumwenyu 12
kigambo 12
kitaffe 12
lwaki 12
munda 12
mutwalo 12
naawe 12
obunyiikivu 12
olet 12
omulimu 12
ssaawa 12
vi 12
wadde 12
yawandiika 12
abakadde 11
butuufu 11
bwabwe 11
bwo 11
gwo 11
kabuga 11
kijja 11
kiri 11
kyokka 11
mary 11
nabo 11
obo 11
okulaba 11
okuyiga 11
omubuulizi 11
oyo 11
univ/art 11
univ_sqr_xl 11
yalaga 11
baali 10
bbaluwa 10
eraga 10
eŋŋanda 10
fiji 10
ge 10
kakaaga 10
ki 10
kyennyini 10
maaso 10
magdalena 10
mitwalo 10
mukyala 10
musanyufu 10
myaka 10
ndabika 10
nnali 10
okumala 10
okunnyamba 10
okuyamba 10
osobola 10
abalalaweereza 9
abali 9
awamu 9
bakkiriza 9
byambalo 9
ddala 9
ebibiina 9
ebizibu 9
ekirala 9
endiga 9
enjiri 9
essira 9
fuba 9
jpg 9
kino 9
kisobola 9
laba 9
misege 9
muganda 9
nsonga 9
obuyambi 9
obwo 9
okusaba 9
okwagala 9
omukazi 9
yalabula 9
abafiripi 8
abasibe 8
abatassaako 8
abayitibwa 8
abayizi 8
akumwenyeza 8
amaaso 8
amadiini 8
ana 8
apo 8
bajjanjabwa 8
balala 8
bamu 8
basaasaanya 8
benkana 8
biseera 8
buweereza 8
byabwe 8
byonna 8
ebibuuzo 8
ebireeta 8
ebitundu 8
egamba 8
ekikristaayo 8
ekiruŋŋamiziddwa 8
jjajja 8
john 8
kati 8
kireetedde 8
kitaabwe 8
kitange 8
kityo 8
kuba 8
kuteekako 8
lunaku 8
lwenda 8
magazini 8
matayo 8
mubiri 8
mwawulira 8
oboolyawo 8
obulamu 8
ogwo 8
okola 8
okubiri 8
okukozesa 8
okumalira 8
okuzikirizibwa 8
okwaŋŋanga 8
okwewala 8
olupapula 8
omunaala 8
omwoyo 8
payoniya 8
singa 8
tebatera 8
timoseewo 8
wagamba 8
yajja 8
abatume 7
agali 7
akali 7
ali 7
amazima 7
ayagala 7
ayinza 7
ayogera 7
baffe 7
bali 7
basaanidde 7
bayinza 7
ebikwata 7
ebyasa 7
ekiyinza 7
embi 7
gwe 7
kyandeetera 7
kyasa 7
lipoota 7
lumu 7
lup 7
mbeera 7
mukwano 7
muwendo 7
naffe 7
nneewulira 7
nsanvu 7
nze 7
obulwadde 7
okuggwaawo 7
oluusi 7
omubiri 7
omulala 7
omusawo 7
richard 7
whitton 7
zuukuka 7
abakazi 6
abasajja 6
abatali 6
abawere 6
akaali 6
akola 6
atya 6
babeera 6
bagamba 6
basalawo 6
bino 6
birowoozo 6
bitundu 6
bulagirizi 6
ddiini 6
ebimalamu 6
ebiyitibwa 6
egikavvula 6
ekisinga 6
ekisoboka 6
ekisukkiridde 6
ekiyitibwa 6
emabega 6
emirembe 6
enkyusa 6
ennyumba 6
esobola 6
eyali 6
eyitibwa 6
gamba 6
guggyeemu 6
kiraga 6
kitaawe 6
kitegeeza 6
kulabirira 6
kulaga 6
kungulu 6
musingi 6
nnamaddala 6
obusika 6
okaddiwa 6
okugumira 6
okukkiriza 6
okukolera 6
okulya 6
okungulu 6
okusobola 6
okutuusa 6
okwekyawa 6
okweraliikirira 6
olufiji 6
olulimi 6
omukuumibayibuli 6
omuminsani 6
omuti 6
omuwendo 6
ronald 6
ssematalo 6
tasobola 6
weereza 6
wesley 6
yakubiriza 6
yalina 6
yawandiikira 6
yonna 6
zabbuli 6
abato 5
agalimu 5
agasobola 5
ageesigamiziddwa 5
akuyambako 5
alwala 5
amaka 5
amangu 5
amerika 5
ani 5
aweereza 5
bandijjidde 5
bannaabwe 5
bannamwandu 5
bato 5
beetaaga 5
bubi 5
bugirimaani 5
bukiikaddyo 5
bwereere 5
bwetaavu 5
byo 5
donnybrook 5
ebaawo 5
ebirungi 5
edda 5
eddiini 5
ekitundu 5
ekkubo 5
ensonga 5
erireeta 5
essanyu​—okuba 5
ffenna 5
gaabwe 5
gayambye 5
katono 5
kijjukire 5
kikuganyulamu 5
kimu 5
kinnoomu 5
kirabika 5
kitundu 5
kiwanvu 5
kiyinza 5
kusooka 5
lowooza 5
lwe 5
mirundi 5
muntu 5
mutima 5
nedda 5
nnagenda 5
nnalina 5
obusatu 5
okubawa 5
okubeera 5
okukuganyula 5
okulowooza 5
okunoonyereza 5
okussa 5
okwogera 5
oli 5
olina 5
omujeemu 5
omulamu 5
phoebe 5
pulintaweereza 5
sindika 5
so 5
tebaali 5
tebasobola 5
waggulu 5
yafa 5
yagezaako 5
yakobo 5
yasaba 5
yatandika 5
yekka 5
abaagala 4
ababajjanjaba 4
ababaka 4
ababalabirira 4
abagoberezi 4
abajjira 4
abakkolinso 4
abakugu 4
abalimba 4
abalwadde 4
abamwenyerezza 4
abasendasenda 4
abasirikale 4
abassaako 4
abassangako 4
abassessaloniika 4
abatayatula 4
abatwalamu 4
abaweereza 4
abayigiriza 4
abe 4
abuzaabuza 4
agatuyambalugandabayibuli 4
ai 4
ajja 4
aka 4
akabonero 4
akati 4
akimanyi 4
akweka 4
amakulu 4
amaze 4
amwenya 4
asobole 4
ateekako 4
ati 4
atyo 4
ayogeddwako 4
baagala 4
baakwatibwangako 4
baaliwo 4
baamala 4
baasengukira 4
baasindikibwa 4
baatandika 4
baatugaananga 4
baawuliranga 4
bafaayo 4
bafuba 4
bafuzi 4
baibuli 4
bakyawakanya 4
bakyewaggula 4
balabise 4
baliwo 4
balungi 4
banaatera 4
banazi 4
bannaffe 4
bano 4
basanyufu 4
bassaako 4
bataddeko 4
bateekako 4
batera 4
baweereza 4
bayibulitandika 4
bayibulitukwaniriza 4
beekenneenya 4
beeyisamu 4
beeyita 4
biki 4
bikozesebwa 4
bikwata 4
bimaze 4
binoomunaala 4
birabika 4
bisangibwa 4
bituyigiriza 4
biwandiiko 4
biyambye 4
bizinga 4
bukiikakkono 4
bulage 4
bumaze 4
bungereza 4
buvanjuba 4
buyinza 4
bwesimbu 4
dawudi 4
ddene 4
ddirisa 4
ebakubiriza 4
ebbaluwa 4
ebbanga 4
ebbiri 4
ebikweraliikiriza 4
ebimu 4
ebizimbe 4
ebyasooka 4
ebyetaago 4
eddamuddala 4
eddamukiki 4
egisinga 4
ekibinja 4
ekibuuzo 4
ekigambo 4
ekika 4
ekikwata 4
ekimala 4
ekimusanyusizza 4
ekinaavaamu 4
ekintu 4
ekirabo 4
ekirungi 4
ekitangaala 4
ekitayatula 4
ekozesa 4
ekyaluŋŋamizibwa 4
ekyama 4
ekyasooka 4
ekyatula 4
ekyewuunyisa 4
ekyokulabirako 4
emirungi 4
emiti 4
emitima 4
enkuŋŋaana 4
ennungiluganda 4
entuufu 4
envi 4
eremesa 4
esooka 4
etaano 4
etategeerekeka 4
etukubiriza 4
ewaabwe 4
eyafa 4
eyakozesa 4
eyeegaana 4
eyogera 4
ezandituleetedde 4
eziggiddwamuerinnya 4
firimu 4
gaabyo 4
gabakubiriza 4
gabuzaabuzizza 4
gagamba 4
gasaasaanyizza 4
harvard 4
ii 4
kaakano 4
kakwata 4
kalina 4
kamwenyumwenyuembeera 4
kasobola 4
kategeeza 4
katharine 4
kikuganyula 4
kikuleetera 4
kinaana 4
kireetawo 4
kisukkiridde 4
kituuka 4
kitwakire 4
kiva 4
kuganyulwa 4
kukuganya 4
kumpi 4
kusikiriza 4
kutulemesa 4
kuzimba 4
kwenyooma 4
kweraliikirira 4
kyaliwo 4
kyanzizangamu 4
kyatutonderwamu 4
kyatuuka 4
labaawake 4
lady 4
lindsay 4
lisangibwa 4
lulimi 4
luuyi 4
lwa 4
mangi 4
mangu 4
masiya 4
mayiro 4
mujulirwa 4
mukugu 4
mulimba 4
mutabani 4
muwandiisi 4
mwannyinaze 4
mwekuume 4
mwesigwa 4
ndi 4
nkambi 4
nnamukadde 4
nnawuliranga 4
nneeyisa 4
nnuŋŋamu 4
noovemba 4
observer 4
obujjanjabi 4
obulabi 4
obungi 4
obwenyi 4
obwewagguzi 4
ogwakazibwako 4
ojja 4
okaddiwaamagezi 4
okikola 4
okubaawo 4
okubayamba 4
okubuulira 4
okugaana 4
okuganyula 4
okukoppa 4
okulabika 4
okulaga 4
okuleetera 4
okulemesa 4
okumwenya 4
okunafuya 4
okunoonya 4
okusinza 4
okusinziira 4
okusomangayo 4
okutandika 4
okuteekako 4
okuteekangako 4
okutereera 4
okutuyamba 4
okuweereza 4
okuwummula 4
okwegatta 4
okweyongera 4
olulala 4
omukuumi 4
omumalirivu 4
omusajja 4
omutima 4
omwami 4
omwenya 4
org 4
oteekako 4
otomanyi 4
otyo 4
owulira 4
peetero 4
perth 4
ravensbrück 4
ssessalonika 4
tannawandiika 4
tategeerekeka 4
tebisobola 4
tekiva 4
telulijja 4
tewabanga 4
tewali 4
tofuba 4
tuli 4
tulina 4
tulowooza 4
tusaanidde 4
tusobola 4
tutegeerera 4
tuweereza 4
twasisinkanyanga 4
wayiseewo 4
weekiri 4
weetegereze 4
yabayita 4
yaggumiza 4
yalabulaabakristaayo 4
yalwangawo 4
yamala 4
yateekangako 4
yatereeranga 4
yayita 4
yazimba 4
yunivasite 4
zaabwe 4
zaffe 4
zeero 4
zino 4
zzaabu 4
a 3
aatawaanyizibwa 3
abaamukyalira 3
abaava 3
ababa 3
ababafumbirwa 3
ababawasa 3
ababiri 3
abakolera 3
abalina 3
abatafa 3
abatannavubuka 3
abategeevu 3
abavubuse 3
abawala 3
agagirimu 3
agattako 3
ajjukira 3
akaalimibwangamu 3
akabi 3
akaddiye 3
akaseera 3
aleetedde 3
alowooza 3
amanyibwa 3
annyamba 3
asaanidde 3
asaasaanya 3
asengukira 3
asingayo 3
atenderezebwa 3
ayiga 3
baabanga 3
baafuuka 3
baagenda 3
baayogera 3
babasigamu 3
babawa 3
babe 3
bafuna 3
bakola 3
bakulu 3
bamativu 3
bandaga 3
bannyina 3
basiimibwa 3
basobole 3
bassa 3
bikolebwako 3
bulaaya 3
bulabe 3
bulamu 3
butaliimu 3
buvunaanyizibwa 3
bwayamba 3
bweyongera 3
bweyongezi 3
byokka 3
eba 3
ebafuula 3
ebibala 3
ebikuteganya 3
ebugwanjuba 3
ebyawandiikibwa 3
egikavvula”emyaka 3
egiri 3
ekifaananyi 3
ekigendererwa 3
ekosa 3
ekyase 3
emikwano 3
emitindo 3
endya 3
enkyukakyuka 3
enneeyisa 3
ennungizuukuka 3
ennyambye 3
entandikwa 3
enteekateeka 3
erabika 3
ereetedde 3
essaza 3
etuwa 3
eviiriddeko 3
eyeeraliikiriza 3
ezo 3
gange 3
gannyambye 3
gwa 3
gwange 3
jiyoo 3
kannyamba 3
kasambula 3
ke 3
kibeerera 3
kibuga 3
kinnyamba 3
kinnyambye 3
kintu 3
kisaanidde 3
kiviirako 3
kizikiza 3
kkubo 3
kugamba 3
kukumwenyeza 3
kuyinza 3
kyanneewuunyisa 3
kyannyamba 3
lukya 3
lunyiriri 3
lupapula 3
lwabwe 3
maanyi 3
mikka 3
mugaso 3
mulungi 3
mutegeevu 3
mwaka 3
ndowooza 3
ngule 3
nicole 3
njawulo 3
nkirabye 3
nnamwandu 3
nneetaaga 3
nneewuliramu 3
nzekka 3
obufumbo 3
obuli 3
obulimu 3
obumuleetera 3
obunaawangaala 3
obutakola 3
obuto 3
obutuukirivu 3
obuvubuka 3
obuvunaanyizibwa 3
obwa 3
ogukolebwa 3
ogwaddawo 3
okubaagala 3
okubaako 3
okugabana 3
okugatta 3
okukimanya 3
okukolagana 3
okukyukakyuka 3
okulimba 3
okusanyusa 3
okusikiriza 3
okutuukanya 3
okuwa 3
okwennyamira 3
okweyisa 3
olabika 3
olunyiriri 3
olunzizaamu 3
olwo 3
omukadde 3
omukristaayo 3
omulembe 3
omunda 3
omuwandiisi 3
omuyigirizwa 3
omuzadde 3
peter 3
ssente 3
ssiri 3
tebabimalira 3
tebatunuulira 3
tebufuma 3
timothy 3
tolinda 3
twekenneenya 3
twewala 3
wabaawo 3
wamu 3
weegendereze 3
yabibuulirako 3
yafuuka 3
yakola 3
yampuliriza 3
yankebera 3
yasavuwaza 3
yategeera 3
yawagira 3
yawasa 3
yaweereza 3
yenna 3
yok 3
yokka 3
zeebigambo 3
zisangibwa 3
abaagirimu 2
abaakibeerangako 2
abaaweereza 2
ababuulizi 2
abajjanga 2
abakyalira 2
abalya 2
abamesodisiti 2
abaminsani 2
abantumu 2
abapolotesitanti 2
abasatu 2
abavubuka 2
abuulira 2
afuna 2
agendanga 2
akaakubibwa 2
akaasimibwangamu 2
akadde 2
akafuzi 2
akakaalukana 2
akakiiko 2
akapande 2
akatabo 2
akayitibwa 2
akeesudde 2
ako 2
akoppa 2
akozesa 2
akyaweereza 2
alaba 2
ampadde 2
andaga 2
andrew 2
anyuddwa 2
asobola 2
asoma 2
ataano 2
atandikawo 2
ategeera 2
atwala 2
awaka 2
awanikiddwa 2
aweereze 2
awo 2
ayogerako 2
baagumira 2
baakoleranga 2
baakoppa 2
baakubaganyizanga 2
baakuzibwa 2
baakwatibwako 2
baalekera 2
baalina 2
baalissanga 2
baalyanga 2
baamukazaako 2
baayolekagana 2
bafubye 2
bajjajjaffe 2
bakewell 2
bakoppa 2
bakoze 2
balabirira 2
balabirirwa 2
ballarat 2
bamwagala 2
bange 2
bannakyewa 2
bapayoniya 2
barr 2
basobodde 2
bayitibwa 2
bbaawe 2
bbugumu 2
bibiri 2
bible 2
bika 2
binoebibuuzo 2
biraga 2
biro 2
bisatu 2
bitabo 2
boogezi 2
bubaka 2
bugwanjubamu 2
bunnabbi 2
busatu 2
busonga 2
byasooka 2
chloe 2
cripps 2
dduuka 2
disitulikiti 2
doll 2
ebibi 2
ebifaananyi 2
ebikolwa 2
ebikozesebwa 2
ebinnyonnyola 2
ebisaanyizo 2
ebisinga 2
ebitabo 2
ebugwanjubwa 2
ebyaleetera 2
ebyongerezeddwako 2
eddamu 2
egizze 2
egyasooka 2
ekibuga 2
ekiddako 2
ekifo 2
ekiganyudde 2
ekimu 2
ekiri 2
ekiro 2
ekisingayo 2
ekitabo 2
ekiyitibwafiji 2
ekizimbe 2
ekizinga 2
embazzi 2
emikutu 2
empaka 2
empuliziganya 2
empya 2
endagaano 2
endala 2
eneetera 2
enjawukana 2
enjawulo 2
ennamba 2
ennuŋŋamulwaki 2
entalo 2
enzimba 2
eraakyayambako 2
eragiddwa 2
eringi 2
essuuti 2
eteri 2
ettaayi 2
eyafulumizibwa 2
eyandimukakasizza 2
eyigiriza 2
eziwooma 2
figi 2
fijiansekya 2
gaffe 2
gavumenti 2
gayamba 2
gibaawo 2
gwakozesebwa 2
gwatandika 2
hedland 2
horncastle 2
hunt 2
i 2
islands 2
janice 2
ji 2
jjanwali 2
jjulaayi 2
jpgwp 2
kaakula 2
kafuuka 2
kakiiko 2
kalaga 2
kalgoorli 2
kanyomero 2
kasanvu 2
kaseera 2
katabokiki 2
kayitibwazi 2
kibiinatuyinza 2
kikolawo 2
kikulu 2
kinnyonnyola 2
kinswaza 2
kirina 2
kisa 2
kisangibwa 2
kitabo 2
kiyamba 2
kizibu 2
kizinga 2
kubuulira 2
kukola 2
kusoma 2
kutema 2
kutuyamba 2
kutwala 2
kuva 2
kuvvuunula 2
kwanguyiriza 2
kwogera 2
kyali 2
kyanafuya 2
kyayitibwanga 2
kyenda 2
kyokulabirako 2
lakeba 2
lakemba 2
leeroleero 2
linnya 2
lukuŋŋaana 2
lye 2
mad 2
madiini 2
mbalaasi 2
mpisa 2
mpulira 2
mubazzi 2
mukkakkamu 2
mukutu 2
mulina​—enkizo 2
munyiikivu 2
muti 2
muwendonga 2
mwangu 2
mwe 2
mweraliikirivu 2
naddala 2
nange 2
nayo 2
ndukuviire 2
ngitwala 2
nkaaga 2
nkitwala 2
nkizo 2
nnafaanana 2
nnakiraba 2
nnakyewa 2
nnatandika 2
nnayisibwa 2
nneewaayo 2
nno 2
nnyimiriramu 2
nnyomagdalena 2
nnyumba 2
nsaagamu 2
ntandika 2
ntono 2
ntuufu 2
obukadde 2
obukosa 2
obulenzi 2
obunene 2
obunnabbi 2
obutasobola 2
obuweereza 2
obwakabaka 2
obwakabakamu 2
obwali 2
obwegendereza 2
obwesigwa 2
offrey 2
ogusobola 2
ogutali 2
oguyanja 2
okubajja 2
okubala 2
okubibuulirako 2
okubirabira 2
okuddaabiriza 2
okuddamu 2
okufaananako 2
okufuba 2
okufunanga 2
okufunayo 2
okugamba 2
okukafuna 2
okukakasa 2
okukubaganya 2
okukuŋŋaaniramu 2
okulabiriramu 2
okumalirizibwa 2
okumuweereza 2
okumuyamba 2
okumuyita 2
okumwagala 2
okusalawo 2
okutegeka 2
okutema 2
okutematema 2
okutta 2
okutuga 2
okutukuza 2
okutwalira 2
okutya 2
okuzikkiririzaamu 2
okuzimbibwa 2
okwebeesaawo 2
okwettanirwa 2
okwewuunya 2
old 2
olunene 2
omujeemu”yesu 2
omukisa 2
omukulembeze 2
omukulu 2
omukuumi—ogu 2
omulalu 2
omunene 2
omusanyufu 2
omutwe 2
omwaka 2
ons 2
ova 2
pacific 2
pawundi 2
pink 2
port 2
price 2
solomon 2
soma 2
students 2
tagikkiririzaamu 2
tebaagala 2
tebaba 2
tebalina 2
tegwamubeerera 2
tekiba 2
tekyannyanguyira 2
temulagajjalira 2
teri 2
tom 2
tonsuula 2
tower 2
tubalinako 2
tubatwala 2
tugenda 2
tukola 2
tutya 2
victoria 2
waabwe 2
waaliwo 2
waaliyo 2
wala 2
watch 2
wazabbuli 2
williamsarthur 2
yabalukawo 2
yabawanga 2
yabiwandiika 2
yabuulirangako 2
yafiira 2
yafissizangawo 2
yagenda 2
yakuwanga 2
yakwatibwako 2
yalangiriranga 2
yaliko 2
yandimuwadde 2
yanoonyerezaako 2
yanoonyerezanga 2
yasiba 2
yasobola 2
yasoma 2
yasookera 2
yateekamu 2
yateekanga 2
yateekawo 2
yatendeka 2
yatuulanga 2
yavvuunula 2
yayambako 2
yayambalanga 2
yayisibwa 2
yayogera 2
yayogerako 2
yazaala 2
yazaalibwa 2
yaziwangula 2
yeewaayo 2
yeeyawula 2
yena 2
yerusaalemi 2
zaabuna 2
