ne 479
mu 392
era 287
bo 248
ku 219
nga 199
na 195
mukama 184
nti 167
bwe 140
no 132
katonda 127
eri 124
olwa 106
ayogera 100
kale 95
isira 77
wa 77
nze 70
kubanga 69
ati 67
nsi 62
so 62
ya 62
eza 56
naye 56
abo 55
laba 53
abantu 52
awo 52
omu 52
omuntu 52
ogu 50
aba 48
ensi 46
e 45
ennyumba 45
nate 44
omwana 43
ekitala 42
zonna 42
ba 41
lunaku 40
wakati 40
amawanga 38
kya 38
bonna 37
mawanga 37
okuva 37
ggwe 35
gye 33
ebya 32
misiri 32
emikono 31
ekya 30
ngo 29
go 28
lwa 28
wamu 28
buli 27
bwo 27
eya 27
mukono 27
nge 27
abaana 26
kye 26
maaso 26
balimanya 25
butuukirivu 25
omukono 25
ye 25
ensolo 24
gwo 24
naawe 24
ndi 24
okuba 24
olufulube 24
gu 23
lwe 23
amazzi 22
ekigambo 22
eruuyi 22
omulyango 22
gwa 21
omusaayi 21
za 21
ai 20
amakumi 20
byo 20
gya 20
kabaka 20
obwa 20
amaaso 19
endiga 19
ga 19
ge 19
mmwe 19
obukiika 19
amaanyi 18
egya 18
gwange 18
lye 18
obutali 18
be 17
byonna 17
gwe 17
obo 17
ekkumi 16
mulyango 16
obuwanvu 16
wansi 16
zo 16
bange 15
byabwe 15
gaabwe 15
kwe 15
kwo 15
obugazi 15
omubi 15
omutima 15
oyo 15
zange 15
aga 14
aŋŋamba 14
byagwo 14
bye 14
ebintu 14
ebizizi 14
ebyo 14
ennaku 14
entiisa 14
gyonna 14
kkono 14
kyo 14
ttuulo 14
wo 14
yo 14
amangi 13
amatongo 13
enjuyi 13
kyange 13
kyava 13
kyogera 13
nsozi 13
oku 13
omuliro 13
yaabwe 13
abattiddwa 12
agera 12
bakomole 12
baligwa 12
bantu 12
bya 12
ebweru 12
eggwanga 12
eggye 12
ekyo 12
emifuubeeto 12
ennyanja 12
falaawo 12
gammwe 12
mwaka 12
nange 12
newakubadde 12
obulungi 12
oli 12
ttale 12
yonna 12
abiri 11
amagumba 11
baabanga 11
byali 11
byammwe 11
ensozi 11
eyo 11
gyo 11
kinjijira 11
lyange 11
nnyanja 11
obuguzi 11
omwezi 11
waabwe 11
waaliwo 11
wange 11
zaabwe 11
baali 10
bunnya 10
butali 10
ddala 10
ddyo 10
ebibuga 10
ekibuga 10
embalaasi 10
etaano 10
gyagwo 10
mulabe 10
nabo 10
nditeeka 10
nnyumba 10
okwolekera 10
oluggya 10
olumuli 10
olwo 10
omusango 10
ze 10
abakka 9
abalamu 9
abasumba 9
akamwa 9
amayu 9
babulooni 9
batya 9
bwagwo 9
ebuvanjuba 9
ensonyi 9
googi 9
lwonna 9
muntu 9
njuyi 9
nkyogedde 9
nsiko 9
obugagga 9
tebaliiko 9
weewaawo 9
abali 8
abasajja 8
aliba 8
amalaalo 8
amatabi 8
amayinja 8
balituula 8
bwayo 8
ebiri 8
ebituli 8
ekibiina 8
ekiruyi 8
ekisibo 8
ekitiibwa 8
emiti 8
emmeeme 8
emmeeza 8
ennyama 8
erinnya 8
gange 8
lagula 8
lumu 8
lya 8
lyo 8
mangi 8
mazima 8
musanvu 8
ogambe 8
okutuuka 8
olwatuuka 8
omuggo 8
omunda 8
omwoyo 8
oyogere 8
si 8
abasuubuzi 7
abattibwa 7
akola 7
alifiira 7
antwala 7
awali 7
awayingirirwa 7
baabwe 7
babbugwe 7
bali 7
bbanga 7
bwabwe 7
ebigambo 7
eddoboozi 7
edomu 7
ekkubo 7
emigga 7
ennyonyi 7
kange 7
lwo 7
lyonna 7
mutima 7
muwulire 7
mwe 7
mwezi 7
ndiba 7
nnyingi 7
nnyo 7
oliba 7
olubereberye 7
yerusaalemi 7
yuda 7
adeni 6
amagezi 6
ataano 6
baawangayo 6
bakabaka 6
bibuga 6
bifo 6
bwange 6
ebigera 6
ebigere 6
ekisasi 6
ekiweebwayo 6
ekyejo 6
emirembe 6
emisango 6
emyaka 6
engabo 6
enkindu 6
eryo 6
ettukuvu 6
gamba 6
gumu 6
kifo 6
matabi 6
mulamu 6
mulimanya 6
nammwe 6
nteeka 6
obuggya 6
obutuukirivu 6
okuleka 6
okutuusa 6
okwetooloola 6
olunaku 6
omuddu 6
omulamu 6
omutuukirivu 6
omuwendo 6
omwo 6
owa 6
ssaddaaka 6
tewaliba 6
yange 6
abatali 5
amalala 5
amoni 5
baagenda 5
basuubuzi 5
batyo 5
boogera 5
busibe 5
bwammwe 5
byange 5
ebikolwa 5
ebitala 5
ebizinga 5
enfuufu 5
ennume 5
ensalosalo 5
gali 5
gano 5
kijja 5
kkubo 5
ko 5
kwa 5
kyendiva 5
lyabwe 5
mabbali 5
magombe 5
meseki 5
migga 5
muli 5
munaana 5
munda 5
ndifuula 5
ndiga 5
ndikufuula 5
ntyo 5
oba 5
obagambe 5
obubi 5
obutalagge 5
obuyinza 5
ogumu 5
okufa 5
okugwa 5
okusobya 5
olusozi 5
omugaati 5
omukuumi 5
omulangira 5
omuyiggo 5
otyo 5
seyiri 5
simba 5
tubali 5
yabanga 5
yali 5
abagoba 4
abalangira 4
abalunnyanja 4
abamisiri 4
abatuula 4
agafisseewo 4
agamba 4
ago 4
akoze 4
alina 4
amaaliire 4
amadaala 4
amakubo 4
ana 4
ani 4
asatu 4
baliba 4
bannaggwanga 4
batali 4
bbiri 4
bigere 4
biri 4
biriba 4
biro 4
bizinga 4
bwenyi 4
dawudi 4
dedani 4
ebibala 4
ebifaananyi 4
ebifo 4
ebigo 4
ebyazika 4
ebyennyanja 4
ebyokulwanyisa 4
edda 4
eddalizi 4
ekire 4
ekitundu 4
ekizikiza 4
ekyewuunyo 4
embuzi 4
emirimu 4
emizizo 4
engeri 4
enju 4
eriyo 4
erye 4
ezikomererayo 4
ffe 4
gaako 4
galimanya 4
gonna 4
guba 4
gwabwe 4
gwaliko 4
gyabwe 4
gyali 4
kaakano 4
kamwa 4
kiriba 4
kiwonvu 4
kuba 4
kwaffe 4
kyabwe 4
kyenvudde 4
kyonna 4
lebanooni 4
lubiriizi 4
luggya 4
lwammwe 4
mayinja 4
mulirya 4
muyiggo 4
ndiguvunaana 4
nebukadduleeza 4
njogera 4
obugulumivu 4
obusibe 4
okubaggya 4
okusinga 4
olulituuka 4
olusuku 4
olwereere 4
omuddo 4
omukka 4
omulimu 4
omunyago 4
omusajja 4
omusumba 4
ssava 4
talirema 4
tewali 4
ttaka 4
waggulu 4
we 4
yammwe 4
zaayo 4
abalabe 3
abalwanyi 3
abasse 3
akabonero 3
amadirisa 3
amafuta 3
amagaali 3
amatu 3
amaziyivu 3
amba 3
awalinnyirwa 3
awatukuvu 3
awonye 3
baayo 3
babaako 3
bagudde 3
balamu 3
balina 3
balinyaga 3
balyogera 3
balyoka 3
bamanya 3
banne 3
batuula 3
bawala 3
bokka 3
bulongoofu 3
bulungi 3
bwa 3
bwabyo 3
bwagyo 3
bwawo 3
bwazo 3
bwonna 3
byaliko 3
ebiwonvu 3
ebyagwa 3
ebyalagirwa 3
ebyalekebwawo 3
ejjinja 3
ekifo 3
ekigera 3
ekisiikirize 3
ekkondeere 3
ekyenyi 3
ekyokebwa 3
ekyuma 3
emivule 3
emmere 3
empewo 3
engoye 3
enkya 3
ennyo 3
ensiko 3
ensonga 3
eriko 3
etunuulira 3
ezaabu 3
ezo 3
eŋŋaano 3
gaali 3
gaayo 3
gamwetoolodde 3
geegomba 3
genda 3
gyammwe 3
kasiru 3
kawumpuli 3
kikumi 3
kityo 3
kufa 3
kwabwe 3
kwaliko 3
kwonna 3
loosi 3
lusozi 3
lusuku 3
luuyi 3
matongo 3
mba 3
mimwa 3
miryango 3
mitwe 3
mmaze 3
mowaabu 3
mukaaga 3
mukazi 3
muliba 3
musuubuzi 3
mwene 3
naabanga 3
ndagula 3
ndibawa 3
ndikomya 3
ndimenya 3
ndirekesaawo 3
ndisaasaanyiza 3
njeemu 3
nju 3
nnawa 3
nnya 3
nnyini 3
ntukuzibwa 3
ntuuko 3
nu 3
nyeenya 3
obagamba 3
obubalagaze 3
obulamu 3
obusongezo 3
obusungu 3
obuyinike 3
obwakabaka 3
ogutunuulira 3
ogwa 3
okubeera 3
okukankana 3
okukungubagira 3
okulwanyisa 3
okunene 3
okunyaga 3
okuvuga 3
okuwuuma 3
oligalamiririra 3
oligwa 3
olimanya 3
oluggi 3
olulimi 3
olyetikka 3
omugga 3
omungi 3
omuzingo 3
owonyezza 3
oyogera 3
puti 3
seeba 3
sidoni 3
talusiisi 3
tanula 3
tolirema 3
wali 3
yakobo 3
yenna 3
yogera 3
zisanze 3
a 2
abaaleetanga 2
ababeetoolodde 2
abagezigezi 2
abakuumi 2
abaliko 2
abavuzi 2
abawala 2
abayitamu 2
abeebagadde 2
abikkako 2
afaanana 2
agali 2
ajja 2
akaloosa 2
akatono 2
akawungeezi 2
akyuka 2
akyukanga 2
alabuse 2
aleme 2
ali 2
alibatiisa 2
alimasi 2
alitta 2
alizirunda 2
amabi 2
amagamba 2
amalobo 2
amalungi 2
amaziga 2
anaabanga 2
antwalayo 2
anyaga 2
anzisa 2
asuli 2
atakyuka 2
atalabuka 2
awamu 2
awulira 2
ayogedde 2
baabeera 2
baana 2
baasaasaanyizibwa 2
baawanikanga 2
bafa 2
bafuta 2
bagalamidde 2
bajja 2
bajjajjammwe 2
bakabona 2
bakoze 2
balagirwa 2
balibaako 2
balibeera 2
balikankana 2
balikungubaga 2
balisowola 2
balitanula 2
baliva 2
bamuleseewo 2
banaabanga 2
banaalyanga 2
bangi 2
bannamuziga 2
bano 2
bansobya 2
basani 2
batabani 2
batabikola 2
battiddwa 2
bawulira 2
bbugwe 2
bigambo 2
bigo 2
bingi 2
bino 2
birikankana 2
bisatu 2
bityo 2
biwonvu 2
bukulu 2
buliba 2
buntu 2
buwesiyopya 2
bwakyo 2
bwali 2
byayo 2
byayolekera 2
byombo 2
ddira 2
ddungu 2
ebbanga 2
ebbi 2
ebibegabega 2
ebibi 2
ebikumi 2
ebinuulo 2
ebinywa 2
ebire 2
ebirijjukirwa 2
ebisenge 2
ebisibo 2
ebitomera 2
ebiwoobe 2
ebiwundu 2
ebyalo 2
ebyambalo 2
ebyewalula 2
ebyombo 2
ebyoya 2
eddiba 2
effeeza 2
effulungu 2
efulayimu 2
eggumba 2
eginywa 2
egyali 2
ekibi 2
ekifunvu 2
ekikomo 2
ekiriyitamu 2
ekirungi 2
ekkulu 2
ekyalekebwawo 2
ekyengera 2
emiggo 2
emiryango 2
empeera 2
empitambi 2
empologoma 2
emyezi 2
enda 2
endagaano 2
eneebanga 2
enfaanana 2
engatto 2
enjala 2
enjegere 2
enjogera 2
enjuki 2
enkasi 2
enkomerero 2
enkuffiira 2
ennanga 2
ennene 2
ennyuma 2
eno 2
ensibuka 2
ensiisira 2
ente 2
ento 2
eriba 2
esatu 2
ettaka 2
eyalekebwangawo 2
ezaalekebwawo 2
ezaava 2
gaago 2
galizimbibwa 2
ggulu 2
ggye 2
gireme 2
gunaabanga 2
guno 2
gunsitula 2
gwakyo 2
gwali 2
gwammwe 2
gwamu 2
gyago 2
gyaliko 2
gyange 2
gyayo 2
kaabwe 2
kabonero 2
kamonugoogi 2
kaniki 2
kaseera 2
kebali 2
kerubi 2
kibagwanira 2
kibi 2
kigere 2
kigo 2
kimu 2
kinene 2
kino 2
kintu 2
kiririnnya 2
kirituuka 2
kitala 2
kitundu 2
kkumi 2
kulya 2
kunyaga 2
kutegerangako 2
kwange 2
kyenda 2
kyoliva 2
leero 2
lubalama 2
ludi 2
lukalu 2
luli 2
lulwe 2
luno 2
lusenyi 2
lwayo 2
lwazi 2
lyabanga 2
lyali 2
maanyi 2
madaala 2
magumba 2
makubo 2
malaalo 2
mateeka 2
mazzi 2
mbakisa 2
mbakuŋŋaanyizza 2
mbalinnyisa 2
mifuubeeto 2
migonjo 2
mirembe 2
miti 2
mmere 2
mpitambi 2
mpulidde 2
mpulira 2
mufuubeeto 2
muganda 2
mujje 2
mukuŋŋaane 2
mukyuke 2
mulangira 2
mulikola 2
mulimu 2
mulirimibwa 2
muliro 2
mulisigibwa 2
mulungi 2
mulya 2
mulyoka 2
munne 2
munyago 2
munywa 2
musumba 2
muti 2
mutwe 2
mutyo 2
muvumisizza 2
mwalimu 2
mwogera 2
mwoyo 2
ndibafuula 2
ndibateeka 2
ndibateekako 2
ndibikka 2
ndiggya 2
ndigololera 2
ndigulumizibwa 2
ndigwisa 2
ndikikola 2
ndikuleka 2
ndikutabaaza 2
ndikuwaayo 2
ndikuzzaayo 2
ndikyukira 2
ndimala 2
ndimalawo 2
ndimuwaayo 2
ndinoonya 2
ndiragaana 2
ndireeta 2
ndisala 2
nditukuzibwa 2
ndituukiriza 2
ndiwa 2
ndiweereza 2
ndizikiriza 2
ndyasamya 2
ndyaza 2
ndyemanyisa 2
ndyoka 2
nfudde 2
njogezezza 2
nku 2
nkufudde 2
nkumalamu 2
nkusuula 2
nnaku 2
nnawandagala 2
noofu 2
nsaasira 2
nsalo 2
nsalosalo 2
nsolo 2
ntebe 2
ntiisa 2
obeere 2
obugabo 2
obugoogwa 2
obulabe 2
obungi 2
obuperusi 2
obusaale 2
obusika 2
obusozi 2
obutabaawo 2
obutaggwaawo 2
obutaka 2
obuvanjuba 2
obuwala 2
ofaanana 2
ofuuse 2
ogende 2
oguli 2
ogusota 2
oguwandiikeko 2
ogwolekera 2
okubikka 2
okujja 2
okukukungubagira 2
okulabula 2
okuliibwa 2
okumasamasa 2
okusibibwa 2
okusuubula 2
okutuukiriza 2
okutwalira 2
okuwalana 2
okuwulukuka 2
okwo 2
okwonoona 2
olabula 2
olema 2
olifa 2
oligalamira 2
olijja 2
olugera 2
olumu 2
olutabaalo 2
oluwandaggirize 2
oluzibu 2
olwazi 2
omenyeka 2
omubiri 2
omubisi 2
omugambe 2
omuggya 2
omugonjo 2
omukisa 2
omulagulireko 2
omulala 2
omulungi 2
omusuubuzi 2
otomanyi 2
otuuke 2
otuukiridde 2
owulire 2
oyonoona 2
pasulo 2
sayiri 2
sevene 2
sikola 2
singa 2
sini 2
teryenkanankana 2
togaluma 2
toobengawo 2
wabula 2
walibaawo 2
wammwe 2
watonderwa 2
wayogera 2
weddirire 2
yaazo 2
yakola 2
yavani 2
yenkana 2
yusufu 2
zaafuuka 2
zaakyo 2
zaasaasaanira 2
zisaasaana 2
