mu 467
ku 322
n 297
nga 246
nti 162
ne 148
e 127
y 100
ng 92
wa 81
era 77
abantu 65
bwe 58
ssente 49
bw 48
kya 47
ya 47
gavumenti 46
kino 46
kkooti 42
poliisi 41
ky 40
buli 39
z 39
uganda 38
eno 37
ye 36
w 35
lya 32
ate 31
b 30
by 29
ez 29
ba 28
amateeka 27
bano 27
gwa 27
akulira 26
bino 26
gye 26
kyokka 26
za 26
2021 25
abaana 25
abadde 25
okukola 25
ono 25
we 25
agamba 23
bya 22
kubanga 22
minisitule 22
naye 22
sipiika 22
aba 21
olw 21
yagambye 21
ategeezezza 20
gwe 20
minisita 20
okulaba 20
wabula 20
gy 19
lw 19
nrm 19
ow 19
000 18
bantu 18
be 18
gw 18
oluvannyuma 18
ssentebe 18
abatuuze 17
eby 17
kye 17
nnyo 17
town 17
wano 17
abamu 16
disitulikiti 16
dr 16
eky 16
enjawulo 16
kwe 16
alina 15
g 15
okuva 15
olwo 15
wamu 15
20 14
abalala 14
bulungi 14
ebintu 14
ebirala 14
ekitundu 14
eri 14
erina 14
ey 14
ggwanga 14
guno 14
kasangati 14
kati 14
lwa 14
maaso 14
november 14
omusango 14
omusolo 14
agambye 13
asabye 13
byonna 13
council 13
emyaka 13
ettaka 13
jjengo 13
lino 13
okuli 13
okwongera 13
omulimu 13
palamenti 13
zino 13
3 12
abakulembeze 12
baabwe 12
bye 12
ebibiina 12
engeri 12
kuba 12
kw 12
naddala 12
nsonga 12
omugenzi 12
omuntu 12
owa 12
yabadde 12
yategeezezza 12
akakiiko 11
amazzi 11
asaba 11
bagamba 11
ddala 11
emmotoka 11
kasasiro 11
kitundu 11
nsubuga 11
okusasula 11
okutuusa 11
omu 11
omuwandiisi 11
si 11
yiga 11
ze 11
abavubuka 10
anyi 10
balina 10
bonna 10
bwa 10
ebitundu 10
ekifo 10
emu 10
emyooga 10
ga 10
group 10
ham 10
kkanso 10
ly 10
okwewala 10
omuli 10
omwana 10
vision 10
wakati 10
100 9
amasomero 9
bagenda 9
eggwanga 9
ensiring 9
k 9
kajubi 9
kampala 9
kimu 9
kkampuni 9
muwonge 9
na 9
ngeri 9
nkola 9
nup 9
oba 9
obukadde 9
oulanyah 9
wakiso 9
yali 9
1 8
10 8
ababaka 8
abayizi 8
agenda 8
bali 8
bungi 8
ekibiina 8
ekigimusa 8
ekitongole 8
ekkanisa 8
emisolo 8
ennyumba 8
ensonga 8
gano 8
kayunga 8
kazimba 8
kenya 8
kifo 8
masomero 8
obuyinza 8
okuba 8
okugenda 8
omulambo 8
omumyuka 8
world 8
4 7
ali 7
amagezi 7
awo 7
basobole 7
bbomu 7
byabwe 7
ebigimusa 7
ebyenjigiriza 7
ebyokwerinda 7
eddagala 7
ekikolwa 7
ekyo 7
emirimu 7
empaka 7
endala 7
enkulu 7
ensi 7
gya 7
ka 7
kibiina 7
kyengera 7
mutungo 7
obubonero 7
okukwata 7
okutandika 7
okuzimba 7
okwewola 7
omukyala 7
omuyizi 7
school 7
ssomero 7
waliwo 7
yasabye 7
yonna 7
15 6
19 6
50 6
ab 6
abakozi 6
abalamuzi 6
abavuzi 6
abo 6
africa 6
afuna 6
amawulire 6
amya 6
baabadde 6
bba 6
bitundu 6
bukedde 6
buno 6
cup 6
dtb 6
ekola 6
embeera 6
emigabo 6
emisango 6
emiti 6
emyezi 6
ennaku 6
essomo 6
ggoolo 6
kano 6
katunywane 6
kitebe 6
kukola 6
kyabwe 6
lwe 6
mmande 6
mukiibi 6
musango 6
mwaka 6
mwe 6
mwezi 6
namirembe 6
obuvunaanyizibwa 6
ogw 6
oku 6
okunoonyereza 6
okwogera 6
oluk 6
olwa 6
omubeezi 6
omwaka 6
pulogulaamu 6
rev 6
s 6
sheikh 6
ssaawa 6
todwong 6
ttaka 6
ttiimu 6
ura 6
zooni 6
zuena 6
11 5
12 5
13 5
18 5
2 5
5 5
9 5
abali 5
abawagizi 5
abazadde 5
akola 5
amaanyi 5
amasasi 5
andrew 5
awaka 5
awamu 5
baana 5
bakola 5
balimwezo 5
bangi 5
bannayuganda 5
batandise 5
batuuze 5
bbaluwa 5
bbiri 5
budde 5
buddo 5
bulijjo 5
church 5
dda 5
december 5
ebibuuzo 5
ebigezo 5
ebiri 5
ebya 5
ekigendererwa 5
endiirwa 5
endwadde 5
enkalakkalira 5
ensimbi 5
enva 5
eryo 5
esatu 5
essimu 5
eya 5
fayiro 5
fred 5
ge 5
ggoobi 5
john 5
kalungu 5
kamuli 5
kasolo 5
katonda 5
kcca 5
kigambibwa 5
kiri 5
kkanisa 5
kkiro 5
kkono 5
kuliko 5
lubaga 5
lukiiko 5
luyombya 5
lwokuna 5
maka 5
mali 5
matovu 5
mayanja 5
mbeera 5
muganzi 5
muntu 5
myaka 5
nabo 5
nakaseke 5
nansana 5
nnamba 5
nnyumba 5
obuzibu 5
obw 5
october 5
okugeza 5
okukuba 5
okumala 5
okusinziira 5
okuteekawo 5
okwenyigira 5
omukulu 5
omulamuzi 5
peter 5
pulezidenti 5
pulojekiti 5
rdc 5
robert 5
sacco 5
singa 5
so 5
ssinga 5
wadde 5
wooteeri 5
zonna 5
00 4
29 4
30 4
45 4
60 4
ababadde 4
abakungu 4
abakyala 4
abalina 4
abasomesa 4
abazigu 4
abeera 4
amaka 4
asula 4
ategeeza 4
awa 4
awakanya 4
awatali 4
azimba 4
baagala 4
baggya 4
banka 4
bannamawulire 4
banne 4
basobola 4
bendera 4
bokisi 4
booda 4
bp 4
buganda 4
butya 4
bwabwe 4
corona 4
cranes 4
ddiini 4
ddwaaliro 4
ebitongole 4
ekiragiro 4
ekiwandiiko 4
ekizibu 4
ekya 4
emitwalo 4
empandiika 4
enkola 4
enteekateeka 4
erya 4
eyali 4
eza 4
famire 4
galiwango 4
ggombolola 4
gino 4
gubadde 4
joseph 4
kapeeka 4
kasirye 4
kawaala 4
kibinja 4
kibuga 4
kirungi 4
kisaawe 4
kkansala 4
kkomera 4
kufuna 4
kwa 4
liita 4
luno 4
luwalira 4
maama 4
mbabazi 4
mmotoka 4
mulimu 4
munisipaali 4
namugongo 4
nnaalongo 4
ntambi 4
obulwadde 4
obusiraamu 4
okubadde 4
okubeera 4
okudda 4
okufuna 4
okuggya 4
okukozesa 4
okulya 4
okumanya 4
okutaasa 4
okutuuka 4
okuwa 4
olukiiko 4
omusaayi 4
omuwendo 4
omwogezi 4
pasita 4
patrick 4
ple 4
rwanda 4
sangobay 4
sikulaapu 4
ssaayansi 4
ssekindi 4
taata 4
takisi 4
twesigye 4
u20 4
udc 4
umeme 4
uneb 4
vermi 4
victoria 4
wansi 4
wiiki 4
women 4
yakkaatirizza 4
yeebazizza 4
yenna 4
yunivaasite 4
zaabwe 4
zigenda 4
0-0 3
14 3
2022 3
22 3
25 3
27 3
40 3
abaali 3
abakulira 3
abakulu 3
abasajja 3
abaserikale 3
abasoba 3
abazannyi 3
ag 3
agolola 3
akasente 3
akawungeezi 3
akawunti 3
akiikirira 3
akwatidde 3
alabula 3
amagye 3
amakubo 3
amasannyalaze 3
amayisa 3
amutta 3
amyuka 3
anti 3
asobole 3
asomesa 3
atwala 3
atyo 3
avunaanyizibwa 3
ayagala 3
ayogera 3
azze 3
baali 3
babaddemu 3
babbye 3
bagende 3
bajeti 3
bakira 3
bakkansala 3
bakozesa 3
banamagoye 3
basabye 3
baserikale 3
bassentebe 3
batadde 3
bategeezezza 3
bavubuka 3
bayinza 3
bazadde 3
bbanga 3
bbanka 3
bikolebwa 3
bikolwa 3
biseera 3
bishop 3
bizinensi 3
bo 3
bobi 3
boodabooda 3
bubi 3
bukadde 3
bulamu 3
bumenyi 3
busuulwa 3
buvuddeko 3
buyinza 3
bwonna 3
charles 3
clerk 3
covid 3
covid-19 3
dduuka 3
development 3
dollo 3
ebadde 3
ebbaafu 3
ebimu 3
ebiragiro 3
ebizimbisibwa 3
ebyenvuba 3
ebyuma 3
eddiini 3
eggombolola 3
eggulo 3
egy 3
egya 3
ejja 3
ekibuga 3
ekika 3
ekikulu 3
ekintu 3
ekiseera 3
ekisooka 3
emikutu 3
emirala 3
emisanvu 3
emmaali 3
empenda 3
empewo 3
enabu 3
endowooza 3
english 3
engoye 3
enguudo 3
ennyo 3
ery 3
ezibadde 3
fauzia 3
ffamire 3
gav 3
genda 3
godfrey 3
gonna 3
gwonna 3
gyayo 3
gyonna 3
hajji 3
henry 3
house 3
jinja 3
jjajjaawe 3
junior 3
kabanda 3
kabuga 3
kafiyu 3
kalali 3
kalifoomu 3
kalulu 3
kansala 3
kasanya 3
kateregga 3
kiddiridde 3
kigo 3
kinnya 3
kitaawe 3
kitaka 3
kitongole 3
kiyambe 3
kizibu 3
kizimbe 3
kobusingye 3
kubeera 3
kugenda 3
kunoonyereza 3
kyalo 3
kyandibadde 3
kyetaagisa 3
kyotera 3
lira 3
liri 3
luguudo 3
lutalo 3
lutuula 3
lwaki 3
lwokutaano 3
lye 3
mabala 3
makerere 3
male 3
market 3
masaka 3
mbaziira 3
mberaze 3
mmeeya 3
moses 3
mpola 3
msgr 3
mufulejje 3
muganga 3
mukasa 3
mukono 3
mukyala 3
mupiira 3
musenero 3
musinguzi 3
musomesa 3
mutendera 3
mutwe 3
nabukenya 3
najjemba 3
nakawa 3
nambassa 3
nasser 3
national 3
nayo 3
ndidde 3
ndyanabo 3
nnaku 3
nsi 3
nteekateeka 3
ntikko 3
obubaka 3
obudde 3
obujulizi 3
obulamu 3
obumenyi 3
obutonde 3
obuwumbi 3
of 3
ofiisi 3
ogujja 3
okubala 3
okuddukanya 3
okufa 3
okukolera 3
okukyusa 3
okuleeta 3
okulonda 3
okulung 3
okusibwa 3
okusimba 3
okusooka 3
okusunsulamu 3
okutema 3
okutta 3
okuttibwa 3
okuvaayo 3
okuwangula 3
okuweereza 3
okuwulira 3
okuyamba 3
okwewandiisa 3
olina 3
oluvanyuma 3
omubaka 3
omuggalo 3
omulabirizi 3
omulala 3
omusika 3
omuwabuzi 3
osobola 3
otadde 3
p7 3
paasita 3
qatar 3
ronald 3
sako 3
samuel 3
sarah 3
shamim 3
south 3
ssaava 3
ssabalabirizi 3
ssande 3
ssebuggwawo 3
ssenga 3
sseninde 3
ssenninde 3
sserunjogi 3
ssi 3
sst 3
st 3
t 3
tewali 3
the 3
trucks 3
ttaano 3
ttivvi 3
tugenda 3
university 3
waabwe 3
waakiri 3
wanyama 3
wasajja 3
wasiiye 3
yaayo 3
yadde 3
yakola 3
yawadde 3
yayongeddeko 3
yeeyama 3
zitambula 3
zzooni 3
120 2
16 2
2020 2
26-28 2
35 2
400 2
478c 2
49 2
4acc 2
6 2
79d0 2
8 2
87 2
90fb56cbac8b 2
9a42 2
9ffd19f74e78 2
a 2
aanya 2
ab9d 2
abaagala 2
ababba 2
abagamba 2
abagenda 2
abajulizi 2
abakristaayo 2
abakristu 2
abakugu 2
abakulembeddwamu 2
abalabula 2
abalagiddwa 2
abalimi 2
abalimu 2
abalowooza 2
abamenyi 2
abasaba 2
abasinga 2
abasukka 2
abatuula 2
abavuga 2
abawa 2
abayindi 2
abazirakisa 2
abeegattira 2
abooluganda 2
afa 2
agalina 2
agambibwa 2
agasseeko 2
agenze 2
agezezzaako 2
agwa 2
aisha 2
ajulira 2
ak 2
akawuka 2
akawunta 2
akozese 2
akulembeddemu 2
akwasa 2
akyali 2
alaga 2
alagira 2
alfonse 2
aliko 2
aloopa 2
alowooza 2
amabanja 2
amaggombolola 2
amalaalo 2
amaliri 2
amaze 2
among 2
amukuba 2
annet 2
answer 2
anthony 2
area 2
asimbiddwa 2
asinzidde 2
asisinkanye 2
asobola 2
asomerwa 2
asomeserezza 2
atandike 2
atandise 2
atenderezza 2
atuuka 2
augustine 2
awadde 2
awangudde 2
ayiseemu 2
ayita 2
ayogerako 2
ayongeddeko 2
aziikiddwa 2
b3ff 2
b7e8bc46 2
baasudde 2
baba 2
babiri 2
babirye 2
badduka 2
baffe 2
bafuna 2
bafungizza 2
bafunyeemu 2
bagambye 2
bagenze 2
bajja 2
bajjeti 2
bakansala 2
bakka 2
bakkaanyizza 2
bakolamu 2
bakulembeddwa 2
bakulembeze 2
bakung 2
bakyala 2
bakyalina 2
baleme 2
balidde 2
balowooza 2
bamufunire 2
bamusaba 2
bamutegeeza 2
bank 2
bannaddiini 2
bannakibiina 2
bannamateeka 2
banyaga 2
barbra 2
basaba 2
basketball 2
basomesa 2
batuule 2
batuuse 2
bavubi 2
bawagire 2
bayambe 2
bbaasi 2
bbago 2
beddizza 2
beekwasa 2
beemulugunya 2
ben 2
bibadde 2
bibiina 2
bigezo 2
bigimusa 2
bijja 2
bintu 2
biwago 2
brown 2
bubaka 2
bugenyi 2
bukya 2
bukyamu 2
bulabe 2
bulabirizi 2
butambala 2
butereevu 2
buvunaanyizibwa 2
buwumbi 2
buyambi 2
byakutaaga 2
byali 2
byogeddwa 2
byomugabe 2
cecafa 2
championship 2
co 2
college 2
commonwealth 2
corporation 2
covid19 2
ddagala 2
ddakiika 2
dos 2
ebbago 2
ebbaluwa 2
ebbanga 2
ebbanja 2
ebidduka 2
ebikolwa 2
ebikwata 2
ebikwekweto 2
ebirowoozo 2
ebiruma 2
ebizibu 2
ebizungu 2
ebyenfuna 2
ebyensimbi 2
ebyo 2
ebyobulamu 2
ebyobulimi 2
ebyobusuubuzi 2
edda 2
egula 2
ekibinja 2
ekibonerezo 2
ekibuuzo 2
ekigezo 2
ekijimusa 2
ekikula 2
ekimu 2
ekirabo 2
ekirala 2
ekireetedde 2
ekiro 2
ekiviirako 2
ekiyimiriza 2
ekiyitibwa 2
ekkubo 2
ekkulu 2
ekole 2
ekyomukaaga 2
embaawo 2
embizzi 2
emipya 2
emirembe 2
emirimo 2
emiriraano 2
emmundu 2
empapula 2
enduulu 2
engulu 2
enkozesa 2
enkulaakulana 2
entebe 2
entuufu 2
enyo 2
esobola 2
essaza 2
etaano 2
eteeka 2
eti 2
etwala 2
eyabadde 2
eyagala 2
eyakiikiridde 2
eyiiriddwa 2
eyita 2
eyo 2
eyongedde 2
ezannye 2
ezireetebwa 2
eziri 2
ezzeeyo 2
fd8c1989 2
fdc 2
ffeffekka 2
fifa 2
gagenda 2
gamba 2
gayaza 2
geometry 2
ggwanika 2
ggwe 2
guild 2
gujja 2
gulaamu 2
ibanda 2
ict 2
ii 2
iii 2
intergrated 2
issa 2
janet 2
javes 2
jimmy 2
journalists 2
joyce 2
kabojja 2
kaducu 2
kaija 2
kakiri 2
kalenda 2
kalidinaali 2
kalifani 2
kalimbwe 2
kamwokya 2
kansiime 2
kanso 2
kapiteeni 2
kaseera 2
kasente 2
kaseruzi 2
kasita 2
kasoobo 2
kasubi 2
katikkiro 2
katumba 2
kawuma 2
kazigo 2
kazo 2
kigali 2
kigezo 2
kijja 2
kiro 2
kiruuta 2
kirwadde 2
kiseera 2
kitegeeza 2
kitende 2
kiti 2
kitimba 2
kityo 2
kiva 2
kiwedde 2
kkubo 2
kubulankanya 2
kuddamu 2
kuddukanya 2
kugwa 2
kukkiriza 2
kulaga 2
kulonda 2
kumpi 2
kumumanya 2
kusabira 2
kusalawo 2
kuteeka 2
kuva 2
kwekyo 2
kyagulanyi 2
kyokuddamu 2
lawrence 2
leero 2
looya 2
ltd 2
ludda 2
lugendo 2
lumunye 2
lwokusatu 2
lyantonde 2
makindye 2
makubo 2
makya 2
maliri 2
manya 2
mark 2
mary 2
maserengeta 2
mateeka 2
mathematics 2
mawula 2
mbi 2
michael 2
migabo 2
migadde 2
mingi 2
minista 2
misango 2
mitendera 2
mivuyo 2
mmaali 2
mofped 2
mohammed 2
moriku 2
mubaka 2
muddwaliro 2
mugatte 2
mugenzi 2
mugera 2
muhammad 2
mukaaga 2
mukisa 2
mukwano 2
mulamu 2
munyonyo 2
musajja 2
museveni 2
musolo 2
mutemo 2
mutindo 2
mutungi 2
muvuzi 2
muwema 2
muwendo 2
mw 2
myala 2
nabukeera 2
nabweru 2
nakidde 2
nakyo 2
nalubwama 2
namagabi 2
nambooze 2
nankya 2
nateete 2
nazo 2
newankubadde 2
nguudo 2
njeru 2
nkomyo 2
nkuba 2
nnyingi 2
north 2
nsangi 2
nsiko 2
nsiring 2
nsobi 2
obeera 2
obubi 2
obucaafu 2
obukugu 2
obukulembeze 2
obulungi 2
obulunzi 2
obupya 2
obusa 2
obusajja 2
obutemu 2
obuweereza 2
obwa 2
obwannanyini 2
obwavu 2
obwegassi 2
ogukunganyizibwa 2
oguli 2
okubafunira 2
okubatuusaako 2
okubitwala 2
okubulankanya 2
okuddamu 2
okuddayo 2
okufaayo 2
okufuba 2
okugezaako 2
okuggulawo 2
okuggwamu 2
okuggyako 2
okugimusa 2
okugizza 2
okugoberera 2
okukakasa 2
okukolebwa 2
okukulakulanya 2
okukwatagana 2
okukwatibwa 2
okulabirira 2
okulekera 2
okulondoola 2
okulwanyisa 2
okumusingisa 2
okunoonya 2
okuntiko 2
okunya 2
okunywa 2
okusimulayo 2
okusinga 2
okusisinkana 2
okusobola 2
okusolooza 2
okusoma 2
okusomera 2
okusomesa 2
okussa 2
okutambuza 2
okutangira 2
okuteeka 2
okutereka 2
okutuukiriza 2
okutwala 2
okuvaako 2
okuwaayo 2
okuweebwa 2
okuwola 2
okuyimirizaawo 2
okuzannya 2
okwekolamu 2
okwekubira 2
okwesogga 2
okwetaba 2
okwetegereza 2
okwettanira 2
okwokya 2
oluddako 2
olukujjukujju 2
olumu 2
olungereza 2
oluva 2
olwatudde 2
olwekyo 2
omukolo 2
omukozi 2
omukugu 2
omukwano 2
omuluka 2
omulundi 2
omusamize 2
omusomesa 2
omuteebi 2
omuti 2
omutono 2
omutuuze 2
omutwe 2
omuvubuka 2
omuyiggo 2
omuzannyo 2
omuzzukulu 2
omwenge 2
omwezi 2
ossa 2
osseemu 2
owinyi 2
p6 2
paul 2
polojekiti 2
preparotory 2
president 2
qualifiers 2
rally 2
recruitment 2
resort 2
road 2
ruparelia 2
saayansi 2
sam 2
satifikeeti 2
science 2
sd 2
sekinomu 2
semwogerere 2
senfuma 2
sente 2
set 2
she 2
silverbacks 2
siriimu 2
siteegi 2
sizoni 2
ssaako 2
ssaala 2
ssabakristu 2
ssemateeka 2
ssemwogerere 2
sserubogo 2
stephen 2
sudhir 2
taano 2
taliiwo 2
tampeko 2
tea 2
tebasobola 2
tegegn 2
tekinologiya 2
terina 2
teyakoma 2
timothy 2
tonnaba 2
ttabi 2
ttakka 2
tugumisiriza 2
tuyinza 2
tv 2
wabaddewo 2
wamala 2
weewoola 2
west 2
who 2
wiikendi 2
wilberforce 2
wine 2
yaabwe 2
yafuna 2
yagaanyi 2
yagenze 2
yagololako 2
yakuutidde 2
yaleka 2
yandibadde 2
yannyonnyodde 2
yasindirira 2
yasinzidde 2
yasooka 2
yasoose 2
yazze 2
yeewuunyizza 2
yennyamidde 2
yiika 2
yo 2
yonas 2
yunivasite 2
zaayo 2
zacchy 2
zawedde 2
zisobola 2
zona 2
