num 977
mu 646
nti 237
ku 236
era 206
nga 198
na 189
ne 170
abantu 138
kkumi 130
bayibuli 125
naye 120
kristo 115
no 113
okukola 108
oba 103
katonda 92
ssatu 92
emu 91
bo 90
ekyo 89
bwe 88
wa 84
gye 79
bbiri 76
okuba 68
gya 65
kya 65
yakuwa 65
omuntu 64
omu 63
kye 62
aba 61
bya 61
ye 60
ba 59
mukaaga 59
abalala 58
eyo 57
musanvu 56
omulabe 54
abiri 53
nge 52
ngo 52
bangi 51
embeera 51
eya 50
owa 50
ttaano 49
nnya 48
abo 47
kikumi 45
nnyo 44
ya 44
ebintu 42
ebya 42
endowooza 41
yokaana 41
okufuna 40
amagezi 38
ekya 38
obulimba 38
olwa 38
yesu 37
emirundi 36
ennyo 36
ate 35
mwenda 33
ngeri 33
buli 32
okukuyamba 32
akamwenyumwenyu 31
we 31
alina 30
amaanyi 30
bubiri 30
bulungi 30
gu 30
gumu 30
mutwalo 30
za 30
obulungi 29
bannamukadde 28
be 28
ebirowoozo 28
olwekyo 28
ekintu 27
engeri 26
eri 26
kiba 26
ndabika 26
omubiri 26
thomas 26
asatu 25
ekizibu 25
engero 25
essanyu 25
gwo 25
okuva 25
oyagala 25
yagamba 25
lya 24
si 24
dduyiro 23
ekituufu 23
emmere 23
kiseera 23
lwaki 23
erinnya 22
kubanga 22
mingi 22
mirundi 22
munaana 22
ka 21
kukola 21
oli 21
atasobola 20
bye 20
kakaaga 20
okutegeera 20
omwana 20
oyinza 20
yali 20
abaana 19
ebyo 19
lukumi 19
okumanya 19
okuwulira 19
wiiki 19
baba 18
date 18
enjigiriza 18
kisobola 18
kyokka 18
okwewala 18
arthur 17
bingi 17
ekiseera 17
ennungi 17
kiki 17
kwe 17
magezi 17
tusobola 17
wange 17
williams 17
abamu 16
bintu 16
birowoozo 16
bukadde 16
ebirungi 16
kyonna 16
leero 16
maaso 16
url 16
yaabwe 16
ze 16
bannabbi 15
bayinza 15
ekyokulabirako 15
mbeera 15
nabo 15
obulwadde 15
okubeera 15
okuyamba 15
omubuulizi 15
univ/art 15
univ_sqr_xl 15
bwabwe 14
ebigambo 14
eza 14
ga 14
kiyinza 14
kuba 14
lunaana 14
nsi 14
obujjanjabi 14
obukulu 14
okulaba 14
okulya 14
omwoyo 14
abakaddiye 13
abalabe 13
baava 13
bakkiriza 13
bantu 13
ddala 13
ekifuula 13
ennuŋŋamu 13
etukubiriza 13
jpg 13
kyange 13
okusoma 13
weegendereze 13
abalalaweereza 12
agamba 12
basobola 12
ebikwata 12
ekibiina 12
eraga 12
essira 12
fuba 12
kibiina 12
kiruubirirwa 12
kyo 12
mutima 12
nkumi 12
oluganda 12
oluusi 12
omunaala 12
omutume 12
ssaayansi 12
teekawo 12
waliwo 12
yawandiika 12
abaali 11
australia 11
awamu 11
awo 11
ayitibwa 11
byo 11
e 11
ekitiibwa 11
kungulu 11
lipoota 11
lumu 11
matayo 11
nnali 11
oku 11
okuddamu 11
okukozesa 11
omusanyufu 11
bina 10
bonna 10
bulamu 10
butuufu 10
byonna 10
egya 10
emeka 10
emyaka 10
eno 10
erimu 10
etubuulira 10
gwa 10
kwa 10
maka 10
mulabe 10
nnamaddala 10
oboolyawo 10
obwongo 10
okola 10
okubiri 10
okumalira 10
omusawo 10
tuli 10
wadde 10
weeteekamu 10
zabbuli 10
abajulirwa 9
abakristaayo 9
abasawo 9
balala 9
ebizibu 9
ekikwata 9
ekirala 9
emikutu 9
empuliziganya 9
enkolagana 9
ensi 9
ensonga 9
eryo 9
etali 9
fiji 9
ge 9
kamwenyumwenyu 9
kifo 9
kigambo 9
kiri 9
lusegere 9
lwe 9
maama 9
mary 9
mukwano 9
munda 9
ndowooza 9
nedda 9
nnungi 9
okukkiriza 9
okukosebwa 9
okutandika 9
okutuuka 9
omuwendo 9
otuuka 9
tufaayo 9
weereza 9
abakkolinso 8
abalwadde 8
abasaasaanya 8
amaaso 8
baabwe 8
bajjajjange 8
baliwo 8
bazadde 8
beebo 8
bugenderevu 8
bwo 8
ebiri 8
ekikyamu 8
ekisinga 8
ekizibugya 8
ekyama 8
ffe 8
kirabika 8
kisukkiridde 8
kitaffe 8
kityo 8
kizibu 8
kulaga 8
kusikiriza 8
kyasa 8
lup 8
mukyala 8
naawe 8
njigiriza 8
nsonga 8
obuyambi 8
okweggyamu 8
okweyisa 8
oluvannyuma 8
osobola 8
otyo 8
pawulo 8
peetero 8
ssaza 8
ssigala 8
western 8
yalina 8
abali 7
akabi 7
ana 7
baali 7
balungi 7
bassaako 7
bwa 7
byaffe 7
egamba 7
ekikulu 7
ekimala 7
ekitabo 7
embi 7
endabika 7
enteekateeka 7
esembayo 7
eŋŋanda 7
gyo 7
kitabo 7
kumpi 7
kyennyini 7
lunaku 7
mikwano 7
muganda 7
muntu 7
myaka 7
obo 7
obulamu 7
obwo 7
ogudde 7
ogwo 7
okumala 7
okunoonyereza 7
okusaba 7
okusigala 7
okuwummula 7
okwagala 7
omulimu 7
omutima 7
omutwe 7
oyimuse 7
ssaawa 7
timoseewo 7
wabula 7
wandyagadde 7
abafiripi 6
abakadde 6
abasibe 6
abatassaako 6
abatume 6
abayitibwa 6
ajja 6
alaba 6
amadiini 6
amazima 6
asobola 6
atya 6
ayinza 6
bajjanjabwa 6
bali 6
balina 6
basaasaanya 6
benkana 6
biruubirirwa 6
biseera 6
bugirimaani 6
bulaaya 6
bulagirizi 6
byabwe 6
byambalo 6
ebibiina 6
ebikulu 6
ebikweraliikiriza 6
ebimalamu 6
ebireeta 6
ebyasa 6
ebyawandiikibwa 6
ebyewuunyisa 6
ekiruŋŋamiziddwa 6
ekisukkiridde 6
ekyangu 6
endiga 6
ennyumba 6
esobola 6
eziyinza 6
firimu 6
gamba 6
guggyeemu 6
kabuga 6
kati 6
kireetedde 6
kuteekako 6
kyandeetera 6
maanyi 6
misege 6
mubiri 6
muwendo 6
nneewulira 6
nsanvu 6
okubayamba 6
okuggwaawo 6
okukifuula 6
okukolera 6
okulabika 6
okulabirira 6
okunoonya 6
okutuyamba 6
okuzikirizibwa 6
okwekyawa 6
okweraliikirira 6
olunaku 6
omukazi 6
omukuumissaayansi 6
omuwandiisi 6
oyo 6
pulintaweereza 6
richard 6
sindika 6
tebalina 6
tebatera 6
wagamba 6
yajja 6
yalabula 6
yalaga 6
abakazi 5
abakkolosaayi 5
abakukubiriza 5
abawere 5
abayinza 5
agasobola 5
ago 5
aguwa 5
ali 5
amangu 5
ayambadde 5
bakuwa 5
bamu 5
bamwetaaga 5
bandyonoonye 5
bannaabwe 5
bannamwandu 5
bannasayansi 5
basajja 5
basobodde 5
bawi 5
bbaluwa 5
biba 5
bibuuzo 5
bitundu 5
bukolamu 5
bukomi 5
bulijjo 5
bumanyirivu 5
busobozesa 5
butonde 5
ebyandivuddemu 5
edda 5
ekikristaayo 5
ekisoboka 5
ekitayonooneka 5
ekiyitibwa 5
ekyambalo 5
ekyangugya 5
emabega 5
engezi 5
engoye 5
enjiri 5
enkyukakyuka 5
esooka 5
etuwa 5
ezo 5
gasobola 5
ggulo 5
giraga 5
gwe 5
gyali 5
gyonna 5
invitati 5
ki 5
kijja 5
kikubeerera 5
kikuleetera 5
kikulu 5
kino 5
kintu 5
kitundu 5
kiwanvu 5
kubeerenga 5
kulekera 5
kulemenga 5
kutubuulira 5
kwammwe 5
kyangu 5
limu 5
lowooza 5
magazini 5
magdalena 5
makya 5
mize 5
musawo 5
mwawulira 5
nnuŋŋamu 5
nsolo 5
obumuviirako 5
obunyiikivu 5
obusobozi 5
obutasobola 5
ofube 5
ogenda 5
ogezaako 5
ogu 5
okubawa 5
okugirya 5
okukulemesa 5
okumpi 5
okussa 5
okutwetaagisa 5
okwekutula 5
okwerungiya 5
okwoleka 5
olemereddwa 5
olubereberye 5
olupapula 5
olwo 5
omuteefu 5
omuwombeefu 5
onookoleramu 5
oteekateeka 5
oyoya 5
siima 5
tebaawo 5
tebeetaaga 5
tekoma 5
tetubuulira 5
tobasuubiramu 5
togireeta 5
tracts 5
tubeera 5
tusaanidde 5
tutera 5
tweteekamu 5
waka 5
wateeseteese 5
weewale 5
wesley 5
whitton 5
yabatonda 5
yasaba 5
yatutonda 5
yawunda 5
zitegeke 5
abaafulumya 4
ababalabirira 4
abalina 4
abatali 4
abayimbi 4
abayizi 4
abeetoowaze 4
addamu 4
agenda 4
agwa 4
akaali 4
akali 4
akatambi 4
akimanyiiko 4
akola 4
akumwenyeza 4
akuwa 4
apo 4
atalina 4
ayagala 4
ayimuka 4
baasengukira 4
bafaayo 4
bagamba 4
bakatuuma 4
balabika 4
balabye 4
baleeta 4
banaayonoonera 4
bannaffe 4
basaanidde 4
basikiriza 4
basomye 4
bassa 4
batafaanaganya 4
bategeeze 4
batera 4
bato 4
bawulira 4
bisobola 4
bisse 4
bugenzi 4
bulwadde 4
buweereza 4
bwetaavu 4
creamne 4
dawudi 4
ddagala 4
ddi 4
ddungi 4
ebibuuzo 4
ebimu 4
ebiruubirirwa 4
ebiyamba 4
ebiyitibwa 4
ebizzaamu 4
egimu 4
ejja 4
ekibaleetera 4
ekifuulakyangugya 4
ekigambo 4
ekiriisa 4
ekirungi 4
ekitalo 4
ekitole 4
ekiyitibwabody 4
embatu 4
emisono 4
engatto 4
enkyusa 4
ennaku 4
ennyimba 4
envi 4
erya 4
etiisa 4
etumbulwa 4
eyeewuunyisa 4
eyinza 4
ezeesigika 4
ezikola 4
gunafuya 4
guno 4
imagekigamba 4
jjajja 4
john 4
kampuni 4
katono 4
ke 4
kibatwalira 4
kijjukire 4
kikula 4
kikusaaliza 4
kimuleetera 4
kinnoomu 4
kitaabwe 4
kitange 4
kivudde 4
kukolalugandassaayansi 4
kukuyambamu 4
kulongoosa 4
kunywa 4
kusooka 4
kutereeramu 4
kyaice 4
lusinga 4
lwenda 4
mitawaana 4
mukutu 4
muli 4
mulimu 4
muze 4
njagala 4
nkutendereza 4
nnagenda 4
nnakola 4
nnakolebwa 4
nnalina 4
nnasembayo 4
nnyinza 4
nsonda 4
ntya 4
nze 4
obukuviirako 4
obutaddamu 4
obutayosa 4
obuweerero 4
ogugamba 4
ogwa 4
okikkiriza 4
okuboggolera 4
okubuusa 4
okugwa 4
okukikola 4
okukoleddwa 4
okukuyambamu 4
okulemererwa 4
okumalirira 4
okumuyamba 4
okunguluekintu 4
okusinziira 4
okutuukako 4
okutuusa 4
okwambala 4
okwebaka 4
okwebuuza 4
okwemanyiiza 4
okweteerawo 4
okwogera 4
olaba 4
olet 4
olina 4
olubatu 4
olufiji 4
omaliridde 4
omukugu 4
omukuumiabantu 4
omukuumilwaki 4
omunwe 4
omutuukirivu 4
omwennyamivu 4
onooddukiramu 4
onswa 4
osobodde 4
ossa 4
otawaanyizibwa 4
oyogeramu 4
perth 4
samwiri 4
simuboggolera 4
singa 4
ssematalo 4
tebamanyi 4
tebasobola 4
tebeeyagala 4
tukola 4
vi 4
wabadde 4
waggulu 4
wasalawo 4
weebuuze 4
weeteekamulugandaweegendereze 4
yagezaako 4
yakobo 4
yakubiriza 4
yamala 4
yatandika 4
yeekweka 4
yonna 4
zeero 4
zo 4
zzaabu 4
aatawaanyizibwa 3
abaabaziyizanga 3
abaagala 3
abaamukyalira 3
ababa 3
ababafumbirwa 3
ababajjanjaba 3
ababaka 3
ababawasa 3
ababiri 3
abafuzi 3
abagoberezi 3
abajjira 3
abakatuliki 3
abakolera 3
abakugu 3
abalimba 3
abamwenyerezza 3
abasendasenda 3
abasirikale 3
abassaako 3
abassangako 3
abassessaloniika 3
abatafa 3
abatannavubuka 3
abatayatula 3
abategeevu 3
abato 3
abatwalamu 3
abavubuse 3
abawala 3
abaweereza 3
abayigiriza 3
abuzaabuza 3
agagirimu 3
agali 3
agattako 3
ajjukira 3
akaddiye 3
akimanyi 3
akweka 3
aleetedde 3
alowooza 3
amaze 3
amerika 3
ani 3
annyamba 3
asaasaanya 3
asobole 3
ateekako 3
atenderezebwa 3
ati 3
atyo 3
ayogeddwako 3
ayogera 3
baagala 3
baakwatibwangako 3
baaliwo 3
baasindikibwa 3
baatandika 3
baateranga 3
baatugaananga 3
baawuliranga 3
baayogera 3
babasigamu 3
babawa 3
babe 3
babeera 3
baffe 3
bafuba 3
bafuna 3
bajulirwa 3
bakabaka 3
bakulu 3
bakyawakanya 3
bakyewaggula 3
balabise 3
bamativu 3
banaatera 3
banazi 3
bandaga 3
bandijjidde 3
bano 3
bappaapa 3
basalawo 3
basanyufu 3
basiimibwa 3
bataddeko 3
bateekako 3
beekenneenya 3
beeyisamu 3
beeyita 3
bikwata 3
bino 3
birabika 3
biraga 3
biwandiiko 3
biyambye 3
bizinga 3
bubi 3
bukiikaddyo 3
bulabe 3
bulage 3
bumaze 3
butaliimu 3
buvanjuba 3
buyinza 3
bwesimbu 3
bweyongera 3
bweyongezi 3
byokka 3
ebafuula 3
ebakubiriza 3
ebbaluwa 3
ebbiri 3
ebikuteganya 3
ebirowoozo“nnakiraba 3
ebitundu 3
ebyasooka 3
eddiini 3
edrich 3
egikavvula 3
egikavvula”emyaka 3
egiri 3
ekibinja 3
ekigendererwa 3
ekika 3
ekikuganyula 3
ekinaavaamu 3
ekirabo 3
ekirina 3
ekitayatula 3
ekitundu 3
ekiwanvu 3
ekosa 3
ekyaluŋŋamizibwa 3
ekyase 3
ekyasooka 3
ekyatula 3
emibi 3
emikwano 3
emirembe 3
emirungi 3
emitima 3
emitindo 3
emize 3
endya 3
enkuŋŋaana 3
enneeyisa 3
ennyambye 3
entuufu 3
erabika 3
ereetedde 3
eremesa 3
etategeerekeka 3
etzsche 3
eviiriddeko 3
ewala 3
eyali 3
eyeeraliikiriza 3
eyitibwa 3
eyogera 3
ezandituleetedde 3
eziggiddwamuerinnya 3
ffenna 3
fri 3
gabakubiriza 3
gabuzaabuzizza 3
gagamba 3
gannyambye 3
gasaasaanyizza 3
gayamba 3
genda 3
gwaffe 3
gwange 3
harvard 3
ii 3
intaneeti 3
jiyoo 3
jw 3
kakwata 3
kalina 3
kamwenyumwenyuembeera 3
kannyamba 3
kasambula 3
kategeeza 3
kibeerera 3
kibuga 3
kikuganyula 3
kimu 3
kinaana 3
kinnyamba 3
kinnyambye 3
kinswaza 3
kiraga 3
kitegeezawadde 3
kiva 3
kiviirako 3
kizikiza 3
kkubo 3
kubuulira 3
kugamba 3
kuganyulwa 3
kukuganya 3
kukumwenyeza 3
kutulemesa 3
kuyinza 3
kwenyooma 3
kweraliikirira 3
kwosa 3
kyaliwo 3
kyanneewuunyisa 3
kyannyamba 3
kyanzizangamu 3
kyatuuka 3
laba 3
leeroleero 3
lingi 3
lisangibwa 3
lukya 3
lulimi 3
luther 3
luuyi 3
mangi 3
mangu 3
martin 3
masiya 3
mayiro 3
mikka 3
mpulira 3
mugaso 3
mujulirwa 3
mukugu 3
mulimba 3
musanyufu 3
mutabani 3
mutegeevu 3
mwekuume 3
mwesigwa 3
nayo 3
ndi 3
ngule 3
ni 3
nicole 3
nkambi 3
nkirabye 3
nnamukadde 3
nneetaaga 3
nneewuliramu 3
nnyomagdalena 3
nzekka 3
obufumbo 3
obukosa 3
obulabi 3
obuli 3
obulimu 3
obumuleetera 3
obunaawangaala 3
obusatu 3
obusika 3
obutaba 3
obutakola 3
obuto 3
obutuukirivu 3
obuvubuka 3
obuvunaanyizibwa 3
obwa 3
obwewagguzi 3
ofuula 3
ojja 3
okikola 3
okubaagala 3
okubaako 3
okubaawo 3
okubuulira 3
okugaana 3
okuganyula 3
okugatta 3
okukimanya 3
okukoppa 3
okukulaakulanya 3
okukuyambango 3
okukuyamba“abalamu 3
okukyukakyuka 3
okuleetera 3
okulemesa 3
okulengerera 3
okulimba 3
okulowooza 3
okuna 3
okunafuya 3
okungulu 3
okusanyusa 3
okusatu 3
okusikiriza 3
okusinza 3
okusobola 3
okusomangayo 3
okutaano 3
okuteekako 3
okuteekangako 3
okutereera 3
okutulemesa 3
okutuukanya 3
okuyita 3
okwaŋŋanga 3
okwegatta 3
okwennyamira 3
olabika 3
olemererwa 3
olulala 3
olulimi 3
olumu 3
olunyiriri 3
olunzizaamu 3
omala 3
omufirosoofo 3
omujeemu 3
omujeemu”yesu 3
omulala 3
omumalirivu 3
omuminsani 3
omunda 3
omuti 3
ons 3
org/lg 3
oteekako 3
owulira 3
oyolekagana 3
oyosaamu 3
payoniya 3
peter 3
phoebe 3
ravensbrück 3
ronald 3
so 3
ssessalonika 3
ssiri 3
tannawandiika 3
tategeerekeka 3
tebaali 3
tebabimalira 3
tebatunuulira 3
tebisobola 3
tebufuma 3
tekiva 3
tekyannyanguyira 3
telulijja 3
tewabanga 3
tewali 3
timothy 3
toddamu 3
tofuba 3
tokoowazuukukatokoowalugandatokoowa 3
tolinda 3
tubaamu 3
tulina 3
tulowooza 3
tutyo 3
twekenneenya 3
tweteeka 3
twewala 3
wabaawo 3
wamu 3
weekiri 3
weemanyiizizza 3
weeteekamuzuukukaweegendereze 3
weetegerezza 3
yabayita 3
yaggumiza 3
yakola 3
yalabulaabakristaayo 3
yalwangawo 3
yampuliriza 3
yankebera 3
yategeera 3
yatereeranga 3
yawandiikira 3
yayita 3
yayitanga 3
yazimba 3
yogerako 3
yokka 3
yunivasite 3
zaffe 3
zino 3
zisangibwa 3
zuukukaweegendereze 3
aamannya 2
abaakibeerangako 2
abagamba 2
abalamu 2
abalya 2
abantumu 2
abe 2
agamu 2
ai 2
aka 2
akaasimibwangamu 2
akabonero 2
akakaalukana 2
akatabo 2
akati 2
akayitibwa 2
akoppa 2
amakubo 2
amakulu 2
amalungi 2
amanyibwa 2
amwenya 2
asoma 2
ataano 2
ategeera 2
atwala 2
aweereza 2
aweereze 2
baabanga 2
baagenda 2
baagumira 2
baakoleranga 2
baakubaganyizanga 2
baalina 2
baalyanga 2
baamala 2
baayolekagana 2
bafuzi 2
baibuli 2
bakewell 2
bakola 2
bakoze 2
balabirirwa 2
ballarat 2
baweereza 2
bayitibwa 2
bbugumu 2
bible 2
biki 2
bikolebwako 2
bikozesebwa 2
bimaze 2
binoomunaala 2
biro 2
bisangibwa 2
bisatu 2
bitabo 2
bituyigiriza 2
bubaka 2
bugwanjubamu 2
bukiikakkono 2
bungereza 2
busobozi 2
buvunaanyizibwa 2
ddene 2
ddirisa 2
donnybrook 2
eba 2
ebbanga 2
ebibi 2
ebikolwa 2
ebisaanyizo 2
ebizimbe 2
ebyaleetera 2
ebyetaago 2
ebyokulabirako 2
egisinga 2
egyasooka 2
ekibuga 2
ekibuuzo 2
ekiddako 2
ekimusanyusizza 2
ekiri 2
ekitangaala 2
ekiyitibwafiji 2
ekozesa 2
ekyewuunyisa 2
emiti 2
eneetera 2
enjawulo 2
entalo 2
enzimba 2
eringi 2
esatu 2
etaano 2
eyafa 2
eyakozesa 2
eyeegaana 2
figi 2
fijiansekya 2
gaabyo 2
gakyusiddwa 2
gange 2
gatonnya 2
gavumenti 2
jjulaayi 2
jpgw 2
kaakano 2
kalgoorli 2
kaseera 2
kasobola 2
katharine 2
kayitibwazi 2
kikolawo 2
kikutwalidde 2
kimutwalira 2
kinnyonnyola 2
kireetawo 2
kirina 2
kirungi 2
kitaawe 2
kituuka 2
kitwakire 2
kizinga 2
kulabirira 2
kutuwa 2
kutuyamba 2
kuvvuunula 2
kuzimba 2
kyali 2
kyanafuya 2
kyatutonderwamu 2
kyenda 2
labaawake 2
lady 2
lakeba 2
lindsay 2
lwa 2
mubazzi 2
muwandiisi 2
mwaka 2
mwangu 2
mwannyinaze 2
mwe 2
mweraliikirivu 2
naffe 2
nnakyewa 2
nnawuliranga 2
nnayisibwa 2
nneeyisa 2
noovemba 2
ntonoko 2
observer 2
obugagga 2
obukadde 2
obulenzi 2
obungi 2
obutakoowa 2
obwenyi 2
obwesigwa 2
oguyanja 2
ogwakazibwako 2
okubibuulirako 2
okufunanga 2
okugamba 2
okulabiriramu 2
okulaga 2
okumalirizibwa 2
okumwenya 2
okunnyonnyola 2
okutegeka 2
okutta 2
okutuga 2
okutwalira 2
okuweereza 2
okuzikkiririzaamu 2
okwegendereza 2
okwewuunya 2
omukadde 2
omukulembeze 2
omusajja 2
omwami 2
omwenya 2
org 2
otomanyi 2
pacific 2
ssente 2
students 2
tebaagala 2
tebaba 2
tegwamubeerera 2
tokoowa 2
tonsuula 2
tower 2
tubalinako 2
tubatwala 2
tugambe 2
tugenda 2
tulabeyo 2
tutegeerera 2
tuweereza 2
twasisinkanyanga 2
victoria 2
waabwe 2
waaliyo 2
watch 2
wayiseewo 2
wazabbuli 2
weetegereze 2
yabiwandiika 2
yafa 2
yafiira 2
yagenda 2
yakwatibwako 2
yaliko 2
yanoonyerezaako 2
yanoonyerezanga 2
yasoma 2
yasookera 2
yateekangako 2
yaweereza 2
yayambako 2
yazaala 2
yeewaayo 2
yekka 2
yena 2
yenna 2
yerusaalemi 2
zaabuna 2
zaabwe 2
zeebigambo 2
