mu 1497
num 1396
nti 344
ne 289
ku 281
bbiri 275
na 226
nkumi 211
kkumi 195
abiri 185
gu 149
nga 148
okusoma 135
omunaala 134
bayibuli 133
obadde 133
okimanyi 133
era 126
omukuumi—ogu 122
ttaano 122
e 121
kibiina 118
abantu 105
ebiri 101
ekyo 97
bya 88
emu 88
ebyo 86
yesu 86
bwe 83
bubiri 80
edda 79
kya 78
ana 72
ebya 70
musanvu 67
nnya 67
abayisirayiri 64
ssatu 63
misiri 62
asatu 61
wa 61
gye 60
mwenda 57
yali 57
bwa 56
no 55
bukadde 54
mitwalo 54
ebibuuzo 49
okuba 49
we 49
bye 48
ebiva 47
nnyo 45
abalala 44
omu 44
baali 43
biseera 43
url 42
ba 41
okuva 41
eya 40
univ/art 40
univ_sqr_xl 40
ebirala 39
mukaaga 39
abo 38
ddala 38
naye 38
yakuwa 38
ebintu 36
ekya 36
ngo 36
nge 35
febwali 34
bo 33
kitundu 33
kye 33
munaana 33
abalalaweereza 32
gumu 32
katonda 31
kyokka 31
jpg 30
ki 30
mutwalo 30
yagamba 30
abamu 29
agamba 29
kyali 29
lwaki 29
lya 29
kiri 28
kiseera 28
ngeri 28
obulaga 28
ebikwata 26
eri 26
lunaana 26
ayitibwa 25
ensonga 25
ga 25
ntaana 25
okulya 25
omusajja 25
yawandiika 25
emmere 24
luganda 24
maaki 24
olwa 24
abaseemu 23
abayonaani 23
bisatu 23
bulungi 23
ddungu 23
gwa 23
kinaana 23
lukumi 23
muti 23
omuntu 23
ye 23
aba 22
bibiri 22
ekiseera 22
empologoma 22
kimu 22
maka 22
noovemba 22
yaliyo 22
berusazza 21
bikwatagana 21
bukakafu 21
ebikwatagana 21
ebitabo 21
ekibuga 21
lye 21
obukakafu 21
ya 21
za 21
amannya 20
bina 20
egamba 20
eggaali 20
kabaka 20
kirabika 20
nsi 20
waliwo 20
abaali 19
abaddu 19
babulooni 19
ekitabo 19
ekyokulabirako 19
emmaanu 19
emyaka 19
enjiri 19
ensolo 19
oba 19
taata 19
ago 18
bagamba 18
bitabo 18
ebyafaayo 18
ebyogerwako 18
eyo 18
leero 18
oggyeeko 18
omwesiyopiya 18
abaruumi 17
abayudaaya 17
agamu 17
bintu 17
eno 17
kityo 17
wadde 17
weereza 17
amazzi 16
awamu 16
baddu 16
basobola 16
be 16
bitundu 16
ekisinziiro 16
eyali 16
eyogera 16
mwaka 16
obulala 16
okusinziira 16
olwekyo 16
pulintaweereza 16
okumala 15
oluvannyuma 15
pawulo 15
baalina 14
bituufu 14
buli 14
date 14
ebitundu 14
ebyafaayoebyafaayo 14
ekitundu 14
enoengeri 14
gwe 14
jjuuni 14
lukka 14
lup 14
t 14
asobola 13
ate 13
bantu 13
bimu 13
ebitali 13
ebizuuliddwa 13
ekisinga 13
engeri 13
kyasa 13
nsonga 13
sindika 13
amatoffaali 12
basomi—noovemba 12
biranga 12
byali 12
byawandiikibwa 12
eggumba 12
entende 12
eryo 12
gaakubibwangamu 12
kiraga 12
kuv 12
lwa 12
lwatu 12
maayi 12
nkaaga 12
nnyingi 12
obwakabaka 12
okwagala 12
omukuumi 12
oyinza 12
tewali 12
timoseewo 12
bukiikakkono 11
buyonaani 11
ebyaliwo 11
ekigambo 11
ekiwandiiko 11
ekiyitibwa 11
emirundi 11
ensi 11
kikumi 11
mmere 11
muntu 11
mwe 11
nabonidasi 11
obukulu 11
obuwanvu 11
owa 11
pontiyo 11
yeriko 11
abawanika 10
amayiba 10
asiya 10
baalinanga 10
baaliyo 10
baaweebwanga 10
balina 10
bangi 10
bawakanya 10
bazadde 10
bukiikaddyo 10
buvunaanyizibwa 10
byogera 10
ebigambo 10
ebiweebwayo 10
ekimu 10
enjiibwa 10
isirayiri 10
jpgw 10
kigamba 10
kikwatagana 10
kirungi 10
kubanga 10
nnyanja 10
obufumbo 10
okuwangayo 10
omukristaayo 10
omulambo 10
omutwalo 10
omuwala 10
palesitayini 10
yakkiriza 10
yusufu 10
abali 9
abayiikuula 9
amagaali 9
amateeka 9
ataano 9
atambuliramu 9
awaali 9
bino 9
ebikolwa 9
ebyali 9
eddungu 9
enkindu 9
feiran 9
kiba 9
kibuga 9
kitabo 9
lyali 9
mayiro 9
mpologoma 9
obulungi 9
obuwangwa 9
of 9
okuziikibwa 9
omulala 9
piraato 9
si 9
yakobo 9
yakomererwa 9
yayigiriza 9
yayogera 9
yonna 9
zaali 9
abaisira 8
amagumba 8
ayogerwako 8
baamala 8
baaziikanga 8
bakola 8
bimson 8
bingi 8
binoomunaala 8
busuuli 8
byafaayo 8
danyeri 8
ebyawandiikibwa 8
ekisangibwa 8
ekitiibwa 8
empula 8
ennyo 8
er 8
essaza 8
gaali 8
gaazuulibwa 8
gavumenti 8
hoffmei 8
kiriko 8
mannya 8
munnabyafaayo 8
obugubi 8
ogu 8
omuwandiisi 8
rohl 8
rooma 8
ssanduuko 8
suetonius 8
yabeerera 8
yehochanan 8
yokaana 8
abaweereza 7
aga 7
amaanyi 7
awo 7
bayisirayiri 7
bifo 7
bonna 7
bwali 7
eggye 7
egya 7
ekibiina 7
ekifaananyi 7
embeera 7
emirambo 7
endowooza 7
ennyingi 7
ka 7
kigambo 7
kiyira 7
kuba 7
kyonna 7
lwe 7
meditereniyani 7
okumanya 7
okunywa 7
okutuuka 7
oluusi 7
oluyonaani 7
olwo 7
omugga 7
omuwendo 7
oyo 7
sabar 7
ssaddaaka 7
abattibwa 6
aleetera 6
ali 6
baavaayo 6
bajja 6
bassekabaka 6
batabani 6
bayinza 6
biblekigamba 6
bikwata 6
biraga 6
bitaano 6
bizuulibwa 6
butto 6
bwasuli 6
byesigika 6
ebifaananyi 6
ebifo 6
ebimu 6
ebizze 6
ebyogera 6
ekiriko 6
ekituufu 6
ekiwonvu 6
emigga 6
emirimu 6
enkalu 6
enkuba 6
erinnya 6
erudda 6
ewerako 6
eyitibwa 6
firipo 6
gya 6
inci 6
kati 6
kigambibwa 6
kino 6
kintu 6
kumala 6
kyawandiikibwa 6
lunaku 6
lusaniya 6
lyalimu 6
magazini 6
mesopotamiya 6
mulamu 6
naddala 6
obungi 6
okubeera 6
okubuusabuusa 6
okukakasa 6
okusinga 6
okusingira 6
omukazi 6
omulundi 6
omumenyi 6
omunnazaaleesi 6
omuruumi 6
ono 6
samwiri 6
seemu 6
tebaazaalibwa 6
tebisobola 6
wakati 6
yakozesanga 6
zaabwe 6
zabbuli 6
ze 6
zirabibwako 6
a 5
abaana 5
abaasooka 5
abamisiri 5
abanoonyereza 5
abasajja 5
abatagatta 5
abatamanyiddwa 5
abawakanya 5
afuka 5
agaakozesebwanga 5
agattululwa 5
akatabo 5
alaga 5
alimasaya 5
ani 5
apuli 5
archa 5
atya 5
awasa 5
bakatonda 5
basomi 5
basomiapril 5
basomiapuli 5
basomi​—ddesemba 5
basomi​—jjulaayi 5
basomi​—maaki 5
basomi—maaki 5
bayudaaya 5
beeyongera 5
ebbumba 5
ebirayiro 5
ekintu 5
ekirooto 5
ekyasa 5
ekyayamba 5
el 5
embala 5
empya 5
ensonyi 5
enteekateeka 5
erimu 5
eyabanga 5
ezo 5
gaabanga 5
iraq 5
isaaya 5
kikakasa 5
kitwala 5
kitya 5
kukuba 5
kusoma 5
kyaluŋŋamizibwa 5
kyo 5
liva 5
maama 5
maanyi 5
mingi 5
mmeeri 5
mukama 5
mukyala 5
muwulire 5
mwo 5
nsanvu 5
obupya 5
obwasooka 5
okufuna 5
okuggwaamu 5
okukkiriza 5
okukola 5
okumpi 5
okusobola 5
okutambulira 5
okuyigira 5
ology 5
oludda 5
omulaawe 5
omulabirizi 5
omuli 5
omulungi 5
omwagalwa 5
omwesigwa 5
otwalidde 5
revi 5
singa 5
tasinzidde 5
tiberiyo 5
ttaka 5
waaliwo 5
wange 5
yakolanga 5
yakulira 5
yokka 5
abaakomererwanga 4
abafumbi 4
abakristaayo 4
abalusi 4
abasukka 4
abatwala 4
abebbulaniya 4
aboogerwako 4
agaali 4
agafaanana 4
agali 4
agasukka 4
aliyali 4
amagye 4
amanya 4
aseri 4
atakiraba 4
atambuliramuluganda 4
atuuka 4
baabeererawo 4
baabwe 4
baalyanga 4
baasenganga 4
baaziikibwanga 4
babylonian 4
bagakoleramu 4
bakabaka 4
bakkiriza 4
bakozesa 4
bakristaayo 4
balyanga 4
baseemu 4
batyo 4
bayiikudde 4
bayiikuuzi 4
bazzukulu 4
bbugwe 4
beekenneenya 4
bikikakasa 4
biri 4
bituufuluganda 4
bufuzi 4
bugero 4
bugwanjuba 4
bujja 4
bulamu 4
bulijjo 4
buno 4
busuulibwa 4
butuufu 4
buwagira 4
bwakabaka 4
bwennyini 4
bwonna 4
codex 4
david 4
dda 4
ddene 4
dr 4
ebikakasa 4
ebitonotono 4
ebiwandiiko 4
ebuvanjuba 4
ebyabeerangamu 4
ebyalo 4
ebyasangibwa 4
ejja 4
ekirala 4
ekiyinza 4
emirala 4
endagaano 4
enguzi 4
enjigiriza 4
ennyumba 4
eryazuulibwa 4
essanyu 4
eyakomererwa 4
eyattibwa 4
eza 4
gafaananira 4
gasangibwa 4
ge 4
ggumba 4
gwali 4
gwateekebwa 4
gwegattira 4
gyabwe 4
ibulayimu 4
ii 4
is 4
isaaka 4
isakaali 4
isira 4
john 4
kabona 4
kibiinayusufu 4
kino”abo 4
kiteekwa 4
kituufu 4
kristo 4
kubuusabuusa 4
kukiwakanya 4
kulemesa 4
kutuukirira 4
kwabwe 4
kyakulabirako 4
lubaawo 4
lugero 4
lukaaga 4
lukalala 4
lwenda 4
lyakakasa 4
lyakomererwa 4
lyetooloola 4
maaso 4
matayo 4
mpaka 4
muisaaya 4
muli 4
munene 4
munich 4
muno 4
mutabani 4
mwalimu 4
myaka 4
nero 4
njawulo 4
obufuzi 4
obumu 4
obutatwala 4
obuweereza 4
obwazuulibwa 4
obwo 4
ogwo 4
okusingawo 4
okuvaayo 4
okuwummuliramu 4
okwegugunga 4
olubereberye 4
omugagga 4
omukulu 4
omukuumi“mbeegayiridde 4
omukuumi“omwana 4
omululu 4
omusango 4
omusanvu 4
omusumaali 4
omuyudaaya 4
omwabeeranga 4
omwali 4
pliny 4
salugoni 4
semitesbaaliko 4
sifira 4
tacitus 4
talmud 4
tebalina 4
tegyasuulibwanga 4
teyali 4
teyaliiyo 4
thebaid 4
waffe”kiki 4
wakyaliwo 4
wansi 4
wayinza 4
yabawa 4
yakulemberangamu 4
yaliwo 4
yandiziikiddwa 4
yattibwa 4
yaziikibwa 4
yerusaalemu 4
zaaweebwayo 4
abaasuli 3
abaatwalibanga 3
abafunye 3
abakaludaaya 3
abakugu 3
abakulu 3
abakungu 3
abalwanyi 3
abamenyi 3
abamidiyaani 3
abasatu 3
abasuuli 3
abataali 3
abawalabu 3
abawandiisi 3
abeeramu 3
abireeni 3
afuga 3
ako 3
alan 3
amalawo 3
amata 3
ari 3
asene 3
atambula 3
ategeeza 3
attiddwa 3
awandiika 3
baabeera 3
baabisuulanga 3
baafugiranga 3
baafunanga 3
baakubanga 3
baalekanga 3
baalinawo 3
baalinga 3
baalondanga 3
baasiisirako 3
baava 3
baayagalanga 3
baayigganga 3
baayitamu 3
baaziggiranga 3
baazirya 3
baaziwaayo 3
baazuula 3
baba 3
babi 3
babiri 3
bafuula 3
bagenda 3
baggya 3
bagiwa 3
bagoberera 3
bakabona 3
bakkiriziganya 3
baliba 3
bamanyi 3
bammwe 3
bamujeemedde 3
bandisaanyeewo 3
bano 3
basumba 3
bava 3
bawera 3
bayibulisindika 3
bayitibwa 3
bayonaani 3
bazoogerako 3
bazze 3
bbanga 3
bbik 3
belsarussur 3
bibunye 3
bigambo 3
bik 3
bikubiddwako 3
bimera 3
bisigalira 3
biwonvu 3
bokka 3
boogerwako 3
britannicakigamba 3
bubunyeemu 3
bugulumivu 3
busangibwa 3
busatu 3
busuuzi 3
buwaŋŋanguse 3
buyindi 3
byalaga 3
byayo 3
byonna 3
censolo 3
dmu 3
dtewaliiwo 3
ebibayamba 3
ebigambibwa 3
ebika 3
ebikandirwamu 3
ebimukwatako 3
ebisangibwa 3
ebiseera 3
ebisenge 3
ebisigalira 3
ebisinga 3
ebisingayo 3
ebisolo 3
ebiwonvu 3
ebugwanjuba 3
edeni 3
edia 3
ekikwata 3
ekiraga 3
ekisiikirize 3
ekisoboka 3
ekitaboencyclopa 3
ekitaboinsight 3
ekiva 3
ekiyitibwadiscovering 3
ekiyitibwaplants 3
ekyabalamuzi 3
ekyamagero 3
ekyaweebwanga 3
emabega 3
embuzi 3
empeke 3
endala 3
endiga 3
enjawulo 3
enkonko 3
ennyama 3
ensulo 3
ente 3
entukuvu 3
enzibu 3
esobola 3
essuula 3
etiibwa 3
ewegamba 3
eyaliwo 3
eyitibwabiblical 3
eyitibwasmithsonianyalaga 3
ezikirimu 3
ezimu 3
feiranabayisirayiri 3
ffuuti 3
gamba 3
ggaali 3
goseni 3
gukendeera 3
guliibwa 3
guteekebwa 3
guteekebwateekebwa 3
gwagenda 3
gwaggibwa 3
gweyawuliramu 3
iran 3
isocrates 3
kabonero 3
kagamba 3
kamwa 3
kanani 3
kayaafa 3
kerode 3
kibonerezo 3
kifo 3
kigeraageranyizibwa 3
kijjudde 3
kiki 3
kirimu 3
kisangibwa 3
kisoboka 3
kiteeberezebwa 3
kitonnyamu 3
kitono 3
kituukirawo 3
kiweza 3
kiwonvu 3
kiyita 3
kkalu 3
kubal 3
kubeerawo 3
kwaggwaawo 3
kwe 3
kyabanga 3
kyaleetera 3
kyatiisa 3
kyegattira 3
kyennyini 3
kyesigika 3
kyeyoleka 3
liyinza 3
lowooza 3
lusuku 3
lyatonnyangamu 3
ma 3
mak 3
mangiko 3
millard 3
mulimu 3
munnamawulire 3
munnassaayansi 3
musa 3
muzingiramu 3
mwennyini 3
nabo 3
nabyo 3
nakyo 3
nnazimba 3
nsolo 3
nta 3
ntalo 3
ntandikwa 3
ntende 3
ntenvu 3
ntiisa 3
nuuwa 3
obo 3
obugagga 3
obugga 3
obukadde 3
obukande 3
obulimba 3
obunene 3
obuwunga 3
obuyigirize 3
obuyiwa 3
oguwerako 3
okubayigiriza 3
okukomerera 3
okulabika 3
okuna 3
okutuukira 3
okutuusiza 3
okutwala 3
okuvaamu 3
okuweebuula 3
okuyitira 3
okwo 3
olugendo 3
oluguudo 3
olulimi 3
oluyingira 3
omuddo 3
omungereza 3
omunoonyereza 3
omutono 3
omutume 3
omuzingo 3
omwaka 3
omwana 3
on 3
scriptures 3
serugiyo 3
sinaayi 3
taba 3
talbot 3
tali 3
tegyaziikibwanga 3
tekisoboka 3
temukyali 3
tennatandika 3
tewakyali 3
tewaliiwo 3
teyawa 3
tim 3
tutaano 3
waali 3
wadi 3
wamu 3
william 3
world 3
yabagamba 3
yabaliisa 3
yabeeranga 3
yabikwasanga 3
yabuulirangamu 3
yafugira 3
yagendanga 3
yakyolekamu 3
yalina 3
yamalanga 3
yava 3
yayitanga 3
yaziikibwanga 3
zaaliyo 3
zaalyanga 3
zeero 3
zennyini 3
zisangibwa 3
zo 3
zoogerwako 3
abaabiwandiika 2
abaakiraga 2
abaaliwo 2
abaatutumuka 2
abaayitibwanga 2
ababi 2
ababuusabuusa 2
abaddewo 2
abafuzi 2
abalabe 2
abalagidde 2
abalamuzi 2
abalya 2
abamanyiddwa 2
abanaafugibwa 2
abatadde 2
abatono 2
abatume 2
abayiikuuzi 2
abayisirayi 2
ajja 2
akaloosa 2
akayitibwabiblical 2
akkiriza 2
akomereddwa 2
albert 2
aleeta 2
amaka 2
amakungula 2
amatongo 2
amubuulira 2
anaasi 2
annals 2
asaanidde 2
asinga 2
atambulira 2
atta 2
atuyamba 2
ayigiriza 2
ayitibwaalbert 2
ayitibwamicha 2
ayitibwawill 2
ayogerako 2
b 2
baafuna 2
baakakasa 2
baakakasibwa 2
baalumba 2
baalwana 2
baani 2
baasanga 2
baavu 2
baavunaana 2
baayiikuula 2
baayingira 2
bafalaawo 2
baffe 2
bafugibwa 2
bagaanye 2
bakiwamba 2
bakizingizza 2
bakkiririza 2
balabbi 2
balibeera 2
bamanyiddwa 2
bamaze 2
bannabyabufuzi 2
bannabyafaayo 2
bannaddiini 2
banyigirizibwa 2
bawaayo 2
bawangaale 2
bawulira 2
bazudde 2
bbayibuli 2
bbumba 2
beeraliikirivu 2
beerimba 2
berakoth 2
biba 2
bijja 2
bikakasa 2
bikolebwe 2
bikulu 2
bikutte 2
binkwatako 2
birevu 2
bisangibwa 2
bisuniya 2
bisuubizo 2
bitubuulira 2
bityo 2
biwandiiko 2
bubwe 2
bugirimaani 2
bukuumi 2
bulaga 2
bulemereddwa 2
bultmann 2
bungereza 2
bungi 2
buperusi 2
butakkaanya 2
butongozebwa 2
buvudde 2
buyudaaya 2
bwatiberiyo 2
bwegugungo 2
byaanaasikabona 2
byabwe 2
byaffe 2
byazuulibwa 2
byo 2
ca 2
claudius 2
cnge 2
dawudi 2
ddi 2
deifi 2
durantyagamba 2
ebibi 2
ebimwogerwako 2
ebirevu 2
ebisingawo 2
ebitaawaandiikibwa 2
ebivumbuddwa 2
ebyabanga 2
ebyakayaafa 2
ebyakolebwa 2
ebyamagero 2
ebyatuumibwa 2
ebyogerwa 2
ed 2
eddamu 2
eddawadde 2
eddeneko 2
egibaleetera 2
einsteinebyafaayo 2
einsteineyazaalibwa 2
ekikristaayo 2
ekirimu 2
ekiyitibwalives 2
ekkubo 2
ekkumi 2
ekulaakulanye 2
ekyalina 2
ekyatandikira 2
ekyazuulibwa 2
ekyogera 2
embaga 2
emigugu 2
enfumo 2
ennaku 2
enotacitus 2
ensumbi 2
ensuubize 2
entalo 2
eraga 2
erya 2
eryatambuzanga 2
esabirwa 2
esars 2
esiyopiya 2
essuubi 2
etaano 2
etyo 2
ewkagamba 2
eyandibaleetedde 2
eyateekerateekera 2
eyeekenneenya 2
gaabwe 2
gaakiwambanga 2
gaamalanga 2
gaasangangamu 2
gaasookanga 2
gaatwalanga 2
gabe 2
gagenda 2
gavana 2
gazingizza 2
genda 2
ggaliraaya 2
ggazi 2
ggulu 2
ginaatera 2
grantyagamba 2
ituliya 2
j 2
jewish 2
jjanwali 2
jjulaayi 2
kalonda 2
kayisaali 2
keezeekiya 2
kikafuuwe 2
kikulu 2
kitaffe 2
kitegeeza 2
kiyinza 2
kubaamu 2
kufuga 2
kugamba 2
kukizingiza 2
kukola 2
kulaga 2
kulawudiyo 2
kuliko 2
kumalawo 2
kumalibwawo 2
kunoonyereza 2
kuyitako 2
kuyoswa 2
kuzikirizibwa 2
kwerimba 2
kweyongera 2
kwonna 2
kyajjira 2
kyakakasa 2
kyakyuka 2
kyamagero 2
kyasobozesa 2
kyenkana 2
kyoleddwako 2
kyongera 2
labalukka 2
labayokaana 2
lyabanga 2
lyabwe 2
magaali 2
magagga 2
makko 2
mangi 2
matongo 2
matwale 2
mbaga 2
menakemu 2
mirembe 2
mirundi 2
misiri​—leev 2
mowaabu 2
mpola 2
muebikolwa 2
mugagga 2
muganda 2
mukungu 2
mulembe 2
munaala 2
munnasayansi 2
museenene 2
mutegeevu 2
mutuufu 2
muyonaani 2
muyudaaya 2
muzigo 2
ndi 2
nebukadduneeza 2
ngafiripomuganda 2
ngakerodeye 2
ngalusaniyaye 2
nkulu 2
nnamaddala 2
nnyumba 2
ntichrestus 2
obanga 2
obufumo 2
obugambo 2
obukuumi 2
obuli 2
obuteeberezebwa 2
obutuufu 2
obwakabona 2
obwaliwo 2
ogumu 2
ogusooka 2
ogwali 2
ogwatta 2
oku 2
okubikkulirwa 2
okubiri 2
okufuga 2
okuggwaako 2
okuguteeka 2
okugwa 2
okukikola 2
okukimanya 2
okukkiririza 2
okukolera 2
okukomya 2
okuleetera 2
okuli 2
okulituulamu 2
okulumba 2
okumusalira 2
okusaba 2
okusanga 2
okusatu 2
okutuusa 2
okuwandiika 2
okuyingira 2
okuyisaamu 2
okuyitako 2
okuzaala 2
okuzuulibwa 2
okwekenneenya 2
okwekkiriranya 2
olowooza 2
olukiiko 2
olukulu 2
olutalo 2
oluvuuvuumo 2
oluwanvu 2
olwebbulaniya 2
omubatiza 2
omubuulizi 2
omukaaga 2
omukungu 2
omulimu 2
omuliro 2
omunazaaleesi 2
omunyago 2
omwenge 2
oyagala 2
peka 2
piraatobwe 2
sanhedrin 2
ssaala 2
ssaayansi 2
suetoniusa 2
tabeerangawoko 2
tabuusabuusa 2
tacitusa 2
talmudekitabo 2
taylor 2
tebaaliyo 2
tebaasooka 2
tebannagenda 2
tebannazuula 2
tebasobola 2
tegaali 2
tekinologiya 2
tekoma 2
tetubuusabuusa 2
tetusobola 2
teyalina 2
tirakoniti 2
trajan 2
tugitwala 2
turkey 2
tusomako 2
tutwala 2
uli 2
watuyamba 2
wayise 2
xv 2
xx 2
xxv 2
yabeereranga 2
yabuuzibwa 2
yafa 2
yafuba 2
yagoba 2
yakiraga 2
yakolera 2
yakuŋŋaanya 2
yalaga 2
yasalawo 2
yasangamu 2
yasangibwa 2
yatandika 2
yatandikawo 2
yatandikira 2
yatuukamu 2
yawandiikira 2
yazaalibwa 2
yazaalibwamu 2
yeeweebuula 2
yenna 2
yeshu 2
yiye 2
yonnakikulu 2
yos 2
youngera 2
yuda 2
zaakoma 2
zeeyolekera 2
zekkaliya 2
zitera 2
