nga 68
mu 53
ku 50
wano 34
naye 29
bwe 28
kati 25
ne 23
abantu 21
nnyo 20
bwo 18
na 18
nti 18
kye 16
ssente 16
ki 15
oba 15
waliwo 15
nze 14
olina 14
wa 14
abamu 13
buli 13
bye 13
gye 13
katonda 12
abaana 11
kyo 11
si 11
ddala 10
ggwe 10
no 10
ani 9
era 9
ffe 9
obudde 9
bino 8
gyo 8
mmwe 8
mukama 8
njagala 8
omuntu 8
amaanyi 7
ate 7
bannaffe 7
bantu 7
enda 7
ensi 7
kino 7
lwaki 7
ojja 7
okubeera 7
omu 7
tolina 7
tugenda 7
alina 6
bwa 6
ebyo 6
emabega 6
gonna 6
gwe 6
okukola 6
oli 6
omukisa 6
oyo 6
tulina 6
yali 6
abalala 5
akola 5
asobola 5
bonna 5
budde 5
bulungi 5
byonna 5
engeri 5
gwo 5
kikulu 5
kya 5
mwenna 5
myaka 5
ngo 5
nnina 5
okuba 5
olabika 5
omwaka 5
omwana 5
otya 5
wo 5
ya 5
ye 5
za 5
abadde 4
abasajja 4
abasinga 4
abeera 4
ayagala 4
ayinza 4
bajja 4
bakola 4
be 4
byo 4
dda 4
ebbanga 4
ebintu 4
ekimala 4
enkya 4
eno 4
ensimbi 4
ensonga 4
guno 4
kimu 4
kuba 4
kutuuka 4
nange 4
ndi 4
nsi 4
nsonga 4
omukazi 4
omulimu 4
omusajja 4
osanga 4
teri 4
yonna 4
zonna 4
abakazi 3
abawagizi 3
akoze 3
amagezi 3
atya 3
baali 3
bagamba 3
bakazi 3
balina 3
bangi 3
bano 3
enjawulo 3
ennyo 3
ensobi 3
eyo 3
gange 3
genda 3
go 3
gya 3
kibuga 3
kintu 3
kkumi 3
kukola 3
kumala 3
kwe 3
lwe 3
maaso 3
mmanyi 3
mpozzi 3
mufune 3
mukisa 3
munne 3
mwagala 3
nabo 3
ndaba 3
ngeri 3
nkola 3
obulamu 3
okimanyi 3
okola 3
okole 3
okulaba 3
okuva 3
olaga 3
oluusi 3
omanyi 3
omupiira 3
osobola 3
oyagala 3
ssinga 3
tosobola 3
twetaaga 3
wadde 3
waffe 3
wange 3
ze 3
zino 3
abali 2
afuna 2
akatale 2
alabika 2
amaaso 2
amanyi 2
amata 2
amawanga 2
asinga 2
ataano 2
awo 2
ba 2
baagenda 2
baana 2
baba 2
babbi 2
bamanyi 2
bamaze 2
bammwe 2
basajja 2
batono 2
batyo 2
bazadde 2
bazibu 2
beetaaga 2
bennyini 2
bo 2
boogera 2
bukulembeze 2
bukyali 2
buno 2
buva 2
ddi 2
e 2
ebya 2
ekibi 2
ekirala 2
ekisa 2
ekituufu 2
ekkumi 2
ekyo 2
enjiri 2
enkoko 2
ennaku 2
eri 2
eye 2
ezo 2
ffenna 2
funayo 2
gaba 2
gammwe 2
ge 2
gwa 2
jjo 2
ka 2
kale 2
kennyini 2
kibi 2
kiki 2
kiri 2
kisaana 2
kisinga 2
kkereziya 2
kola 2
kubeera 2
kukomawo 2
kwogera 2
leero 2
lino 2
luli 2
lwa 2
mbadde 2
mirembe 2
mmaze 2
mugayaavu 2
mulamu 2
mulamwa 2
muli 2
mulimu 2
muzibu 2
naawe 2
nakwo 2
nakyo 2
nali 2
nammwe 2
natuuka 2
nja 2
njawulo 2
nkakasa 2
nkooye 2
nkwegayirira 2
nno 2
nsawo 2
nsobola 2
obulungi 2
ogenda 2
okubaako 2
okukula 2
okulya 2
okumanya 2
okusinga 2
okusoma 2
okutuuka 2
olaba 2
olabe 2
oluvannyuma 2
olwo 2
omanya 2
omulala 2
omunene 2
omuwala 2
omwoyo 2
ono 2
onywa 2
osobole 2
ova 2
owe 2
owulira 2
oyinza 2
ssomero 2
tunoonya 2
twafuna 2
wali 2
waliyo 2
wenna 2
wiiki 2
wokka 2
yaffe 2
yagenda 2
yo 2
yuganda 2
