num 2314
mu 1451
ne 586
na 495
ku 448
kkumi 362
nga 291
era 273
lukumi 263
mukaaga 236
nti 210
abiri 204
ssatu 202
katonda 189
eya 177
abantu 165
kikumi 159
bayibuli 158
bbiri 144
emu 142
kamu 140
mitwalo 132
no 127
za 127
oba 123
yakuwa 122
bwe 121
bo 116
naye 107
kya 102
munaana 99
abasajja 96
musanvu 94
ttaano 90
asatu 88
ekya 88
essaala 88
awo 86
abalala 83
nnya 83
ba 82
wa 82
bonna 78
ensi 78
omuntu 77
isirayiri 74
omu 73
ppaasika 73
ekyo 72
bya 71
bukadde 70
univ/art 70
univ_sqr_xl 70
url 70
bye 69
ebiri 68
ya 68
mwenda 67
baali 66
ebitabo 66
ebyawandiikibwa 66
empya 66
enkyusa 66
intaneeti 66
abalalaweereza 59
jpg 59
ebya 56
buli 55
lugandasoma 55
ga 52
ebintu 51
kino 51
gye 50
kubanga 48
yesu 48
ana 47
ebyo 47
yali 46
byonna 45
eri 44
abo 43
lwa 42
abakristaayo 41
olwa 41
abakaafiiri 40
ddala 40
kabaka 40
obulombolombo 40
gibeya 39
ababenyamini 37
maaso 37
okuba 36
wansi 36
weereza 36
e 35
nnannyini 35
pulintaweereza 35
sindika 35
addamu 34
ekintu 34
nge 34
omuwendo 34
kitabo 33
abayisirayiri 32
engeri 32
gu 32
kwa 32
omutume 32
owa 32
abaali 31
benyamini 30
nnyo 30
zeero 30
aba 29
kintu 29
okubaamu 29
okusaba 29
be 28
ebyomumirembe 28
ka 28
kimu 28
oyo 28
sekeri 28
si 28
ssente 28
wo 28
ekitabo 27
kifo 27
obut 27
agamba 26
ensolo 26
ggwe 26
kabona 26
kyonna 26
okusobola 26
wange 26
ye 26
yokaana 26
abamu 25
anaabanga 25
gya 25
lunaku 25
lye 25
okukuza 25
abakkolinso 24
bagenda 24
bukristaayo 24
ebibi 24
gwe 24
kigamba 24
kuzuukira 24
kye 24
pawulo 24
tuyiga 24
asobola 23
ebikolwa 23
ebirala 23
ekimu 23
ibulaamu 23
ngeri 23
ayagala 22
date 22
enjawulo 22
ge 22
obwa 22
ogu 22
okukola 22
tewali 22
waliwo 22
eyo 21
ezo 21
ai 20
ajja 20
akamyu 20
ate 20
ekkumi 20
isaaya 20
nnyumba 20
okuva 20
osobola 20
ssaala 20
ssabbiiti 20
tulina 20
tusaba 20
ali 19
anaawangayo 19
asaba 19
bwo 19
oluvannyuma 19
olwo 19
zabbuli 19
zinaabanga 19
amazima 18
bungi 18
ebikwata 18
emmere 18
ki 18
kiba 18
kibuga 18
kwe 18
kyokka 18
lya 18
obanga 18
obutiti 18
wadde 18
we 18
abaleevi 17
basaanidde 17
kitukuvu 17
ngo 17
okulwanyisa 17
omukisa 17
wakati 17
bagamba 16
batakkiriza 16
bayibulikatonda 16
bitukakasa 16
bitya 16
eggi 16
ekikristaayo 16
kiseera 16
kukuza 16
kyogera 16
muntu 16
mwaka 16
obugambo 16
obukolebwa 16
obuli 16
ogwo 16
okutegeera 16
okuyingizibwa 16
okuzuukira 16
olowooza 16
omukolo 16
otya 16
temwegattanga 16
walter 16
yalabula 16
ekiro 15
ennyumba 15
laba 15
okuddamu 15
bantu 14
eza 14
mateeka 14
ndi 14
nsi 14
obulamu 14
obutuukirivu 14
okugenda 14
okulwana 14
omugwira 14
sodomu 14
balina 13
batta 13
ebitala 13
ebitukuvu 13
ekiseera 13
asinziira 12
bina 12
egya 12
ettaka 12
gwa 12
jjubiri 12
kale 12
kiyinza 12
kyali 12
nkomerero 12
nze 12
okufa 12
okugamba 12
okukwata 12
okuvvuunulwa 12
omukazi 12
omuleevi 12
omwana 12
omwenge 12
waffe 12
waggulu 12
wamu 12
yonna 12
alina 11
amalungi 11
atyo 11
bali 11
bino 11
byo 11
ekibuga 11
go 11
jpgobwa 11
mazima 11
mutwe 11
okwagala 11
soma 11
abatagondera 10
abeetoowaze 10
abuulira 10
agattako 10
amawulire 10
amazzi 10
awuliriza 10
baabwe 10
baagala 10
bakola 10
balekera 10
bibuga 10
birina 10
bituukana 10
ebiragiro 10
ebitukuvuekyamateeka 10
ebitukuvuolubereberye 10
ekibi 10
ekitukuvu 10
eneebanga 10
ennyo 10
gumu 10
guno 10
gwange 10
kasirise 10
kutaano 10
lulimi 10
lwonna 10
lyo 10
mmwe 10
mutabani 10
nekkemiya 10
nja 10
oku 10
okukozesa 10
okutuuka 10
okuwulira 10
omunaala 10
omutima 10
singa 10
so 10
sseebaaseka 10
tawulira 10
waaliwo 10
yerusaalemi 10
yuda 10
abaasaba 9
abamukoowoola 9
baba 9
badduka 9
bafukamidde 9
balowoozanti 9
basaba 9
batudde 9
bayimiridde 9
beeyaze 9
eraga 9
ezera 9
kaakano 9
kumpi 9
limmoni 9
lwazi 9
okufukamira 9
okukkiriza 9
okukutamya 9
tateekawo 9
tteeka 9
yawuliriza 9
abagoberezi 8
abalwanyi 8
abamutaddamu 8
abaruumi 8
abassessaloniika 8
abatume 8
abayigirizwa 8
aboogera 8
agali 8
amakulu 8
anaabaliriranga 8
anaasasulanga 8
asingayo 8
atalina 8
ayitibwa 8
ayongerako 8
baakola 8
baakuzanga 8
baatandika 8
baddukira 8
baganda 8
bakabaka 8
bakutte 8
bakyaliwo 8
bamaze 8
bamazeeko 8
bannaddiini 8
basajja 8
basimba 8
basituka 8
batandise 8
battako 8
bayinza 8
beseri 8
bissa 8
bitabagana 8
bonnaadamu 8
britannicabwe 8
bubiri 8
bukolebwa 8
bukwataganira 8
bulombolombo 8
bulungi 8
busibuka 8
bwabwe 8
bwayo 8
byasa 8
ddungu 8
ebigikwatako 8
ebika 8
ebikyamye 8
ebimera 8
ebiwandiiko 8
edda 8
egambabayibuli 8
egamba“yakuwa 8
ekifo 8
ekikaafiiri 8
ekikuta 8
ekiramu 8
ekisooka 8
ekitangaala 8
ekiyitibwa 8
ekiyitibwabritannicakiraga 8
ekiyitibwathe 8
ekizikiza 8
ekiziyiza 8
ekyasa 8
ekyokulabirako 8
emikolo 8
emyaka 8
encyclopedia 8
encyclopædia 8
ennyiriri 8
eyaviirako 8
eyeekenneenya 8
ezinaamubalirirwangamu 8
ffeeza 8
ggi 8
kakaaga 8
kakiikirira 8
kalenda 8
kazaala 8
ke 8
kicupuli 8
kikulu 8
kikyamu 8
kimanyiddwa 8
kirongoofu 8
kitali 8
kivaamu 8
kristo 8
kugamba 8
kunnyonnyola 8
kyabaawo 8
kyabanguyira 8
kyaleetera 8
kyasa 8
kyaviirako 8
kyayamba 8
likiikirira 8
lukka 8
madiini 8
mbagamba 8
mubeeyawuleko 8
mukama 8
mukolo 8
mulekere 8
mutwalo 8
muve 8
muwendo 8
nfumo 8
nnongoofu 8
nsonga 8
obubonero 8
obuggya 8
obujeemu 8
obukaafiiri 8
obukozesebwa 8
obulungi 8
obumu 8
obwo 8
of 8
okubagoberera 8
okubuzaabuza 8
okufakwe 8
okugatta 8
okujjukira 8
okukakasa 8
okukwataganya 8
okukyekebejja 8
okumeruka 8
okusendasenda 8
okusookera 8
okutajjulukuka 8
okuteekebwa 8
okuwaayo 8
okuyingiza 8
okwekenneenya 8
olunaku 8
omukulu 8
onbwe 8
philippe 8
pulofeesa 8
religi 8
tebaleseeyo 8
tebasaanidde 8
tebulina 8
tekyali 8
teyandikikkirizza 8
ttaka 8
ttwale 8
tulabye 8
tusaanidde 8
wabula 8
wandibaddewo 8
yagamba 8
yaguyita 8
yakozesa 8
yalaba 8
yalagira 8
yandimaze 8
yannyonnyola 8
yawandiika 8
yennabayibuli 8
yo 8
ze 8
ababi 7
abeera 7
akabi 7
ebibuuzo 7
ebizibu 7
emabega 7
enjuba 7
muganda 7
nguudo 7
obubi 7
abagwira 6
abakazi 6
abakugu 6
amafuta 6
amagezi 6
amateeka 6
amawanga 6
amba 6
anaalonda 6
anaayagalanga 6
ani 6
baffe 6
baleeta 6
balwana 6
balwanyi 6
basobole 6
bassa 6
batabani 6
bateeze 6
bava 6
bazira 6
biki 6
bulijjo 6
ebiriirwamu 6
ebirungi 6
ebiweebwayo 6
eggulu 6
eggye 6
ekiriirwamu 6
ekiwuugulu 6
empeke 6
endagaano 6
eyali 6
eyeeyama 6
ggomola 6
gwabwe 6
gwo 6
kamunye 6
kedolawomeeri 6
kibiina 6
kika 6
kinaabanga 6
kwo 6
kyo 6
leero 6
lwaki 6
mirundi 6
miryango 6
mugabo 6
muli 6
myaka 6
nabo 6
nate 6
nnaku 6
nnamwandu 6
nsolo 6
obo 6
obungi 6
obusika 6
okubiri 6
okusinziira 6
okutuukira 6
okutuusa 6
omukuumikatonda 6
omuliro 6
omusajja 6
onzijukiranga 6
yakobo 6
zo 6
abali 5
anannyamba 5
ataddamu 5
atawuliriza 5
atufaako 5
baakyuka 5
babeera 5
baleme 5
biragiro 5
byamagero 5
ebibereberye 5
ebisenge 5
ebitukuvuebya 5
ebitukuvuekyabalamuzi 5
ebitukuvuengero 5
ebitukuvunekkemiya 5
ebitukuvuomubuulizi 5
ebitukuvutito 5
ebitukuvuzabbuli 5
ebitundu 5
ebuvanjuba 5
ekisenge 5
ekitala 5
embuzi 5
emisana 5
ena 5
endala 5
eno 5
kisenge 5
kutwala 5
lusozi 5
musa 5
nange 5
nsaba 5
nsozi 5
okuwuliriza 5
olutalo 5
omusumba 5
takoze 5
tufunye 5
weema 5
zaabwe 5
abaagala 4
abaami 4
abakola 4
abaweereza 4
abawondera 4
addira 4
aga 4
agibaliriddemu 4
akawungeezi 4
akola 4
amaanyi 4
amalala 4
amanyi 4
amuwa 4
aneri 4
ataano 4
ayinza 4
bafubutuka 4
bagezaako 4
bajja 4
bakkuta 4
bakoze 4
bakuŋŋaana 4
bammwe 4
bange 4
batwala 4
batyo 4
bawala 4
bawangula 4
baweereza 4
beebuuza 4
beetaaga 4
bintu 4
boogera 4
butaliimu 4
buyinza 4
byabwe 4
ddaani 4
ebe 4
ebibala 4
ebibeera 4
ebinuulo 4
ebirime 4
ebukiikakkono 4
ebweru 4
ebyali 4
eddamubwe 4
eddamulwaki 4
eddoboozi 4
eggana 4
eginaabanga 4
ejjinja 4
ekibiina 4
ekijjukizo 4
ekikka 4
ekinene 4
ekiri 4
ekirongoofu 4
ekisa 4
ekisibo 4
ekiterekebwamu 4
ekiwonvu 4
embi 4
emirala 4
enda 4
eneefuukanga 4
ennene 4
ennungi 4
ensega 4
ensigo 4
enviiri 4
erimu 4
erinnya 4
eriyasibu 4
esukoli 4
etali 4
ezimu 4
ezzadde 4
ffe 4
fuba 4
ggulu 4
ggwanga 4
gisigaddeyo 4
gubaliriddwa 4
kaali 4
kibi 4
kinaabaawo 4
kiri 4
kitaawe 4
kiwonvu 4
konna 4
kuba 4
kubeeranga 4
kubiri 4
kubitegeera 4
kuggyako 4
kukkiriza 4
kulaba 4
kulwana 4
kuva 4
linaabanga 4
lino 4
lugandakatonda 4
lugenda 4
lugendo 4
lusanvu 4
lutti 4
lwabwe 4
makya 4
mamule 4
mangu 4
mazzi 4
mbalabula 4
mizupa 4
mmwenna 4
mpa 4
mugende 4
mukono 4
munaakiryanga 4
munda 4
mutaalyenga 4
muzingo 4
mwana 4
mwe 4
mwonoona 4
nakyo 4
nammwe 4
njagala 4
nkaaga 4
nkoze 4
nnalaba 4
nnalagira 4
nnangirira 4
nnimiro 4
nsulo 4
ntyo 4
obulokozi 4
obuswavu 4
obwakabona 4
obwenkulumu 4
obweyamo 4
ogugigyaamu 4
oguligyaamu 4
ogunaabanga 4
ojja 4
okimanyi 4
okola 4
okubeera 4
okuginunula 4
okugiwanyisaamu 4
okuleeta 4
okusatu 4
okuteega 4
okuwakana 4
okuyisibwa 4
okwonoona 4
oleme 4
oli 4
omubereberye 4
omubi 4
omugabo 4
omugereke 4
omukuumikikulu 4
omulala 4
omulundi 4
omusango 4
omusu 4
omuzaana 4
omwaka 4
sidimu 4
sirina 4
tajja 4
tasobola 4
tawuliriza 4
temulyanga 4
tobiya 4
ttukuvu 4
tubawangudde 4
tuddeyo 4
tugenda 4
tujja 4
twabawangula 4
wandagira 4
yakusuubiza 4
yalina 4
yeeyama 4
yenna 4
zonna 4
abaafa 3
abaava 3
agiwanyisizzaamu 3
amaaso 3
anaatukuzanga 3
azibala 3
azikirira 3
baafa 3
baalaba 3
baalina 3
baasanga 3
babalinnyirira 3
babalwanyisa 3
babatta 3
babyokya 3
bakomawo 3
bakyuka 3
balaba 3
bamusaayi 3
bannaabwe 3
bannannyini 3
bano 3
basoberwa 3
batutte 3
beegatta 3
beeyongera 3
biryefunira 3
bisenge 3
bizikirizibwe 3
boogerwako 3
boolekera 3
ebibuga 3
ebikwatagana 3
eddungu 3
ekyali 3
ekyenyi 3
emyezi 3
ennyanja 3
ensonga 3
entukuvu 3
eyakola 3
gakusanyusenga 3
gammwe 3
gidomu 3
gwambuka 3
kabatuuseeko 3
kisigadde 3
kituntumuka 3
kubaako 3
kubawonya 3
kugenda 3
kulub 3
kunge 3
litegeeza 3
lubagoberera 3
lukaaga 3
lunyiriri 3
luuyi 3
maanyi 3
mutabule 3
okubawondera 3
okumala 3
okusinza 3
okusoma 3
okusula 3
okutunula 3
okuwa 3
olusooka 3
omuggo 3
oyinza 3
sinaayi 3
tebeebaka 3
tebusobola 3
temumwanga 3
temwemwanga 3
tewabisanyukira 3
tezinunulibwanga 3
yakutama 3
yange 3
yawa 3
zaayitanga 3
zombi 3
abaabeeranga 2
abaagenze 2
abaamoli 2
abaamoni 2
abaana 2
abaasigalawo 2
abaatendekebwa 2
abaayingiranga 2
abaazaalibwa 2
ababeera 2
ababikola 2
abafu 2
abagamba 2
abakkirizza 2
abakooli 2
abakozi 2
abakulemberamu 2
abakungu 2
abakunoonya 2
abakuyigganya 2
abala 2
abaleefa 2
abamaleki 2
abamowaabu 2
abanjigirizanga 2
abasanyukira 2
abasogola 2
abasomesa 2
abasudodi 2
abasuubuzi 2
abatabala 2
abatalina 2
abatambuza 2
abatunzi 2
abatuukirivu 2
abatuulo 2
abatuuzeba 2
abatwagala 2
abatya 2
abavubuka 2
abawanguzi 2
abayambako 2
abayimbi 2
abayudaaya 2
abazuuzi 2
abe 2
abeemi 2
abeerakumpi 2
abeeredde 2
adamu 2
aduma 2
afa 2
agaali 2
agabanyaamu 2
agakulukuta 2
agenda 2
agiwaddeyo 2
agolokoka 2
agulumizibwe 2
agununula 2
aka 2
akabonero 2
akaguwa 2
akaleeta 2
akalulu 2
akantu 2
akenkana 2
akiraze 2
akituuma 2
akolanga 2
akomyawo 2
akoze 2
akuba 2
akugabudde 2
akulagira 2
akuleetedde 2
akulemberamu 2
akuwadde 2
akuwe 2
akuŋŋaanya 2
akwata 2
alaba 2
aleeta 2
aliba 2
aligula 2
alisimba 2
aliyiwako 2
aliyoki 2
alooni 2
aloota 2
alulinako 2
alyezizika 2
alyoke 2
amabeere 2
amadaalanga 2
amaggwa 2
amakubo 2
amakumi 2
amata 2
amaterekero 2
amatu 2
amawanvu 2
ampa 2
amufuula 2
amugamba 2
amulaferi 2
amuyisa 2
amwagala 2
anaagiwanyisangamu 2
anaagiyimirizanga 2
anaagyawulangako 2
anaalinunulanga 2
anaamubaliranga 2
anaawangayoennyumba 2
anaayimirizibwanga 2
anattibwanga 2
aneeyongera 2
ankuuma 2
annunula 2
annyamba 2
apolo 2
asaliddwa 2
asinga 2
asutelosikalunayimu 2
atakkirizibwa 2
ateekawo 2
atema 2
atenderezebwe 2
atuleetako 2
atumbula 2
atya 2
avudde 2
awadde 2
awaddeyo 2
awangaala 2
awangula 2
awanyisizzaamu 2
awasizza 2
awatali 2
awe 2
aweerezamu 2
ayagalanga 2
ayavuwadde 2
ayogera 2
ayonoonye 2
azuukuka 2
b 2
baafuluma 2
baakaaba 2
baakoleranga 2
baakuŋŋaanya 2
baaleetanga 2
baalowooza 2
baalumba 2
baamuleetera 2
baasimba 2
baasitukiramu 2
baasula 2
baatwala 2
baaviirako 2
babalumba 2
babawangula 2
babiguza 2
babigwamu 2
babitisse 2
babuuza 2
badda 2
baddayo 2
badde 2
baddeyo 2
bafeebezeddwa 2
bafudde 2
bafuluma 2
bafunire 2
bagaana 2
bagakkirako 2
bagambenga 2
bagambukirako 2
bagenze 2
bagezi 2
bagudde 2
bajagulize 2
bajjajjaffe 2
bajjajjammwe 2
bajjenga 2
bajula 2
bakaabira 2
bakabona 2
bakirya 2
bakuume 2
bakuŋŋaanira 2
bakwasiddwa 2
bakwatibwe 2
bakyusa 2
balala 2
baleevi 2
baleka 2
balibuna 2
balidde 2
balongoosa 2
balumba 2
balya 2
bamalayika 2
bamutya 2
bana 2
banaakiriiranga 2
banajjanga 2
bannumba 2
banyoose 2
basaasaana 2
basanyuke 2
basemberera 2
basendebwasendebwa 2
basiiba 2
basiisira 2
basobola 2
basobya 2
baswale 2
bataano 2
bataddewo 2
bateesezza 2
batuukira 2
batuula 2
batwale 2
batwalibwa 2
batya 2
batye 2
bawaayo 2
bawamba 2
bawasizzaabakazi 2
bawulira 2
bayige 2
bayimirira 2
baziikibwa 2
bazzeeyo 2
bba 2
bbaalitamali 2
bbugwe 2
beegasse 2
beerabirwa 2
beeruseba 2
beesiga 2
beesigika 2
beesigwa 2
beesuule 2
beetegeka 2
beetooloola 2
beetukuzenga 2
beeyongerayo 2
bera 2
bibala 2
bibe 2
bibinja 2
bibiri 2
biboonoona 2
bibugabyammwe 2
bibugabyo 2
bifo 2
bigalagamba 2
bigamba 2
biganyula 2
bika 2
bikolebwa 2
bikolwa 2
bikwata 2
bikwatenga 2
bimusuula 2
binaabagenderanga 2
binaabangawo 2
bingi 2
binkuumenga 2
binoebibuuzo 2
biriweebwa 2
birongoofu 2
birungi 2
bisatu 2
bituma 2
bitundu 2
biyitiridde 2
boonoonye 2
bubi 2
bunaabanga 2
buvubuka 2
bwa 2
bwaziba 2
bwenkulumu 2
bwonna 2
byaseemu 2
byazo 2
byesigika 2
ddamasiko 2
ddoboozi 2
dukipaasi 2
eba 2
ebeera 2
ebenga 2
ebibatawaanya 2
ebigalagamba 2
ebigambo 2
ebigere 2
ebikolebwa 2
ebikolebwayo 2
ebikoleddwa 2
ebikozesebwa 2
ebikungulwa 2
ebinneetoolodde 2
ebinnya 2
ebiramu 2
ebirimukemali 2
ebirina 2
ebiro 2
ebirowoozo 2
ebitereke 2
ebiterekebwamu 2
ebiwaawaatirosi 2
ebugwanjuba 2
ebukiikaddyo 2
ebyamaguzi 2
ebyeyawuddemu 2
ebyokebwa 2
ebyoleka 2
ebyonoono 2
eggwanga 2
egyaamu 2
ekibaawo 2
ekibuuka 2
ekigambo 2
ekiganzi 2
ekigereke 2
ekika 2
ekikutte 2
ekimalamu 2
ekimbala 2
ekinaanunulibwanga 2
ekinaatundibwanga 2
ekinuulo 2
ekinyira 2
ekirayiro 2
ekirina 2
ekisangiddwa 2
ekisiikirize 2
ekisiru 2
ekitalina 2
ekitawulirwangako 2
ekitiibwa 2
ekitono 2
ekitundu 2
ekituufu 2
ekiweebuula 2
ekiweeredwayo 2
ekulukuta 2
ekwagala 2
ekyakolebwa 2
ekyalayirwa 2
ekyaseemu 2
embaata 2
embizzi 2
emigga 2
emigugu 2
emiguwa 2
emimwa 2
eminene 2
emirembe 2
emirimu 2
emirundi 2
emiryango 2
emiti 2
emiwendo 2
empeewo 2
empenda 2
empungu 2
endiga 2
eneebalirirwangamu 2
enfuufu 2
engatto 2
enimisupaati 2
enjaza 2
enjigiriza 2
enjuki 2
enkaayana 2
enkola 2
enkoonamasonko 2
enku 2
enkunga 2
enkya 2
ennaku 2
ennyingi 2
enookukkiriza 2
ensobi 2
ensonyi 2
ensulo 2
ensusso 2
ente 2
enteekateeka 2
entikko 2
entuufu 2
envinnyo 2
envuumuulo 2
enzigi 2
enzikiza 2
enzirugavu 2
eragajjaliddwa 2
eramu 2
erasali 2
erina 2
eritali 2
eriyazaali 2
erupalani 2
eryo 2
esaanira 2
esatu 2
essanduuko 2
essimbo 2
etaano 2
etakkirizibwa 2
etambuza 2
ettendo 2
ettiini 2
ettukuvu 2
ettutumu 2
etuukira 2
eva 2
ewedde 2
eyattibwa 2
eyawonawo 2
ezaabalirirwa 2
ezaagibalirirwamu 2
ezaalibalirirwamu 2
ezibalirirwamu 2
ezimala 2
ezinaabalirirwanga 2
eziringa 2
ezizza 2
ezzabbibu 2
eŋŋamira 2
fenekaasi 2
gaayo 2
gabe 2
gago 2
gakumatizenga 2
gali 2
gandisaasaanidde 2
gano 2
gasaasaana 2
gasimbiddwa 2
gera 2
ggye 2
gijja 2
ginaabalirirwanga 2
gireyaadi 2
giri 2
gondera 2
gonna 2
goyiyimu 2
gubanga 2
gube 2
gukuweddeko 2
gulowooza 2
gumalirira 2
gunaagerekebwanga 2
gunaakendeezebwangako 2
gunaatundibwanga 2
gutaanunulwenga 2
guyingizibwa 2
gwakaggwaako 2
gwalyo 2
gwammwe 2
gwanyoomera 2
gwonna 2
gyabwe 2
gyange 2
gyo 2
gyonna 2
ibulayimu 2
isaaka 2
jjajjaawo 2
kaamu 2
kabi 2
kabonero 2
kaboolekedde 2
kadesi 2
kakwakkulizo 2
kanani 2
kano 2
kati 2
katonda—abalwanyi 2
kazazonutamali 2
kibanja 2
kibeere 2
kibereberye 2
kifuba 2
kifudde 2
kijjudde 2
kikolebwamu 2
kikuleetere 2
kikuŋŋaana 2
kimune 2
kimuokulwanyisa 2
kinaayinzanga 2
kinyonyi 2
kiraba 2
kiramu 2
kirina 2
kisinga 2
kisolo 2
kitaawene 2
kitandika 2
kitange 2
kitya 2
kityo 2
kiyitibwa 2
kkoba 2
kkono 2
kkubo 2
komeri 2
komeriya 2
kubaawo 2
kubawaayo 2
kubawangula 2
kubeera 2
kubikwata 2
kubitwala 2
kubuusabuusa 2
kufa 2
kugikuwa 2
kuguziyiza 2
kujja 2
kukozesa 2
kukuba 2
kukugulumiza 2
kukukomyawo 2
kukukuuma 2
kukungubaga 2
kukuwa 2
kukwata 2
kulinunula 2
kulya 2
kumanya 2
kumugendera 2
kumusiba 2
kunsaasira 2
kunywa 2
kusanyuka 2
kusasula 2
kusooka 2
kutegana 2
kutegeera 2
kutta 2
kutuukibwako 2
kuwaayo 2
kuwaba 2
kuweebwayo 2
kwagala 2
kwetikka 2
kwogera 2
kwongera 2
kyajja 2
kyakyo 2
kyannyiiza 2
kyeguva 2
kyennava 2
leka 2
linaaddiranga 2
linaaweebwangayo 2
linnya 2
liriba 2
lirifuuka 2
lita 2
luggya 2
lukale 2
lunaakubeereranga 2
lunyiinyiitira 2
lusobole 2
lusudodi 2
lutalo 2
lutukuvu 2
luuzi 2
luyudaaya 2
luzzi 2
lwange 2
lyanyi 2
lyoleka 2
maaya 2
magga 2
maggwa 2
makubo 2
makwanzi 2
mangi 2
mata 2
materekero 2
mattaniya 2
mawanga 2
mayinja 2
mbadde 2
mbaggyako 2
mbakolimira 2
mbalayiza 2
mbayombesa 2
mbazza 2
mbi 2
mbiggye 2
mbikasuka 2
mbirabye 2
mbiwa 2
mbiweereza 2
mbuzi 2
merukizeddeeki 2
mirembe 2
mirimu 2
miti 2
mmugoba 2
mpaddeyo 2
mpeddemu 2
mpewo 2
mubalwanyise 2
mubeeko 2
mugaso 2
mugugu 2
mukiryanga 2
mukka 2
mukola 2
mulekwa 2
mulongoofu 2
mulyango 2
munaakiddamu 2
munaalyanga 2
munaayinzanga 2
munne 2
musajja 2
musula 2
mutaba 2
muteese 2
mutego 2
mutima 2
mutubuulire 2
mutya 2
muwa 2
muwala 2
muwasa 2
muweeyo 2
muyinza 2
muzaana 2
mwalimu 2
mwavu 2
mwongera 2
mwoyo 2
mwoyooba 2
naawe 2
nayo 2
ndaba 2
ndagira 2
ndala 2
ndayira 2
ndidde 2
ndiga 2
ndikola 2
ndogoyi 2
ndokola 2
ngusalaasalamu 2
nikopoli 2
njazi 2
njuyi 2
nkimanyi 2
nkiraba 2
nkola 2
nkomawo 2
nkomeredde 2
nkuba 2
nkusuubizza 2
nkutteko 2
nkuunyuula 2
nkuŋŋaanya 2
nkwata 2
nnaakuwangako 2
nnaatera 2
nnabalaba 2
nnagaggawaza 2
nnagenda 2
nnakizuula 2
nnakyayira 2
nnali 2
nnalowooza 2
nnamalirira 2
nnamusiza 2
nnamuŋŋoona 2
nnasemba 2
nnatuuka 2
nnimi 2
nnungi 2
nnyama 2
nnyimusa 2
nnyina 2
nnyiriri 2
nnyombesa 2
nsa 2
nsanyukira 2
nsazeewo 2
nsigo 2
nsimbye 2
nte 2
nteeka 2
nteekawo 2
ntiisa 2
ntukuvu 2
ntukuza 2
ntumanga 2
nvunaana 2
nywa 2
nzigya 2
nzizaamu 2
obagambe 2
obajjukiranga 2
obeeramu 2
obifunamu 2
obiggumizenga 2
obikolereko 2
obubaani 2
obuguzi 2
obukulu 2
obulenzi 2
obulimba 2
obumanyirivu 2
obusirusiru 2
obusungu 2
obutatunda 2
obutawabulwa 2
obuvumu 2
obuvunaanyizibwa 2
obuwala 2
obuyinza 2
obuzaale 2
obweru 2
obwesigwa 2
obwetaavu 2
ogalamiddeko 2
ogamba 2
ogenda 2
oggyeeko 2
oguddako 2
ogugibaliriddwamu 2
ogukigyaamu 2
ogumu 2
ogusooka 2
ogwa 2
okiteeka 2
okiwanga 2
okubagobawo 2
okubalika 2
okubawasiza 2
okubaŋŋanga 2
okubeeramu 2
okubimanya 2
okubireka 2
okubuulirirwa 2
okuddayo 2
okudduka 2
okufuna 2
okugabiranga 2
okuggyako 2
okujja 2
okukiwa 2
okukolanga 2
okukuumibwa 2
okukuumira 2
okukuŋŋaanya 2
okulaba 2
okulabirira 2
okulinunula 2
okulisiga 2
okumpi 2
okumubuulira 2
okumubuuza 2
okumulabula 2
okunenyezebwa 2
okungi 2
okununula 2
okunyooka 2
okusanyuka 2
okusinda 2
okusinga 2
okusisinkana 2
okuswala 2
okutegekera 2
okutundibwa 2
okutya 2
okuwaayoomwana 2
okuwakanira 2
okuwangula 2
okuweebwayo 2
okuyambanga 2
okuyiga 2
okuyitira 2
okuzikwatako 2
okwambala 2
okwasooka 2
okwata 2
okwaŋŋanga 2
okwebaka 2
okwebuuza 2
okwesuula 2
okweyongerayo 2
okwolekera 2
oleetedde 2
olisanyuka 2
olugendo 2
olulala 2
olumu 2
oluviiri 2
oluwanvu 2
olwasooka 2
olwekyo 2
omala 2
omalanga 2
omubiri 2
omubisi 2
omuddugavu 2
omugwenyufu 2
omukenkufu 2
omukka 2
omukolooni 2
omukono 2
omukoppolozi 2
omulambo 2
omulenzi 2
omulimu 2
omumyufu 2
omusirikale 2
omuwala 2
omwamoli 2
omwebbulaniya 2
omwewalanga 2
omwezi 2
omwonoonyi 2
ondaga 2
ondedde 2
onnyambe 2
onompanga 2
onooba 2
onoobanga 2
onoobiriiranga 2
onoobitundanga 2
onoogendanga 2
onookiwanga 2
onooleetanga 2
onooliiranga 2
onootambuliranga 2
onooyagalanga 2
onoozigulangamu 2
onsaasira 2
osanyuka 2
osanyusibwenga 2
osiga 2
osigaze 2
osikirizibwa 2
osobole 2
otuwadde 2
otyo 2
owe 2
owuliriza 2
oyagadde 2
oyagala 2
oyima 2
oyogereranga 2
ozikwata 2
pedaya 2
saalemi 2
saawuliriza 2
sanubalaati 2
sanyukanga 2
sassaayo 2
save 2
savekiriyasayimu 2
seebaka 2
seesobola 2
seremiya 2
seyiri 2
sibubikkira 2
sigikomako 2
sijja 2
sikimanyi 2
sikweka 2
simenye 2
sinaali 2
sireseeyo 2
siri 2
sirikuleka 2
ssaddaaka 2
ssayiri 2
sseddindi 2
ssekanyolya 2
sulemaani 2
taddamu 2
tagikeberanga 2
tagiwaanyisangamu 2
takyayinza 2
taleetangamu 2
talina 2
talinunudde 2
tanunulibwanga 2
tataddeeko 2
tatya 2
tebabonerezebwa 2
tebaddamu 2
tebakyaweebwa 2
tebamanyi 2
tebasobola 2
tebayinza 2
tebibalika 2
tebigasa 2
tebijja 2
tebiriimu 2
tebisobola 2
teguukendeezebwengako 2
temubawanga 2
temukiryanga 2
temuwasanga 2
temwalimu 2
tennatandika 2
teri 2
tetuddayo 2
tewabangawo 2
teweenyigiranga 2
teweerabiranga 2
teziggulwa 2
tezikyaŋŋanya 2
tezza 2
tidali 2
tobaliddeeko 2
tofumbiranga 2
togaana 2
tokyalina 2
tolemanga 2
tolwawo 2
tomusuuliriranga 2
tosobola 2
toyanguyirizanga 2
ttale 2
tubasendesende 2
tubatte 2
tudduke 2
tuggyeko 2
tuggyewo 2
tukiko 2
tukirumbe 2
tunula 2
waago 2
waagwo 2
wabaawo 2
wabweru 2
wala 2
walayirira 2
waleme 2
watali 2
wazzeewo 2
weewale 2
wekka 2
wonna 2
wuzi 2
yaabwe 2
yaago 2
yaakatandika 2
yagula 2
yakola 2
yakomawo 2
yaligulako 2
yamuwa 2
yanguwa 2
yanyaga 2
yasikira 2
yawaayo 2
yeebaka 2
yeesalira 2
yeetegereza 2
yeezizise 2
yekka 2
yenkanankana 2
yiye 2
yogera 2
yoyada 2
zadooki 2
zakkuli 2
zange 2
zeboyimu 2
zeena 2
zifudde 2
ziggalwe 2
zinaafuukanga 2
zino 2
zinsukkiriddeko 2
zisinga 2
zizza 2
zowaali 2
zzadde 2
