mu 495
ku 337
n 307
nga 306
nti 207
ne 158
ng 147
e 131
era 121
y 82
wa 81
gavumenti 71
abantu 70
bwe 67
bw 64
w 63
kino 52
olw 51
ate 49
eno 49
naye 46
ya 41
kubanga 38
gw 37
bano 36
ye 36
guno 34
agamba 32
b 32
eby 32
uganda 32
abaana 31
by 31
kya 31
poliisi 31
z 30
enjawulo 29
gye 29
bino 28
buli 27
be 26
okuva 26
ono 26
we 26
abamu 25
ebintu 25
g 25
kye 25
lino 25
omubaka 25
wabula 25
yagambye 25
emirimu 24
essomero 24
gy 24
ky 24
lya 24
bagenda 23
bye 23
gwa 23
kati 23
minisita 23
nnyo 23
okukola 23
omwana 23
abakyala 22
akulira 22
aba 21
amazzi 21
bagamba 21
ente 21
eri 21
lwa 21
oluvannyuma 21
ow 21
abadde 20
agambye 20
ssente 20
ba 19
lw 19
oba 19
ssentebe 19
alina 18
kkampuni 18
kyokka 18
ly 18
okufuna 18
okulaba 18
amaanyi 17
baabwe 17
eggwanga 17
maaso 17
okuli 17
omu 17
ttaka 17
abalala 16
ategeezezza 16
ekya 16
ez 16
kampala 16
kkooti 16
nsonga 16
zino 16
abayizi 15
gya 15
kuba 15
tebalina 15
wamu 15
yonna 15
ze 15
ab 14
abaami 14
balina 14
bya 14
dr 14
ey 14
gwe 14
mwoleso 14
okutuuka 14
omugenzi 14
omuntu 14
owa 14
sheikh 14
agenda 13
ali 13
bwa 13
disitulikiti 13
kabaka 13
mmotoka 13
museveni 13
mwe 13
omulimu 13
omusango 13
pulezidenti 13
yategeezezza 13
za 13
zaake 13
000 12
abavubuka 12
amateeka 12
buganda 12
group 12
kw 12
kyalo 12
na 12
okuba 12
omuli 12
omutindo 12
palamenti 12
polof 12
vision 12
100 11
abazadde 11
asaba 11
bakola 11
bangi 11
bantu 11
bukedde 11
ebyenjigiriza 11
egenda 11
ekitongole 11
embeera 11
emmotoka 11
endala 11
ensi 11
ettaka 11
harvest 11
k 11
kaabuyonjo 11
kiseera 11
money 11
wano 11
2 10
abakulembeze 10
bali 10
bitundu 10
bulungi 10
ebitundu 10
ekizimbe 10
emyaka 10
ennaku 10
ggombolola 10
mirimu 10
mulumba 10
nnannyini 10
obulungi 10
obutonde 10
obuvunaanyizibwa 10
ofiisi 10
okubeera 10
okutuusa 10
okwongera 10
omwoleso 10
wakati 10
yali 10
10 9
ababazzi 9
abasiraamu 9
abatuuze 9
bbaasi 9
ddala 9
ebbeeyi 9
ettendekero 9
ga 9
kimu 9
kololo 9
kwe 9
lye 9
nabo 9
obujulizi 9
obukadde 9
okukuuma 9
sizoni 9
ttiimu 9
wiiki 9
yunivasite 9
zzaabu 9
20 8
2022 8
abalimi 8
abasinga 8
akakiiko 8
amafuta 8
amagezi 8
amyuka 8
asabye 8
byonna 8
cansala 8
council 8
ebikozesebwa 8
ebyemikono 8
eggulo 8
eky 8
emu 8
etaano 8
ggwanga 8
gimbo 8
kalungu 8
kibuga 8
kitundu 8
nsubuga 8
obuwumbi 8
omukolo 8
school 8
si 8
sipiika 8
ssabbuuni 8
vipers 8
waliwo 8
wange 8
wansi 8
7 7
abakulu 7
abavubi 7
abeera 7
akawoowo 7
asobola 7
ayagala 7
baagala 7
babadde 7
bafuna 7
basobole 7
bonna 7
bungi 7
byabwe 7
ddwaliro 7
ebadde 7
ebirala 7
ebyuma 7
ekibiina 7
ekiseera 7
ekitundu 7
emipiira 7
enkoko 7
ensonga 7
gyaviira 7
kabanda 7
katonda 7
kaweefube 7
kcca 7
kifo 7
kyetume 7
leero 7
naddala 7
nsi 7
obubaka 7
okukozesa 7
okusoma 7
olina 7
oludda 7
olukiiko 7
olunaku 7
omulembe 7
ssinga 7
tekinologiya 7
yeebazizza 7
1 6
ababbi 6
abalunzi 6
abasomesa 6
akabenje 6
amaka 6
amasomero 6
amata 6
amatendekero 6
atwala 6
baana 6
baategeezezza 6
bannaabwe 6
basabye 6
batandise 6
bbanka 6
bbeeyi 6
bifo 6
david 6
ddyo 6
ebigambo 6
embuzi 6
emikono 6
emmere 6
endwadde 6
enkulaakulana 6
ennyo 6
ensimbi 6
expo 6
gano 6
kisaawe 6
kukola 6
lukwago 6
lwe 6
maj 6
maka 6
march 6
mbeera 6
moses 6
mutono 6
mwalo 6
naawe 6
nkola 6
nnamba 6
nteekateeka 6
obulemu 6
oguwedde 6
okumanya 6
okusinziira 6
okutandika 6
okutumbula 6
okutwala 6
okwogera 6
oluwaabi 6
olwo 6
omubeezi 6
omumyuka 6
omusolo 6
omwaka 6
omwami 6
ssatu 6
ssemwanga 6
super 6
wadde 6
zaabwe 6
3 5
5 5
8 5
ababaka 5
abagenda 5
abakulira 5
abaliko 5
abalina 5
abasawo 5
abo 5
africa 5
ajja 5
alipoota 5
alupo 5
awamu 5
baali 5
bakozesa 5
bakyala 5
bazadde 5
beesunga 5
bingi 5
bubi 5
bukulembeze 5
bulamu 5
bwabwe 5
ddagala 5
ebinene 5
ebya 5
ekifo 5
ekirala 5
ekiro 5
ekisiibo 5
ekitiibwa 5
ekizibu 5
emizannyo 5
emmwaanyi 5
emmwanyi 5
empisa 5
engeri 5
enkola 5
entambula 5
enteekateeka 5
erina 5
essaza 5
ethiopia 5
eyabadde 5
fc 5
gino 5
ibrahim 5
jinja 5
kano 5
katale 5
kigambibwa 5
kipsiro 5
kizimbe 5
kkono 5
kyamuliibwa 5
makerere 5
makumbi 5
misinde 5
mugisha 5
muhammad 5
mukasa 5
munaana 5
mupiira 5
mutindo 5
mwana 5
mwanje 5
nabweru 5
newankubadde 5
ngeri 5
obujjanjabi 5
obukugu 5
obuluma 5
obw 5
ogw 5
okuddamu 5
okugenda 5
okulunda 5
okusinga 5
okuwulira 5
okuzimba 5
okwewala 5
okwolesa 5
omukazi 5
omusaayi 5
ossa 5
pulojekiti 5
september 5
town 5
tugenda 5
waabwe 5
waggulu 5
yasabye 5
11 4
30 4
80 4
abakozi 4
abali 4
abazannyi 4
abazze 4
afuna 4
agamu 4
akalulu 4
amagombolola 4
amagye 4
amasannyalaze 4
amasundiro 4
april 4
asisinkanye 4
asobole 4
asooka 4
ategeeza 4
ayita 4
azze 4
baba 4
balimwezo 4
baminisita 4
bannayuganda 4
banne 4
baweebwe 4
bazze 4
bibiina 4
bintu 4
bo 4
bodaboda 4
boodabooda 4
budaaki 4
butto 4
bwensi 4
charles 4
college 4
dda 4
ebbaluwa 4
ebibanja 4
ebigenda 4
ebika 4
ebiri 4
ebweru 4
ebyokwerinda 4
egimu 4
ejja 4
ekirungi 4
ekivuddeko 4
ekyo 4
embi 4
ery 4
ewedde 4
express 4
eya 4
ffaamu 4
gaddafi 4
ge 4
gutandise 4
gwabwe 4
gyabwe 4
international 4
jjajja 4
john 4
joseph 4
ka 4
kaawaase 4
kaduco 4
kamya 4
kaweesi 4
kayondo 4
kijja 4
kisoboka 4
kisowera 4
kitegeeza 4
kiwedde 4
kizito 4
kuliko 4
kutendekebwa 4
kwa 4
kwongera 4
league 4
liigi 4
lunaku 4
luzannya 4
lwaki 4
lwo 4
maama 4
maanyi 4
makyiino 4
malwaliro 4
martyrs 4
masomero 4
mateeka 4
mayaye 4
mpaka 4
muhangi 4
mukolo 4
mukono 4
mukyala 4
muntu 4
mutendera 4
myaka 4
nakaayi 4
nawangwe 4
nayo 4
nnaabagereka 4
nsambya 4
nsiike 4
nsimbi 4
obukulembeze 4
obuli 4
obulimi 4
obulunzi 4
obutaba 4
obuvune 4
obuyinza 4
obwesige 4
obwetaavu 4
okubadduukirira 4
okukakasa 4
okukolera 4
okukyusa 4
okumuggyamu 4
okutendeka 4
okuvaayo 4
okuyiga 4
okwekebeza 4
oluusi 4
omugoba 4
omulamuzi 4
omulanga 4
omusajja 4
onen 4
oulanyah 4
patrick 4
paul 4
peter 4
sarah 4
simbwa 4
ssaawa 4
ssabuuni 4
ssomero 4
steven 4
sudan 4
taata 4
tanui 4
tebandeke 4
technical 4
tumwebaze 4
ura 4
wakibi 4
walugembe 4
wiini 4
wo 4
yabadde 4
yagasseeko 4
yayongeddeko 4
yennyamidde 4
00 3
12 3
18 3
19 3
2-0 3
2021 3
21 3
26 3
800 3
abaali 3
abakadde 3
abakugu 3
abasoba 3
abasoma 3
abatayagala 3
abato 3
abawa 3
abdu 3
adduukiridde 3
agabakakasa 3
agali 3
akola 3
akozesa 3
akubirizza 3
akulembeddemu 3
akuutidde 3
akwasa 3
alaajanira 3
alagidde 3
alondeddwa 3
amabaluwa 3
amabanja 3
amawulire 3
amaze 3
andrew 3
arabia 3
asiimye 3
asinzidde 3
atyo 3
awaka 3
awatali 3
awezezza 3
aya 3
ayinza 3
ayogera 3
ayogerako 3
baabadde 3
babeera 3
babiri 3
badduka 3
bagenze 3
bakulembeddwa 3
bakulembeddwaamu 3
bakwatiddwa 3
balinze 3
bamanyi 3
bamulekwa 3
bange 3
bannannyini 3
basazeewo 3
basobola 3
baweereddwa 3
bayinza 3
bbaale 3
bbiri 3
bekikwatako 3
bibanja 3
big 3
birombe 3
bishop 3
bitongole 3
bizinensi 3
bombi 3
bongere 3
bubiri 3
bubonero 3
bucaafu 3
bukomansimbi 3
bukya 3
bulijjo 3
buno 3
busoga 3
busulwa 3
buwanguzi 3
buwembo 3
buyamba 3
byakatonda 3
byogeddwa 3
commonwealth 3
covid 3
daniel 3
ddwaaliro 3
dit 3
eba 3
ebbanga 3
ebikolwa 3
ebirowoozo 3
ebirungo 3
ebitongole 3
edda 3
eddembe 3
ekikulu 3
ekimu 3
ekivaako 3
emidaali 3
emiriraano 3
emirundi 3
emisinde 3
emyala 3
enguzi 3
enjala 3
enkulu 3
erias 3
erya 3
esatu 3
essanyu 3
essuubi 3
ewa 3
eyita 3
eyo 3
ezimu 3
farmers 3
fattah 3
felix 3
fred 3
gaabwe 3
gaayo 3
gaggaddwa 3
gen 3
george 3
ggoolo 3
gm 3
grace 3
hajji 3
hiisa 3
house 3
ii 3
james 3
janet 3
juma 3
juniour 3
kafeero 3
kamoga 3
kasangati 3
kasasiro 3
katikkiro 3
kawempe 3
ke 3
kibanja 3
kibiina 3
kiggundu 3
kigo 3
kiro 3
kirungi 3
kitaabwe 3
kivuddeko 3
kiyambeko 3
kkansala 3
kubba 3
kubeera 3
kumanya 3
kusima 3
kusobola 3
kuteesa 3
kuwuubaala 3
kwogera 3
kyabwe 3
kyagulanyi 3
kyamanywa 3
kyonna 3
langi 3
libya 3
limbo 3
loogi 3
ltd 3
lubaga 3
lukaya 3
luno 3
lususu 3
lwamaggwa 3
lwengo 3
magombolola 3
maroons 3
matendekero 3
mayumba 3
mikono 3
mirembe 3
misango 3
misomo 3
mita 3
mityana 3
mmeeya 3
mmita 3
mugumya 3
mukaaga 3
mukulu 3
muleke 3
mulimu 3
musajja 3
musango 3
mutebi 3
muwonge 3
muyingo 3
muzadde 3
mw 3
nduggwa 3
nkozi 3
nkya 3
nsisinkano 3
nte 3
ntya 3
nyanzi 3
nze 3
obumenyi 3
obwakabaka 3
obwami 3
october 3
of 3
ogwa 3
oku 3
okubayamba 3
okubifuna 3
okudda 3
okufaayo 3
okuleeta 3
okulinnya 3
okulwanyisa 3
okumala 3
okusaba 3
okusima 3
okusobola 3
okusonda 3
okutambuza 3
okuteekamu 3
okuteekawo 3
okutema 3
okutulugunya 3
okuvuganya 3
okuyambako 3
okuyingira 3
okuyita 3
okwagala 3
okwegatta 3
okwetaba 3
okweyambisibwa 3
okweyanza 3
olutalo 3
olwa 3
omuduumizi 3
omuggya 3
omukisa 3
omukozi 3
omukwano 3
omukyala 3
omulala 3
omulimi 3
omupiira 3
omusana 3
omutendesi 3
omuze 3
omwogezi 3
owekibanja 3
pikipiki 3
principal 3
rakai 3
russia 3
sabbuuni 3
saudi 3
sebute 3
seed 3
singa 3
siriimu 3
so 3
ssaako 3
ssebuggwawo 3
ssenga 3
ssiiru 3
sugar 3
sultan 3
tajja 3
talina 3
tasobola 3
tawuni 3
tebasobola 3
tewali 3
ttendekero 3
ttuleera 3
turyamusiima 3
utc 3
veriyano 3
weekuba 3
wine 3
world 3
yaabwe 3
yadde 3
yakwatiddwa 3
yasazeewo 3
yusuf 3
zokka 3
zonna 3
1-1 2
10000 2
13 2
15 2
1500 2
17 2
200 2
2010 2
2019 2
28 2
300 2
31 2
40 2
9 2
a 2
abaabadde 2
abaakoseddwa 2
abaayolesezza 2
ababadde 2
ababiri 2
abafunye 2
abagambibwa 2
abagenyi 2
abagenzi 2
abagoba 2
abajaagaliza 2
abakola 2
abakristu 2
abakuba 2
abakungu 2
abakwate 2
abalenzi 2
abalwadde 2
abamyuka 2
abanoonya 2
abasaba 2
abasajja 2
abataagala 2
abataka 2
abatta 2
abatwala 2
abavumaganya 2
abawagizi 2
abawawaabirwa 2
abdallah 2
abebibanja 2
abeebaza 2
abeetabye 2
abeewaabwe 2
aboomugaso 2
abwoki 2
addayo 2
adde 2
addukanya 2
afunamu 2
afune 2
ag 2
agnes 2
akakasizza 2
akatale 2
akiikirira 2
akomawo 2
akomyeewo 2
akungubagidde 2
akuutira 2
akyazizza 2
alaba 2
alabudde 2
alagira 2
alangiridde 2
aloysius 2
alule 2
alumiriza 2
amakula 2
amanyiddwa 2
amatondo 2
amerika 2
among 2
amuwa 2
ana 2
anifa 2
anita 2
annyonnyola 2
anoonya 2
anthony 2
antony 2
asinga 2
association 2
atandise 2
atendereza 2
atenderezza 2
athletics 2
atuuka 2
augustine 2
avumiridde 2
awa 2
awadde 2
awolereza 2
ayisaamu 2
ayogedde 2
ayub 2
aziikiddwa 2
baabivaako 2
baakizuula 2
baakuweebwa 2
baami 2
baatuula 2
baayoleseza 2
babalambuza 2
babisopu 2
bafunamu 2
bagambye 2
baganda 2
bagguddewo 2
bajja 2
bakashaba 2
bakimanyi 2
bakozi 2
balimi 2
balindiridde 2
balinga 2
balowooza 2
balyejjusa 2
bamala 2
bamaze 2
bamenyi 2
bammwe 2
bamu 2
bamukuutira 2
bamutulugunya 2
bamutunda 2
banaabeera 2
bannabyabufuzi 2
bannaddiini 2
bannamateeka 2
bannanyini 2
bannyonnyodde 2
basaabaze 2
basaanye 2
basanga 2
baserikale 2
basiimye 2
basima 2
basusse 2
basuubira 2
bataasa 2
batandike 2
batono 2
batuuka 2
batuula 2
batwawula 2
bavubuka 2
bavunaanibwa 2
bawanjagidde 2
bayibuli 2
bayita 2
beetegefu 2
beti 2
bibadde 2
bigambo 2
bigenda 2
birungi 2
biseera 2
bobi 2
bombo 2
bongedde 2
bp 2
bubaka 2
bugoloobi 2
buikwe 2
bukadde 2
bukoto 2
bukugu 2
bushenyi 2
busingye 2
butereevu 2
butongole 2
buyondo 2
buyonjo 2
buzibu 2
bwakabaka 2
bwanika 2
bwati 2
bwatyo 2
bwavu 2
bwenkanya 2
bwogi 2
bwokka 2
byabadde 2
byali 2
byalo 2
center 2
chrysostom 2
col 2
community 2
cooperative 2
county 2
damian 2
ddeesike 2
dduyiro 2
december 2
development 2
difensi 2
dinia 2
diviizoni 2
don 2
doola 2
ebbugumu 2
ebbula 2
ebibajje 2
ebibi 2
ebibiina 2
ebibira 2
ebirungi 2
ebiseera 2
ebiva 2
ebizibu 2
ebizigo 2
ebizimbe 2
ebyemizannyo 2
ebyenfuna 2
ebyentambula 2
ebyo 2
ebyobuzimbi 2
eddagala 2
efuumudde 2
egambibwa 2
egy 2
ekibuga 2
ekidomola 2
ekifaananyi 2
ekikula 2
ekikye 2
ekimanyiddwa 2
ekiraalo 2
ekireeseewo 2
ekirooto 2
ekirungo 2
ekisaawe 2
ekisajja 2
ekwata 2
ekyokulabirako 2
ekyuma 2
elgon 2
emabega 2
emidaala 2
emikisa 2
emiriano 2
emisolo 2
emiti 2
emitwe 2
emivuyo 2
emmanuel 2
empenda 2
engaano 2
engalo 2
engendo 2
engoye 2
enkaayana 2
enkiiko 2
enkya 2
ennyana 2
ennyumba 2
ensangi 2
ensiike 2
ensimbu 2
entebe 2
envuba 2
enzibe 2
erisangibwa 2
esinga 2
essaala 2
essatu 2
essira 2
etendekero 2
etuwadde 2
etwala 2
ewangula 2
ex 2
eyafiira 2
eyagala 2
eyali 2
eyamutwala 2
eyasooka 2
eyitibwa 2
ezikola 2
ezingizza 2
ezisoba 2
ezitali 2
eziva 2
ezo 2
ezra 2
faridah 2
fayinolo 2
fayiro 2
ffirimbi 2
foundation 2
fr 2
francis 2
frank 2
gadafi 2
galabuzi 2
gamba 2
ggaggadde 2
gubadde 2
gwaka 2
gwetabiddwaako 2
hajat 2
haruna 2
harvestmoneyexpo 2
health 2
hotel 2
imc 2
industrial 2
institute 2
isaac 2
jacob 2
joyce 2
kaabong 2
kabaddemu 2
kabenje 2
kadde 2
kalangala 2
kalema 2
kalyango 2
kamisoona 2
kampeyini 2
kanyike 2
kasangaki 2
kasita 2
kataaha 2
kataha 2
kato 2
katono 2
katuuso 2
kawooya 2
kayima 2
kayunga 2
kcb 2
keita 2
kiddiridde 2
kifuba 2
kigongo 2
kikopo 2
kikulu 2
kisenge 2
kitara 2
kitebe 2
kituufu 2
kiwawu 2
kizibu 2
kizinga 2
kkanso 2
kkolero 2
kkusu 2
kojjaabwe 2
kontulakita 2
kubeerawo 2
kufuna 2
kugezesebwa 2
kukikola 2
kulaba 2
kulima 2
kuloopa 2
kulya 2
kusigala 2
kusoma 2
kusomesa 2
kusooka 2
kuva 2
kuwa 2
kuwakanyizibwa 2
kuwulira 2
kuziika 2
kyengera 2
lagu 2
lc 2
lc1 2
lci 2
lifuuka 2
liita 2
lira 2
looya 2
lubiri 2
ludda 2
luguudo 2
lukiiko 2
lulonze 2
luzira 2
lwokubiri 2
lwokusatu 2
lwokutaano 2
mabaluwa 2
magulu 2
makindye 2
makungula 2
maliri 2
maneja 2
masaka 2
mata 2
maviiri 2
mawanga 2
mayiga 2
mazzi 2
mbuya 2
medical 2
meeya 2
mingi 2
minisitule 2
miruka 2
misindye 2
misolo 2
mmengo 2
mo 2
mpisa 2
mrc 2
mugenda 2
mugume 2
mukenenya 2
mukutu 2
mulamu 2
muli 2
mulundi 2
mumuggyeeyo 2
mumulinako 2
mumyuka 2
munda 2
munnayuganda 2
munno 2
muno 2
musa 2
musaala 2
musinguzi 2
mutanzania 2
mutumba 2
muyanja 2
muyi 2
muzigiti 2
mwaalo 2
mwebaze 2
mwezi 2
mwoyo 2
myda 2
nakawa 2
naluwooza 2
nantale 2
nanyondo 2
nassaka 2
ndaba 2
ndejje 2
njake 2
njala 2
nkambi 2
nkoko 2
nkoze 2
nnamulondo 2
nnwana 2
nnyingi 2
november 2
nsindika 2
ntebe 2
ntege 2
ntikko 2
ntulume 2
nvuba 2
obubi 2
obubonero 2
obukodyo 2
obulabe 2
obulamu 2
obululu 2
obulwadde 2
obuntu 2
obusiraamu 2
obusungu 2
obuyambi 2
obuzibu 2
obwaami 2
obweruufu 2
obwo 2
odoch 2
ogenda 2
ogwaka 2
okubaako 2
okubadde 2
okubangula 2
okubategekera 2
okubayambako 2
okubba 2
okubikozesa 2
okubiri 2
okubulwa 2
okufiira 2
okufulumya 2
okuganyulwa 2
okugezesebwa 2
okugoba 2
okugula 2
okujjumbira 2
okukikola 2
okukolagana 2
okukolebwa 2
okukomawo 2
okukomya 2
okukuba 2
okukubira 2
okukulaakulanya 2
okukungaanya 2
okulabirira 2
okulera 2
okulowooza 2
okulya 2
okumalawo 2
okumukuba 2
okumuyamba 2
okunoonyereza 2
okusigala 2
okusisinkana 2
okusomesa 2
okusoomozebwa 2
okussa 2
okutaasa 2
okutabaganya 2
okutabuka 2
okutabula 2
okutta 2
okutunda 2
okutuukiriza 2
okutya 2
okuviira 2
okuwa 2
okuwaayo 2
okuwangulira 2
okuweereza 2
okuyamba 2
okuziika 2
okuzuula 2
okuzza 2
okw 2
okwagazisa 2
okwekuba 2
okwekulaakulanya 2
okwetandikirawo 2
okwetooloola 2
okwewa 2
okwewozaako 2
okweyongera 2
okwonoona 2
oli 2
olulwana 2
olutudde 2
oluvanyuma 2
omara 2
omugotteko 2
omujjuzo 2
omukono 2
omukristu 2
omukulu 2
omukuumi 2
omukwanaganya 2
omulamu 2
omulamwa 2
omuluka 2
omulundi 2
omulungi 2
omusawo 2
omuti 2
omuwendo 2
omuzikiti 2
owners 2
oyo 2
oyongeramu 2
primary 2
puleesa 2
pulogulaamu 2
rcc 2
rdc 2
road 2
robert 2
ronald 2
saaka 2
saddam 2
sadiki 2
safeboda 2
salim 2
sam 2
sgt 2
sharif 2
shiekh 2
simon 2
society 2
sooka 2
south 2
sp 2
ssaabasajja 2
ssaabawolereza 2
ssaati 2
ssande 2
ssempijja 2
ssendegeya 2
ssentaayi 2
ssenyonga 2
sserunjogi 2
ssimu 2
ssuubi 2
sukaali 2
sulaiman 2
sunflower 2
sylvia 2
tannatandika 2
tayagala 2
tebafaayo 2
tekuli 2
tom 2
tulina 2
tusobola 2
tuzze 2
twaha 2
twitter 2
uhuru 2
ukraine 2
united 2
university 2
upbc 2
updf 2
us 2
usdp 2
ven 2
wabaddewo 2
wabweru 2
wagenda 2
wahaab 2
wala 2
wanyama 2
weetaaga 2
yaakyo 2
yahya 2
yakola 2
yakutte 2
yakuutidde 2
yaleeta 2
yandibadde 2
yannyonnyodde 2
yasensebuse 2
yasiimye 2
yasuuza 2
yatandikira 2
yatuusizza 2
yatwalibwa 2
yava 2
yawaddeyo 2
yawakanyizza 2
yawangudde 2
yawangulira 2
yawulira 2
yeekokodde 2
yeeyama 2
yeeyambisa 2
yeeyamye 2
yo 2
yokka 2
yusufu 2
zibadde 2
zziwa 2
