mu 487
ku 352
n 276
nga 268
nti 204
e 151
ng 141
ne 133
y 90
era 88
wa 87
w 76
bwe 65
ya 54
kya 52
z 47
poliisi 46
ye 46
kkooti 42
naye 39
abantu 38
ate 37
buli 35
noella 35
za 34
kino 33
gavumenti 32
ky 32
yagambye 32
ssente 31
wabula 31
bw 30
okuva 30
gye 29
ekibiina 28
oluvannyuma 28
olw 28
aba 26
ba 26
uganda 26
abaana 25
agamba 25
guno 24
gw 24
okuli 24
omusango 24
lw 23
omulamuzi 23
yategeezezza 23
2022 22
ez 22
kuba 22
omu 22
abamu 21
b 21
bano 21
by 21
eno 21
dr 20
ono 20
be 19
bino 19
gy 19
kubanga 19
kyokka 19
palamenti 19
ze 19
ab 18
bukedde 18
gwe 18
kati 18
metropolitan 18
abalala 17
akulira 17
bwa 17
kampala 17
kye 17
ali 16
balina 16
disitulikiti 16
ekiro 16
enkola 16
kwe 16
okutuusa 16
owa 16
abadde 15
buno 15
eby 15
empaka 15
ensonga 15
february 15
klesia 15
okukola 15
ssaabasumba 15
ssentebe 15
we 15
g 14
kakiiko 14
kiseera 14
lwa 14
muzeeyi 14
abakyala 13
abasodokisi 13
babadde 13
eri 13
ggwanga 13
gwa 13
kkampuni 13
maaso 13
okufuna 13
okutuuka 13
omumyuka 13
pulezidenti 13
ssenyonga 13
waabwe 13
100 12
ababaka 12
abazadde 12
asaba 12
ebintu 12
ekitundu 12
ekya 12
embeera 12
emirimu 12
enjawulo 12
ka 12
kayunga 12
ly 12
lya 12
mmisa 12
obukadde 12
okukuba 12
okulaba 12
omuliro 12
si 12
ssaawa 12
town 12
1 11
5 11
abasuubuzi 11
africa 11
akakiiko 11
bagamba 11
busoga 11
bya 11
ebibiina 11
ffamire 11
jeronymos 11
kalangala 11
kifo 11
kitebe 11
kwa 11
leero 11
maka 11
minisita 11
nrm 11
nsamba 11
nsonga 11
ofiisi 11
ow 11
wakati 11
yali 11
zino 11
11 10
agambye 10
alina 10
amateeka 10
arabia 10
ategeeza 10
bantu 10
bp 10
budde 10
eggwanga 10
emmotoka 10
ennaku 10
eya 10
kibiina 10
kyabazinga 10
mpaka 10
naigaga 10
namwirya 10
okubeera 10
omuntu 10
ssenkatuuka 10
wamu 10
yabadde 10
6 9
abaakaligibwa 9
abatuuze 9
amazzi 9
baagala 9
bali 9
bazze 9
ben 9
blick 9
bye 9
ddala 9
ebyapa 9
ebyuma 9
emyaka 9
essomero 9
ettaka 9
ey 9
ga 9
k 9
kano 9
katale 9
kitundu 9
kkomera 9
march 9
namungoona 9
olwo 9
omuserikale 9
omuzannyo 9
omwana 9
omwogezi 9
saudi 9
wadde 9
wambuzi 9
00 8
000 8
10 8
abalangira 8
agenda 8
amafuta 8
amyuka 8
ategeezezza 8
baali 8
bannayuganda 8
bifo 8
bitundu 8
ebirala 8
ekifo 8
eklesia 8
ge 8
gya 8
jinja 8
kcca 8
kibira 8
kw 8
lwe 8
lye 8
mateeka 8
naddala 8
nansana 8
nup 8
okusinziira 8
okusobola 8
okuyingira 8
okwongera 8
omwaka 8
sn 8
ssaako 8
13 7
16 7
2 7
2021 7
3 7
abadigize 7
abakozi 7
akola 7
amasasi 7
bafuna 7
bagenda 7
bangi 7
basatu 7
baza 7
bbaala 7
bbiri 7
charles 7
clerk 7
dda 7
dipu 7
ebimu 7
ebyo 7
egya 7
ekitiibwa 7
ekitongole 7
emyala 7
famire 7
fdc 7
gabula 7
geoffrey 7
kafeero 7
kasasiro 7
kituufu 7
kizimbe 7
kuno 7
lino 7
lutikko 7
mbeera 7
minisitule 7
mirimu 7
mmemba 7
muntu 7
musango 7
oba 7
of 7
okusaba 7
omugenzi 7
omukuumi 7
patrick 7
ssemateeka 7
ssempijja 7
tanzania 7
tebalina 7
ttabamiruka 7
waliwo 7
yalondebwa 7
15 6
19 6
abakungu 6
abavubuka 6
abayizi 6
agambibwa 6
anita 6
asimbiddwa 6
atayo 6
ayagala 6
babiri 6
bakola 6
bobi 6
council 6
ebyokulonda 6
eggombolola 6
ekissi 6
eky 6
emyezi 6
enkadde 6
ensimbi 6
erya 6
gumu 6
ii 6
kabagambe 6
kibuga 6
kimu 6
kiraabu 6
kunoonyereza 6
kyalo 6
looya 6
lubaga 6
miss 6
mulago 6
muzannyo 6
nicholas 6
nkola 6
nnyo 6
obuwumbi 6
ogw 6
ogwa 6
oku 6
okugenda 6
okugereka 6
okukozesa 6
okunoonyereza 6
okutegeka 6
olukiiko 6
omuggya 6
omukulembeze 6
omulangira 6
omulimu 6
omusuubuzi 6
omuwaabi 6
omuyizi 6
rukare 6
ssimu 6
tewaabadde 6
yagenda 6
yeemulugunyizza 6
zaake 6
zziwa 6
29 5
40 5
abaagwa 5
abaffamire 5
abakkiriza 5
abali 5
alumizibwa 5
asobole 5
augustine 5
bakkansala 5
bakungu 5
basabye 5
basobola 5
bbeeyi 5
bigambibwa 5
bulungi 5
bungi 5
buvunaanyizibwa 5
bwonna 5
chemutai 5
colombus 5
congo 5
cross 5
ddwaliro 5
dp 5
ebadde 5
ebidongo 5
ebidyeri 5
edward 5
eggulo 5
egy 5
ekintu 5
ekisulo 5
ekyapa 5
elizabeth 5
ente 5
eyagenda 5
hajji 5
kabowa 5
kabuye 5
kalulu 5
ke 5
kitongole 5
kityo 5
lookman 5
lukwago 5
mmotoka 5
mpapula 5
mubiru 5
mukyala 5
munaana 5
mwana 5
mwe 5
nabo 5
ncs 5
nze 5
obudde 5
okuba 5
okuleeta 5
okulonda 5
okumala 5
okusangibwa 5
okutolontoka 5
okutuula 5
okutuuza 5
okuvaayo 5
okwebaza 5
oludda 5
olwa 5
omubaka 5
omukyala 5
omulambo 5
omuvuzi 5
omuwala 5
omwezi 5
oxygen 5
paapa 5
pallaso 5
pikipiki 5
reynold 5
sipiika 5
siteegi 5
ssinga 5
tour 5
wine 5
yonna 5
2020 4
23 4
4 4
7 4
abalwadde 4
abaserikale 4
adda 4
adf 4
agattako 4
akozesa 4
amaanyi 4
amabbaala 4
amanda 4
amasomero 4
amawulire 4
anguyo 4
asabye 4
asindikiddwa 4
asobola 4
atuuzibwa 4
ava 4
awamu 4
ayita 4
baabwe 4
bajja 4
bakansala 4
bakozesa 4
bammemba 4
bannamateeka 4
bawakanya 4
bazadde 4
bbaasi 4
bibadde 4
boodabooda 4
bulamu 4
bumativu 4
bwangu 4
bwetaavu 4
byapa 4
ebbaala 4
ebiri 4
ebitabo 4
ebitundu 4
ebyalo 4
ebyobulamu 4
ebyokwerinda 4
egenda 4
ejja 4
ekika 4
ekirwadde 4
ekiseera 4
ekitebe 4
ekiwandiiko 4
eklisia 4
ekyo 4
emirundi 4
engeri 4
enkaayana 4
enkulaakulana 4
ensi 4
enteekateeka 4
etteeka 4
ettofaali 4
gano 4
gutandike 4
gwabwe 4
henry 4
january 4
joseph 4
kalungu 4
katonda 4
kigambibwa 4
kirabira 4
kulondebwa 4
kwabwe 4
kyanjo 4
lightning 4
liigi 4
loughborough 4
lumunye 4
lwaki 4
makerere 4
masaka 4
masomero 4
mbarara 4
moses 4
mpuuga 4
mulamba 4
mulamu 4
musa 4
museveni 4
mutaasa 4
muwanga 4
mwaka 4
mwanza 4
nnamba 4
nninga 4
obujjanjabi 4
obulabe 4
obulamu 4
obulungi 4
obusobozi 4
obutagoberera 4
obutali 4
obw 4
okudda 4
okufa 4
okufuuka 4
okutambuza 4
okuzimba 4
okuzuula 4
omuggalo 4
omulembe 4
omuli 4
omulundi 4
omutukuvu 4
peace 4
ppaaka 4
puleesa 4
rakai 4
richard 4
school 4
september 4
singa 4
ssuuna 4
takisi 4
theodorous 4
time 4
todwong 4
ttaka 4
ttiimu 4
ttiyaggaasi 4
waggulu 4
walakira 4
wano 4
yaabwe 4
yafa 4
yagasseeko 4
yasabye 4
zooni 4
12 3
31 3
500 3
9 3
aanya 3
ababadde 3
ababbi 3
abagenda 3
abakazi 3
abakulembeze 3
abakulira 3
abakulu 3
abangi 3
abasaabaze 3
abasatu 3
abasomesa 3
abawerako 3
abazirakisa 3
abuusabuusa 3
afiiramu 3
afune 3
aggyamu 3
ak 3
akabenje 3
akakebe 3
akomezebwewo 3
akuuma 3
aleese 3
alekulira 3
amaka 3
amalwaliro 3
amannya 3
amaze 3
amazima 3
amina 3
among 3
annyonnyola 3
ansaba 3
app 3
arnest 3
asimbye 3
asooka 3
atambula 3
atereka 3
atwala 3
avudde 3
avuddeyo 3
awo 3
ayitirizza 3
baalonze 3
bagoberera 3
bakutte 3
bakwatagane 3
bakyala 3
balaga 3
balooya 3
bambega 3
bamukuba 3
bamutwala 3
bannaabwe 3
basazeewo 3
basobole 3
bataddewo 3
batunula 3
bbanga 3
bendera 3
bingi 3
biraze 3
birina 3
birivumbuka 3
bishop 3
bisopu 3
biwandiiko 3
booda 3
buganda 3
bukadde 3
bukoba 3
bulaga 3
bumanyirivu 3
bungereza 3
butalejja 3
buvuddeko 3
buvunaanyibwa 3
buyinza 3
buzibu 3
bwatyo 3
byansi 3
byobufuzi 3
byonna 3
committee 3
country 3
covid 3
ddigi 3
donald 3
dorothy 3
east 3
ebbanga 3
ebibye 3
ebidduka 3
ebifo 3
ebirina 3
ebisongovu 3
economy 3
eddakiika 3
eddembe 3
eddwaliro 3
ekibinja 3
ekibonerezo 3
ekikwekweto 3
ekimu 3
ekirungi 3
ekivvulu 3
ekyalo 3
ekyaviirako 3
embuto 3
emikono 3
emisinde 3
emisomo 3
engatto 3
enkulu 3
ensala 3
ensawo 3
entukuvu 3
erigamba 3
esatu 3
ewa 3
eyalekulira 3
eyali 3
eyatuula 3
eyookubiri 3
ezitaali 3
fr 3
francis 3
fuel 3
gino 3
gl 3
gonna 3
gubadde 3
gulu 3
hon 3
iganga 3
ipod 3
jeff 3
john 3
kaabuyonjo 3
kabega 3
kabenje 3
kaggo 3
kaleerwe 3
kamwokya 3
kaweefube 3
kazambi 3
kazigo 3
kenya 3
kibbululwa 3
kiddu 3
kigozi 3
kinnya 3
kirina 3
kiro 3
kisaakye 3
kisaka 3
kisitu 3
kivvulu 3
kiweebwa 3
kiwugulu 3
kizito 3
kkalenda 3
kkanso 3
kkopi 3
konsitityusoni 3
kukola 3
kukwasa 3
kulonda 3
kusuulawo 3
kwetu 3
kwewozaako 3
kwongera 3
kyayongedde 3
kyeyo 3
kyonna 3
lc1 3
ldc 3
luguudo 3
lukaya 3
lunaku 3
lwokuna 3
lwokutaano 3
maanyi 3
makindye 3
malwaliro 3
mary 3
mayuge 3
mengo 3
misango 3
misinde 3
mityana 3
mmere 3
motor 3
muhanga 3
mukamaawe 3
mukisa 3
mukolo 3
mulala 3
muliro 3
mumyuka 3
munene 3
munnayuganda 3
musiitwa 3
mutendera 3
muwonge 3
muyizi 3
mv 3
mw 3
mwagaanya 3
na 3
nakibirige 3
namba 3
nantege 3
natandise 3
nateete 3
national 3
nkaayana 3
nnaku 3
november 3
nsaba 3
nsalessale 3
nuba 3
obubonero 3
obujulizi 3
obumu 3
obumulemesa 3
obungi 3
obupiira 3
obusodokisi 3
obutambi 3
obuwaayiro 3
obuyambi 3
obwegendereza 3
obwenkanya 3
obwetaavu 3
ogufo 3
oguwedde 3
okubadde 3
okubayamba 3
okufiira 3
okuggulawo 3
okujulira 3
okukuuma 3
okulaga 3
okulekulira 3
okulondebwa 3
okusalawo 3
okusoma 3
okutaasa 3
okutalaaga 3
okuteekawo 3
okutigiinya 3
okutta 3
okuwereeza 3
okuwuliriza 3
okuyisaawo 3
okwagala 3
okweragira 3
okwetoloola 3
okwogera 3
okwonoona 3
olubuto 3
olumu 3
olunaku 3
olwaleero 3
olwekyo 3
omukaaga 3
omukka 3
omukulu 3
omusajja 3
omutwe 3
omuvubuka 3
omuwendo 3
omuyindi 3
oyo 3
p 3
paasita 3
peruth 3
prezidenti 3
proscovia 3
rdc 3
road 3
ruparelia 3
sarah 3
shemmy 3
simon 3
speaker 3
ssedduvutto 3
ssegirinya 3
ssese 3
ssewanyana 3
ssomero 3
stephen 3
storm 3
surrey 3
tabadde 3
tafuna 3
tebaweereddwa 3
tebeetaba 3
terina 3
tewali 3
teyakirengererawo 3
theodoros 3
ttawulo 3
tukolera 3
tulinda 3
turyasingura 3
tuyinza 3
tuzikwate 3
twamutaddewo 3
umma 3
updf 3
viika 3
waakakiiko 3
waka 3
wiiki 3
william 3
yafunye 3
yagitandikiddewo 3
yakutte 3
yandiweereddwa 3
yannyonnyodde 3
yasoose 3
yategezezza 3
yawadde 3
yayongeddwaako 3
yaziba 3
yeekwasa 3
yeenyigira 3
zijja 3
ziweddeyo 3
zokka 3
zonna 3
zzooni 3
14 2
17 2
18 2
1999 2
20 2
200 2
2007 2
2009 2
2014 2
2016 2
21 2
24 2
27 2
33 2
36 2
43 2
485 2
50 2
55 2
600 2
70 2
8 2
81 2
88 2
abaabadde 2
abaakwatiddwa 2
abaanyagibwa 2
abaddukanya 2
abagagga 2
abagoberezi 2
abakolera 2
abakulisa 2
abalimi 2
abalina 2
abalunzi 2
abamabbaala 2
abanaamweyirira 2
abasawo 2
abasoba 2
abasodookisi 2
abavuzi 2
abdunafi 2
abeera 2
abeetabye 2
abo 2
acamudde 2
afa 2
afunye 2
agaana 2
agaanyi 2
agakola 2
agasseeko 2
agende 2
agenze 2
agnes 2
agudde 2
aids 2
ajja 2
akabinja 2
akambe 2
akapima 2
akatale 2
akawuka 2
akawungeezi 2
akayimba 2
akolamu 2
akolera 2
akoze 2
akubye 2
akutamya 2
akyagenda 2
akyali 2
albania 2
alex 2
alimanda 2
alimu 2
alule 2
alumiriza 2
amagezi 2
amalidde 2
amangu 2
amanya 2
amatuufu 2
amazina 2
american 2
amizza 2
amukwata 2
amuriat 2
amusindika 2
amutwala 2
amuwe 2
amwekengera 2
anadda 2
and 2
angero 2
annet 2
arthur 2
asindise 2
asomerwa 2
asula 2
at 2
atadde 2
atc 2
ateeketeeke 2
athletics 2
attiddwa 2
atulugunya 2
atuuziddwa 2
atwalibwa 2
avunaanibwa 2
awali 2
awangudde 2
ayogera 2
ayongerako 2
aziikiddwa 2
azimbye 2
baafunye 2
baalina 2
baana 2
baasabye 2
baasanze 2
baba 2
babaka 2
babatwala 2
babbibwa 2
babeeko 2
baddukira 2
baddusibwa 2
bagambye 2
bagezaako 2
bakabona 2
bakkakkanye 2
bakomye 2
bakulembeddwa 2
bakyagenda 2
bakyalina 2
balaze 2
balumbye 2
balumiriza 2
balyoke 2
bamanyi 2
bamativu 2
bamaze 2
bamukomyewo 2
bamukozesa 2
bamulanga 2
bamulumiriza 2
bamwoyo 2
banannyini 2
bandikomyawo 2
banna 2
bannakibiina 2
bannannyini 2
banne 2
basemera 2
basimattuse 2
basinziira 2
batambulira 2
batandise 2
bategeeza 2
bategeezezza 2
batwawula 2
bava 2
bawuliziganya 2
bayitamu 2
beetaaga 2
belgium 2
betty 2
bibalirirwamu 2
bibiina 2
bigenda 2
bigere 2
bisatu 2
biwala 2
bo 2
boda 2
bokka 2
bonna 2
bubi 2
bugiri 2
bujjanjabi 2
bukenya 2
bukyaliwo 2
bumyuka 2
bunkenke 2
bupiira 2
busatu 2
busolwe 2
butya 2
buwanguzi 2
buyonaani 2
bwabwe 2
bwange 2
bwawedde 2
bweyategeezezza 2
byabwe 2
byali 2
byalo 2
byenfunidde 2
canon 2
championship 2
christine 2
church 2
commission 2
company 2
cooperation 2
cps 2
cranes 2
dan 2
david 2
ddwaaliro 2
ddyo 2
december 2
diguli 2
division 2
dugo 2
duku 2
ebbaluwa 2
ebbanja 2
ebigambo 2
ebika 2
ebikwata 2
ebirime 2
ebituufu 2
ebivvulu 2
ebiwandiiko 2
ebizibu 2
ebya 2
ebyana 2
ebyeddiini 2
ebyenjawulo 2
ebyenjigiriza 2
eddaala 2
eddiini 2
eddoboozi 2
eggye 2
egyali 2
egyaziba 2
egyo 2
ekifuba 2
ekisoboka 2
ekituufu 2
ekivundu 2
ekizimbe 2
ekizinga 2
ekola 2
ekutte 2
ekyabadde 2
ekyabaddewo 2
ekyakutte 2
ekyamuviirako 2
ekyavuddeko 2
ekyeeyo 2
ekyeyo 2
eligenda 2
emabega 2
emiggo 2
emikolo 2
emipiira 2
emirambo 2
emisango 2
emitwalo 2
emizannyo 2
emorimor 2
empya 2
emu 2
ena 2
endala 2
endongo 2
enduulu 2
enfo 2
enkiiko 2
enkozesa 2
enkya 2
ennono 2
ennume 2
ennyonta 2
ennyumba 2
ensaasaanya 2
entambula 2
entebe 2
enteekateka 2
entuula 2
erias 2
erina 2
eririwo 2
esembabule 2
essimu 2
etuula 2
etwala 2
ewadde 2
ewala 2
experito 2
eyagaanye 2
eyalwala 2
eyawangula 2
eyayitiddwaamu 2
eyo 2
eza 2
ezimukomyawo 2
eziri 2
ezudde 2
gaabwe 2
garuga 2
ggeeti 2
gibadde 2
gitambuza 2
good 2
gukutte 2
guwedde 2
guwulirwa 2
gwonna 2
gyakubeera 2
gyali 2
house 2
isiko 2
jeema 2
jim 2
jnr 2
joel 2
jonathan 2
julius 2
kabale 2
kabuyonjo 2
kagoya 2
kaguli 2
kalenda 2
kalyango 2
kampuni 2
kamu 2
kasangati 2
kasita 2
katanga 2
katatumba 2
katetemera 2
kawaala 2
kiba 2
kibaale 2
kibumbiro 2
kika 2
kikendedde 2
kikomera 2
kikyamu 2
kisa 2
kisanja 2
kkanisa 2
kkono 2
koma 2
kubaako 2
kubaddeko 2
kubayamba 2
kubeera 2
kufa 2
kugezesebwa 2
kugonza 2
kukomezebwawo 2
kunoonya 2
kusobola 2
kusoma 2
kusooka 2
kutabudde 2
kutambuza 2
kuzaala 2
kwakolebwa 2
kyaddondo 2
kyadondo 2
kyagulanyi 2
kyakusatu 2
kyazuuliddwa 2
kyrineos 2
laawundi 2
lubega 2
lubuto 2
luke 2
lukiiko 2
lule 2
luno 2
lusaze 2
lusozi 2
lwakuba 2
lydia 2
lyonna 2
ma 2
magulu 2
makumbi 2
makya 2
masaza 2
master 2
masters 2
mathias 2
mayumba 2
mazzi 2
mbi 2
meeya 2
miguel 2
mikono 2
min 2
misiri 2
misomo 2
mpeereza 2
muganda 2
mugezi 2
muhammad 2
muhwezi 2
mulindwa 2
munnaabwe 2
musanvu 2
musiba 2
musigansimbi 2
musoba 2
mutesaasira 2
muto 2
mutuuze 2
mutuuzo 2
muyimbi 2
mwannyina 2
mweyannyonnyoledde 2
mwota 2
mwoyo 2
myezi 2
naabo 2
nadiope 2
nagenda 2
nakaseke 2
nakulabye 2
nakyo 2
nankyama 2
nassozi 2
ndagire 2
ndi 2
nektarios 2
ngeri 2
ngobya 2
nigiina 2
nikosi 2
nnagenda 2
nnamulondo 2
nnannyini 2
nnungi 2
nsimbi 2
nsisinkano 2
nsubuga 2
ntebe 2
ntono 2
ntungamo 2
o 2
obadde 2
obubi 2
obubuga 2
obujanjabi 2
obulunzi 2
obutemu 2
obuvunanyizibwa 2
obuwagizi 2
obuzibu 2
obwa 2
obwakyabazinga 2
obwesige 2
obwetaagisa 2
offiisi 2
oguba 2
okubadduukirira 2
okubulwa 2
okubuulirirwa 2
okuddamu 2
okuggya 2
okuggyamu 2
okuggyayo 2
okugula 2
okugwa 2
okukabasanya 2
okukung 2
okuleetebwa 2
okulondoola 2
okumanya 2
okumuddira 2
okumukwata 2
okumuwa 2
okumwaniriza 2
okumweyimirira 2
okusabira 2
okusobya 2
okuttibwa 2
okutulugunya 2
okutuukira 2
okutwala 2
okutya 2
okuviira 2
okuwa 2
okuwangula 2
okuwanyisiganya 2
okuwulirirwa 2
okuwulirwa 2
okuyitamu 2
okuzaala 2
okuziba 2
okuzibukula 2
okwagazisa 2
okwatuukiriza 2
okweddiza 2
okwemulugunya 2
okwetaba 2
oluganda 2
olutukuvu 2
oluvanyuma 2
oluvuganya 2
olwokubiri 2
omuduumizi 2
omugongo 2
omukisa 2
omuko 2
omukolo 2
omukubiriza 2
omulala 2
omulonde 2
omulwadde 2
omupiira 2
omusaale 2
omusibe 2
omusirikale 2
omuti 2
omutindo 2
omutuufu 2
omutuuze 2
omuwalabu 2
omwami 2
omwenge 2
osubani 2
owe 2
paaka 2
papa 2
pneuma 2
protection 2
pulida 2
ramji 2
rev 2
robert 2
roland 2
rwakakooko 2
rwanda 2
s 2
sag 2
salama 2
sekonda 2
sesusanani 2
she 2
sigenda 2
siniya 2
sinodi 2
siriimu 2
ssaabawandiisi 2
ssaalongo 2
ssali 2
ssande 2
ssentamu 2
ssi 2
sukaali 2
supamaketi 2
talwetegekedde 2
tamale 2
tawuni 2
tebakola 2
tebamanyi 2
tebamuwa 2
teri 2
times 2
timothy 2
tirana 2
tower 2
tteeka 2
ttendekero 2
ttumbi 2
tumwiine 2
twitter 2
unit 2
uoc 2
upc 2
vent 2
wabaddewo 2
waninda 2
wansi 2
watuufu 2
wazira 2
west 2
world 2
yabaategeezezza 2
yabiteeka 2
yagenze 2
yagukkiriza 2
yagyiddwayo 2
yakakasizza 2
yakolera 2
yakwatiddwa 2
yakyalira 2
yalaze 2
yamaliriza 2
yamusanga 2
yamusanze 2
yasangibwa 2
yasemba 2
yasimbiddwa 2
yasindikibwa 2
yasooka 2
yategeeza 2
yatwalibwa 2
yavudde 2
yawambye 2
yaweebwa 2
yayawulibwa 2
yayongeddeko 2
yeetaaga 2
yeetegekera 2
yekka 2
yenyoola 2
yiika 2
zaabwe 2
