mu 354
num 325
ne 258
ku 256
nti 216
nga 182
era 161
oba 139
ekyo 132
yali 111
bo 107
bwe 104
na 101
naye 100
nnyo 95
no 94
omuntu 77
ngo 70
kye 66
bazadde 63
be 59
annette 56
omulenzi 54
oyo 54
agamba 52
e 52
ebintu 51
kkumi 50
kwogera 50
natali 50
si 50
gwe 48
mpulira 48
okukola 47
muntu 44
ssatu 44
abantu 43
bange 41
olwa 41
mutima 38
emu 35
abalala 34
ebya 34
olowooza 34
omusajja 34
katonda 32
ya 32
eyo 31
kya 31
wa 31
kiki 30
kyokka 29
nnali 29
nsonga 29
waliwo 29
yakobo 29
abo 28
ebyo 28
ye 28
okukabassanyizibwa 27
abavubuka 26
bayibuli 26
bubiri 26
ebikwata 26
gumu 26
gye 26
kiba 26
kikumi 26
mutwalo 26
abamu 25
bulijjo 25
ekyaliwo 25
kukwatibwa 25
naawe 25
nge 25
ntya 25
oluusi 25
omu 25
owa 23
bakwatibwa 22
ebigambo 22
esawu 22
abaana 21
ekya 21
byonna 20
ebibuuzo 20
weesiga 20
aba 19
ayagala 19
bifaananyi 19
ekintu 19
engeri 19
ennaku 19
gya 19
maanyi 19
wadde 19
abakadde 18
abalenzi 18
abiri 18
amaanyi 18
anveeko 18
balala 18
bitaano 18
ebitasaana 18
ekibi 18
ekitiibwa 18
kyannyamba 18
lwaki 18
mmugamba 18
munaana 18
nkumi 18
nsaanidde 18
obuseegu 18
okukiraba 18
okuviirako 18
omukono 18
omutuufu 18
akola 17
candice 17
emirundi 17
eya 17
kati 17
kisobola 17
nze 17
okumanya 17
okuwulira 17
omubuulizi 17
omulala 17
omutima 17
osobola 17
wange 17
yenna 17
akaso 16
amukabassanya 16
amukyokooza 16
amusaagisa 16
awulira 16
baba 16
ebyaliwo 16
ekiro 16
ekyokulabirako 16
ggwe 16
gumulumiriza 16
nnatya 16
obuzibu 16
okufa 16
oluganda 16
singa 16
we 16
yobu 16
bukadde 15
buli 15
bye 15
nnyinza 15
nsobi 15
okukuba 15
wali 15
za 15
amagezi 14
bbiri 14
bino 14
empisa 14
okukuyamba 14
okwogera 14
oyinza 14
ttaano 14
yakuwa 14
jpg 13
nnya 13
okuba 13
okuddamu 13
univ/art 13
univ_sqr_xl 13
url 13
vidiyo 13
abakkolinso 12
abalalaweereza 12
beebuuza 12
bonna 12
eyali 12
kino 12
mwenda 12
yagamba 12
akuyambe 11
ba 11
bibuuzo 11
ddala 11
ekiseera 11
eyinza 11
kinaana 11
lukumi 11
maaso 11
musanvu 11
myaka 11
obo 11
okufuna 11
okukuyitirirako 11
okweraliikirira 11
oyogerako 11
tofuna 11
weereza 11
yatandika 11
yesu 11
abeera 10
aboogerwako 10
akakwata 10
atyo 10
awaka 10
awamu 10
baali 10
bagamba 10
bantu 10
biseera 10
ebingi 10
emirembe 10
eri 10
eziri 10
gaali 10
gwange 10
ki 10
kiraga 10
kubanga 10
lumu 10
lwe 10
mukwano 10
obukwata 10
olina 10
omukwano 10
pulinta 10
twali 10
aana 9
abakabassanya 9
agezaako 9
akukyawa 9
akuwa 9
anjagala 9
ankubiriza 9
assa 9
atandika 9
baayogerako 9
babikolako 9
bamanyi 9
bambudaabuda 9
bankubiriza 9
bankwatiriranga 9
bannyamba 9
bano 9
bbaasi 9
beeyongera 9
bethany 9
bisobola 9
boogera 9
bulamu 9
bulumi 9
bwo 9
c 9
ebisatu 9
ebiseera 9
ebweru 9
eddoboozi 9
egamba 9
egiwera 9
ekiriko 9
ekisinga 9
ekisobola 9
ekisukkiridde 9
ekyakutuukako 9
ekyali 9
ekyamutuukako 9
engatto 9
ennukuta 9
eriwo 9
essomero 9
essuubi 9
eyaŋŋambanga 9
eza 9
faayo 9
ffembi 9
ge 9
gwammwe 9
kabina 9
kakkaadi 9
kibi 9
kibiina 9
kikyamu 9
kindeetera 9
kiyinza 9
kukikola 9
kumugamba 9
kwayamba 9
kwonna 9
lusegere 9
malungi 9
mbeera 9
mitindo 9
muwala 9
nabo 9
nakwo 9
nange 9
ndeka 9
nedda 9
njawulo 9
nkyasoma 9
nnabuulirako 9
nnaku 9
nnandyagaddenga 9
nnasindika 9
nnawuliriranga 9
nneeyabiza 9
nsaba 9
nsiba 9
obuguwa 9
obutanakuwala 9
obutatya 9
obuulirako 9
ogoberera 9
oguwedde 9
oku 9
okubudaabuda 9
okugaana 9
okukaka 9
okukendeeza 9
okukupikiriza 9
okukwatibwa 9
okukyogerako 9
okukyogerangako 9
okumpi 9
okunkwatirira 9
okusaagasaaga 9
okusaba 9
okusingira 9
okuwona 9
okuzannyirira 9
okuŋŋamba 9
okwegatta 9
okwogerako 9
oli 9
omwaka 9
saagala 9
sindika 9
sinenyezebwa 9
sisobola 9
tawulira 9
tebabyagala 9
teyali 9
totya 9
tugende 9
tukyakaleko 9
wakati 9
weesige 9
weetaaga 9
weewale 9
yabuulira 9
yampa 9
yankuba 9
yankwatanga 9
yonna 9
zange 9
abakazi 8
abamanyi 8
abasajja 8
abawenyuka 8
akabassanyizibwa 8
akakisa 8
akwatibwaaba 8
amaaso 8
amusuula 8
ansimbye 8
atera 8
avuddeko 8
baalibamukyokooza 8
baasobola 8
baatulagira 8
bakibuusa 8
bakutte 8
balinako 8
balowooza 8
bamukabassanya 8
bamusaagisa 8
basigala 8
batamanyi 8
bawangula 8
bayibulikakkaadi 8
baŋŋambanga 8
bibatuukako 8
birowoozo 8
bitera 8
biyinza 8
budde 8
bukkaadi 8
bulungi 8
coretta 8
ebibi 8
ebikonde 8
ebitasuubirwa 8
ebizibu 8
egimu 8
ekisoboka 8
emisinde 8
empaka 8
enduulu 8
eno 8
ensobi 8
entiisa 8
eyakabassanyizibwa 8
eyakukabassanya 8
eyakukwata 8
eyakwatibwa 8
gamba 8
ganzigwamu 8
intaneeti 8
kano 8
kasanvu 8
kibaviirako 8
kigenda 8
kijjukire 8
kimala 8
kimuyambamu 8
kintuuseeko 8
kirala 8
kirina 8
kisinga 8
kubuulirako 8
kukakibwa 8
kukola 8
kwegatta 8
kyakosa 8
kyangu 8
kyonna 8
lunaana 8
luno 8
lupapula 8
lyagaana 8
manya 8
mmukuba 8
mmukwagula 8
mmusamba 8
muganda 8
ndi 8
nja 8
nnagezaako 8
nnakola 8
nnamusindika 8
nnandibadde 8
nnandiwulidde 8
nnavaako 8
nnawa 8
nnawulira 8
nneegatta 8
nneeyongera 8
nsanvu 8
nswadde 8
ntyo 8
obulungi 8
okola 8
okubeeranga 8
okukabassanya 8
okukkiriza 8
okukuganyula 8
okukutuukako 8
okukwata 8
okulusomera 8
okuluwanula 8
okulwanyisa 8
okumulwanyisa 8
okunfumita 8
okunkabassanya 8
okunnuma 8
okunzijira 8
okutabagana 8
okuvaayo 8
okwennyamira 8
okwesalira 8
okwogereza 8
olugero 8
oluli 8
olusomera 8
oluvannyuma 8
olwekyo 8
omusango 8
omutuukirivu 8
omuvubuka 8
osanga 8
otambula 8
otuuse 8
otya 8
oyita 8
saamulwanyisa 8
saawuliriza 8
sikyalina 8
sisooka 8
tannategeera 8
tantegeera 8
tekiba 8
tewali 8
teyeeyagalidde 8
tuzannyira 8
waabwe 8
wandikoze 8
wansi 8
weegendereza 8
weewulira 8
yakabassanyizibwa 8
yakola 8
yamala 8
yantunuulira 8
yavumbagira 8
yiyo 8
bangi 7
ebisingawo 7
jonathan 7
media 7
okubuulirako 7
okukabassanyizibwa“bwe 7
okulaba 7
okuzannya 7
okwogerezebwabo 7
olabye 7
omanye 7
omwana 7
playereremereddwa 7
wanula 7
bakabassanyizibwa 6
biddibwamukiki 6
bukatuuninnyinza 6
ebitundu 6
kikikyewandikoze 6
lowooza 6
mwaka 6
naddala 6
okusoma 6
okwagala 6
wanulako 6
atya 5
bafu 5
bintu 5
bitukuvu 5
ebinyuma 5
ebirala 5
ebyesigamiziddwa 5
ekifaananyi 5
ekiyinza 5
engero 5
enjigiriza 5
ennungi 5
gano 5
gasobola 5
kikulu 5
langi 5
mukyala 5
mutabani 5
obulumi 5
okisiige 5
okisindike 5
okumuyamba 5
okuyigiriza 5
okwanguyirwa 5
pawulo 5
tasiima 5
waffe 5
yakiraga 5
yasuubiza 5
agenze 4
ayinza 4
baibuli 4
bayibuliabaanakozesa 4
biddibwamunsaanidde 4
bifaananyiyakobo 4
bya 4
ekkakafu 4
ensonga 4
envayiga 4
esawuesawu 4
esawuluganda 4
kristo 4
kwe 4
kyali 4
lugandakiki 4
lugandannyinza 4
mikwano 4
mingi 4
okukanika 4
okuzuukira 4
peetero 4
pulintaweereza 4
wala 4
yakobokiki 4
yayogera 4
afa 3
afiiriddwa 3
amerika 3
awo 3
baffe 3
banno 3
boogeranyinza 3
bwa 3
ebikwatagana 3
emiganyulo 3
emyaka 3
enkomerero 3
eryo 3
esawuengero 3
eyalina 3
ka 3
kiseera 3
kityo 3
lwenda 3
lye 3
mukaaga 3
mukama 3
mulimu 3
new 3
nnyina 3
nsi 3
okufiirwa 3
okuva 3
omutwe 3
paquito 3
abaafa 2
abaagalwa 2
afiiriddemu 2
agendeyo 2
akonkona 2
amabi 2
amawulire 2
anaatera 2
ati 2
azuukiziddwa 2
bali 2
bayigirizwa 2
biddibwamu 2
binobavubuka 2
binobukkaadi 2
ebibeera 2
ebidduka 2
ebikolwa 2
ebyawandiikibwa 2
egyali 2
egyo 2
ekifo 2
ekitali 2
enkumi 2
ennyo 2
enoengero 2
erikwata 2
erye 2
ewaabwe 2
gibeera 2
girina 2
gwa 2
gyali 2
kibuga 2
kiri 2
kitundu 2
kufa 2
kwabaawo 2
luggi 2
luguudo 2
muli 2
mwana 2
nkaaga 2
nnalowolereza 2
nnalowooza 2
nnamwandu 2
ofiirwa 2
ogu 2
okudda 2
okukyalira 2
okuyigira 2
okweyongera 2
olwo 2
omukulu 2
omukyala 2
omulabe 2
omutume 2
omuzadde 2
puerto 2
rico 2
ssuubi 2
tekisoboka 2
teyayagalanga 2
tukuleetedde 2
tukyalina 2
tuli 2
tusooke 2
valentina 2
wabaawo 2
waka 2
wayiseewo 2
yakomawo 2
yawandiika 2
yokaana 2
york 2
