mu 434
nga 289
n 283
ku 279
nti 194
ne 152
e 140
ng 115
era 75
w 75
y 68
abantu 66
bwe 64
wa 64
kino 49
ye 45
ya 44
bano 42
we 40
kyokka 38
poliisi 37
ate 35
abaana 34
agamba 33
eno 32
gavumenti 31
kya 31
yagambye 29
z 29
olw 28
abadde 27
ettaka 27
gye 27
aba 26
buli 26
bw 26
ky 26
uganda 26
by 25
eby 24
ono 24
wabula 24
bino 23
be 22
bya 22
oluvannyuma 22
omu 22
b 21
yategeezezza 21
abalala 20
guno 20
kati 20
kiseera 20
lw 20
ssentebe 20
ba 19
eri 19
kuba 19
kye 19
namutebi 19
nsonga 19
okuva 19
ssente 19
ab 18
akulira 18
alina 18
ez 18
ly 18
lya 18
disitulikiti 17
gw 17
gwe 17
kubanga 17
naye 17
okulaba 17
zaabwe 17
bangi 16
kwe 16
okukola 16
abakulembeze 15
abatuuze 15
bashir 15
ebintu 15
kampala 15
katonda 15
abamu 14
ategeezezza 14
bitundu 14
ensimbi 14
lwa 14
nnyo 14
omugenzi 14
yali 14
ekitongole 13
empaka 13
ga 13
gwa 13
lino 13
mmotoka 13
oba 13
october 13
omubaka 13
owa 13
za 13
zino 13
agambye 12
asaba 12
bagenda 12
balina 12
eggwanga 12
ogw 12
okugulu 12
omuntu 12
pulezidenti 12
yasabye 12
abavubuka 11
amateeka 11
baana 11
bba 11
dr 11
emirimu 11
lwe 11
minisita 11
obubonero 11
okufuna 11
okwongera 11
omulabirizi 11
ow 11
rdc 11
wakati 11
wamu 11
abakadde 10
abaserikale 10
asabye 10
baabwe 10
babadde 10
bye 10
eky 10
enjawulo 10
ensonga 10
kitundu 10
lyabwe 10
mbeera 10
nabo 10
olwo 10
omuli 10
omwana 10
yabadde 10
abawala 9
bali 9
blick 9
butambala 9
ddwaaliro 9
ebirala 9
eddwaliro 9
emyaka 9
enteekateeka 9
gy 9
kalanda 9
lubaga 9
maaso 9
mukolo 9
ngalo 9
okubeera 9
omusaayi 9
palamenti 9
wiiki 9
1 8
ababaka 8
abakozi 8
agenda 8
and 8
baali 8
bagamba 8
bakola 8
ekibiina 8
ekya 8
embeera 8
emmundu 8
g 8
k 8
kanyanya 8
kifo 8
lukwago 8
mityana 8
obulungi 8
okufa 8
omusango 8
omusumba 8
ssaza 8
ssemogerere 8
abali 7
abasawo 7
abazannyi 7
ali 7
amaanyi 7
ayagala 7
baabadde 7
bantu 7
bonna 7
covid-19 7
ekitundu 7
emikono 7
emmotoka 7
francis 7
gyabwe 7
kawempe 7
kcca 7
kkanisa 7
mengo 7
mpaka 7
mugambe 7
mulago 7
na 7
national 7
obuyambi 7
ofiisi 7
okutta 7
okutuusa 7
omuserikale 7
rev 7
ssemakula 7
st 7
tebalina 7
ttaka 7
yonna 7
000 6
2 6
2021 6
8 6
amaka 6
ategeeza 6
ategezezza 6
babiri 6
bannayuganda 6
buvuddeko 6
ebiri 6
empumbu 6
enduulu 6
enguudo 6
enkuba 6
enkulaakulana 6
erya 6
essomero 6
ewedde 6
eya 6
eza 6
famire 6
ggwanga 6
ka 6
kkooti 6
kuno 6
lukiiko 6
luno 6
maama 6
mugisha 6
mukono 6
mutabaazi 6
mwe 6
nnyanja 6
nsi 6
nssf 6
obulabirizi 6
obulamu 6
of 6
okuba 6
okugaba 6
okuli 6
okumanya 6
okunoonyereza 6
okuziika 6
okuzimba 6
omulimu 6
omutemu 6
omwaka 6
rugby 6
si 6
singa 6
talina 6
waliwo 6
walukagga 6
yagasseeko 6
yayongeddeko 6
ze 6
20 5
3 5
abayizi 5
abazadde 5
abeera 5
akakiiko 5
akola 5
ava 5
ayogedde 5
baagala 5
baba 5
bafunye 5
bajja 5
balyokwayibwe 5
bazadde 5
bbosa 5
bp 5
bwa 5
bwaise 5
byabwe 5
covid 5
ddala 5
ebbanga 5
ebigoma 5
ebikolwa 5
ebinazi 5
ebirowoozo 5
eddembe 5
ekirwadde 5
ekisaawe 5
embuto 5
endala 5
endwadde 5
ennaku 5
essaza 5
ffamire 5
fr 5
gayaza 5
kaggo 5
kano 5
kassanda 5
katwe 5
kiraabu 5
kivumbi 5
kiwanuka 5
kw 5
kyaddondo 5
kyalo 5
kyengera 5
leero 5
luwalira 5
lwaki 5
maka 5
maneja 5
mayuge 5
mazinga 5
mubende 5
mukyala 5
mutabani 5
mw 5
naddala 5
nakasongola 5
namirembe 5
ngeri 5
nnaabagereka 5
nze 5
obusumba 5
okugenda 5
okumala 5
okusaba 5
okusinziira 5
okutwala 5
okuwa 5
okwabadde 5
okwogera 5
oluguudo 5
omukyala 5
omwezi 5
road 5
robert 5
ronald 5
sipiika 5
ssande 5
ssebaggala 5
town 5
vipers 5
wano 5
zonna 5
10 4
12 4
18 4
19 4
2018 4
29 4
ababadde 4
ababbi 4
abakulu 4
abasajja 4
abasinga 4
abasiraamu 4
abasoba 4
abavubi 4
abazigu 4
abazira 4
afudde 4
amanyi 4
amazaalibwa 4
amazzi 4
amyuka 4
asiimye 4
atwalibwa 4
avuddeyo 4
avumiridde 4
awaka 4
awamu 4
baasazeewo 4
baategeezezza 4
baleme 4
bannaabwe 4
bannabyamizannyo 4
basobole 4
bbooda 4
black 4
bo 4
booda 4
buno 4
byonna 4
club 4
ddyo 4
ebikozesebwa 4
ebyapa 4
ebyettaka 4
eggombolola 4
eggulo 4
ekibinja 4
ekifo 4
eklezia 4
emu 4
engeri 4
ennyumba 4
express 4
ey 4
eyali 4
fmu 4
fred 4
gonna 4
gya 4
haji 4
inzikuru 4
johns 4
joseph 4
kabaka 4
kabalega 4
kaleerwe 4
kansala 4
kigambibwa 4
kigo 4
kisa 4
kisenge 4
kkampuni 4
kkono 4
kulubya 4
kutandise 4
kwonna 4
luweero 4
lwokutaano 4
mannya 4
masaka 4
mbi 4
mirimu 4
misango 4
mmaapu 4
mmisa 4
moses 4
mpiima 4
muhammad 4
mukaaga 4
musango 4
myaka 4
nakitende 4
nakyazze 4
nalubega 4
nkola 4
nnamba 4
nup 4
obulumbaganyi 4
obuyinza 4
oku 4
okudda 4
okukuba 4
okukuza 4
okulonda 4
okusinga 4
okutuuka 4
okwewala 4
olunaku 4
olwa 4
omukolo 4
omukono 4
omukulu 4
omulambo 4
omulangira 4
omumyuka 4
omusajja 4
omuwala 4
omuyimbi 4
omuzigu 4
omwami 4
oyo 4
paapa 4
peter 4
pikipiki 4
ppaaka 4
richard 4
rutiba 4
ssaawa 4
ssebakigye 4
ssinga 4
tavares 4
tewali 4
visioned 4
waabwe 4
wansi 4
william 4
yaabwe 4
yasinzidde 4
yenna 4
youth 4
11 3
2019 3
30 3
4 3
50 3
7 3
aanya 3
abaabadde 3
ababiri 3
abakristu 3
abanja 3
abasabye 3
abasibe 3
abasumba 3
abeetabye 3
abo 3
agenze 3
aisha 3
akoze 3
akulembeddemu 3
alaga 3
amaaso 3
amagezi 3
amakubo 3
amayumba 3
arua 3
atandise 3
atwala 3
baagambye 3
baakwatibwa 3
baamukwatidde 3
baatwaliddwa 3
baawadde 3
babeere 3
bafuna 3
bagonza 3
bakristu 3
balagadde 3
baludde 3
balumbye 3
bamanyi 3
bamukuba 3
banne 3
batema 3
batuuse 3
batuuze 3
batwalibwa 3
bayita 3
bazuule 3
bazze 3
bbaala 3
bbiri 3
bigambo 3
bigere 3
bingi 3
bishop 3
bodybuilding 3
buganda 3
bulamu 3
bulungi 3
busikiri 3
bwabwe 3
canon 3
clerk 3
company 3
council 3
d 3
dak 3
dda 3
ddwaliro 3
ebadde 3
ebibuga 3
ebigenda 3
ebitundu 3
ebiwandiiko 3
ebyafaayo 3
egy 3
ekibonerezo 3
ekika 3
ekimu 3
ekintu 3
ekirabo 3
ekiseera 3
ekisoboka 3
ekituufu 3
ekkulu 3
ekyo 3
emalidde 3
embi 3
emitwalo 3
emmanuel 3
emyala 3
enanga 3
enguzi 3
enjaga 3
ennyo 3
ensako 3
ensi 3
entambula 3
envuba 3
eraga 3
ereeta 3
essimu 3
etteeka 3
ewa 3
ezibadde 3
fayiro 3
foundation 3
gaabwe 3
gano 3
geoffrey 3
godfrey 3
gombe 3
gombolola 3
gwetabiddwako 3
gyokka 3
housing 3
ii 3
john 3
kafiyu 3
kajjansi 3
kakiiko 3
kalema 3
kanso 3
kasalirwe 3
kasasiro 3
kaseera 3
kateregga 3
katikkiro 3
kato 3
kayondo 3
kayunga 3
ki 3
kibuuka 3
kiro 3
kisakye 3
kitongole 3
kittavu 3
kizza 3
kugenda 3
kujja 3
kukola 3
kukoma 3
kusooka 3
kutandika 3
kyadondo 3
kyeyune 3
kyonna 3
latinum 3
light 3
liizi 3
lucky 3
luguudo 3
lunaku 3
lwabwe 3
lwagwamu 3
lye 3
makubo 3
manya 3
masomero 3
mayanja 3
mikono 3
minisitule 3
muganda 3
mulamwa 3
mulimu 3
muluka 3
mulundi 3
museveni 3
musomo 3
mwala 3
nabbi 3
nabisunsa 3
nakibinge 3
nakibirige 3
nambooze 3
namuganza 3
namugera 3
namulesa 3
ncs 3
ndagaano 3
ngogwe 3
ngoyan 3
nju 3
nnannyini 3
nnyingi 3
nnyumba 3
november 3
nrm 3
ntebe 3
nteekateeka 3
obudde 3
obujulizi 3
obukadde 3
obukama 3
obuvunaanyizibwa 3
obuwangwa 3
obuzibu 3
obw 3
odong 3
ofwono 3
okubba 3
okubiri 3
okuggulawo 3
okugoberera 3
okugwamu 3
okukubwa 3
okulya 3
okunaaba 3
okusasula 3
okusobola 3
okusoma 3
okusoomoozebwa 3
okutambulira 3
okutandika 3
okuteekateeka 3
okutwalira 3
okuvunda 3
okuyingira 3
okwekuuma 3
olympics 3
omukubiriza 3
omuluka 3
omusibe 3
omusika 3
omutaka 3
omutima 3
omutuuze 3
omuwendo 3
patrick 3
paul 3
pearls 3
saako 3
samuel 3
sheikh 3
so 3
solar 3
south 3
ssali 3
ssuubi 3
suzanne 3
tekuli 3
tororo 3
ttiimu 3
university 3
wandegeya 3
wandera 3
wasswa 3
wazira 3
yadde 3
yagenda 3
yasabidde 3
yasiimye 3
yo 3
zari 3
ziri 3
zo 3
zooni 3
zzooni 3
00 2
0708010908 2
0754457273 2
100 2
14 2
2-0 2
2015 2
24 2
35 2
45 2
5 2
60 2
80 2
86 2
aanyiza 2
abaakoze 2
abaali 2
abaami 2
ababanja 2
abaffamire 2
abafunye 2
abagagga 2
abagambibwa 2
abakakiiko 2
abakazi 2
abakristaayo 2
abakugu 2
abakulira 2
abakungu 2
abakyala 2
abalabula 2
abalamuzi 2
abalina 2
abaliriko 2
abalokole 2
abalwadde 2
abamanyi 2
abanene 2
abasaba 2
abasika 2
abasirikale 2
abatalina 2
abatemu 2
abattakisi 2
abatuula 2
abawadde 2
abawuzi 2
abayize 2
abazirakisa 2
abeebyokwerinda 2
abuuza 2
abyogeredde 2
adduka 2
advocacy 2
afa 2
africa 2
afrika 2
afunye 2
agaba 2
agibbye 2
agiyingiremu 2
ajjanjabwa 2
akabaga 2
akati 2
akube 2
akubirizza 2
akwasa 2
alaajanidde 2
alestair 2
alex 2
alfred 2
aliisa 2
aliko 2
allah 2
amabwa 2
amaggombolola 2
amaggye 2
amagye 2
amakampuni 2
amalambulukufu 2
amangu 2
amanyiddwa 2
amasomero 2
amatooke 2
amaze 2
amukoledde 2
amusaba 2
amutema 2
amuyambe 2
ani 2
annyonnyola 2
arthur 2
asabidde 2
asinga 2
asinzidde 2
association 2
asula 2
atataddeeko 2
atyo 2
authority 2
avengers 2
awalabula 2
awanjagidde 2
aweza 2
awo 2
ayinza 2
aziz 2
azze 2
baakoze 2
baakuba 2
baalabye 2
baapunta 2
baasinzidde 2
baayawukana 2
babaka 2
babwe 2
badru 2
bagende 2
bagenze 2
bakadde 2
bakansala 2
bakira 2
bakoowu 2
bakoze 2
bakulembeddwamu 2
bakulembera 2
bakwasa 2
balaajanidde 2
balaba 2
bamaze 2
bambala 2
bamusabira 2
bamutta 2
baron 2
basaba 2
basabye 2
basazeewo 2
basse 2
basumba 2
batabuddwa 2
batambulire 2
batandika 2
bategeezezza 2
batudde 2
batunda 2
batwalira 2
bavubi 2
bavubuka 2
baweebwe 2
baweereddwa 2
bayizi 2
beesonzemu 2
beetabye 2
bifaananyi 2
bifo 2
bikwatagana 2
bimufaako 2
bintu 2
biragiro 2
bisaanyizo 2
bivamuntuuyo 2
bodaboda 2
bokka 2
bombi 2
bubi 2
bucaafu 2
budde 2
bufumbo 2
bugoba 2
bukadde 2
bukama 2
bukya 2
bukyamu 2
bulijjo 2
bulwadde 2
bumativu 2
bungi 2
butongole 2
buyonjo 2
bwenyi 2
bwongeramu 2
byapa 2
byeyongera 2
cat 2
center 2
championships 2
charles 2
cheptoris 2
child 2
christopher 2
construction 2
darusu 2
david 2
ddaala 2
ddene 2
ddereeva 2
ddiifiri 2
diamond 2
district 2
do 2
dunstan 2
eba 2
ebbula 2
ebibiina 2
ebijambiya 2
ebijingirire 2
ebimu 2
ebimukubako 2
ebiragiro 2
ebirambikiddwa 2
ebiriko 2
ebirooto 2
ebirungi 2
ebiso 2
ebitongole 2
ebiwayi 2
ebyalo 2
ebyensimbi 2
ebyobulamu 2
ebyobuvubi 2
eddagala 2
efudemba 2
egisinga 2
egypt 2
ekibbattaka 2
ekibuga 2
ekifaananyi 2
ekikolwa 2
ekikula 2
ekikulu 2
ekiro 2
ekisobooka 2
ekittavu 2
ekivaako 2
ekkanisa 2
ekyabadde 2
ekyaddako 2
ekyalo 2
ekyamukwasiddwa 2
ekyavuddeko 2
emabega 2
emifumbi 2
emiggo 2
emikolo 2
emirundi 2
emisango 2
emitayimbwa 2
emizannyo 2
empapula 2
empenda 2
endagaano 2
enduro 2
engule 2
enjiri 2
enkola 2
ennono 2
ensonda 2
entalo 2
entebe 2
enzikiza 2
erina 2
esatu 2
essuubi 2
etandika 2
etonnya 2
ettendekero 2
eustace 2
evvuunike 2
eyaliko 2
eyamuyamba 2
eziddako 2
ezimu 2
eziri 2
eziva 2
ezze 2
faaza 2
fitness 2
force 2
fredrick 2
gaali 2
gav 2
ge 2
ggoolo 2
gino 2
girls 2
hajji 2
hana 2
health 2
henry 2
hill 2
hotel 2
iii 2
isaac 2
james 2
jane 2
jjumba 2
judith 2
kabaawo 2
kabangali 2
kaijuka 2
kakeeka 2
kakookolo 2
kalangala 2
kale 2
kamalimali 2
kanyike 2
kasana 2
kasooka 2
katale 2
kawaase 2
keeki 2
keitha 2
kenneth 2
kibadde 2
kibiina 2
kibirango 2
kibonerezo 2
kibuli 2
kiddiridde 2
kigenda 2
kigozi 2
kikomera 2
kikyamu 2
kimu 2
kimutambula 2
kinene 2
kirabo 2
kirala 2
kiri 2
kitaabwe 2
kitegeeza 2
kiti 2
kiyambeko 2
kkolero 2
kondakita 2
kubabuulira 2
kubeera 2
kubuulira 2
kubuulirira 2
kufuna 2
kugaana 2
kukolera 2
kulaba 2
kulinda 2
kulwanyisa 2
kumala 2
kumbuga 2
kussibwako 2
kutambula 2
kutuuka 2
kuvunda 2
kuwangula 2
kuwulira 2
kuzzeemu 2
kwongera 2
kyababuseeko 2
kyagulanyi 2
kyakubiri 2
kyetaagisa 2
leader 2
leaders 2
league 2
lender 2
li 2
liigi 2
ltd 2
lubega 2
luggya 2
luke 2
lungujja 2
lutikko 2
lwanga 2
lwokubiri 2
lyayo 2
madiina 2
maggale 2
makerere 2
makindye 2
makomera 2
makya 2
manzoki 2
mateeka 2
mayangayanga 2
mayiga 2
mazzi 2
mbaga 2
mboko 2
mbu 2
mbuga 2
memba 2
mitwalo 2
mizannyo 2
mmeeya 2
money 2
motor 2
mr 2
mubiru 2
mudoola 2
muggalo 2
mukama 2
mukasa 2
mukazi 2
mukozi 2
mukwano 2
muky 2
mulamu 2
mulembe 2
munda 2
munne 2
mupangisa 2
musanvu 2
musingi 2
musisi 2
musoke 2
mutendera 2
muwala 2
mwalo 2
myala 2
myanzi 2
myezi 2
nabakooba 2
nabyo 2
nagyo 2
nakatto 2
nakirima 2
nakyo 2
nalukolongo 2
namakula 2
namatovu 2
namigavu 2
namuyiga 2
nantaba 2
ndaba 2
nfeete 2
ngando 2
ngule 2
nguudo 2
nkoyooyo 2
nnya 2
notu 2
nsasula 2
nsuwa 2
obufere 2
obugagga 2
obujjanjabi 2
obukookolo 2
obulwadde 2
obuntubulamu 2
obusiraamu 2
obusungu 2
obutaggwaamu 2
obutali 2
obuto 2
obutonde 2
obuvunanyizibwa 2
obuwunga 2
obwenkanya 2
obwennyanja 2
odugu 2
ogugamba 2
ogutatya 2
ogwa 2
ogwel 2
okubaako 2
okubawa 2
okubayamba 2
okuddamu 2
okugabira 2
okuggulwako 2
okuggyako 2
okujjanjaba 2
okukkiriza 2
okukozesa 2
okukuuma 2
okukwatibwa 2
okulabirira 2
okulimirako 2
okulondoola 2
okumusaba 2
okumusuulawo 2
okumuyamba 2
okunnyikiza 2
okunywa 2
okusaalimbira 2
okusiba 2
okusigala 2
okusika 2
okusomoozebwa 2
okuteeka 2
okuteekamu 2
okuteesa 2
okuteeseganya 2
okutegeera 2
okutereeza 2
okuttibwa 2
okutunda 2
okuvaayo 2
okuwandiikira 2
okuweereza 2
okuwona 2
okuyamba 2
okuyiga 2
okuzibikira 2
okuzza 2
okwatandikira 2
okwebuuza 2
okwegayirira 2
okwegemesa 2
okwekwasa 2
okwetandikirawo 2
okweyisa 2
okweyongera 2
olubadde 2
olukiiko 2
oluvanyuma 2
olwaleero 2
olwekyo 2
omubeezi 2
omubiri 2
omugaso 2
omukama 2
omukisa 2
omukozi 2
omukubirizza 2
omukulembeze 2
omukwano 2
omukyamu 2
omulala 2
omungi 2
omupiira 2
omusawo 2
omusolo 2
omusomo 2
omuto 2
omuwaabi 2
omuwandiisi 2
omuzibe 2
omwawule 2
omwenge 2
omwogezi 2
oscar 2
owor 2
paakingi 2
pelum 2
persis 2
piki 2
platnumz 2
police 2
polof 2
premier 2
puleesa 2
rally 2
rose 2
rubongoya 2
s 2
sam 2
sd 2
sevens 2
shi 2
sipeeya 2
sports 2
ssaabasumba 2
ssaabawandiisi 2
ssaako 2
ssatu 2
ssebulime 2
ssegirinya 2
sseguya 2
ssekkadde 2
ssemateeka 2
ssewanyana 2
startimes 2
sukaali 2
swabra 2
t 2
tebaagala 2
tebalaba 2
tebanneetuuka 2
teziriiwo 2
ttakisi 2
tukaikiriza 2
tukirinnya 2
tulina 2
tumanyi 2
twagala 2
union 2
waakiri 2
wadde 2
waggulu 2
wakaliga 2
wakiso 2
werikhe 2
west 2
women 2
yaayo 2
yafudde 2
yaguza 2
yakiikiriddwa 2
yakubwa 2
yalina 2
yasoose 2
yatandise 2
yatonda 2
yattiddwa 2
yawangula 2
yeekokkodde 2
yennyamidde 2
yiika 2
ying 2
yokka 2
zaategeezezza 2
zitambula 2
ziwedde 2
