mu 5993
num 3313
na 854
mitwalo 670
kamu 588
kikumi 564
mukaaga 496
ku 485
ne 466
kkumi 452
nti 443
lukumi 402
ssatu 394
bbiri 387
kasiriivu 360
emu 325
abiri 323
era 320
bukadde 300
nkumi 294
busiriivu 292
asatu 281
munaana 259
nga 243
mwenda 241
musanvu 227
naye 227
buwumbi 216
nnya 214
bufukunya 210
busedde 210
ana 208
ebiri 208
bwe 195
ttaano 195
yakuwa 189
bayibuli 181
oba 180
eya 176
wa 157
bubiri 150
bo 136
kubanga 136
busatu 132
butaano 132
ataano 126
awo 122
ena 122
omu 115
katonda 113
ensi 110
bina 104
ebya 103
gumu 102
ebitabo 98
kabaka 98
abalala 96
buna 96
mutwalo 96
yali 96
no 95
ebintu 89
bya 88
ye 88
kya 86
kye 85
kasanvu 84
aba 83
omuntu 83
esatu 82
oyo 82
agamba 80
empya 80
olwa 79
bibiri 78
ebyawandiikibwa 78
enkyusa 78
intaneeti 78
univ/art 78
univ_sqr_xl 78
url 78
bye 77
abantu 76
yesu 76
kenda 72
ya 71
ekya 70
isirayiri 69
kyenda 68
ajja 67
abalalaweereza 65
be 65
jpg 65
lugandasoma 65
mmwe 63
nge 63
nsanvu 63
okuva 62
kanaana 60
lunaana 60
lusanvu 60
e 59
amugamba 57
ggwe 57
bonna 56
gwe 56
kino 55
eri 54
okuba 54
bassekabaka 53
yokaana 52
gye 51
kinaana 51
nze 51
ga 50
abo 48
ebyo 48
ebyomumirembe 48
lukaaga 48
peetero 48
samwiri 48
abassessalonika 47
ate 47
ka 46
ennaku 45
lwa 45
buli 44
yekosafaati 44
ba 43
kitabo 43
lwenda 42
ali 41
gwa 40
nnabbi 40
omwana 40
nnannyini 39
pulintaweereza 39
sindika 39
weereza 39
maaso 38
wo 38
ddala 36
wansi 36
we 36
byonna 35
obut 35
omusajja 35
owa 35
wange 35
abaleevi 34
abayigirizwa 34
guno 34
agenda 33
laba 33
maliyamu 33
omwoyo 33
amaanyi 32
bannabbi 32
ekyo 32
ngo 32
omukazi 32
omusango 32
baali 31
linnya 31
nsi 31
gya 30
kakaaga 30
abakkolinso 29
kitange 29
kyokka 29
nkaaga 29
ogu 29
abagamba 28
emyaka 28
kuba 28
lya 28
tewali 28
ebigambo 27
ennyo 27
baganda 26
nja 26
obwa 26
okubiri 26
omulembe 26
kati 25
katono 25
obwakabaka 25
si 25
abakkolinsoabaggalatiyaabeefesoabafiripiabakkolosaayi 24
bino 24
bisatu 24
bitaano 24
dayimooni 24
ebikolwaabaruumi 24
ekisooka 24
ekyabalamuziluusi 24
ekyamateekayoswa 24
engeroomubuulizi 24
esezayobuzabbuli 24
eyo 24
ezeekyeridanyerikoseyayoweeriamosi 24
ezeranekkemiya 24
mutabani 24
okubala 24
okubikkulirwa 24
okukungubaga 24
olubereberye 24
oluyimba 24
sulemaaniisaayayeremiya 24
timoseewo 24
timoseewotitofiremooniabebbulaniyayakobo 24
yokaanayuda 24
abafalisaayo 23
ebitukuvu 23
ki 23
obadiyayonamikkanakkumukaabakuukuzeffaniyakaggayizekkaliyamalakimatayomakkolukkayokaana 23
waggulu 23
amazzi 22
bagamba 22
ebikolwa 22
emmere 22
mazima 22
mbagamba 22
ssabbiiti 22
wamu 22
abaana 21
ekiseera 21
omubi 21
omuliro 21
zaffe 21
akozesa 20
amawanga 20
ayogera 20
bangi 20
essuula 20
gyonna 20
lye 20
mikaaya 20
nnyumba 20
okwogera 20
wano 20
yona 20
ago 19
bwo 19
kaseera 19
mazzi 19
muntu 19
oluvannyuma 19
wabula 19
amuddamu 18
ani 18
ayagala 18
bajja 18
ekigambo 18
essanyu 18
gu 18
gwo 18
kibuga 18
kiseera 18
lusozi 18
maanyi 18
nammwe 18
obugambo 18
obuli 18
yeekaalu 18
yenna 18
zibasanze 18
bakabona 17
bange 17
emirimu 17
ggulu 17
go 17
kwe 17
kyonna 17
maama 17
olwo 17
omukono 17
baagala 16
bwa 16
byo 16
ebibi 16
eno 16
ggaliraaya 16
kale 16
naawe 16
nnyo 16
okulaba 16
okutuusa 16
omugabo 16
ono 16
samaliya 16
abamu 15
alina 15
amagezi 15
bantu 15
ebirala 15
ebitukuvuisaaya 15
ekikozesebwa 15
emirembe 15
enda 15
eyali 15
ge 15
gyaffe 15
kifo 15
lwe 15
lyange 15
wadde 15
yakola 15
akabonero 14
amazima 14
byabwe 14
ekintu 14
emikono 14
engeri 14
kityo 14
lamosigireyaadi 14
lunaku 14
okuggyako 14
oli 14
omulala 14
soma 14
yerusaalemi 14
yuda 14
aga 13
ebirungi 13
jpgobwa 13
kintu 13
kitiibwa 13
labaawanny 13
mba 13
mwana 13
nange 13
ze 13
abaweereza 12
akabu 12
akola 12
asinga 12
awa 12
ekitangaala 12
ekitundu 12
etaano 12
genda 12
giringa 12
gwonna 12
kkuŋŋaaniro 12
kyagwo 12
laga 12
lyo 12
mugenda 12
mujja 12
mukono 12
musa 12
obukwata 12
obulimba 12
obusungu 12
ojja 12
omuti 12
omutukuvu 12
sitaani 12
yava 12
za 12
agoba 11
alinga 11
ayinza 11
baabwe 11
biseera 11
ekitiibwa 11
eza 11
guba 11
gwange 11
jjo 11
kijja 11
makya 11
mangu 11
mateeka 11
mirembe 11
mukama 11
munda 11
ndi 11
njogera 11
nneme 11
obulamu 11
okukola 11
omusota 11
ssanyu 11
tuyigirize 11
yakobo 11
yange 11
a 10
abeerawo 10
beeruzebuli 10
bijja 10
birungi 10
bwakabaka 10
byammwe 10
ebitukuvulukka 10
ebitukuvuzabbuli 10
ekibiina 10
ekimu 10
enjala 10
ennyumba 10
kitaawe 10
lwaki 10
makuŋŋaaniro 10
malayika 10
mutima 10
nabo 10
ngoba 10
nkozesa 10
obwenkanya 10
okufuna 10
okusala 10
okusinga 10
okwagala 10
olutalo 10
omusaayi 10
omutima 10
sulemaani 10
tajja 10
yamala 10
akaseera 9
akyawa 9
amaaso 9
bajjajjaabe 9
bamugamba 9
bayinza 9
beewuunya 9
byange 9
dawudi 9
eggye 9
entukuvu 9
ewaabwe 9
ffe 9
gonna 9
guva 9
kigambo 9
kiyinza 9
kubabuulira 9
kugamba 9
kungulu 9
kyo 9
mbabuulidde 9
mundabe 9
obukambwe 9
ogwa 9
okubalamu 9
okuvvuunulwa 9
olukumi 9
singa 9
ssaawa 9
ssaddaaka 9
temukyandaba 9
tusaanidde 9
wakati 9
wayitewo 9
yamugamba 9
agambye 8
atandika 8
awonye 8
bammwe 8
bingi 8
bitundu 8
ebyafaayo 8
ekifaananyi 8
ekiro 8
ekyuma 8
embeera 8
eryo 8
gaabwe 8
kiriba 8
kitaffe 8
kitundu 8
kuddayo 8
kufuulibwa 8
kukola 8
kyaffe 8
kyawandiikibwa 8
luno 8
mukwano 8
mwaka 8
obulungi 8
okubuulira 8
okugenda 8
okuzaala 8
olwekyo 8
omubiri 8
omutego 8
omuzizo 8
waaliwo 8
waffe 8
abaagala 7
abalina 7
asiimibwa 7
atuula 7
bagambagana 7
bakabaka 7
bakola 7
bamalaaya 7
bano 7
batandika 7
bibuga 7
bifo 7
butuukirivu 7
buyudaaya 7
ebifaananyi 7
ebisingayo 7
ebitaliimu 7
ekibuga 7
emyoyo 7
ewala 7
kamwa 7
kennyini 7
kimu 7
kuddamu 7
kwogera 7
kyabwe 7
muliro 7
musango 7
ngero 7
nineeve 7
nsonga 7
obubonero 7
obusagwa 7
okufa 7
okutuuka 7
okuweereza 7
okuyingira 7
omufuzi 7
omugenyi 7
waliwo 7
yagamba 7
yusufu 7
abaali 6
abakenkufu 6
abakulu 6
abasajja 6
abatuukirivu 6
abeera 6
addeyo 6
afulumya 6
agawa 6
ai 6
aka 6
akaziya 6
amagaali 6
amawulire 6
anajja 6
asa 6
ategeeza 6
atya 6
atyo 6
avvoola 6
awangaala 6
ayimirira 6
ayitibwa 6
bajjajjammwe 6
balabe 6
banaalyanga 6
bayimiridde 6
bibi 6
bulumi 6
busika 6
bwonna 6
ebibala 6
ebibuga 6
eggulu 6
egwa 6
ejja 6
ekijjukizo 6
ekirabo 6
ekisa 6
emisana 6
emitima 6
endiga 6
ensobi 6
entaana 6
entebe 6
erinnya 6
erituukana 6
ettaala 6
eyeebuuza 6
eyeeraliikirira 6
ezzadde 6
gabulyeri 6
gijjudde 6
gyammwe 6
kaperunawumu 6
kiba 6
kibi 6
kiri 6
kitegeeza 6
kituuse 6
kizikiza 6
kkubo 6
kristo 6
kukiwaayo 6
kulaba 6
kumat 6
kusanyuka 6
kusooka 6
kyange 6
lwammwe 6
lwange 6
mbabuulira 6
mmwekka 6
mpa 6
mulabe 6
mulala 6
muli 6
muwala 6
muzimba 6
mwami 6
mwoyo 6
nate 6
ndeetera 6
ndiga 6
njagala 6
obufumu 6
obukumi 6
okumanya 6
okutegeera 6
okuwulira 6
olusozi 6
oluzzi 6
omanyi 6
omuddo 6
omugolokofu 6
omukisa 6
omukungu 6
omulyolyomi 6
omusujja 6
omuweereza 6
omuyigiriza 6
oyogera 6
sirina 6
ssebo 6
tebalina 6
tterekero 6
tusobole 6
wabweru 6
yalina 6
yategeera 6
abaavu 5
ababi 5
abadde 5
abakola 5
abalaguzi 5
abali 5
abayingira 5
addamu 5
addayo 5
agaaka 5
akamwa 5
akasaale 5
akuwa 5
alibasingisa 5
alizuukirira 5
alya 5
amafuta 5
amaka 5
amala 5
amayinja 5
anoonya 5
awangula 5
awulira 5
b 5
babi 5
bagezaako 5
balibasingisa 5
balizuukirira 5
bayigirizwa 5
beenenya 5
bintu 5
boogera 5
bukiikaddyo 5
bulijjo 5
buseera 5
bwaffe 5
ddoboozi 5
ebeera 5
ebifo 5
ebikwata 5
ebitukuvuekyamateeka 5
ebitukuvumatayo 5
ebitukuvuokubala 5
ebitukuvuyokaana 5
ebiwoobe 5
egigusinga 5
egya 5
ekika 5
ekkumi 5
ekyennyanja 5
ekyokulabirako 5
embwa 5
emirala 5
enjawulo 5
ennimiro 5
ennyonta 5
ensozi 5
erongooseddwa 5
eyakola 5
eyantuma 5
eyereddwa 5
gibeera 5
gimala 5
gubulwa 5
gugamba 5
gugenda 5
gugisanga 5
gugituukamu 5
gujja 5
gukola 5
guleetayo 5
gunoonya 5
guyitaayita 5
kabonero 5
kajja 5
ke 5
kibbo 5
kibya 5
komawo 5
kubaako 5
kuguweebwa 5
lubuto 5
lusiisira 5
mbi 5
mugaso 5
mukube 5
mumanyi 5
musaba 5
muyinza 5
mwali 5
naffe 5
nazaaleesi 5
nditeeka 5
ngalo 5
ngeri 5
nnavaamu 5
nnyina 5
obadde 5
obo 5
obubi 5
obusamize 5
ogamba 5
ogubuuka 5
okumala 5
okusinza 5
okuttibwa 5
okuwummulira 5
okuyitira 5
okwebuuza 5
omufalisaayo 5
omulabe 5
omulungi 5
omwenge 5
omwo 5
otegeerera 5
oyinza 5
so 5
tebikkirizibwa 5
temuyinza 5
tuli 5
tumanyi 5
tuwe 5
yeewuunya 5
yo 5
ababaka 4
ababuuza 4
abaddukira 4
abakanani 4
abamaleki 4
abasamaliya 4
abatiza 4
abawonya 4
afa 4
agalamizibwa 4
agende 4
akikolamu 4
akuŋŋaanya 4
amalungi 4
amangu 4
ambuulidde 4
amubuuza 4
amusaba 4
amusabye 4
amusikira 4
amutwala 4
anywa 4
asaasaanya 4
asobola 4
ataba 4
atakuŋŋaanyiza 4
ati 4
atuuka 4
avaayo 4
awamu 4
ayingira 4
ayita 4
azze 4
baalaba 4
badayimooni 4
bagambye 4
bakozesa 4
balagula 4
balowooza 4
balya 4
bamu 4
bamusaba 4
bamutwala 4
basigaddewo 4
basobole 4
bazigoba 4
biba 4
bigambo 4
birisigalawo 4
biwandiikiddwa 4
buba 4
bufirisuuti 4
bunaayimirirawo 4
buno 4
busuuli 4
butuufu 4
butya 4
buzikirira 4
ddi 4
ddyo 4
ebbi 4
ebibikkiddwa 4
ebitundu 4
ebukiikakkono 4
ebyali 4
ebyambalo 4
eggaali 4
ekiddukiro“yakuwa 4
ekifisseewo 4
ekire 4
ekiri 4
ekirungi 4
ekitala 4
ekyole 4
emagombe 4
emigaati 4
emiti 4
emyezi 4
enjuba 4
enkuba 4
ennyama 4
envunyu 4
eriiso 4
eriya 4
eyaliko 4
eyalina 4
eŋŋaano 4
gange 4
gano 4
ggaali 4
gwakaayakana 4
gyo 4
imula 4
isaaya 4
kenaana 4
kiki 4
kikkirizibwa 4
kinnya 4
kisenge 4
kituuka 4
kuboneka 4
kugenda 4
kulumwa 4
kumuwa 4
kusituka 4
kuwangula 4
kyayo 4
liba 4
ludda 4
luk 4
lyammwe 4
lyonna 4
manda 4
mawanga 4
muba 4
mubusubiddwa 4
mugamba 4
musobole 4
musumba 4
mutamanyi 4
muti 4
muweereza 4
ndibafuula 4
ndirinnya 4
nnaamuwa 4
nnakola 4
nnina 4
nno 4
nnyonta 4
nnyweko 4
nsozi 4
ntaana 4
ntebe 4
ntikko 4
obufuzi 4
obutaggwaawo 4
obuyinza 4
obweyawulamu 4
okubeera 4
okufuula 4
okulwanyisa 4
okulya 4
okumpi 4
okumukema 4
okusena 4
okusoma 4
okuwa 4
okuweesa 4
okuzimbibwa 4
olina 4
olunaku 4
omukka 4
omukunguzi 4
omusingi 4
omuzingo 4
omwezi 4
otya 4
simooni 4
taba 4
talisonyiyibwa 4
talusiisi 4
tayogera 4
temusomangako 4
tulina 4
tumaze 4
twagala 4
waaliyo 4
yagenda 4
yakolanga 4
yakuwakatonda 4
yandisobodde 4
yatambulira 4
yayingira 4
yazimba 4
yeeyawuddemu 4
yekka 4
zaali 4
zange 4
zeddeekiya 4
ab 3
abaabakozesanga 3
abagolokofu 3
abatume 3
abawandiisi 3
abayisirayiri 3
abbeeri 3
abuuza 3
afunye 3
agatali 3
agolola 3
agookya 3
akivunnamira 3
akyogedde 3
alagula 3
aleevi 3
aliba 3
alibalaga 3
alibategeeza 3
alibawa 3
alikuwa 3
alowooze 3
alyogera 3
amalaalo 3
amalaalogaabwe 3
amanda 3
ambuuza 3
ambye 3
amukyayira 3
amulonze 3
anaabanga 3
anaabatta 3
anaafunanga 3
anaalonda 3
anaavanga 3
anaawanga 3
anaawangayo 3
anaaweererezanga 3
aneeroboza 3
aneetulinkirizanga 3
asaliddwa 3
asanyuka 3
ataliwuliriza 3
atta 3
attibwanga 3
atugamba 3
ava 3
awasingayo 3
aweereza 3
ayogerako 3
ayogeranga 3
ayokyamutabani 3
azaala 3
azaaliddwa 3
baabatta 3
baanaabiranga 3
baani 3
baba 3
babulawo 3
bafu 3
bajulirwa 3
bakateeka 3
bakatonda 3
balasize 3
balibagoba 3
baliswazibwa 3
banne 3
batabani 3
batambulira 3
batta 3
batte 3
bawandiisi 3
baweta 3
bbanga 3
bika 3
biyonjo 3
bubwe 3
buggwaawo 3
buggya 3
butale 3
butereevu 3
butumalawo 3
buwungeerera 3
bwabwe 3
byaffe 3
dduka 3
ebe 3
ebibali 3
ebibereberye 3
ebibuuzo 3
ebifa 3
ebigirimu 3
ebijjula 3
ebinaasookanga 3
ebinyonyi 3
ebirabo 3
ebiribaawo 3
ebirina 3
ebiweebwayo 3
ebizibu 3
ebyambika 3
ebyenda 3
ebyokebwa 3
ebyoya 3
eddagala 3
eddungi 3
egiteetikkika 3
ekifo 3
ekikkowe 3
ekikopo 3
ekinene 3
ekinyonyi 3
ekirungo 3
ekiruyi 3
ekisisimuka 3
ekisumuluzo 3
ekitaliimu 3
ekiwummulo 3
ekyoto 3
emba 3
embuyaga 3
embuzi 3
emigugu 3
emisingi 3
emisingibwe 3
empeke 3
eneemala 3
ennume 3
ensiguvunaanibwe 3
entaanaza 3
enva 3
erumwa 3
ewuwe 3
eyamugamba 3
eyattibwa 3
eyayogera 3
eyokya 3
ezaakozesebwanga 3
gaagamba 3
gaawulirizanga 3
gakola 3
gamba 3
geetegereza 3
giba 3
giggwaawo 3
gijja 3
gimenyebwa 3
ginyweze 3
giwe 3
giyita 3
gudda 3
gujjudde 3
gukaze 3
gumulisa 3
gunaabanga 3
guwotose 3
jjajjaawe 3
kaabwe 3
kaakano 3
kabona 3
kaguwa 3
kibuuzo 3
kiddukiro 3
kigo 3
kikopo 3
kimera 3
kiribavunaanibwa 3
kirituuka 3
kiro 3
kitabaawo 3
kitatuukirira 3
kitubeereko 3
kitutiisa 3
kolebu 3
koogera 3
kubaggyako 3
kubawa 3
kubibuusa 3
kubitegeera 3
kuganyula 3
kujja 3
kukaaba 3
kukibawa 3
kumala 3
kumbuuza 3
kumubaweereza 3
kumubuuza 3
kunaaba 3
kunakuwala 3
kundaba 3
kunenyezebwa 3
kungulumiza 3
kusala 3
kusinza 3
kutonnyesa 3
kutunda 3
kutuuka 3
kuvunaanibwa 3
kuwa 3
kuwulira 3
kuyigganya 3
kwa 3
kwange 3
kwo 3
kyabyo 3
kyakuŋŋaana 3
kyama 3
kyanika 3
kyava 3
kyeyava 3
leero 3
leevi 3
litwalibwe 3
luyonaani 3
lwo 3
maasomu 3
magezi 3
malaalo 3
malambe 3
masiya 3
mbagambye 3
mbasabira 3
mbibabuulidde 3
mmanyi 3
mmeeza 3
mmwennyini 3
mubigabire 3
mubiwagira 3
muddeeyo 3
mudduke 3
mugaati 3
mugabo 3
muganda 3
mugende 3
muguluka 3
mugwanidde 3
mujjudde 3
mujjukire 3
mulinga 3
mulisaba 3
mulisalirwa 3
muliyitibwa 3
mulubaale 3
mulumwa 3
musaayi 3
musabye 3
musajja 3
musuula 3
mutikka 3
mutukuvu 3
mutuukirivu 3
mutya 3
muwaayo 3
muyonja 3
muziyiza 3
muziziko 3
mwa 3
mwagala 3
mwaggyawo 3
mwannyinaze 3
mwebuuzaganya 3
mwesigwagwagala 3
nalyo 3
ndibatumira 3
ndibawa 3
ndimulagira 3
ndimuvunaana 3
nedda 3
nfuufu 3
njereere 3
nkyalina 3
nnabbugira 3
nnabibabuulira 3
nnajja 3
nnali 3
nnawanikira 3
nsa 3
ntandikwa 3
nte 3
nteekateeka 3
ntyo 3
nyweza 3
nzikiza 3
nzirukidde 3
obaggyawo 3
obukakafu 3
obulagirizi 3
obulaguzi 3
obumatiza 3
obusika 3
obutuukirivu 3
obwamalaaya 3
ofuuse 3
ogenda 3
ogende 3
oguliibwa 3
ogumera 3
ogutali 3
ogwanidde 3
ogwasannyalala 3
ogwayiika 3
ogwetegese 3
okubabuulira 3
okubalaba 3
okubikola 3
okugatta 3
okujja 3
okukuba 3
okukungula 3
okukyogera 3
okulagulwa 3
okulamusibwa 3
okumubuuza 3
okumukwasa 3
okumusinzizanga 3
okumuteganya 3
okupima 3
okusalibwa 3
okusalirako 3
okusobola 3
okusooka 3
okussa 3
okutajjulukuka 3
okutiibwa 3
okutya 3
okuviira 3
okuwangula 3
okuŋŋamba 3
okwogerako 3
okwogerera 3
olugalo 3
olumu 3
olwayise 3
omaze 3
omubazzi 3
omugumu 3
omukenkufu 3
omuleevi 3
omulogo 3
omululu 3
omulundi 3
omungi 3
omusamize 3
omusu 3
omutuukirivu 3
omuwulirizanga 3
omuyambi 3
onoomuwanga 3
onootuuka 3
onsinzaako 3
otulabya 3
otulage 3
otuvuma 3
oyobo 3
oziteeka 3
ozzaayo 3
peganonine 3
peʹga 3
saabibabuulira 3
saasira 3
siigende 3
sikyayogera 3
simulagidde 3
sitegeeza 3
ssente 3
takukkirizza 3
takyajjukira 3
tannalya 3
tasoose 3
tebaabenga 3
tebakimanyi 3
tebalifuna 3
tebammanyi 3
tebamumanyi 3
tebanzikiririzaamu 3
temugenda 3
temugikwatako 3
temujja 3
temusaanidde 3
temwayingira 3
tetutegeera 3
tewalabikanga 3
tezinnazaalibwa 3
tobangako 3
tomutyanga 3
tonnakola 3
toyiganga 3
ttaka 3
ttukuvu 3
ttuntu 3
tuba 3
tubonaabona 3
tubulawo 3
tujaganye 3
tukkuse 3
tukola 3
tunaamanyanga 3
tusobola 3
tutya 3
tuwangaala 3
wabaawo 3
wagamba 3
wammwe 3
wasaba 3
wazaalibwa 3
weewaawo 3
yababuulira 3
yabagamba 3
yafuna 3
yagambanti 3
yakyogera 3
yamanya 3
yammwe 3
yayogera 3
yeetegereza 3
yeetulinkiriza 3
zaakomberera 3
zekkaliya 3
zigenda 3
zikendeera 3
zo 3
zombi 3
zonna 3
abaabikola 2
abaalina 2
abaami 2
abaanabammwe 2
abaawulira 2
abaddu 2
abafu 2
abagaliraaya 2
abagenda 2
abagenge 2
abagezigezi 2
abagwanira 2
abakangavvulwa 2
abakozi 2
abakuba 2
abakuutira 2
abalabe 2
abalage 2
abaleega 2
abaliba 2
abaliddawo 2
abalikulaba 2
abalinga 2
abalisigalawo 2
abalwadde 2
abamusaba 2
abamusinza 2
abanaku 2
abanjeemera 2
abanyigirizibwa 2
abasibe 2
abasinza 2
abasirusiru 2
abasuuli 2
abatalabanga 2
abattibwa 2
abatwalibwa 2
abavubuka 2
abawambe 2
abaweesi 2
abawulira 2
abayitamu 2
abayudaaya 2
abazibe 2
abazzukulu 2
abbamu 2
abe 2
abeereko 2
abigaba 2
aboogera 2
afaanana 2
afiire 2
afuga 2
afuluma 2
afumba 2
afumiitiriza 2
afuna 2
afuuse 2
agaana 2
agalamidde 2
agamukwatako 2
ageeyawulamu 2
aggwaamu 2
agiteeka 2
agubajjamu 2
aguboggolera 2
aguddiza 2
agugolola 2
agukolamu 2
aguleka 2
agupima 2
aguwala 2
aguzingulula 2
akabi 2
akakisa 2
akalala 2
akawungeezi 2
akazi 2
akigamba 2
akikozesa 2
akikubaakuba 2
akisaba 2
akitegeera 2
akkiriza 2
akkirizibwa 2
akkuta 2
akolamu 2
akomyewo 2
akoowa 2
akooye 2
akoze 2
akuba 2
akubiriza 2
akugamba 2
akuma 2
akungula 2
akuuma 2
akyayogera 2
akyokya 2
alaajana 2
alagidde 2
alagira 2
alamba 2
alayidde 2
aleega 2
aleekaana 2
aleka 2
aleme 2
alijjira 2
alimanyisa 2
aliragira 2
alireetawo 2
alisonyiyibwa 2
alitubuulira 2
alituukiriza 2
aliyitibwa 2
alumwa 2
alye 2
amakulu 2
amakungula 2
amalala 2
amaloboozi 2
amannya 2
amasanga 2
amayembe 2
amba 2
amira 2
amoni 2
amugambiddeko 2
amuggyeeko 2
amulaga 2
amuleetedde 2
amuleka 2
amulwanyisa 2
amusinga 2
amusinza 2
amuteeka 2
amuwa 2
amuwangula 2
amuwe 2
amuwonya 2
amuwonye 2
anaalimbalimba 2
anaatera 2
anaŋŋamba 2
ankyalidde 2
anunudde 2
asaanyaawo 2
asaba 2
asazeewo 2
asembera 2
asiga 2
asimba 2
asingayo 2
asoberwa 2
asoonooka 2
asoose 2
assa 2
atadde 2
ataddewo 2
atagiggyaamu 2
atali 2
atalina 2
atazikkiriza 2
atema 2
atudde 2
atunudde 2
atuukiridde 2
atwala 2
avudde 2
awataali 2
awatali 2
aweesa 2
awoneddeko 2
ayakaayakana 2
ayigirizaamu 2
ayimuka 2
ayogerera 2
ayolekaganye 2
ayolesezza 2
ayota 2
aziboggolera 2
aziikibwa 2
azingako 2
azuba 2
aŋŋamba 2
baabalaba 2
baakiwulira 2
baaliyo 2
baamukkiriza 2
baamulaba 2
baanywanga 2
baasinzizanga 2
baategana 2
babaanukule 2
babakuba 2
babamuleetera 2
babasaasaanya 2
babeera 2
babulooni 2
bafuluma 2
bagalamidde 2
bagasa 2
bagenda 2
bagendere 2
bagenze 2
bagolokoka 2
bajjajjaabwe 2
bajjajjaffe 2
bakazi 2
bakikolerako 2
bakka 2
bakkiriza 2
bakugamba 2
bakuŋŋaane 2
bakuŋŋaanye 2
bakyanyookereza 2
bakyaweerayo 2
bakyuka 2
balaba 2
balabye 2
balagulira 2
baleeta 2
balekera 2
baleme 2
baliba 2
balibaleeta 2
balibaleetera 2
baliddukira 2
balifuluma 2
balijja 2
balikusitulira 2
balikwekaliriza 2
balikwekenneenya 2
balina 2
balinga 2
balirangirira 2
balireeta 2
balisonyiyibwa 2
baliswala 2
balittibwa 2
bamalayika 2
bamanyi 2
bambadde 2
bambuka 2
bamubuuza 2
bamuddamu 2
bamufulumya 2
bamugoberera 2
bamukkiriza 2
bamuleetera 2
bamusembeza 2
bamusisinkana 2
bamussaamu 2
bamutunuulira 2
bamuvunaana 2
bamuwa 2
bamuwaniridde 2
bamuyimiriza 2
bamuziika 2
bamwegayirira 2
banaabira 2
banaasinzanga 2
bannamwandu 2
banoga 2
basaasaanye 2
basamaliya 2
basirusiru 2
basituka 2
basunguwala 2
bataano 2
batabaako 2
batalina 2
bateekwa 2
bategeera 2
batudde 2
batunuulira 2
batuuka 2
batwale 2
batya 2
bava 2
bawulidde 2
bawuniikirira 2
bayimirire 2
bayudaaya 2
bbaali 2
beebo 2
beekobaana 2
beetulinkiriza 2
bibala 2
bibeere 2
bibegaabega 2
bibuna 2
bigaali 2
bikolere 2
bimanyi 2
bimwogerwako 2
binkwatako 2
binooba 2
biriddamu 2
biriraanyeewo 2
birowoozo 2
bityo 2
bizinga 2
bokka 2
booleza 2
bu 2
bubwo 2
bujja 2
bujje 2
bulamu 2
bulimba 2
buliri 2
bulungi 2
buntu 2
busaasizi 2
busibukamu 2
buyinza 2
buziba 2
bwakya 2
bwampeebwa 2
bwetaavu 2
byagwo 2
byamenyekeramenyekera 2
byayo 2
byegattira 2
byereere 2
byokka 2
byombo 2
da 2
date 2
dda 2
eba 2
ebaluma 2
ebbiri 2
ebibikkiddwako 2
ebigamba 2
ebigulumivu 2
ebire 2
ebirimba 2
ebiriraanyeewo 2
ebirowoozo 2
ebisago 2
ebivuga 2
ebulayo 2
ebyabwe 2
ebyamagero 2
ebyamu 2
ebyayogerwa 2
ebyayonoonebwa 2
ebyeyawulamu 2
ebyole 2
ebyombo 2
ebyong 2
ebyonoono 2
edomu 2
egamba 2
eggi 2
eggwanga 2
egukuza 2
ejjinja 2
ekibanja 2
ekibi 2
ekibira 2
ekidiba 2
ekijjudde 2
ekikoligo 2
ekikolo 2
ekikutte 2
ekinnya 2
ekipima 2
ekiragiro 2
ekiringa 2
ekirongoofu 2
ekirootoku 2
ekisingayo 2
ekitakkirizibwa 2
ekitegeeza 2
ekitenkanankana 2
ekitundutundu 2
ekituufu 2
ekiyitibwa 2
ekumulisa 2
ekyali 2
ekyambalo 2
ekyavaamu 2
ekyawandiikibwa 2
ekyenyinyaza 2
embalaasi 2
emeka 2
emibi 2
emigga 2
emirambo 2
emirundi 2
emisota 2
emizira 2
emmambya 2
emmunyeenye 2
emmyufu 2
empeera 2
emulemesa 2
emuluma 2
emuvaako 2
endagaano 2
ende 2
endwadde 2
eneevangamu 2
enjaba 2
enjogera 2
enkaliriza 2
enkizo 2
enkoba 2
enkola 2
enkolagana 2
enku 2
ennene 2
ennimi 2
ennoni 2
ennungi 2
ennyondo 2
ensinjo 2
ensiriŋŋanyi 2
ensulo 2
ensuwa 2
entalo 2
ente 2
entolokyo 2
entuufu 2
eriamawanga 2
eriggya 2
erisa 2
erya 2
essaala 2
essaawa 2
essanduuko 2
etubuulirako 2
ewala—abatawuliranga 2
ewammwe 2
eyafufuggaza 2
eyafuula 2
eyagaananga 2
eyagenda 2
eyakankanyanga 2
eyakutonda 2
eyakuyonsa 2
eyakuzaala 2
eyalasa 2
eyaleetera 2
eyasooka 2
eyatuwa 2
eyawa 2
eyayuuguumyanga 2
ezidduka 2
eziribalya 2
ezitalina 2
eziyonigeberi 2
ezo 2
gaakyo 2
gabuna 2
gajja 2
galisuubirira 2
gammwe 2
gasasika 2
gassiddwa 2
gatuuke 2
gazibiddwa 2
gguuliro 2
giva 2
golola 2
gugoloddwa 2
gukula 2
gukulukutira 2
guli 2
guliggibwa 2
gulizimbibwa 2
gumenyese 2
gumuvaako 2
gumuwabizza 2
gutegeererwa 2
guvaamu 2
guwona 2
gwabwe 2
gwagala 2
gwakuvaako 2
gwamuvuddeko 2
gwanvaako 2
gwogera 2
gyabwe 2
jjajjaffe 2
jjangu 2
jjinja 2
jjukira 2
kaana 2
kabi 2
kabuga 2
kaffe 2
kagulungujjo 2
kakwasa 2
kalira 2
kalobo 2
kibe 2
kibeerenga 2
kibiina 2
kibira 2
kifa 2
kigere 2
kikoligo 2
kikolo 2
kikondo 2
kikozesebwa 2
kimunoonya 2
kirabika 2
kirala 2
kirangirirwa 2
kiribeeramu 2
kiriddamu 2
kiriggibwa 2
kirituukirira 2
kirungi 2
kisaliddwawo 2
kitammwe 2
kitulaga 2
kituukiridde 2
kiva 2
kiwundu 2
kkiriza 2
kkomera 2
kkono 2
koluma 2
kubalwanyisa 2
kubawangula 2
kubuusabuusa 2
kufuuka 2
kugiryako 2
kukemebwa 2
kukiikirira 2
kukituukiriza 2
kukkiriza 2
kukolebwa 2
kukoona 2
kukununula 2
kukuwa 2
kulwa 2
kumulimbalimba 2
kumusaba 2
kumusiba 2
kundagulako 2
kusenesa 2
kusigalawo 2
kusobola 2
kuteebwa 2
kutegana 2
kuttibwa 2
kutuukibwako 2
kutuzikiriza 2
kuulo 2
kuweebwa 2
kuwonya 2
kuyitira 2
kuŋŋamba 2
kwabwe 2
kwesittala 2
kwogerwako 2
kwonna 2
kyabwo 2
kyagambibwa 2
kyali 2
kyamagero 2
kyandiba 2
kyantumya 2
kyayeekaalu 2
kyenva 2
kyewuunya 2
kyuka 2
labbi 2
leeta 2
lekera 2
lifuuke 2
liiso 2
lino 2
liribeera 2
litukuzibwe 2
litunula 2
liyimiridde 2
lubiri 2
ludi 2
lugendo 2
lulala 2
lumu 2
lunyiinyiitira 2
lutalo 2
lutalokubanga 2
luwanvu 2
luzzi 2
lwaggaddwawo 2
lwonna 2
lyabwe 2
lyagwo 2
magaali 2
magye 2
matono 2
mawanga—abaddukira 2
mbaga 2
mbalaasi 2
mbugume 2
mbuwa 2
mi 2
mikono 2
mikwano 2
mmere 2
mmwenna 2
mpolaayo 2
mubagambe 2
mubanga 2
mubi 2
mugambenga 2
muganyulwa 2
mujeemera 2
mujje 2
muka 2
mukazi 2
mukimanyi 2
mukyetegereze 2
mulabye 2
mulamu 2
muleme 2
mulivaamu 2
mulokozi 2
mulyango 2
mumukwase 2
mumuteeke 2
mumuwe 2
munafu 2
musamaliya 2
musawo 2
musinza 2
mutalisinziza 2
mutangaavu 2
muteeketeeke 2
mutegedde 2
mutunuulire 2
mutuufu 2
mutwale 2
muveeko 2
muwendo 2
muwulidde 2
muyimuse 2
muzibe 2
mwalekera 2
mwalimu 2
mwe 2
mwen 2
mwogerere 2
naamani 2
nabyo 2
ndaba 2
ndiggirawo 2
ndijja 2
ndikaliza 2
ndikifuula 2
ndikyera 2
ndimenyeramenyera 2
ndimulinnyirira 2
ndimuteekako 2
ndireetera 2
ndisangula 2
ndituma 2
ndituula 2
ndiwanika 2
ndizzaawo 2
ndokola 2
ndya 2
ndyefaanaanyiriza 2
nebati 2
nfunye 2
nfuula 2
nguudo 2
njagadde 2
njokyako 2
nkikolemu 2
nkimanyi 2
nkiraba 2
nkomyewo 2
nkugamba 2
nkumanyi 2
nkuwa 2
nkuŋŋaanya 2
nnaakulayiza 2
nnabamba 2
nnafumbyeko 2
nnakubumba 2
nnakyokezza 2
nnalaba 2
nnalonda 2
nnamunnungu 2
nnamwandu 2
nnasalawo 2
nnateekateeka 2
nnayanjuluza 2
nneefudde 2
nnemesa 2
nnimiro 2
nnwanyise 2
nnyingi 2
nnyumbu 2
nsaanidde 2
nsanyukira 2
ntaanaye 2
nteeke 2
ntonda 2
ntono 2
ntunuulira 2
ntuukiriza 2
nzekka 2
obanga 2
oboolyawo 2
obubaka 2
obuggya 2
obujulirwa 2
obuliri 2
obulokozi 2
obusaale 2
obusirusiru 2
obutambuulira 2
obutamumanyisa 2
obuzira 2
ofiri 2
ogaggye 2
ogudde 2
ogugoloddwa 2
ogulibookya 2
ogulinnyiriddwa 2
ogupima 2
ogutaagalibwa 2
oguyingira 2
ogwakala 2
ogwali 2
ogwalimbibwa 2
ogwo 2
okolana 2
okole 2
okomewo 2
oku 2
okubaako 2
okubavaako 2
okubaweereza 2
okubayigiriza 2
okudda 2
okufaananako 2
okugendanga 2
okugoberera 2
okugolokoka 2
okugula 2
okuguzzaayo 2
okujjanga 2
okukiggya 2
okukimayo 2
okukiremesa 2
okukkiririzibwamu 2
okukkiriza 2
okukoleeza 2
okukukuuma 2
okulaga 2
okulagira 2
okulangirira 2
okulumwa 2
okulwana 2
okumaliriza 2
okumukasuka 2
okumulimbalimba 2
okumulwanyisa 2
okumusaba 2
okumusinza 2
okumusinzanga 2
okumutta 2
okumuvaako 2
okumuvunnamira 2
okumuwondera 2
okumuziyiza 2
okumwogerako 2
okuna 2
okunsaba 2
okuntawaanya 2
okunyaga 2
okunywa 2
okusaba 2
okusanyukira 2
okusatu 2
okusinziira 2
okusinziza 2
okusoberwa 2
okusumulula 2
okusuula 2
okutomezaabasuuli 2
okuttira 2
okutuukira 2
okutuukirira 2
okutuukiriza 2
okuvunnamamu 2
okuvvoola 2
okuwonya 2
okuyigiriza 2
okuyimba 2
okuyita 2
okuyitiramu 2
okuzikiriza 2
okwakisa 2
okwambuka 2
okwazimbibwa 2
okwekweka 2
okwokya 2
okwonoona 2
okwota 2
olabe 2
oleme 2
oliggwaamu 2
olinga 2
olissibwa 2
olugendo 2
olugero 2
oluggi 2
olukuŋŋaanirwako 2
olumenyese 2
olumuli 2
olutambi 2
olutobazzi 2
olutukuvu 2
oluyi 2
oluzimeera 2
olwalaba 2
olwebbulaniya 2
olweyo 2
omubaka 2
omubereberye 2
omubiribalijja 2
omuggo 2
omugugu 2
omuguwa 2
omukulu 2
omulamu 2
omulimu 2
omulwadde 2
omulyango 2
omunaku 2
omunda 2
omunnazaaleesi 2
omununuzi 2
omusaba 2
omusamaliya 2
omusanvu 2
omusigire 2
omusizi 2
omusuuli 2
omutulumbi 2
omutunsi 2
omuvuzi 2
omuweesi 2
omuyovu 2
omuyudaaya 2
omwaka 2
omwami 2
omwasuli 2
omwavu 2
omwesigwa 2
omworeni 2
onoobamalawo 2
onoogenda 2
onookikola 2
onookomawo 2
onoonya 2
onootegeera 2
onooyingira 2
onsinza 2
onzigye 2
osinga 2
osuulibwa 2
osuuliddwa 2
otemeddwa 2
otoziikibwa 2
otulanga 2
otusonyiwe 2
otyo 2
oyambaziddwa 2
oyite 2
oyogedde 2
puli 2
saakugambye 2
sayuuni 2
sidoni 2
sigenda 2
simwagala 2
siriivu 2
sirika 2
sirikwerabira 2
siruki 2
sisobola 2
sooka 2
sukali 2
taasituke 2
taata 2
tagikweka 2
tagivuunikako 2
takigenderedde 2
takooye 2
tali 2
taliddamu 2
talireekaana 2
talirubetenta 2
taliruzikiza 2
talisingawo 2
taliyomba 2
tandagulako 2
tannafa 2
tanywa 2
tasaanidde 2
tasobola 2
tatuukiridde 2
taweebwa 2
tayogedde 2
tebakkirizibwa 2
tebakolagana 2
tebaliiko 2
tebasobola 2
tebiraba 2
tebiriba 2
tebirina 2
tebisobola 2
tebyagenda 2
tebyaggibwawo 2
tegaliddamu 2
tegulizikizibwa 2
tegutegeera 2
temubeeranga 2
temugamba 2
temukozeeko 2
temulwanyisa 2
temwambuka 2
temwandinenyezza 2
terina 2
tetonnya 2
tetugenda 2
tetukkiriza 2
tewaaliwo 2
tewaba 2
tewaliba 2
tewaliiwo 2
teyali 2
teyalivaamu 2
teyatumibwa 2
teyava 2
teyeebuuza 2
teyeetwala 2
tezirifa 2
togezesanga 2
tolibeegattako 2
tolina 2
tosanyuka 2
totutwala 2
ttama 2
ttumbi 2
tubali 2
tubanja 2
tugende 2
tukaasamizza 2
tukirwanyise 2
tulonzalonza 2
tusinza 2
tusonyiwa 2
tuutuno 2
twalo 2
twawulira 2
twebuuze 2
twetegese 2
twewuliriddeko 2
twonoonye 2
waabwe 2
waakabeera 2
wajja 2
wakola 2
wandibadde 2
wayogedde 2
wayogera 2
wazikiriza 2
weebisse 2
weebuuze 2
weegendereze 2
weesuule 2
weewonye 2
wenna 2
wonna 2
wulira 2
yabanga 2
yabuulira 2
yabuuza 2
yaffe 2
yafiiramu 2
yafuuka 2
yafuulira 2
yagattako 2
yagifugira 2
yakimanya 2
yakulira 2
yakuwagundiko 2
yaliko 2
yalongoosebwawabula 2
yalwana 2
yamalirawo 2
yamaliriza 2
yambala 2
yamuvaako 2
yandifunye 2
yanfukako 2
yantuma 2
yanyiizanga 2
yatumibwa 2
yatuteerawo 2
yatuuka 2
yavaayo 2
yavani 2
yawa 2
yaweereza 2
yawonyezebwa 2
yawulira 2
yayigiriza 2
yayogerako 2
yeebuuza 2
yeefuula 2
yeekolera 2
yeeroboza 2
yeesiga 2
yeetaaga 2
yeeyongera 2
yekolaamu 2
yennyini 2
yerobowaamu 2
yima 2
yogera 2
yogerera 2
yokka 2
yonna 2
yowaasi 2
zalefaasi 2
zigamba 2
zikomberera 2
zimanyi 2
zireekaana 2
ziringa 2
zituuse 2
ziva 2
zizo 2
zzaabu 2
