mu 182
muwogo 102
ku 98
ki 79
kasooli 74
ebijanjaalo 58
nga 56
n 49
kya 47
abalimi 44
ettaka 44
y 42
by 38
ng 34
kiki 33
bya 31
ttaka 31
ky 29
obulungi 29
buli 25
kika 25
okusimba 25
e 24
ne 24
ebiwuka 23
bw 21
omulimi 21
lwaki 20
nnyo 20
gya 19
embuzi 18
kw 18
okuva 17
z 17
ebitooke 16
ensigo 16
okulima 16
okutangira 16
omuddo 16
ya 16
ebimera 15
eddagala 15
ekigimusa 15
emiti 15
uganda 15
wa 15
bwa 14
emu 14
nnimiro 13
ebikoola 12
eby 12
ebyennyanja 12
ennyo 12
kulima 12
kye 12
ly 12
okufuna 12
okukozesa 12
sizoni 12
ebika 11
ente 11
era 11
ddagala 10
enkuba 10
ennaanansi 10
nsobola 10
obulwadde 10
okufuuyira 10
okukungula 10
waliwo 10
yiika 10
za 10
amatooke 9
ayinza 9
bijanjaalo 9
bulungi 9
ebigimusa 9
ekireetera 9
ennungi 9
eri 9
ez 9
kyenvu 9
lw 9
ntya 9
okulunda 9
omusana 9
osobola 9
amazzi 8
asobola 8
bisobola 8
bwe 8
disitulikiti 8
embizzi 8
emmwanyi 8
ey 8
ga 8
gw 8
kiseera 8
ngeri 8
oluvannyuma 8
w 8
abasinga 7
akatale 7
amakungula 7
biseera 7
bitundu 7
ebyenyanja 7
ekiviirako 7
gwa 7
kkiro 7
kutangira 7
kwa 7
obutunda 7
okuteeka 7
okuvunda 7
singa 7
wiiki 7
alina 6
amangu 6
bikoola 6
ebinyeebwa 6
ebiriisa 6
ebisinga 6
ebya 6
ekidiba 6
ekika 6
ekirungi 6
enjawulo 6
ennimiro 6
ennyaanya 6
esinga 6
gavumenti 6
gy 6
gye 6
kidiba 6
lumonde 6
mmeka 6
oba 6
obuwuka 6
okugengewala 6
okukola 6
okulimibwa 6
okusobola 6
okwongera 6
ssente 6
abantu 5
amata 5
ate 5
atya 5
b 5
balina 5
bbiri 5
bimera 5
ebintu 5
ebirungi 5
ebitundu 5
eddungi 5
ekimera 5
ekisobola 5
ekitundu 5
emirungi 5
endokwa 5
engeri 5
enkola 5
ery 5
esobola 5
ffaamu 5
kigimusa 5
kirungi 5
kusimba 5
kutangirwa 5
masindi 5
mutendera 5
na 5
nninza 5
nti 5
okufukirira 5
okufuuka 5
okuggya 5
okukoola 5
okukula 5
okusimbiramu 5
omu 5
simba 5
ssatu 5
waakiri 5
amalagala 4
amalungi 4
awamu 4
basobola 4
batya 4
bayinza 4
bbanga 4
bijja 4
bika 4
bingi 4
bitya 4
budde 4
ddala 4
ebbugumu 4
ebirime 4
ebirungo 4
emirandira 4
ennyingi 4
etya 4
funa 4
g 4
gwonna 4
kabale 4
kikumi 4
kirina 4
kkumi 4
lya 4
lye 4
mugaso 4
myezi 4
nsigo 4
obutonde 4
oggyeko 4
okuba 4
okubala 4
okukolebwa 4
okumala 4
olw 4
omuntu 4
omutindo 4
omwaka 4
wansi 4
yange 4
yenna 4
abeera 3
amagezi 3
asidi 3
babuuza 3
bangi 3
bbeeyi 3
birina 3
bubiri 3
bulijjo 3
byennyanja 3
byonna 3
ddi 3
ebbeeyi 3
ebikolo 3
ebikumi 3
ebikuta 3
ebiri 3
ebisagazi 3
ebiseera 3
ebisolo 3
ebyeru 3
ekikolo 3
ekireeta 3
ekisinga 3
ekitooke 3
ekiva 3
ekiwuka 3
ekyuma 3
embeera 3
emmere 3
empeke 3
endwadde 3
enkoko 3
ensawo 3
ensonga 3
eriddugavu 3
esatu 3
eya 3
eyinza 3
ezisinga 3
ggwanga 3
ggyamu 3
gulina 3
k 3
ka 3
kaseera 3
kebera 3
kibuzi 3
kikolo 3
kikubirizibwa 3
kimera 3
kimu 3
kisobola 3
kituufu 3
kitya 3
kiyamba 3
kozesa 3
kuba 3
kufuna 3
kukola 3
kukozesa 3
kukula 3
kulwanyisa 3
langi 3
lirina 3
lisobola 3
mazzi 3
miti 3
mwaka 3
mwe 3
naddala 3
ndwadde 3
nkuba 3
obudde 3
obukadde 3
obusa 3
obuwanvu 3
obuwunga 3
okka 3
okubeera 3
okudda 3
okukala 3
okukebera 3
okukozesebwa 3
okukulugguka 3
okumanya 3
okumera 3
okusiga 3
okusimbako 3
okusimbibwa 3
okuteekebwa 3
okwewala 3
omungi 3
omuzira 3
owa 3
phosphate 3
tusobola 3
tutya 3
wakati 3
we 3
yeetaaga 3
yinki 3
yonna 3
abalima 2
abalunzi 2
abatuuze 2
akawuka 2
akubiddwa 2
amabala 2
amagoba 2
ataano 2
avunda 2
baagala 2
bakozesa 2
bakubirizibwa 2
balowooza 2
bannayuganda 2
bibadde 2
bifo 2
bikala 2
bikendeera 2
bintu 2
biriisa 2
birungi 2
birwadde 2
bisimbiddwa 2
bisolo 2
bitaano 2
bitooke 2
biyinza 2
bubonero 2
bugimu 2
bulwadde 2
bungi 2
busobola 2
butya 2
byabwe 2
ddungi 2
diammonium 2
ebibala 2
ebimu 2
ebimuli 2
ebinnya 2
ebirala 2
ebirimu 2
ebirya 2
ebissa 2
ebitendo 2
ebito 2
ebiwakisa 2
ebyobulimi 2
ebyonoona 2
egendamu 2
egy 2
ekibaawo 2
ekifo 2
ekikuba 2
ekikula 2
ekirala 2
ekiseera 2
ekitongole 2
ekitono 2
ekizibu 2
eky 2
ekyeya 2
emboga 2
emmerezo 2
empewo 2
empiira 2
emyezi 2
endala 2
endiirwa 2
enkota 2
ennaku 2
ennima 2
eno 2
ensolo 2
entobazi 2
entono 2
enva 2
erifuuyira 2
erisinga 2
eritta 2
esooka 2
ettuufu 2
eza 2
ezimu 2
ezisimbiddwa 2
fuba 2
giba 2
gisimbibwe 2
gumu 2
hoima 2
kali 2
kiba 2
kiboga 2
kikolwa 2
kinnya 2
kino 2
kintu 2
kisinga 2
kisoboka 2
kitaka 2
kitegeeza 2
kitundu 2
kiwotokwa 2
kiyinza 2
kko 2
kubala 2
kuggya 2
kukolebwa 2
kulina 2
kumpi 2
kuno 2
kutandika 2
kutereka 2
kuyinza 2
kwetaaga 2
kyonna 2
londa 2
lyonna 2
magezi 2
matooke 2
mbeera 2
mmerezo 2
muddo 2
mulimi 2
mwenda 2
mwezi 2
nambaale 2
naro 2
naye 2
nkaaga 2
nkola 2
nkozesa 2
nkungula 2
nnina 2
nnungi 2
nnyingi 2
nnyinza 2
nsi 2
nsozi 2
ntobazi 2
obukuba 2
obulimi 2
obutabala 2
obutuufu 2
obwa 2
obwetaavu 2
ojja 2
okubabuka 2
okufiirizibwa 2
okufuuyirwa 2
okujjako 2
okukabalibwa 2
okukubwa 2
okukunkumuka 2
okukuuma 2
okuliisa 2
okumulisa 2
okungula 2
okusaasaana 2
okusaasaanya 2
okusimbamu 2
okusinziira 2
okutandika 2
okutta 2
okuvaamu 2
okuwakisa 2
okuweebwa 2
okuyamba 2
okuyita 2
okwengera 2
okwonoona 2
omugaso 2
omulimisa 2
omulungi 2
omusujja 2
omusulo 2
omwezi 2
osimba 2
otya 2
si 2
sima 2
siringi 2
sooka 2
soroti 2
ssentimita 2
ssoya 2
teeka 2
tewali 2
tonnasimba 2
ttaano 2
tuyinza 2
wajja 2
wange 2
wano 2
whiteflies 2
whitefly 2
yogera 2
ziwe 2
