mu 222
ku 108
nga 92
ne 76
baháu 57
lláh 57
era 54
na 44
ya 36
ye 35
bwe 30
ga 30
no 30
nti 29
abantu 26
kabaka 25
omu 25
yali 25
katonda 23
lwa 22
okuva 22
báb 21
olwo 20
ba 19
be 18
ki 18
bo 17
buli 17
ddala 17
kya 17
naye 17
olwa 17
wa 17
kye 16
maaso 16
ennyo 15
baali 14
bonna 14
eyali 14
abo 13
bya 13
ekya 13
enzikiriza 13
lwe 13
abaali 12
bye 12
eri 12
eya 11
gwe 11
kwa 11
nnyo 11
omuntu 11
abagoberezi 10
badasht 10
lukuŋŋaana 10
nno 10
aba 9
bwa 9
ekyo 9
gu 9
kyali 9
oba 9
olukuŋŋaana 9
oluvannyuma 9
oyo 9
amaanyi 8
amawulire 8
byonna 8
ebya 8
gya 8
gye 8
mwe 8
okutuuka 8
tihrán 8
bigambo 7
ebikolwa 7
eddiini 7
kino 7
kwe 7
lunaku 7
nge 7
obo 7
obungi 7
omukisa 7
singa 7
táhirih 7
wadde 7
wansi 7
yakola 7
za 7
ababáb 6
ababábi 6
abasinga 6
ataano 6
bano 6
bino 6
e 6
ebyo 6
engeri 6
ensi 6
gaabwe 6
kitaawe 6
kusooka 6
lya 6
mangu 6
mbeera 6
munnaddiini 6
newaakubadde 6
okwagala 6
omuti 6
yenna 6
abakuumi 5
abamu 5
agenda 5
amagezi 5
amazima 5
ate 5
bagoberezi 5
byabwe 5
ebigambo 5
ebigere 5
ebyali 5
ekifo 5
ekikolwa 5
ekkomera 5
empya 5
enzikiza 5
eringi 5
essanyu 5
eyo 5
ge 5
gwali 5
kaakano 5
kennyini 5
kifo 5
kiki 5
kyalo 5
kyonna 5
lino 5
lukumi 5
lunaana 5
lyali 5
lye 5
mázindarán 5
obubaka 5
obulamu 5
okumpi 5
okutuusa 5
olunaku 5
omuto 5
ono 5
ze 5
abali 4
agaali 4
aliyolesa 4
banne 4
basibe 4
byo 4
ejjinja 4
ekiragiro 4
ekitundu 4
ekyali 4
embalaasi 4
embeera 4
eno 4
gavumenti 4
gwa 4
kaduukulu 4
kiseera 4
kkomera 4
kubanga 4
litegeeza 4
mpolampola 4
mukama 4
munaana 4
muntu 4
ngeri 4
ngo 4
nnyonnyola 4
nsi 4
ogu 4
okubikkulirwa 4
okukola 4
síyáhchál 4
tewaali 4
waggulu 4
ababiri 3
abakkiriza 3
abatono 3
adduka 3
ali 3
alyoka 3
amateeka 3
ana 3
asatu 3
awatali 3
ayagala 3
ayogera 3
babáb 3
bakkiriza 3
balyoka 3
bantu 3
banywanyi 3
bbiri 3
biseera 3
buyinike 3
ddaala 3
ebibala 3
ebiseera 3
ebyaliwo 3
ekikangabwa 3
ekitalo 3
ekitiibwa 3
ekiwandiiko 3
emu 3
ennaku 3
ensonga 3
entiisa 3
eryo 3
kabona 3
kale 3
katikkiro 3
kibuga 3
kikumi 3
kumpi 3
kutuukiriza 3
lumu 3
luno 3
lwaki 3
lyonna 3
maka 3
muti 3
mwene 3
nate 3
nkomerero 3
nnaku 3
nnawaalubwa 3
nnyumba 3
núr 3
obukambwe 3
obulumi 3
obutemu 3
obuvumu 3
oku 3
okudduka 3
okufa 3
okugezaako 3
okuggyako 3
okukwatibwa 3
okulangirira 3
okusisinkana 3
okusoma 3
okutegeera 3
okutemula 3
okuwaayo 3
okuyigganyizibwa 3
olunyiriri 3
olwali 3
omuliro 3
omwoyo 3
owa 3
quddús 3
shimirán 3
si 3
ttaka 3
tusaana 3
wamu 3
we 3
wo 3
wonna 3
abaaliwo 2
abaaweerezebwa 2
ababbi 2
abakazi 2
abakulu 2
abalabe 2
abalala 2
abasibe 2
abatemu 2
abayiisiramu 2
abazira 2
abeetaba 2
abikkula 2
abiri 2
aga 2
agaana 2
agamba 2
akabi 2
akabinja 2
akyusa 2
alaba 2
alina 2
amadaala 2
amakoola 2
amannya 2
amanyi 2
amapya 2
asinga 2
austria 2
avuga 2
awamu 2
ayolekera 2
baagenda 2
baayo 2
babábi 2
bali 2
bangi 2
batya 2
beera 2
beewuunya 2
beeyongera 2
benkanya 2
bifo 2
bigendererwa 2
biki 2
bintu 2
bisobole 2
bulago 2
bulamu 2
buno 2
bwegutyo 2
bwennyini 2
bwenyi 2
byagwo 2
byali 2
byawandiikibwa 2
byayita 2
caayi 2
ddaladdala 2
ebbugumu 2
ebibuuzo 2
ebikumi 2
ebimuli 2
ebipya 2
ebituli 2
ebyaddirira 2
ebyayita 2
eddaala 2
eddoboozi 2
ekibinja 2
ekifaananyi 2
ekigendererwa 2
ekikulu 2
ekiri 2
ekiro 2
ekisa 2
ekiseera 2
ekivundu 2
ekkubo 2
emboozi 2
emibiri 2
emikono 2
emyaka 2
enjegere 2
enjigiriza 2
enkomerero 2
enkumi 2
ennono 2
ennyiriri 2
entambi 2
entandikwa 2
erinnya 2
essuubi 2
ewa 2
eyalinnya 2
eyasuubizibwa 2
ezikwata 2
ffe 2
geesulise 2
ggulu 2
guno 2
gwange 2
gwonna 2
gyabwe 2
july 2
kakaaya 2
ke 2
kitundu 2
kkiriza 2
kkubo 2
kkumi 2
kugenda 2
kugumira 2
kukola 2
kukulaakulana 2
kuno 2
kwabwe 2
kwaffe 2
kwali 2
kweyongera 2
kwo 2
kyakolebwa 2
ludda 2
lujjudde 2
lukuubo 2
lwabwe 2
lwali 2
lwatuuzibwa 2
lwayimbanga 2
mazima 2
mazzi 2
mbaawo 2
mitima 2
mpuku 2
mukazi 2
mukwano 2
munda 2
mwalimu 2
mwezi 2
ngoberera 2
njegere 2
nkuubo 2
nnaggomola 2
nnamulondo 2
nsonga 2
nze 2
nzikiriza 2
obufuzi 2
obukuumi 2
obulabe 2
obunakuwavu 2
obutabanguko 2
obutuufu 2
obuweereza 2
obuzira 2
obwali 2
ogwali 2
okudda 2
okugenda 2
okugoberera 2
okukoowoola 2
okukwata 2
okukyusibwa 2
okulungi 2
okulya 2
okumala 2
okunywa 2
okusaba 2
okusseekimu 2
okuttibwa 2
okutwalira 2
okuviira 2
okuwa 2
okwegeza 2
okwekweka 2
okwetooloola 2
oli 2
olukuubo 2
olukwe 2
olulala 2
olumu 2
olwaddirira 2
omubiri 2
omujulizi 2
omukadde 2
omukazi 2
omukungu 2
omulyango 2
omumbowa 2
omupya 2
omutima 2
omuvubuka 2
osobole 2
sháh 2
ssanyu 2
ssemayanja 2
tasobola 2
tebaalina 2
tewali 2
tákur 2
wabula 2
wala 2
wammanga 2
yaabwe 2
yafuna 2
yagaana 2
yakwatibwa 2
yasalawo 2
yeesowolayo 2
yennyini 2
zonna 2
