mu 961
num 859
bayibuli 409
ne 283
nga 238
nti 229
ku 205
era 203
e 166
abantu 142
na 140
ebya 128
ekya 118
ekyo 104
bya 101
ebyawandiikibwa 101
ya 94
edda 93
ebiwandiiko 88
ebyo 87
bwe 86
kkumi 85
kya 85
nnyo 80
yali 78
baali 74
lukumi 71
emu 67
ebiri 66
katonda 65
no 61
eyo 57
za 57
gye 56
ba 55
ebitabo 55
emizingo 54
nge 54
naye 53
enkyusa 52
oba 51
musanvu 50
omu 48
wa 48
bye 47
abiri 46
emyaka 46
kye 46
okuba 45
ebigambo 44
kyali 43
ate 42
ddala 42
ekiwandiiko 41
ssatu 41
gwa 39
ye 39
ennyo 37
nineeve 37
bbiri 36
ttaano 36
abayudaaya 35
eya 35
lwaki 35
aba 34
ayitibwa 34
mukaaga 34
enjiri 33
kiseera 33
kyasa 33
lefèvre 33
oluvannyuma 33
omuzingo 33
ana 32
bedell 32
biwandiiko 32
ebitoogo 32
wadde 32
abo 31
awo 31
bwasuli 31
muzingo 31
abaali 30
buli 30
ekitabo 30
lya 30
nnya 30
okusoma 30
okuvvuunula 30
gya 29
asatu 28
bangi 28
byawandiikibwa 28
ebirala 28
engeri 28
lulimi 28
lwa 28
we 28
yokaana 28
ekyasa 27
gu 27
munaana 27
obubaka 27
oluyonaani 27
yagamba 27
bingi 26
egya 26
empya 26
endagaano 26
ekiseera 25
kabaka 25
okutegeera 25
abalala 24
byali 24
ga 24
lwe 24
sipeyini 24
amaliba 23
bo 23
ebintu 23
ekkereziya 23
olwebbulaniya 23
bulijjo 22
okubiri 22
t 22
bina 21
bitaano 21
ekigambo 21
ensobi 21
eyali 21
mwaka 21
eza 20
kikumi 20
kyokka 20
lulattini 20
mwenda 20
ngo 20
nnimi 20
obukadde 20
obuli 20
waaliwo 20
abakristaayo 19
enfu 19
ennyanja 19
kwe 19
nsi 19
ogu 19
ogwo 19
okumpi 19
bannaddiini 18
ebimu 18
enjigiriza 18
ezo 18
ki 18
kibuga 18
kitabo 18
okusobola 18
olwa 18
tewali 18
tutaano 18
wakati 18
abamu 17
bisatu 17
kityo 17
leero 17
mangu 17
singa 17
waliwo 17
baakozesanga 16
byonna 16
eno 16
eri 16
omukaaga 16
amateeka 15
baakoppolola 15
ebikolwa 15
ekyavaamu 15
gumu 15
kirabika 15
kiwandiiko 15
myaka 15
olulattini 15
omwaka 15
wamu 15
bitundu 14
ebyali 14
ekibuga 14
gamba 14
gwe 14
kifo 14
nkaaga 14
nkyusa 14
nsonga 14
obulungi 14
okuva 14
olusuuli 14
zabbuli 14
agamba 13
bagamba 13
bavvuunula 13
bikyaliwo 13
bimanyibwa 13
bitoogo 13
egamba 13
embala 13
erinnya 13
ezimu 13
ireland 13
isirayiri 13
kugamba 13
lwenda 13
okusaanawo 13
okuyamba 13
si 13
yavvuunula 13
yesu 13
yonna 13
abakoppolozi 12
abakugu 12
bantu 12
basobola 12
biraga 12
bwa 12
ebbugumu 12
ekitundu 12
endala 12
eziri 12
kyatuukira 12
kyawandiikibwa 12
lwabwe 12
mugaso 12
nnyingi 12
nsuwa 12
okumanya 12
okuwandiikibwa 12
olwekyo 12
zaali 12
abasajja 11
ali 11
amangu 11
baawandiikanga 11
bategeera 11
bitabo 11
ebikwata 11
ebitaano 11
ebyazuulibwa 11
ein 11
enkadde 11
ennimi 11
ensi 11
ensonga 11
gedi 11
lukaaga 11
lup 11
mingi 11
misiri 11
obungi 11
olulimi 11
olwayirisi 11
omunaala 11
william 11
zaabwe 11
abavvuunuzi 10
abeekenneenya 10
baagala 10
bibiri 10
bubiri 10
ebisooka 10
emirundi 10
enzikiriza 10
kenda 10
kigambo 10
kino 10
kirala 10
kitegeeza 10
kitundu 10
lufalansa 10
matongo 10
mutwalo 10
nabwo 10
nkumi 10
obunene 10
okukakasa 10
okuwandiika 10
versi 10
wayiseewo 10
yawandiika 10
ze 10
abaagikoppolola 9
bukadde 9
bulungi 9
butuufu 9
buzibu 9
bwali 9
ebitukuvu 9
emaze 9
ezisinga 9
james 9
jerome 9
kati 9
kitya 9
lunaana 9
makko 9
mayinja 9
obwakabaka 9
obwaliwo 9
oggyeeko 9
okubunyisibwa 9
okutaano 9
omuwandiisi 9
vulgate 9
yawona 9
amaanyi 8
amawulire 8
amazima 8
avvuunudde 8
awali 8
ayagala 8
baaterekanga 8
bikumi 8
biwangadde 8
busatu 8
ebifaananyi 8
ebingi 8
ebirimu 8
ebisingayo 8
ebiwuka 8
ebyasa 8
eddiini 8
egyazuulibwa 8
ekingi 8
ekintu 8
ekitangaala 8
ekitasoboka 8
ekyali 8
emabega 8
eringi 8
eyaliwo 8
gusobola 8
kiba 8
kibiina 8
kopi 8
kyalimu 8
lukka 8
makuŋŋaaniro 8
matayo 8
mwo 8
njiri 8
obukwata 8
okumala 8
olugosiki 8
olungereza 8
omulimu 8
omusanvu 8
otwalidde 8
wabula 8
yafulumya 8
yakuwa 8
yalagira 8
abaakoppolola 7
abakulembeze 7
ago 7
awaali 7
baagamba 7
baagezaako 7
baazuula 7
be 7
bible 7
bino 7
bonna 7
bruce 7
bungereza 7
bwandibadde 7
byafaayo 7
byasaanawo 7
ebitiibwa 7
egisukka 7
ekkumi 7
ekyasooka 7
enkola 7
eryo 7
eyitibwa 7
gwali 7
kimu 7
kirimu 7
kukozesa 7
kuvvuunula 7
kyapa 7
lowooza 7
luyonaani 7
mwonna 7
nnyiriri 7
nsanvu 7
obugirimu 7
ogwali 7
okulaba 7
okusinga 7
okusinziira 7
okutuuka 7
okuwangulwa 7
omukuumi—ogu 7
syriac 7
timoseewo 7
url 7
yakola 7
yavvuunulwa 7
yayagala 7
abamanyi 6
abanoonyereza 6
abavisigoosi 6
agali 6
ati 6
avvuunula 6
bakabaka 6
bakoppolola 6
bakugu 6
bbanga 6
beatty 6
bifo 6
bituufu 6
boogera 6
byalaga 6
chester 6
dda 6
ddiini 6
ebitundu 6
egiyise 6
egyo 6
ekikulu 6
ekiyitibwa 6
ekyawandiikibwa 6
emanyiddwa 6
emirembe 6
ennyiriri 6
erimu 6
eyitibwaarianism 6
ezaali 6
ge 6
inci 6
ka 6
kigo 6
kiki 6
kiraga 6
kiri 6
kiyinza 6
kumpi 6
kwongera 6
kyonooneddwa 6
laba 6
lumu 6
munyage 6
mwe 6
myuziyamu 6
nnabbi 6
obunnabbi 6
okufuna 6
okukola 6
okukoppolola 6
okulemesa 6
okutandika 6
okutuukira 6
okuvvuunulwa 6
okuyiga 6
okwekenneenya 6
olwo 6
omulala 6
omwekenneenya 6
oyo 6
paris 6
tekisoboka 6
tulina 6
yaabwe 6
yalina 6
yatandika 6
yayamba 6
zeero 6
abakkolinso 5
abamasoreti 5
abaruumi 5
abasinga 5
abawandiisi 5
agnes 5
akimanyi 5
amanyi 5
baasinga 5
bakakensa 5
beegendereza 5
bisobola 5
bisopu 5
bwino 5
byakozesebwamu 5
byokulabirako 5
dublin 5
eba 5
ebigendererwa 5
ebiriko 5
ebyakozesebwanga 5
ebyasooka 5
ekifo 5
ekikatuliki 5
ekikuba 5
ekikyasinze 5
ekiri 5
ekiyitibwathe 5
ekyokulabirako 5
ekyuma 5
empandiika 5
ennukuta 5
eriri 5
evvuunuddwa 5
ewala 5
ezaalimu 5
ezavvuunulwa 5
henry 5
john 5
kirina 5
kizze 5
kusoma 5
kyaviirako 5
lungereza 5
lwayirisi 5
maliba 5
metzger 5
mukutu 5
muwendo 5
ogwa 5
okukiraba 5
okukuuma 5
okutuusa 5
okuwandiikako 5
okuyigganyizibwa 5
okwongera 5
omukatuliki 5
omungereza 5
omuntu 5
omuwendo 5
roberts 5
tebwakyusibwa 5
tterekero 5
univ/art 5
univ_sqr_xl 5
yafuba 5
yafuuka 5
yakubibwa 5
zonna 5
abaasooka 4
abalalaweereza 4
abamasoleti 4
abasamaliya 4
abasatu 4
abasomi 4
abayigirizwa 4
abayisirayiri 4
aleppo 4
amakulu 4
amalungi 4
amerika 4
ataano 4
awamu 4
awannyogovu 4
baagumira 4
baakizuula 4
baakola 4
baawakanya 4
baba 4
babiri 4
bakiyita 4
bakozesa 4
bamanyi 4
bannabyafaayo 4
batya 4
bayibulilaba 4
bazuula 4
beeyongera 4
bigambo 4
biggwaamu 4
bimanyibwaluganda 4
bireme 4
birya 4
bisinga 4
bityo 4
bivunda 4
biyulika 4
bufalansa 4
bufirosoofo 4
bukya 4
bulabe 4
bwabwe 4
byakozesebwanga 4
byamala 4
byazuulibwa 4
codexeyawandiikibwa 4
comfort 4
dani 4
date 4
ebbanga 4
ebibiddirira 4
ebibiri 4
ebigamba 4
ebina 4
ebitundutundu 4
ebituufu 4
egimu 4
egyaddawo 4
egyasangibwa 4
egyawandiikibwa 4
ekimu 4
ekinnyogovu 4
ekirimu 4
ekivuddemu 4
ekiyitibwadiatessaron 4
ekyakoppololwa 4
ekyamateeka 4
el 4
emingi 4
emmese 4
enkuyege 4
ennyumba 4
ensolo 4
eriyitibwa 4
esangibwa 4
esobola 4
esooka 4
etegeerekeka 4
eyeekenneenya 4
ezaakolebwa 4
ezaasinga 4
gaabwe 4
gaali 4
galagira 4
gerizimu 4
giba 4
gil 4
gimaze 4
giragajjalirwa 4
giri 4
giteekebwa 4
gusaanawo 4
guterekebwa 4
guziikibwa 4
guzuuliddwa 4
gwayo 4
gyali 4
gyateekebwa 4
gyo 4
gyonooneka 4
jerusalem 4
jjuuni 4
kabuga 4
kasasiro 4
kisobose 4
kituufu 4
kiwanvu 4
kiyitibwa 4
kkereziya 4
kubanga 4
kutegeera 4
kwonooneka 4
kyabaawo 4
kyabanga 4
kyafuuka 4
kyagiviirako 4
kyalabika 4
kyangu 4
kyenda 4
langi 4
lewis 4
library 4
ludda 4
lupapula 4
lusuuli 4
luther 4
lwali 4
lwebbulaniya 4
maanyi 4
makulu 4
martin 4
masedoniya 4
mbeera 4
migumu 4
mitono 4
mizingo 4
mpuku 4
mpukuphilip 4
muqumran 4
mwalimu 4
mwokka 4
nabo 4
naddala 4
nagyo 4
nnyanjula 4
nnyumba 4
nsobi 4
oboolyawo 4
obufuzi 4
obuyinza 4
ogukoleddwa 4
oguli 4
ogusingayo 4
okubikuuma 4
okugamba 4
okuggya 4
okukozesa 4
okukyusa 4
okuliibwa 4
okuna 4
okusaba 4
okutonaatona 4
okuviirako 4
okuvunda 4
okuwumba 4
okuyigiriza 4
okwogera 4
okwogerwa 4
okwonooneka 4
oluyitibwathe 4
omukuumibayibuli 4
omuli 4
on 4
owa 4
oyinza 4
parkinson 4
peshittaya 4
quirke 4
richard 4
sorbonne 4
ssente 4
stephen 4
tebasobola 4
tebikyaliwo 4
tebuliiwo 4
tebyakyuka 4
tegunnazuulwa 4
teyavundaabawandiisi 4
tezaakyusa 4
tezaayamba 4
ttaka 4
tulabe 4
tusobola 4
w 4
waali 4
yakiraba 4
yakizuula 4
yalaba 4
yalatin 4
yamaliriza 4
yawa 4
yenna 4
yokka 4
yunivasite 4
zohar 4
abaabanga 3
abaawulira 3
abababulooni 3
abajeemedde 3
abakungu 3
abaleevi 3
abameedi 3
abateeberezebwa 3
abawakanya 3
abayiikuula 3
abayizi 3
abayonaani 3
abeekenneenyezza 3
aboogera 3
agambe 3
agisoma 3
ajja 3
akali 3
akasanduuko 3
aligolola 3
alikifuula 3
amanene 3
amaterekero 3
amaze 3
anaakulaba 3
arabic 3
archa 3
archive 3
armenian 3
ashurbanipal 3
asuubira 3
austen 3
awakanya 3
awera 3
baabwe 3
baagattamu 3
baageraageranya 3
baagisaanyaawo 3
baaguzuula 3
baakozesa 3
baalina 3
baamukozesa 3
baanoonya 3
baanyiiga 3
baasalawo 3
baasanga 3
baatwalibwanga 3
baavumirira 3
baawamba 3
babuulira 3
bagiyuza 3
bagyokya 3
bajja 3
bakakasizza 3
bakuŋŋaanya 3
bakyerabirira 3
bali 3
balowooza 3
bannabyabufuzi 3
banoonye 3
basobole 3
batayagala 3
batta 3
bawakanya 3
bayiikuula 3
bayinza 3
bayudaaya 3
beesigwa 3
biblical 3
bigulimu 3
bikakasa 3
bintu 3
birabika 3
bombi 3
bugirimaani 3
bujja 3
bukiikakkono 3
bulaaya 3
bulamu 3
busingayo 3
butandikira 3
butuukira 3
buzingiramu 3
bwasaanawo 3
bwawandiikibwa 3
byaliwo 3
byokebwa 3
coptic 3
dan 3
ddungu 3
ebigulimu 3
ebijjukizo 3
ebikontana 3
ebikwatagana 3
ebimuli 3
ebinene 3
ebitasobola 3
ebugwanjuba 3
ebunyisibwa 3
ebuvanjuba 3
ebyafaayo 3
ebyayolebwa 3
eddungu 3
egyali 3
ekigendererwa 3
ekikristaayo 3
ekiragiro 3
ekirala 3
ekisingayo 3
ekitoogo 3
ekiyitibwasinaitic 3
ekkuŋŋaaniro 3
ekozesebwa 3
ekyaliwo 3
ekyalo 3
ekyatuuka 3
ekyowadde 3
ekyusizza 3
embiri 3
enkyukakyuka 3
ennimiro 3
epifanesi 3
ereetedde 3
eryayokebwa 3
erye 3
esingayo 3
etaano 3
ethi 3
eti 3
ettaano 3
ettaka 3
etterekero 3
ety 3
etz 3
eyandisangiddwamu 3
eyayagala 3
eyitibwalatin 3
eyitibwapeshitta 3
eyitibwaulfilase 3
ezirabika 3
ezisooka 3
ffeeza 3
francis 3
ggulu 3
gisaanyizibwewo 3
gra 3
gwasiriira 3
gwatuyamba 3
gwokka 3
gyatuukira 3
gyawandiikibwa 3
gyazuulibwa 3
gyonna 3
heinrich 3
i 3
intaneeti 3
iran 3
jpg 3
kennyini 3
kibaddewoko 3
kifuuse 3
kigamba 3
kigambibwa 3
kikakasa 3
kikalu 3
kirifuuka 3
kirimaanyi 3
kirisoboka 3
kisenge 3
kisigadde 3
kitongole 3
kizikirizibwa 3
kuguzingulula 3
kukudduka 3
kunoonyereza 3
kupulo 3
kutuukirira 3
kuwangulwa 3
kuzikirizibwa 3
kyabuutikirwa 3
kyagenda 3
kyaggwaamu 3
kyaggweerako 3
kyasigala 3
kyennyini 3
kyerabirwa 3
kyereere 3
kyo 3
kyogerwako 3
kyonna 3
layard 3
lirimu 3
liwandiikiddwa 3
lugosiki 3
mbi 3
mirundi 3
mulembe 3
munnabyafaayo 3
muokuva 3
nakkumu 3
njigiriza 3
nnukuta 3
ntono 3
ntuufu 3
obanga 3
obubi 3
obugagga 3
obugazi 3
obulamu 3
obuliwo 3
obusingayo 3
obwa 3
okuddamu 3
okufa 3
okufaananako 3
okuggyako 3
okukolebwa 3
okukozesebwa 3
okukyuka 3
okusaanyaawo 3
okusaanyizibwawo 3
okusatu 3
okusinza 3
okutukakasa 3
okutuukirizibwa 3
okuwakanya 3
okuwaliriza 3
okuyiikuula 3
okuzibunyisa 3
okuzivvuunula 3
okwagala 3
ology 3
olubalama 3
olupya 3
oluvvannyuma 3
oluyitibwa 3
omukono 3
omutume 3
omuvvuunuzi 3
oneza 3
online 3
opic 3
p 3
peshitta 3
reccared 3
slavonic 3
soci 3
st 3
strasbourg 3
tatian 3
tebabeera 3
tebakkiririza 3
tebiri 3
tekinologiya 3
tulabye 3
twetaaga 3
tyndale 3
weereza 3
yabeerera 3
yafuna 3
yaluŋŋamya 3
yasooka 3
yasookera 3
yateekebwa 3
yattibwa 3
yayiggannya 3
yayisa 3
yeeyita 3
yeeyongera 3
yerusaalemi 3
yona 3
zaawerebwa 3
zaggyamu 3
zef 3
zeffaniya 3
zino 3
zirimu 3
zookebwa 3
zzaabu 3
a 2
abaabiwandiika 2
abaagala 2
ababuulizi 2
abakanye 2
abakazi 2
abakkolosaayi 2
abaliwo 2
abalongo 2
abangereza 2
abantuabaavu 2
abapolotesitanti 2
abasaba 2
abasomesa 2
abasooka 2
abassessalonika 2
abatume 2
abaweereza 2
abeekenneenyanga 2
abiweereza 2
aga 2
agakwata 2
agamu 2
agenda 2
agusito 2
ajje 2
akalombolombo 2
akaseera 2
akayitibwa 2
alabye 2
alaga 2
amadiini 2
amayinja 2
amugamba 2
anchor 2
asibibwa 2
atategeera 2
atereezezza 2
awagira 2
awalina 2
ayambamu 2
ayinza 2
ayogera 2
azivvuunudde 2
baabalanga 2
baabanga 2
baabiwandiikira 2
baabuliranga 2
baabyongera 2
baafuna 2
baagattanga 2
baagendanga 2
baagukola 2
baakeberanga 2
baakitwalanga 2
baakiwandiikanga 2
baakoppololanga 2
baalangirira 2
baamuyita 2
baasanganga 2
baasanyuka 2
baasomanga 2
baatandika 2
baatwalangamu 2
baawulira 2
baayambibwako 2
baayongeramu 2
baazimba 2
babanga 2
babitunga 2
babizza 2
babuulizi 2
baddiranga 2
bafune 2
bafunebayibuli 2
bagategeera 2
bagenze 2
bagoberera 2
bakkiriza 2
bakkirizanga 2
bakkiriziganya 2
bakola 2
bakoze 2
bakuusa 2
balagira 2
balekere 2
bamuwakanya 2
banaayigiriza 2
bandibadde 2
banditegedde 2
bannanfuusi 2
bano 2
banoonyereze 2
basanga 2
basatu 2
basigale 2
basome 2
bassaawo 2
bateebereza 2
batono 2
bavvuunudde 2
bawandiika 2
bayibuliabamu 2
bayibulimu 2
bayibuliyokka 2
bayigiriza 2
bayita 2
bbeeyi 2
beekebejja 2
beekenneenya 2
beekenneenyanga 2
beesunga 2
beetaaga 2
beewuunya 2
besirekemu 2
biba 2
bibleerimu 2
bifaanana 2
bifaananyi 2
biggiddwamu 2
bika 2
biki 2
bikozesebwa 2
binoensonga 2
biri 2
bituyambye 2
bivvuunuddwa 2
biwagira 2
biwagire 2
biyitibwamasoretic 2
biyitibwavisigothic 2
bongedde 2
bubaka 2
bubi 2
bugenderevu 2
bukatuliki 2
bukwatagane 2
butale 2
buto 2
buvuddeko 2
buyambi 2
buzibuwaza 2
bwakoppololwa 2
bwayo 2
bwongerwa 2
byabanga 2
byadiatessaronebizuuliddwa 2
byagattibwa 2
byakoppololwa 2
byakwata 2
byalimu 2
byasomebwa 2
byavvuunulwa 2
byokebwe 2
byongeddwa 2
byonoonye 2
catherine 2
charles 2
college 2
ddi 2
di 2
dicti 2
ebbali 2
ebe 2
ebiginnyonnyola 2
ebikirimu 2
ebikkirizibwa 2
ebimaze 2
ebisingawo 2
ebisinzibwa 2
ebiyitibwa 2
ebulayo 2
ebyakolebwa 2
ebyakolebwanga 2
ebyasookera 2
ebyava 2
ebyavumbulwa 2
ebyawandiikibwalefèvre 2
ebyongerezeddwako 2
eddimu 2
efuuka 2
egisinga 2
egiwera 2
egizuuliddwa 2
egula 2
egyaddirira 2
ejjinja 2
ekakasiza 2
ekibiina 2
ekireeta 2
ekiriko 2
ekisangibwa 2
ekisooka 2
ekitegeeza 2
ekituufu 2
ekiyitibwarylandskiraga 2
ekiyitibwarylandskya 2
ekiyitibwarylandsmu 2
ekizibu 2
ekkirizibwa 2
ekoleddwa 2
ekyakubibwa 2
ekyandireeseewo 2
ekyazuulibwa 2
ekyoto 2
encyclopediakigamba 2
endowooza 2
enfuna 2
enjawulo 2
enkulu 2
enkyamu 2
ennaku 2
ennamba 2
ennyingi 2
enoebiwandiiko 2
entongole 2
entono 2
erangirirwe 2
eribatuusa 2
erina 2
eririko 2
erya 2
essaala 2
essanyu 2
essatu 2
essomero 2
etuumibwalatin 2
etuyamba 2
eyafulumizibwa 2
eyakozesebwanga 2
eyalimu 2
eyavvuunulwa 2
eyayongera 2
eyitibwabedells 2
eyitibwaleón 2
eyitibwaseptuagint 2
eyitibwasyriac 2
ezaabangamu 2
ezaakozesebwa 2
ezaaliwo 2
ezaasooka 2
ezaava 2
ezirimu 2
ezitowa 2
eziviira 2
f 2
frederic 2
galiko 2
gange 2
gi 2
gituyamba 2
giyambye 2
goshengottstein 2
greek 2
green 2
gutenberg 2
gyokka 2
hispana 2
howard 2
internati 2
isidoro 2
jacques 2
johannes 2
jpgw 2
katono 2
kenyon 2
kibayambye 2
kibeerawo 2
kifuuka 2
kilmore 2
kinaana 2
kinene 2
kinnoomu 2
kiriko 2
kiro 2
kiruubirirwa 2
kisingayo 2
kisobozesa 2
kitabofivefold 2
kitaffe 2
kiteekwa 2
kitono 2
kituuse 2
kkubo 2
kkuŋŋaaniro 2
kristo 2
kugisaanyaawo 2
kujeemera 2
kukyuka 2
kulaba 2
kumakko 2
kumanya 2
kumulemesa 2
kusangibwa 2
kutuyamba 2
kuvunaanibwa 2
kuwandiika 2
kuyigiriza 2
kuzuula 2
kwaliko 2
kwekenneenya 2
kyaiberia 2
kyakolebwa 2
kyakolebwamu 2
kyamuleetera 2
kyannyamba 2
kyasobozesa 2
kyatandikira 2
kyatwalanga 2
kyawandiikibwako 2
kyetaagisa 2
kyewuunyisa 2
kyeyongera 2
kyondo 2
latin 2
latina 2
león 2
liriko 2
luba 2
lujjudde 2
lukaddiwa 2
lukyayogerwa 2
lulamba 2
lulattiniwadde 2
lunaku 2
lunyiriri 2
lusinga 2
lusozi 2
luvannyuma 2
lwaffe 2
lwokka 2
maaso 2
maka 2
makkati 2
masiya 2
meaux 2
mesopotamiya 2
miko 2
moshe 2
mukama 2
mukwano 2
mukyasa 2
mulimu 2
munaazimba 2
munnaddiini 2
muno 2
mutima 2
mutonzi 2
mwekenneenya 2
myezi 2
nabyo 2
nea 2
necodex 2
ngacodexso 2
nguudo 2
njuyi 2
nkomerero 2
nnaggomola 2
nnamaddala 2
nnamba 2
ntandikwa 2
nyangu 2
nze 2
nzijuvu 2
obufirosoofo 2
obujulizi 2
obukatuliki 2
obukristaayo 2
obulimba 2
obutafaananako 2
obutaggwaawo 2
obutakkiriza 2
obuvunaanyizibwa 2
obuwanvu 2
obwali 2
odati 2
ogigeraageranya 2
okubaamu 2
okubikkulirwa 2
okubuna 2
okubunyisa 2
okubutegeera 2
okubuulira 2
okubuzaabuzibwa 2
okugatta 2
okugeraageranya 2
okuggyamu 2
okugifuna 2
okugigula 2
okugonzaamu 2
okuguzinga 2
okuguzingulula 2
okukolacodex 2
okukubibwa 2
okukuyamba 2
okumuyambako 2
okusinzizaamu 2
okusobozesa 2
okusookera 2
okutereeza 2
okuvvuunulalefèvre 2
okuwandiikibwamu 2
okuzzibwa 2
okwegendereza 2
okweyongerayo 2
okwo 2
olivétan 2
olufalansa 2
olugendo 2
olukalala 2
oluli 2
olulyonaani 2
olunaku 2
oluyitale 2
oluzaaliranwa 2
omufalansa 2
omugaso 2
omukugu 2
omukulu 2
omusango 2
omusuuli 2
omutukuvu 2
omutwe 2
omwesimbu 2
omwoyo 2
onal 2
onarykigamba 2
onbangi 2
osobola 2
otadde 2
ovanni 2
peetero 2
pentateuch 2
peteero 2
psalter 2
pulintaweereza 2
ripoll 2
samaritan 2
san 2
septuagint 2
septuagintera 2
septuagintnge 2
septuagintye 2
sinaiticusnecodex 2
sindika 2
sir 2
sitaani 2
slates 2
smith 2
ssande 2
standard 2
stapulensis 2
switzerland 2
tannatandika 2
tebaagalabantu 2
tebaagalira 2
tebaasobola 2
tebakyayagalaseptuagint 2
tebannafuna 2
tebeefiirayo 2
tebikozesebwa 2
tebitwalibwa 2
tebyaleetera 2
tebyali 2
tegaabanga 2
tegikoma 2
tekyewuunyisa 2
tennatandika 2
terukyategeerekeka 2
tevvuunuddwa 2
text 2
teyabanyega 2
teyakkiriza 2
teyavunda 2
teyayingira 2
trinity 2
tugirina 2
tuli 2
tusoma 2
twasanyuka 2
twasoma 2
university 2
vatican 2
vaticanus 2
vulgateate 2
vulgatenga 2
waabangawo 2
waffe 2
wajjawo 2
wiiki 2
wycliffe 2
yabavumirira 2
yaddukira 2
yafunayo 2
yageraageranyiza 2
yaggibwa 2
yakikola 2
yakikuba 2
yakizibuwaza 2
yakozesanga 2
yalekera 2
yalimu 2
yalwanirira 2
yamala 2
yamanya 2
yannyonnyola 2
yasalawo 2
yaseptuaginteya 2
yasinga 2
yataputangamu 2
yatuumibwagreek 2
yawandiikira 2
yayanika 2
yayiiya 2
yazitereeza 2
yazuula 2
yeekaalu 2
yeekenneenya 2
yeemalira 2
yeesiga 2
yeesigamiziddwa 2
yeetaagisa 2
yeeyambisa 2
yekka 2
yennyonnyoleko 2
yuda 2
zaalimu 2
zaalowoozebwako 2
zaayongerwamu 2
zeeyongera 2
zeeyongeraabantu 2
zikwatagane 2
zisobole 2
zivvuunuddwa 2
ziweddewo 2
zombi 2
zoogerwa 2
