mu 438
ku 271
nga 259
n 239
nti 151
ne 145
e 102
ng 89
era 77
abantu 67
bwe 63
y 62
bw 57
wa 52
w 51
uganda 42
ate 40
agamba 37
gavumenti 36
we 34
eno 33
kino 33
naye 32
ye 32
okuva 31
ya 31
by 30
ono 30
poliisi 30
bano 29
ky 29
000 28
nnyo 28
b 27
emisota 27
minisita 27
olw 27
ttiimu 27
wabula 27
lw 26
buli 25
ab 24
gye 24
kubanga 24
okuli 24
aba 23
zino 23
guno 22
oba 22
okulaba 22
omuntu 22
ssente 22
z 22
za 22
abaana 21
kuba 21
kya 21
2 20
abamu 20
disitulikiti 20
ggwanga 20
gw 20
ssentebe 20
1 19
ba 19
eby 19
omusota 19
abadde 18
abazannyi 18
ez 18
gy 18
ensonga 17
kampala 17
obusagwa 17
wakiso 17
yagambye 17
eri 16
naddala 16
yategeezezza 16
abatuuze 15
baabwe 15
bino 15
emirimu 15
gya 15
kwe 15
lya 15
oluvannyuma 15
omu 15
be 14
bya 14
ebintu 14
enjawulo 14
kye 14
mwe 14
okukola 14
olympics 14
omugenzi 14
ze 14
bye 13
eggwanga 13
ey 13
kyokka 13
wakati 13
abeera 12
ebitundu 12
fc 12
g 12
gwe 12
lwa 12
masaka 12
owa 12
waliwo 12
10 11
bagenda 11
bulungi 11
emizannyo 11
gwa 11
kizimbe 11
lwe 11
ly 11
malwaliro 11
mbeera 11
minisitule 11
okufuna 11
okutuusa 11
olukiiko 11
town 11
abalala 10
abali 10
abasajja 10
agambye 10
babadde 10
bitundu 10
eggulo 10
ekkanisa 10
kiseera 10
lwanga 10
mizannyo 10
na 10
okusinziira 10
omuli 10
palamenti 10
sizoni 10
100 9
8 9
abavubuka 9
afrika 9
akakiiko 9
amazzi 9
ategeeza 9
ategeezezza 9
dr 9
ebijambiya 9
ebirala 9
ekyagudde 9
enswera 9
eya 9
k 9
ka 9
kabanda 9
kansala 9
kati 9
katikkiro 9
kyofatogabye 9
mayiga 9
mpaka 9
nsonga 9
omubaka 9
wano 9
zaabwe 9
abalimi 8
abasawo 8
abasinga 8
abasoba 8
ali 8
balina 8
bangi 8
bantu 8
bingi 8
bwa 8
centre 8
cheptegei 8
council 8
ebika 8
eddagala 8
ekitongole 8
ekya 8
ekyalo 8
emyaka 8
enguudo 8
ensimbi 8
gulina 8
health 8
kw 8
lino 8
lukiiko 8
mulimu 8
muntu 8
ncs 8
ngeri 8
nnamba 8
obujjanjabi 8
okuba 8
olwa 8
omukka 8
omulimu 8
ow 8
pulezidenti 8
rwanda 8
shaban 8
ssaako 8
ttaka 8
3 7
9 7
abakadde 7
abalwadde 7
allan 7
amasomero 7
bagamba 7
bali 7
bba 7
bonna 7
burkina 7
ddala 7
ebbanga 7
ebyuma 7
embeera 7
emu 7
endala 7
express 7
eza 7
faso 7
kawempe 7
kcca 7
kyalo 7
leero 7
maaso 7
mitwalo 7
moses 7
mpigi 7
muto 7
obutambi 7
ogw 7
okubeera 7
okumanya 7
okutuuka 7
oluusi 7
omupiira 7
saako 7
wamu 7
wansi 7
wiiki 7
5 6
6 6
ababaka 6
abakulu 6
agenda 6
amaanyi 6
amyuka 6
asaba 6
asabye 6
ayagala 6
bakansala 6
bakozesa 6
ebyenjigiriza 6
ekibuga 6
ekiro 6
ekiseera 6
ekitundu 6
eky 6
engeri 6
engule 6
ennyumba 6
erya 6
ettaka 6
ewedde 6
gino 6
iganga 6
kabuye 6
kano 6
kasangati 6
kasasiro 6
kiraabu 6
kitundu 6
league 6
luf 6
lye 6
mutendera 6
nabo 6
namata 6
nnyumba 6
obukadde 6
obulabe 6
obulamu 6
obwagazi 6
okunoonyereza 6
omukyala 6
omwana 6
omwezi 6
september 6
ssaawa 6
tusaba 6
waabwe 6
wadde 6
yaabwe 6
yo 6
yonna 6
20 5
2021 5
a 5
abasomesa 5
abazadde 5
agumizza 5
akulira 5
amalwaliro 5
amanyiddwa 5
andrew 5
baagala 5
babeera 5
banne 5
bulenga 5
bungi 5
burundi 5
butabika 5
byalo 5
champions 5
clerk 5
ddwaliro 5
ebikozesebwa 5
eggaali 5
egy 5
ekika 5
ekikomo 5
emidaali 5
emitwe 5
enviiri 5
ethiopia 5
eyali 5
ga 5
gayaza 5
ghetto 5
guba 5
gumu 5
hajjat 5
kibuga 5
kika 5
kitebe 5
kkomera 5
kyeyune 5
maka 5
makindye 5
mali 5
masomero 5
mateeka 5
misota 5
muhammad 5
munisipaali 5
mutabani 5
obuyambi 5
of 5
ofiisi 5
oguwedde 5
okumpi 5
okusala 5
okusinga 5
okwongera 5
olina 5
omuggalo 5
omulamuzi 5
onduparaka 5
patrick 5
ritah 5
ssegirinya 5
ssekamwa 5
unra 5
yasabye 5
yesu 5
yona 5
00 4
7 4
abaafiiriddwa 4
ababadde 4
abakozi 4
abakulembeze 4
abooluganda 4
africa 4
agambibwa 4
akatwala 4
akola 4
akwasa 4
amaato 4
amangu 4
amateeka 4
annyonnyola 4
awo 4
baali 4
baana 4
badminton 4
bafuna 4
bamaze 4
basobola 4
bavubuka 4
bazadde 4
bbiri 4
bifaananyi 4
budde 4
buno 4
bwabwe 4
bwangu 4
byabwe 4
caf 4
cameroon 4
charles 4
ddyo 4
ebibaluwa 4
ebiri 4
ebiseera 4
ebisinga 4
ebyobulamu 4
ekiteeso 4
eklesia 4
empaka 4
enanga 4
ennyo 4
ensi 4
essimu 4
ewa 4
eyo 4
ge 4
gyabwe 4
gymnastics 4
iii 4
jacob 4
japan 4
kakiiko 4
kalungu 4
kiddiridde 4
kiro 4
kisaawe 4
kumpi 4
kyonna 4
lwengo 4
maama 4
makerere 4
mita 4
mmande 4
mugerwa 4
mukono 4
mukyala 4
musanvu 4
mwaka 4
nakawooya 4
naluyima 4
namirembe 4
nke 4
nsimbi 4
nssf 4
nyumba 4
obuwala 4
ogwa 4
okubadde 4
okubajja 4
okugenda 4
okugula 4
okukwata 4
okumala 4
okusiba 4
okusomesa 4
olumu 4
olwo 4
omudaali 4
omukwano 4
omulala 4
omumyuka 4
omuriwe 4
omusajja 4
omutendesi 4
omutima 4
omuwandiisi 4
omwaka 4
opoka 4
oyinza 4
poloti 4
quarter 4
rdc 4
sewannyana 4
si 4
ssegirinnya 4
st 4
tebalina 4
ttimba 4
umeme 4
uoc 4
volleyball 4
wasswa 4
waya 4
yabadde 4
yategezezza 4
yawangudde 4
zonna 4
zooni 4
13 3
15 3
16 3
25 3
3-1 3
4 3
50 3
abaafudde 3
abakolera 3
abakugu 3
abakungu 3
abakyala 3
abalenzi 3
abategesi 3
abatendesi 3
abato 3
abayimbi 3
afuna 3
ak 3
akabaga 3
akacupa 3
akatambi 3
akutte 3
alaba 3
alina 3
aliro 3
amawanga 3
asisinkanye 3
asoose 3
asula 3
atandise 3
atwala 3
awaka 3
ayogera 3
babba 3
babwe 3
bakoma 3
balaajanidde 3
bamusigansimbi 3
bamusobyako 3
basajja 3
basatu 3
basiimye 3
basuubira 3
batandise 3
bbanga 3
bbo 3
betty 3
bifo 3
bijambiya 3
bintu 3
bisatu 3
biseera 3
bishop 3
bo 3
bogere 3
bright 3
bulamu 3
bulijjo 3
buwama 3
buyondo 3
bwansi 3
bwoba 3
cbe 3
covid 3
david 3
ddagala 3
east 3
ebibiina 3
ebifaananyi 3
ebifo 3
ebikwata 3
ebirime 3
ebituli 3
ebyensimbi 3
ebyokulya 3
ebyokwerinda 3
eddakiika 3
eddwaliro 3
effujjo 3
eggali 3
ejja 3
ekigendererwa 3
ekimu 3
ekintu 3
ekiyinza 3
ekizimbe 3
ekutte 3
emabega 3
embi 3
emiti 3
emitwalo 3
emmanuel 3
emyooga 3
enjala 3
enkola 3
ensambaggere 3
enteekateeka 3
erinnya 3
erivumula 3
essomero 3
etandise 3
etteeka 3
ex 3
eyabadde 3
eyawakati 3
eyongere 3
ezikola 3
fayinolo 3
foundation 3
geoffrey 3
ggombolola 3
godfrey 3
gubeera 3
gusinga 3
gwagala 3
gyokka 3
herbert 3
iv 3
john 3
kabon 3
kalema 3
kansanga 3
kasaija 3
katale 3
katende 3
kazo 3
kibinja 3
kibirige 3
kifo 3
kirungi 3
kisenyi 3
kisobozese 3
kitalya 3
kitongole 3
kiyingi 3
kkampani 3
kkono 3
kkooti 3
kubeera 3
kufuna 3
kukola 3
kuliko 3
kumulundi 3
kutya 3
kwa 3
kwogera 3
kyangu 3
lady 3
liigi 3
living 3
lukonge 3
lukwago 3
luno 3
lwokubiri 3
lwokutaano 3
masaba 3
matovu 3
mbi 3
meeya 3
mingi 3
minsa 3
mirimu 3
misango 3
mmita 3
mmotoka 3
mukazi 3
mukoddomi 3
mukolo 3
mulina 3
munne 3
museveni 3
mw 3
myaka 3
nakadama 3
namutebi 3
nantaba 3
nanziri 3
ndi 3
nigeria 3
nkajja 3
nkolera 3
nnyingi 3
north 3
nsada 3
nteekateeka 3
ntono 3
obeera 3
obudde 3
obulwadde 3
obuseegu 3
obusookerwako 3
obuyinza 3
obuzibu 3
obw 3
ogola 3
okubayamba 3
okufunako 3
okuggyako 3
okulambula 3
okulya 3
okunoonya 3
okusanga 3
okusimba 3
okusobola 3
okutambula 3
okutumbula 3
okuvaayo 3
okuweebwa 3
okuyiga 3
okuyingira 3
okuyita 3
okwabulira 3
okwakolebwa 3
okwemulugunya 3
okwenyigira 3
okwewala 3
omubeezi 3
omugagga 3
omukolo 3
omukono 3
omulundi 3
omusango 3
omusomo 3
omutwe 3
omuzannyo 3
omwogezi 3
oulanyah 3
pearls 3
public 3
queens 3
s 3
satifikeeti 3
school 3
semi 3
sente 3
sipiidi 3
sipiika 3
so 3
soul 3
ssaava 3
ssalambwa 3
ssali 3
ssegawa 3
ssejjemba 3
ssentongo 3
ssimu 3
stars 3
sudan 3
tulina 3
ura 3
victoria 3
vipers 3
wakiri 3
wala 3
wam 3
wange 3
wiini 3
wonna 3
yali 3
yokka 3
1000 2
10000 2
11 2
150 2
170 2
18 2
19 2
200 2
2017 2
2024 2
28 2
29 2
30 2
300 2
3000 2
350 2
40 2
500 2
5000 2
5430 2
90 2
abaakwatiddwa 2
abaalina 2
ababa 2
ababbi 2
ababiri 2
abafumbo 2
abafuna 2
abagambibwa 2
abagole 2
abakazi 2
abakola 2
abakristaayo 2
abalina 2
abalumwa 2
abanoonyereza 2
abaserikale 2
abasodokisi 2
abatawaanyizibwa 2
abatemu 2
abavuzi 2
abawala 2
abdu 2
abe 2
abeebyokwerinda 2
afa 2
afudde 2
aga 2
agasseeko 2
ago 2
ajja 2
aka 2
akabinja 2
akaboozi 2
akakutiya 2
akamu 2
akaveera 2
akawungeezi 2
akuba 2
akungubagidde 2
alaga 2
alikoba 2
alondoola 2
amaaso 2
amabwa 2
amagezi 2
amasannyalaze 2
amasanyalazze 2
amawulire 2
amayumba 2
anya 2
asanga 2
asinga 2
asinzidde 2
asobola 2
association 2
atalina 2
atambula 2
august 2
augustine 2
avuddeyo 2
awamu 2
awangula 2
awasangibwa 2
ayimbuddwa 2
ayinza 2
ayita 2
baabisudde 2
baagenze 2
baakufuna 2
baategeezezza 2
baayo 2
baazudde 2
baba 2
babiri 2
babuuliridde 2
baddamu 2
badduukiridde 2
bafiirwa 2
bafuba 2
bafune 2
bafunye 2
bagole 2
bajja 2
bajjo 2
bakadde 2
bakola 2
bakukkulumidde 2
bakulembeze 2
bakung 2
bakungu 2
balaba 2
balalaika 2
baleme 2
balimi 2
baliyirirwa 2
balondeddwa 2
baluku 2
balumwa 2
balwanira 2
bamanyi 2
bammemba 2
bamutenderezza 2
bandeegi 2
bankizo 2
bannabyamizannyo 2
banyonyodde 2
basaba 2
basabidwa 2
basanga 2
basazeewo 2
bataata 2
batambuze 2
batongozza 2
batwalibwa 2
baveeyo 2
bawaayo 2
bawanjagidde 2
bazannyi 2
bazze 2
bazzeeyo 2
beemulugunyirizza 2
beesunga 2
bijjambiya 2
bikozesebwa 2
biswa 2
bizinensi 2
bombi 2
bp 2
buganda 2
bugenyi 2
bukadde 2
bulabe 2
bulange-mmengo 2
bulungibwansi 2
bunkenke 2
bushenyi 2
butambi 2
butcherman 2
buwanguzi 2
bwabadde 2
bwanika 2
bwatyo 2
bweba 2
bwensi 2
byagyo 2
byamukama 2
byobulimi 2
cairo 2
ch 2
championship 2
chemutai 2
christopher 2
city 2
coffee 2
commonwealth 2
corona 2
corporation 2
covid-19 2
cranes 2
cricket 2
cup 2
ddene 2
ddigi 2
ddwaaliro 2
degeya 2
derrick 2
dokita 2
doozi 2
dorothy 2
doves 2
ebadde 2
ebasaba 2
ebbaluwa 2
ebbula 2
ebibaawo 2
ebifukirira 2
ebikolwa 2
ebimu 2
ebiragalalagala 2
ebiveera 2
ebizibu 2
ebyembi 2
ebyo 2
egenda 2
egwa 2
egya 2
egyabadde 2
ejjambiya 2
ekibanja 2
ekibiina 2
ekibinja 2
ekikulu 2
ekikulumye 2
ekimala 2
ekinnansi 2
ekiragiro 2
ekiretedde 2
ekisajja 2
ekisoboka 2
ekitiibwa 2
ekizibu 2
ekyabadde 2
ekyamuwalirizza 2
ekyo 2
ekyokulya 2
emikisa 2
emiriraano 2
emisango 2
emisinde 2
emisiri 2
emitima 2
emize 2
emmere 2
emmese 2
emmwaanyi 2
empapula 2
empeereza 2
empi 2
emukutte 2
emyezi 2
ena 2
enduulu 2
enfuna 2
eng 2
engoye 2
enkizo 2
ennungi 2
ensiko 2
ensisinkano 2
ensobi 2
entambula 2
enzaalwa 2
erijjanjaba 2
erimu 2
erina 2
esatu 2
essaawa 2
ettemankima 2
ettemu 2
eveeyo 2
eyalabikidde 2
eyisizza 2
ezaabadde 2
eziva 2
fa 2
ffamire 2
ffe 2
fiina 2
fred 2
fredrick 2
fuba 2
fufa 2
gano 2
gatuuka 2
george 2
geraldine 2
get 2
ggoolo 2
gibalumira 2
gibeera 2
gigenda 2
ginaakiikirira 2
ginoonya 2
giyinza 2
greater 2
gubadde 2
gukubozze 2
gukuluma 2
gukulumye 2
gukutademu 2
gutambulira 2
gutuuka 2
guyimusa 2
guyinza 2
gwange 2
gwetabiddwako 2
gwokka 2
harunah 2
high 2
hotel 2
jinja 2
jonah 2
joseph 2
joshua 2
junior 2
kabale 2
kakaire 2
kampeyini 2
kamu 2
kapere 2
kasese 2
kasozi 2
katabi 2
katambi 2
kaweefube 2
kayunga 2
kaz 2
kazaarwe 2
kenya 2
khc 2
ki 2
kibaawo 2
kibadde 2
kibira 2
kiconco 2
kigagga 2
kikolwa 2
kilo 2
kimbowa 2
kireese 2
kiteezi 2
kituntu 2
kiva 2
kiwalimu 2
kiyumba 2
kkampuni 2
kkanisa 2
kkansa 2
kkubo 2
kooti 2
kubajja 2
kugezesa 2
kukwetakkuluzaako 2
kulaba 2
kulonda 2
kulwana 2
kuno 2
kusangibwa 2
kutema 2
kutendekebwa 2
kutuula 2
kuyingira 2
kuzinga 2
kwabwe 2
kyabwe 2
kyazuulibwa 2
kyenkanyi 2
kyoffa 2
kyotera 2
lc 2
life 2
lions 2
lugogo 2
lutalo 2
luwalira 2
luwandula 2
luyooza 2
lwokuna 2
lyayo 2
maanyi 2
malende 2
maliri 2
malwadde 2
man 2
mangu 2
masengere 2
matia 2
mayambala 2
mazzi 2
mbarara 2
mbuga 2
meere 2
metropolitan 2
micheal 2
misiri 2
misolo 2
mmengo 2
morocco 2
mp 2
mpapula 2
mpolampola 2
mubajje 2
mubiru 2
mugalu 2
muggalo 2
mulamba 2
mumbeera 2
mumbere 2
mumpaka 2
munda 2
munene 2
musota 2
mutundwe 2
mutwe 2
mutyaba 2
mwalo 2
mwanje 2
nabadda 2
nagawa 2
nakiito 2
naluvule 2
nambooze 2
nankyama 2
nannyini 2
nassolo 2
nebicupacupa 2
newankubadde 2
ngule 2
nicholas 2
niger 2
nkola 2
nkomerero 2
nnabaana 2
nnaku 2
nnali 2
nnimiro 2
nnyina 2
nsalesale 2
nsambya 2
nsi 2
nsobodde 2
ntulume 2
nze 2
obubaka 2
obubonero 2
obulumbaganyi 2
obulungi 2
obumenyi 2
obungi 2
obusika 2
obusungu 2
obutabeera 2
obutafiibwako 2
obuveera 2
obuvune 2
obuwanguzi 2
obuwumbi 2
obwakabaka 2
obwenkanya 2
obwetaavu 2
obwo 2
obwongo 2
ochan 2
oguddako 2
okongo 2
okot 2
okubakunya 2
okubatwala 2
okubawemula 2
okubayunga 2
okudda 2
okuddamu 2
okuddukanya 2
okufa 2
okufuuka 2
okugaziya 2
okuggalawo 2
okugoba 2
okugulu 2
okukanika 2
okukiikirira 2
okukkakkana 2
okukolebwa 2
okukolera 2
okukozesa 2
okukunganya 2
okukwatibwa 2
okukyuka 2
okukyusa 2
okulifuna 2
okuliyirirwa 2
okulwanyisa 2
okumwebaza 2
okunywa 2
okusigala 2
okusiibula 2
okusiiga 2
okusiima 2
okusoma 2
okusoomoozebwa 2
okutabuka 2
okutandika 2
okuteeka 2
okutemaatema 2
okutereka 2
okutondawo 2
okutunda 2
okuvumula 2
okuwa 2
okuwagira 2
okuweereza 2
okuyamba 2
okuyigiriza 2
okuzannya 2
okuzimba 2
okuzinga 2
okwabadde 2
okwematiza 2
okwemazisa 2
okwerinda 2
okwesogga 2
okwetegekera 2
okwogera 2
okwolesa 2
oluggya 2
oluguudo 2
olunaku 2
olususu 2
omubiri 2
omuddo 2
omukazi 2
omukisa 2
omukugu 2
omukulu 2
omukwasi 2
omulabirizi 2
omungi 2
omusana 2
omusawo 2
omusulo 2
omutindo 2
omutuuze 2
omuwendo 2
omuzira 2
omuzungu 2
omwabadde 2
omwala 2
otucet 2
paul 2
peruth 2
pic 2
piki-piki 2
proline 2
puliida 2
pulojekiti 2
pulosesi 2
railway 2
railways 2
riham 2
robert 2
ronald 2
rukare 2
ruth 2
said 2
saluuni 2
samuel 2
sawuda 2
sentebe 2
shilla 2
silverbucks 2
singa 2
sitampu 2
snake 2
sooka 2
south 2
ssaabadinkoni 2
ssaabalabirizi 2
ssaabasumba 2
ssaluuni 2
ssekandi 2
ssekinoomu 2
ssempa 2
ssenyondo 2
ssewanyana 2
ssezaala 2
ssinga 2
ssomero 2
steven 2
taata 2
talina 2
tanzania 2
tegakyawona 2
tegulina 2
tewali 2
tugenda 2
tunisia 2
umar 2
ven 2
vihiga 2
wainright 2
wananchi 2
wegukulumye 2
william 2
women 2
yabyogeredde 2
yadde 2
yagenze 2
yakakasizza 2
yakasasiro 2
yakwatibwa 2
yaleese 2
yannyonnyodde 2
yasazeewo 2
yawangula 2
yayongeddeko 2
yazaalibwa 2
yeebazizza 2
yeegatta 2
yiga 2
zaabadde 2
zaabu 2
zibadde 2
ziri 2
zitera 2
zzaabu 2
