mu 1120
num 825
bayibuli 463
ne 248
nga 235
nti 230
ku 193
era 174
abantu 155
ekya 145
ekyo 124
e 116
ebya 112
ya 111
na 108
nnyo 99
bya 94
kya 93
ebyawandiikibwa 92
yali 86
lukumi 85
baali 82
ebyo 78
katonda 78
bwe 76
ebiwandiiko 73
omu 70
emu 68
ba 63
edda 63
kkumi 63
za 63
ebitabo 62
enkyusa 61
kye 61
ebiri 60
no 57
ebigambo 55
naye 55
ana 54
gye 53
nge 52
musanvu 51
ttaano 51
bye 50
ekiwandiiko 48
eyo 47
kyasa 45
ssatu 45
ddala 44
enjiri 44
okuvvuunula 44
wa 44
aba 43
abiri 43
kiseera 43
emyaka 41
kyali 41
wadde 40
bedell 38
ebirala 37
lefèvre 37
ye 37
bibiri 36
oba 36
oluvannyuma 36
bbiri 35
mukaaga 35
nineeve 35
asatu 34
ate 34
ayitibwa 34
gu 34
eza 33
okuba 33
yagamba 33
biwandiiko 32
eya 32
gwa 32
lulimi 32
okusoma 32
okutegeera 32
ekigambo 31
lwaki 31
oluyonaani 31
bubiri 30
ekitabo 30
yokaana 30
abaali 29
ekyasa 29
emizingo 29
abalala 28
bulijjo 28
gya 28
lukaaga 28
abayudaaya 27
bangi 27
buli 27
byawandiikibwa 27
ennyo 27
kibuga 27
lya 27
gumu 26
munaana 26
nnya 26
sipeyini 26
we 26
bitaano 25
ekkereziya 25
kyokka 25
lulattini 25
awo 24
eyali 24
okuva 24
bwasuli 23
ekiseera 23
endagaano 23
engeri 23
lwe 23
nnimi 23
obubaka 23
okubiri 23
omunaala 23
abamu 22
abo 22
leero 22
lwa 22
bo 21
ebitoogo 21
ebyali 21
kabaka 21
obuli 21
olusuuli 21
olwebbulaniya 21
byali 20
ebintu 20
empya 20
enjigiriza 20
eno 20
kakaaga 20
luwalabu 20
mutwalo 20
mwaka 20
ngo 20
tebaasobola 20
tewali 20
ireland 19
nnyingi 19
nsi 19
olulattini 19
omulimu 19
bingi 18
bisatu 18
bulungi 18
ensobi 18
ensonga 18
waliwo 18
bukadde 17
gamba 17
kitabo 17
kityo 17
kusaanyaawo 17
mwenda 17
olwa 17
t 17
bannaddiini 16
eri 16
eziri 16
kikumi 16
kyawandiikibwa 16
url 16
waaliwo 16
yavvuunula 16
ebikwata 15
ekkumi 15
ezo 15
obungi 15
okumanya 15
omuwendo 15
univ/art 15
univ_sqr_xl 15
yesu 15
zaali 15
ebyazuulibwa 14
ekintu 14
erinnya 14
lusipeyini 14
obulungi 14
okusobola 14
okuwandiikibwa 14
si 14
teyavunda 14
zabbuli 14
abavvuunuzi 13
bantu 13
bitundu 13
ebimu 13
ebyasa 13
egya 13
embala 13
ezimu 13
jpg 13
lwabwe 13
nkyusa 13
tutaano 13
wamu 13
william 13
yonna 13
abalalaweereza 12
amazima 12
baagala 12
bible 12
bitabo 12
bwa 12
egamba 12
ekitundu 12
endala 12
enkadde 12
kirabika 12
kiwandiiko 12
kwa 12
nsonga 12
obukadde 12
okuvvuunulwa 12
okuyamba 12
okuzikirizibwa 12
oluwalabu 12
olwayirisi 12
olwekyo 12
omwaka 12
wakati 12
zaabwe 12
ze 12
abakristaayo 11
basobola 11
bategeera 11
byonna 11
ekibuga 11
emaze 11
ensi 11
ga 11
kifo 11
lunaana 11
matayo 11
misiri 11
myaka 11
njiri 11
nkaaga 11
okukakasa 11
okutuuka 11
olulimi 11
omukaaga 11
yakola 11
abakugu 10
abakulembeze 10
abasajja 10
agamba 10
amaliba 10
bungereza 10
ebingi 10
ebitiibwa 10
ebyafaayo 10
ebyasooka 10
ekyokulabirako 10
ezavvuunulwa 10
ezisinga 10
ki 10
kigambo 10
kirala 10
lufalansa 10
makko 10
mitwalo 10
okulaba 10
okumala 10
okumpi 10
okutaano 10
omunaana 10
vulgate 10
wabula 10
yayamba 10
abeekenneenya 9
amateeka 9
baagezaako 9
baakoppolola 9
bagamba 9
bavvuunula 9
ebikolwa 9
ebikwatagana 9
eddiini 9
ekyavaamu 9
ekyazuulibwa 9
ennimi 9
gwe 9
john 9
kasasiro 9
kino 9
kyatuukira 9
obukwata 9
obunene 9
oggyeeko 9
okuwandiika 9
abaakoppolola 8
agali 8
agnes 8
ayagala 8
baagamba 8
bino 8
biraga 8
date 8
ebitaano 8
ebitukuvu 8
ekiyitibwa 8
eryo 8
eyitibwa 8
ezaali 8
kati 8
kiba 8
kibiina 8
kigo 8
kimu 8
kirimu 8
kitegeeza 8
kubanga 8
kyalimu 8
kyapa 8
lup 8
luyonaani 8
lwali 8
mugaso 8
okukuyamba 8
okusinga 8
okuyiga 8
okuyigiriza 8
okwongera 8
olungereza 8
omuwandiisi 8
omwekenneenya 8
tulina 8
versi 8
wayiseewo 8
weereza 8
yafulumya 8
yalaba 8
abakkolinso 7
abakoppolozi 7
ali 7
amaanyi 7
amadiini 7
avvuunudde 7
be 7
bigambo 7
bonna 7
bruce 7
busatu 7
bwali 7
ekiyitibwathe 7
ekyawandiikibwa 7
emirundi 7
eyaliwo 7
ka 7
kiraga 7
kumpi 7
kwongera 7
lowooza 7
nnyiriri 7
obwakabaka 7
okukola 7
okusaanawo 7
omukuumi—ogu 7
omuzingo 7
roberts 7
singa 7
syriac 7
tterekero 7
yafuna 7
yakuwa 7
yayagala 7
abasamaliya 6
abasinga 6
abasiraamu 6
aboogera 6
amerika 6
asuubira 6
ataano 6
baakola 6
baakozesanga 6
bali 6
bamanyi 6
bbanga 6
beeyongera 6
bikumi 6
bisinga 6
bisopu 6
bituufu 6
bombi 6
boogera 6
butuufu 6
dda 6
ddi 6
ebigamba 6
ebisooka 6
ebitundu 6
egiyise 6
ekifo 6
ekyakoppololwa 6
ekyali 6
emabega 6
emingi 6
emirembe 6
enjawulo 6
ennukuta 6
enzikiriza 6
gerizimu 6
henry 6
inci 6
james 6
jerome 6
kigambibwa 6
kinaana 6
kiri 6
kisingayo 6
kukozesa 6
kyenda 6
laba 6
lukka 6
lusuuli 6
luther 6
muwendo 6
mwe 6
nabwo 6
nkumi 6
obunnabbi 6
ogwo 6
okubunyisibwa 6
okugamba 6
okuggya 6
okukyusa 6
okwekenneenya 6
olusipeyini 6
olwo 6
omukuumi 6
omukuumiabantu 6
omukuumibayibuli 6
omungereza 6
omusanvu 6
owa 6
oyo 6
paris 6
pulintaweereza 6
tusobola 6
yafuba 6
yakiraba 6
yamaliriza 6
yatandika 6
yavvuunulwa 6
yawona 6
abamasoreti 5
abaruumi 5
ago 5
akimanyi 5
amakulu 5
amaze 5
avvuunula 5
baakizuula 5
baasinga 5
bakabaka 5
bakoppolola 5
bakozesa 5
bayibul 5
beegendereza 5
bina 5
bintu 5
bivvuunuddwa 5
bulaaya 5
buzibu 5
bwino 5
byakozesebwamu 5
byokulabirako 5
charles 5
dublin 5
ebifaananyi 5
ebituufu 5
ebyakozesebwanga 5
ekikatuliki 5
ekikuba 5
ekikulu 5
ekiri 5
ekiyitibwarylandsekirimu 5
ekyuma 5
empandiika 5
enfu 5
ennaku 5
ennyanja 5
ennyiriri 5
ennyumba 5
erimu 5
esangibwa 5
francis 5
i 5
isirayiri 5
kiki 5
kituufu 5
kopi 5
kuvvuunula 5
kwe 5
kyetaagisa 5
ludda 5
lumu 5
lungereza 5
lwenda 5
matongo 5
metzger 5
mingi 5
munnabyafaayo 5
muokuva 5
mwokka 5
myuziyamu 5
nsobi 5
nsuwa 5
ntandikwa 5
obuvunaanyizibwa 5
obwaliwo 5
ogwa 5
okuddamu 5
okufuna 5
okukuuma 5
okulemesa 5
okuna 5
okuwandiikako 5
okuwangulwa 5
okwogerwa 5
omulala 5
omuvvuunuzi 5
oyinza 5
strasbourg 5
tebwakyusibwa 5
timoseewo 5
yalagira 5
yalina 5
yawandiika 5
zaayamba 5
abaasookera 4
abamanyi 4
abapolotesitanti 4
abasatu 4
abatume 4
abawandiisi 4
abayigirizwa 4
aga 4
akali 4
akasanduuko 4
amanyi 4
asibibwa 4
awamu 4
ayogera 4
baagiwandiika 4
baani 4
baasalawo 4
baavumirira 4
baawakanya 4
baba 4
bakiyita 4
balowooza 4
basobole 4
batya 4
bawakanya 4
bayibulilaba 4
bayibulilugandaabantu 4
beatty 4
bifo 4
bufalansa 4
bufirosoofo 4
bulabe 4
byafaayo 4
chester 4
ddiini 4
ddungu 4
ebigendererwa 4
ebina 4
ebyasookera 4
ebyavumbulwa 4
egyazuulibwa 4
egyo 4
ekikyasinze 4
ekimu 4
ekisooka 4
ekitasoboka 4
ekiyitibwasinaitic 4
ekyaliwo 4
emanyiddwa 4
enkola 4
enkyukakyuka 4
ensibuko 4
entuufu 4
eriyitibwa 4
etaano 4
eyavvuunulwa 4
ezaakafulumizibwa 4
ezaalimu 4
ezikulemesa 4
ezisobola 4
gange 4
ggulu 4
gwayo 4
kasasiroekiwandiiko 4
kennyini 4
kisobola 4
kitundu 4
kiyitibwa 4
kutegeera 4
kwaliko 4
kyannyamba 4
kyo 4
kyonooneddwa 4
lewis 4
león 4
library 4
lwaffe 4
lwayirisi 4
maanyi 4
maka 4
mangu 4
martin 4
mayinja 4
mirundi 4
mizingo 4
mpuku 4
munyage 4
mwo 4
mwonna 4
naddala 4
nineeveluganda 4
nnabbi 4
nnyanjula 4
nsanvu 4
ntono 4
nze 4
obadde 4
obubi 4
obuyinza 4
okimanyi 4
okukozesa 4
okusaanyaawo 4
okusaba 4
okutuukira 4
okuwandiikibwamu 4
okwogera 4
oluzaaliranwa 4
omuli 4
omuntu 4
on 4
osaanidde 4
otegeera 4
otwalidde 4
ozitwala 4
peshitta 4
sindika 4
sorbonne 4
ssente 4
st 4
teyavundalugandabayibuli 4
tezaayamba 4
tulabe 4
twasanyuka 4
twasoma 4
tyndale 4
university 4
yaazo 4
yakizuula 4
yakubibwa 4
yalatin 4
yaluŋŋamya 4
yasooka 4
yasookera 4
yattibwa 4
yenna 4
yokka 4
yunivasite 4
zaawerebwa 4
zoogerwa 4
zookebwa 4
abaabanga 3
abaagala 3
abababulooni 3
abajeemedde 3
abakazi 3
abakungu 3
abalongo 3
abameedi 3
abangereza 3
abanoonyereza 3
abateeberezebwa 3
abawakanya 3
abayonaani 3
abeera 3
agakwata 3
agisoma 3
agwanidde 3
akalombolombo 3
akola 3
alfonso 3
amalungi 3
amangu 3
amawulire 3
anchor 3
archa 3
archive 3
ati 3
austen 3
awagira 3
awakanya 3
awalina 3
ayinza 3
baabalanga 3
baabanga 3
baabwe 3
baabyongera 3
baagattamu 3
baakitwalanga 3
baakiwandiikanga 3
baanoonya 3
baanyiiga 3
baasanga 3
baaterekanga 3
baatwalibwanga 3
baayongeramu 3
baazimba 3
babuulira 3
bagiyuza 3
bagoberera 3
bagyokya 3
bakakensa 3
bakkiriza 3
bakoze 3
bakugu 3
bakuusa 3
bakyerabirira 3
bannabyafaayo 3
bano 3
banoonye 3
basanga 3
bassaawo 3
batasiima 3
bateebereza 3
batta 3
bawambye 3
bayibuliabamu 3
bayigiriza 3
bayita 3
bayudaaya 3
biblical 3
bifaananyi 3
bifugibwa 3
bikakasa 3
bikozesebwa 3
bikwatagana 3
biri 3
bituyambye 3
biwagire 3
biyitibwamasoretic 3
bubaka 3
bugenderevu 3
bujja 3
bukwatagane 3
bulamu 3
busingayo 3
butiitiizi 3
buyambi 3
bwabwe 3
bwakoppololwa 3
bwandibadde 3
byabunyisibwa 3
byaliwo 3
byamala 3
catherine 3
dan 3
ddiba 3
de 3
dicti 3
eba 3
ebbali 3
ebbugumu 3
ebibiri 3
ebikirimu 3
ebimala 3
ebimaze 3
ebiriko 3
ebiseera 3
ebisingayo 3
ebisinzibwa 3
ebunyisibwa 3
egisukka 3
egitawera 3
egizuuliddwa 3
ejjinja 3
ekikakasa 3
ekiragiro 3
ekiriko 3
ekitoogo 3
ekiyitibwadiatessaron 3
ekoleddwa 3
ekyasooka 3
ekyoto 3
ekyusizza 3
ena 3
epifanesi 3
ereetedde 3
eriri 3
eririko 3
esingayo 3
esooka 3
etegeerekeka 3
ettaano 3
ettaka 3
ety 3
etz 3
evvuunulwe 3
eyandisangiddwamu 3
eyayagala 3
eyayongera 3
eyitibwalatin 3
eyitibwaleón 3
eyitibwapeshitta 3
ezaakolebwa 3
ezaaliwo 3
ezaasooka 3
frederic 3
gimaze 3
giri 3
gisaanyizibwewo 3
gituyamba 3
giyambye 3
goshengottstein 3
gra 3
green 3
gwamuwa 3
gyali 3
gyatuukira 3
gyokka 3
gyonna 3
heinrich 3
independence 3
kabuga 3
kakensa 3
kenyon 3
kibaddewoko 3
kibeerawo 3
kigamba 3
kikaddiye 3
kikolwa 3
kimusobozesa 3
kirimaanyi 3
kirina 3
kitaffe 3
kitongole 3
kiwanvu 3
kiyinza 3
kkereziya 3
kubunyisa 3
kugisaanyaawo 3
kukyuka 3
kumanya 3
kunoonyereza 3
kusangibwa 3
kutuukirira 3
kutuyamba 3
kuzikirizibwa 3
kwekenneenya 3
kyabuutikirwa 3
kyagenda 3
kyaggwaamu 3
kyaggweerako 3
kyaiberia 3
kyasigala 3
kyerabirwa 3
kyogerwako 3
kyondo 3
layard 3
lukozesebwa 3
lusozi 3
lutandise 3
lutikko 3
makuŋŋaaniro 3
mitono 3
moshe 3
mukama 3
mukutu 3
mulimu 3
munaazimba 3
muno 3
mutabani 3
mutonzi 3
mwekenneenya 3
nnaggomola 3
ntuufu 3
obanga 3
obo 3
obufuzi 3
obugazi 3
obugirimu 3
obujulizi 3
obulamu 3
obuliwo 3
obutakkiriza 3
obwa 3
obwetwaze 3
of 3
okubutegeera 3
okuddukira 3
okufa 3
okuggwaako 3
okukiraba 3
okukolebwa 3
okukozesebwa 3
okukyuka 3
okumaliriza 3
okusaanyizibwawo 3
okusinza 3
okusinziira 3
okusinzizaamu 3
okusookera 3
okutandika 3
okutukakasa 3
okutuukirizibwa 3
okuwakanya 3
okuwaliriza 3
okuyigganyizibwa 3
okuyiikuula 3
okwagala 3
okwewala 3
okweyongerayo 3
ology 3
olulyonaani 3
olumu 3
olupya 3
olwali 3
omugaso 3
omukulu 3
omusango 3
omutukuvu 3
omwesimbu 3
omwoyo 3
onarykigamba 3
online 3
otadde 3
peetero 3
pentateuch 3
samaritan 3
seville 3
sir 3
sitaani 3
soci 3
states 3
tebaagala 3
tebeefiirayo 3
tebikozesebwa 3
tebikyalabika 3
tebyaleetera 3
tebyali 3
tegikoma 3
tekyewuunyisa 3
text 3
tezikyaliwo 3
tulabye 3
twetaaga 3
united 3
x 3
yamuwa 3
yaterekebwa 3
yawagira 3
yayisa 3
yeekaalu 3
yeeyongera 3
yekka 3
yerusaalemi 3
zaalimu 3
zeero 3
zikwatagane 3
zonna 3
abaabiwandiika 2
abaawulira 2
abaayaza 2
ababiri 2
ababuulizi 2
abakkolosaayi 2
abaliwo 2
abalumirirwa 2
abasaba 2
abasomi 2
abassessalonika 2
abatukuvu 2
abavvuunula 2
abaweereza 2
abayizi 2
abeekenneenyanga 2
abeekenneenyezza 2
abimanyi 2
abisengeka 2
abiweereza 2
aboogeddwako 2
afuna 2
agaawandiikibwa 2
agambe 2
agenda 2
agenze 2
agusito 2
ajja 2
ajje 2
ajjukirwa 2
akamu 2
akasaale 2
akaseera 2
akayitibwa 2
akwatibwa 2
akyayigganyizibwa 2
alaga 2
aligolola 2
alikifuula 2
alina 2
amanene 2
amaterekero 2
amugamba 2
anaakulaba 2
antwerp 2
arabic 2
armagh 2
armenian 2
as 2
ashurbanipal 2
ateebereza 2
ategeere 2
atereezezza 2
attottola 2
awali 2
awasonze 2
aweebwa 2
ayambamu 2
azivvuunudde 2
baafa 2
baafuna 2
baagendanga 2
baageraageranya 2
baagisaanyaawo 2
baagukola 2
baagumira 2
baakiraba 2
baakuba 2
baakyalako 2
baalangirira 2
baalina 2
baalivvuunula 2
baamala 2
baamukuuma 2
baamuyita 2
baasanyuka 2
baatandika 2
baawandiikanga 2
baawulira 2
baazuula 2
babiri 2
babizza 2
babyokye 2
badell 2
bafune 2
bafunebayibuli 2
bagategeera 2
bagenze 2
bakakasizza 2
bakatuliki 2
bakazi 2
bakkirizanga 2
balagira 2
balekere 2
balwanyisa 2
bamuwakanya 2
banaayigiriza 2
banditegedde 2
bangiwadde 2
bannabyabufuzi 2
bannanfuusi 2
banoonyereze 2
basatu 2
basengeka 2
basigale 2
basoma 2
basome 2
batayagala 2
batono 2
bavvuunudde 2
bawandiika 2
bayibulimu 2
bayinza 2
beekebejja 2
beesigwa 2
beesunga 2
beewuunya 2
bibulamu 2
biggiddwamu 2
bikyaliwo 2
binoensonga 2
birabika 2
bireetera 2
birowoozo 2
bisaanewo 2
bisobola 2
bitegeerekeka 2
biwagira 2
biwangadde 2
biweebwe 2
bizuulibwa 2
bizuuliddwa 2
bongedde 2
boonoona 2
boyle 2
bubi 2
bubirigi 2
bugirimaani 2
bukatuliki 2
bukiikakkono 2
butandikira 2
buto 2
butuukira 2
buvuddeko 2
buwanvu 2
buzibuwaza 2
buzingiramu 2
bwasaanawo 2
bwawandiikibwa 2
bwongerwa 2
bwonna 2
byagattibwa 2
byakozesebwanga 2
byakwata 2
byalaga 2
byalimu 2
byasangulwamu 2
byasomebwa 2
byaterekebwa 2
byatwalibwa 2
byavvuunulwa 2
byawandiikibwa”ne 2
byokebwe 2
byongeddwa 2
byonoonye 2
colin 2
college 2
coptic 2
cureton 2
dani 2
ddalabayibuli 2
desert 2
diguli 2
ebe 2
ebiba 2
ebiginnyonnyola 2
ebigirimu 2
ebijjukizo 2
ebikadde 2
ebikakasa 2
ebikontana 2
ebikyafu 2
ebimanyiddwa 2
ebimuli 2
ebinene 2
ebirimu 2
ebitaasanguka 2
ebitasobola 2
ebitundutundu 2
ebiwuka 2
ebiwunya 2
ebugwanjuba 2
ebulayo 2
ebuvanjuba 2
ebyaggibwa 2
ebyaliko 2
ebyalimu 2
ebyatwalibwa 2
ebyawandiikibwalefèvre 2
ebyayolebwa 2
eddembe 2
eddungu 2
efugibwa 2
efulumizibwabedell 2
efuuka 2
egula 2
egyaddawo 2
egyali 2
ehovah 2
ekigendererwa 2
ekikujjira 2
ekingi 2
ekipande 2
ekiraga 2
ekirala 2
ekireeta 2
ekirimu 2
ekisingayo 2
ekitangaala 2
ekitiibwa 2
ekituufu 2
ekivuddemu 2
ekiyitibwafivefold 2
ekiyitibwala 2
ekiyitibwarylandsekya 2
ekizibu 2
ekkanisa 2
ekkirizibwa 2
ekoppololwa 2
ekubiddwa 2
ekyakubibwa 2
ekyamwewuunyisa 2
ekyandireeseewo 2
ekyavumbulwa 2
ekyayamba 2
el 2
embi 2
embiri 2
empapula 2
empula 2
encyclopediakigamba 2
enda 2
endowooza 2
enfuna 2
enkulu 2
enkyamu 2
ennimiro 2
ennya 2
ennyingi 2
enoebiwandiiko 2
enoebyafaayo 2
enoengeri 2
ensimbi 2
enteekateeka 2
entongole 2
entono 2
entuumu 2
erangirirwe 2
erina 2
eringi 2
erisukka 2
eriyitibwabritish 2
eriyitibwanitrian 2
eriyitibwathe 2
eriyo 2
erya 2
eryali 2
erye 2
esingamu 2
esobola 2
essaala 2
essanyu 2
essatu 2
essomero 2
etandika 2
ethi 2
eti 2
etterekero 2
etuumibwalatin 2
evvuunulwa 2
ewala 2
eyafulumizibwa 2
eyafuuka 2
eyakozesebwanga 2
eyalimu 2
eyasinziirwako 2
eyasookera 2
eyitibwapeshittayaddamu 2
eyitibwapeshittayavvuunulwa 2
eyitibwaprealfonsine 2
eyitibwasyriac 2
eyongerwamu 2
ezaakozesebwa 2
ezaasinga 2
ezikiikirira 2
ezirabika 2
eziviira 2
eziyitibwatetragrammaton 2
ezoogerwa 2
ezze 2
f 2
fazi 2
ffeeza 2
gaabwe 2
ge 2
ginaatera 2
greek 2
grenfell 2
gusobola 2
gutenberg 2
gwatuyamba 2
gwokka 2
gyawandiikibwa 2
gyazuulibwa 2
h 2
history 2
howard 2
hunt 2
intaneeti 2
internati 2
iran 2
isira 2
jacques 2
jjuuni 2
johannes 2
jpgw 2
juan 2
kaabula 2
kafuumuulampawu 2
kasenge 2
kata 2
katono 2
keller 2
kibayambye 2
kifuuse 2
kigubye 2
kikakasa 2
kikalu 2
kikyaliwo 2
kilmore 2
kimaze 2
kinene 2
kintu 2
kirifuuka 2
kirisoboka 2
kiruubirirwa 2
kisenge 2
kisigadde 2
kisobozesa 2
kitabofivefold 2
kitono 2
kitusanyusa 2
kituuse 2
kiyitibwacuretonian 2
kiyitibwasinaitic 2
kkomera 2
kkuŋŋaaniro 2
kristo 2
kufulumya 2
kugamba 2
kujeemera 2
kukozesebwa 2
kukudduka 2
kulaba 2
kulowooza 2
kumakko 2
kumulemesa 2
kupulo 2
kusengeka 2
kusingapeshittayali 2
kuvunaanibwa 2
kuwandiika 2
kuwangulwa 2
kuyigiriza 2
kyabaawo 2
kyabanga 2
kyaggibwa 2
kyakutaano 2
kyalabika 2
kyaluŋŋamizibwa 2
kyamuleetera 2
kyamuviirako 2
kyamwewuunyisa 2
kyangu 2
kyataataaganya 2
kyazuulibwa 2
kyennyini 2
kyereere 2
kyewuunyisa 2
kyonna 2
latin 2
layibulale 2
libraryeriri 2
lirimu 2
luba 2
lujjudde 2
lukaddiwa 2
lunaku 2
luno 2
lusinga 2
lusipeyiniabakulembeze 2
luvannyuma 2
lwasalawo 2
lwatandika 2
lwebbulaniya 2
lwogerwa 2
mabaluwa 2
manchester 2
mar 2
marsh 2
marshs 2
masiya 2
mbeera 2
meaux 2
mikwano 2
mukristaayo 2
mukwano 2
mulunyiriri 2
mungereza 2
munnaddiini 2
munnasaayansi 2
muntu 2
museummu 2
mutima 2
muwaatwa 2
muyokaana 2
muzigo 2
muzingo 2
mwawandiikibwamu 2
myezi 2
nabyo 2
nakkumu 2
narcissus 2
ngalatin 2
nile 2
nkadde 2
nkomerero 2
nnamaddala 2
nnungi 2
nnyumba 2
noovemba 2
nti“i 2
ntuumu 2
nzijuvu 2
oboolyawo 2
obufirosoofo 2
obugagga 2
obukatuliki 2
obulimba 2
obulombolombo 2
obusingayo 2
obutafaananako 2
obwali 2
ogigeraageranya 2
ogu 2
okubunyisa 2
okubuulira 2
okubuzaabuzibwa 2
okudda 2
okufaananako 2
okufulumya 2
okuggyako 2
okuggyamu 2
okugigula 2
okugonzaamu 2
okukkiriza 2
okukoppolola 2
okukubibwa 2
okulaga 2
okuleetawo 2
okunywevu 2
okusangamu 2
okusatu 2
okusengeka 2
okusingira 2
okusobozesa 2
okuteebereza 2
okutereeza 2
okutereka 2
okutonaatona 2
okuvvuunulalefèvre 2
okuwandiikibwamuyee 2
okuzibunyisa 2
okuzivvuunula 2
okuzzibwa 2
okwegendereza 2
okwesomera 2
olaba 2
olivétan 2
olowooza 2
olufalansa 2
olugendo 2
olukalala 2
olukasitiiliya 2
olukiiko 2
olukwe 2
olulala 2
oluli 2
olutalo 2
oluvvannyuma 2
olwatuula 2
omufalansa 2
omukatuliki 2
omukisa 2
omukono 2
omukulembeze 2
omuoxford 2
omusuuli 2
omutume 2
omuyambi 2
onal 2
oneza 2
opic 2
orts 2
oxford 2
p 2
peshittaya 2
psalter 2
psalterkyalimu 2
robert 2
rylands 2
scotland 2
septuagint 2
septuagintera 2
septuagintnge 2
septuagintye 2
sinaiticusnecodex 2
slavonic 2
smith 2
so 2
ssaabalabirizi 2
ssande 2
standard 2
stapulensis 2
syriackubanga 2
tabannamaliriza 2
tamanyi 2
tannabaawo 2
tannatandika 2
tarragona 2
tatian 2
tebaagalabantu 2
tebaagalira 2
tebabeera 2
tebakyayagalaseptuagint 2
tebannafuna 2
tebasobola 2
tebiri 2
tekibikkulwa 2
tekinnatandika 2
tekyatuukirira 2
tekyatuukiriramu 2
tennafulumizibwa 2
tennatandika 2
terukyategeerekeka 2
tewaaliwo 2
teyabanyega 2
teyakkiriza 2
teyakyusibwakyusibwa 2
teyalina 2
teyamanyibwa 2
teyasobola 2
teyayingira 2
toyinza 2
trinity 2
ttendekero 2
ttendo 2
tugirina 2
tusoma 2
ultra 2
v 2
valley 2
vaticanus 2
vulgateate 2
vulgatenesyriac 2
vulgatenga 2
waaliyo 2
waffe 2
waggulu 2
wano 2
werner 2
wycliffe 2
yaakategeera 2
yabavumirira 2
yabeerera 2
yaddukira 2
yafuuka 2
yagenda 2
yageraageranya 2
yageraageranyiza 2
yakibikkula 2
yakikola 2
yakikuba 2
yakisanga 2
yakizibuwaza 2
yakoppololwa 2
yakozesanga 2
yakwatibwa 2
yalekera 2
yalwaddaaki 2
yalwanirira 2
yamala 2
yamanya 2
yamusobozesa 2
yamuwagira 2
yamuyambako 2
yandirekedde 2
yandiyambye 2
yannyonnyola 2
yasalawo 2
yaseptuaginteya 2
yasobola 2
yasoma 2
yataputangamu 2
yateekebwa 2
yatuumibwagreek 2
yatuumibwaphiloxenian 2
yavumbula 2
yawa 2
yawandiikira 2
yayanika 2
yayiga 2
yayiggannya 2
yayiiya 2
yazitereeza 2
yeekenneenya 2
yeemalira 2
yeesigamiziddwa 2
yeetaagisa 2
yeeyambisa 2
yeeyita 2
yennyonnyoleko 2
zaakyo 2
zaalowoozebwako 2
zaasengekebwa 2
zaawandiikibwa 2
zaayongerwamu 2
zaggyamu 2
zavvuunulwa 2
zeekwata 2
zeesigika 2
zeeyongera 2
zeeyongeraabantu 2
zef 2
zeffaniya 2
zifaananira 2
zigabanyiziddwamu 2
zino 2
zisobole 2
zivvuunuddwa 2
ziwandiikiddwa 2
ziweddewo 2
zombi 2
zzaabu 2
