mu 536
num 432
era 246
ne 196
nga 185
ku 183
nnali 166
nnyo 140
bayibuli 137
nti 134
yakuwa 133
bwe 130
na 116
ba 105
naye 85
olwa 79
no 70
okuba 66
katonda 64
kkumi 64
obulamu 63
gye 62
bwange 60
abajulirwa 57
abantu 55
wa 52
okuyiga 48
bye 42
ebya 42
omu 42
maama 41
ekyo 40
kye 39
engeri 38
nze 38
yali 37
ate 34
wange 34
oluvannyuma 33
za 33
emu 32
bbiri 31
lukumi 31
lwenda 31
ya 31
buli 30
kiseera 30
nnatandika 30
nnya 30
ekya 29
emyaka 29
ebyo 28
kya 28
nnalina 28
abiri 26
bulamu 26
eza 26
mwenda 26
njagala 26
wadde 26
bya 24
aba 23
ebikwata 23
ebintu 23
ekiseera 23
lumu 23
musanvu 23
nge 23
abalala 22
bingi 22
gwe 22
kati 22
munaana 22
baali 21
ennyo 21
ndi 21
owa 21
poliisi 21
ensi 20
bwa 19
myaka 19
ngo 19
okukola 19
ssatu 19
tena 19
ebiragalalagala 18
kyonna 18
mukaaga 18
bo 17
bwali 17
emirembe 17
awaka 16
awo 16
be 16
empaka 16
essanyu 16
nnakiraba 16
nsi 16
okuva 16
yakyusaamu 16
amaanyi 15
bajulirwa 15
enkyukakyuka 15
ennaku 15
kibuga 15
kyokka 15
lwa 15
nneeyongera 15
obo 15
okugenda 15
omuzannyo 15
amateeka 14
ayagala 14
bawerekera 14
ebyafaayo 14
eyo 14
kungufu 14
mukyala 14
nnabanga 14
nnayiga 14
okuzannya 14
okwagala 14
olwo 14
omujulirwa 14
omuntu 14
pikipiki 14
yange 14
abaana 13
bikolwa 13
bulungi 13
byonna 13
e 13
eyali 13
ngeri 13
nnazaalibwa 13
okukozesa 13
ssente 13
taata 13
abo 12
asatu 12
ebikolwa 12
gwa 12
kyali 12
lya 12
nkimanyi 12
nnina 12
nsanvu 12
obulungi 12
tuli 12
twali 12
waliwo 12
we 12
zange 12
ataano 11
ddala 11
egya 11
ekintu 11
emirundi 11
gumu 11
kubanga 11
lukuŋŋaana 11
mingi 11
obukambwe 11
okufuna 11
sirina 11
amazima 10
bange 10
gyange 10
mukambwe 10
nabo 10
ndowooza 10
njiga 10
nkola 10
nkuŋŋaana 10
nnasalawo 10
ogu 10
okubeera 10
okulaba 10
okusoma 10
ttaano 10
yesu 10
abamu 9
agali 9
babiri 9
bibiri 9
bwenkanya 9
ebirala 9
ekyokulabirako 9
emmundu 9
empisa 9
joseph 9
kimu 9
lwaki 9
lwe 9
mikwano 9
muntu 9
nnafuna 9
nnagenda 9
nnagendanga 9
omulimu 9
yatandika 9
ye 9
zabbuli 9
ali 8
bitaano 8
bubiri 8
byali 8
erinnya 8
kenda 8
kitono 8
kyenda 8
latvia 8
lebanooni 8
maka 8
mpaka 8
mpulira 8
mutwalo 8
nneetaaga 8
nsobole 8
ntandika 8
okumala 8
omuwala 8
si 8
wiiki 8
zzaala 8
abaali 7
ana 7
anyuddwamu 7
ebibi 7
ebiri 7
ekikulu 7
ekyali 7
emikwano 7
ensonga 7
ga 7
kinaana 7
kkereziya 7
kwe 7
leero 7
musanyufu 7
nkyali 7
nnalaba 7
nnanyumirwanga 7
nnawulira 7
nnyinza 7
obukulu 7
okukolera 7
okulekera 7
olunaku 7
tayikondo 7
ze 7
abasirikale 6
amawulire 6
amerika 6
annyambe 6
bansaba 6
bantu 6
basanyufu 6
bintu 6
bungi 6
date 6
ebibuuzo 6
ebimu 6
ekigendererwa 6
ekitiibwa 6
enjawulo 6
eri 6
gya 6
kibiina 6
kifo 6
kkomera 6
maaso 6
matayo 6
nange 6
nkaaga 6
nnakitegeera 6
nnaku 6
nnasooka 6
nnaweza 6
obanga 6
obutali 6
obwakabaka 6
okufuuka 6
okusobola 6
okuyigiriza 6
olwekyo 6
omulungi 6
omuto 6
oyo 6
timoseewo 6
yaŋŋamba 6
zaabwe 6
abakristaayo 5
abamenyi 5
amakulu 5
amalungi 5
awagamba 5
awamu 5
ayitibwa 5
baganda 5
bannange 5
bungereza 5
buto 5
ebyawandiikibwa 5
eddiini 5
eggwanga 5
ekibuga 5
ekimu 5
ekyawandiikibwa 5
emibi 5
enkomerero 5
erya 5
eryo 5
evija 5
ezaali 5
gwabaseball 5
gyonna 5
kabi 5
kisa 5
kitundu 5
kityo 5
kwange 5
kyanneewuunyisa 5
lingi 5
lunaku 5
maanyi 5
mangu 5
mbeera 5
mexico 5
muganzi 5
mujulirwa 5
mukwano 5
muto 5
mwannyinaze 5
nfuna 5
nnabatizibwa 5
nnakizuula 5
nnakola 5
nnakozesanga 5
nnakulira 5
nnalabanga 5
nnalekera 5
nnalowoozanga 5
nnamaddala 5
nnasaba 5
nneebaza 5
nneegatta 5
nnyingi 5
nsobola 5
obumenyi 5
okuddamu 5
okumanya 5
okumpi 5
okunoonya 5
okuyimba 5
okwenyigira 5
oluusi 5
omukyala 5
omwenge 5
omwoyo 5
tuyamba 5
yannyamba 5
yazaalibwa 5
yokaana 5
yonna 5
abakkolinso 4
abato 4
aga 4
akakonge 4
ako 4
amagulu 4
anita 4
annunziato 4
baafa 4
bakiggala 4
banjigiriza 4
bannantameggwa 4
bazadde 4
bbomu 4
bifo 4
bikwata 4
bukadde 4
butuufu 4
bwangu 4
bwonna 4
china 4
ddiini 4
ebizibu 4
egamba 4
ekirala 4
ekiri 4
ekiyitibwa 4
emikono 4
emisango 4
emizannyo 4
emmotoka 4
emyezi 4
enda 4
eno 4
enviiri 4
esatu 4
essuubi 4
etali 4
ewaka 4
eya 4
eyigiriza 4
gange 4
gwange 4
jpg 4
kafulu 4
kibinja 4
kugasa 4
kusula 4
kutendekebwa 4
kyandeetera 4
kyangu 4
kyankwatako 4
kyannyamba 4
lutalo 4
mbizzaawo 4
mirundi 4
mizannyo 4
mmanyi 4
mmaze 4
mpolampola 4
muvuzi 4
muzannyo 4
mwe 4
nakyo 4
nguudo 4
njawulo 4
nkizo 4
nnabbanga 4
nnaddamu 4
nnafuuka 4
nnakolanga 4
nnakoma 4
nnamenyanga 4
nnava 4
nnawasa 4
nsaba 4
nsula 4
nyumirwa 4
nzannya 4
nzikiriza 4
oba 4
obugwenyufu 4
oku 4
okubba 4
okubuulira 4
okukuba 4
okukyusa 4
okulwanyisa 4
okunjigiriza 4
okunywa 4
okusaba 4
okusinga 4
okutulabirira 4
okuvuga 4
okuwulira 4
okuyamba 4
okuzannyira 4
okwefuga 4
okweyongera 4
olunene 4
omubiri 4
omubuulizi 4
omulala 4
omuzannyi 4
omwaka 4
omwesigwa 4
singa 4
tebwali 4
univ/art 4
univ_sqr_xl 4
url 4
wabula 4
wayiseewo 4
yakiraba 4
abalalaweereza 3
abawola 3
aboogera 3
ajja 3
akaakubibwa 3
akatabo 3
akoze 3
alina 3
amagezi 3
amaka 3
ampe 3
ayogera 3
baafuuka 3
baatandika 3
babuulizi 3
bafuba 3
bakkondo 3
bandaga 3
bangi 3
bannyaniriza 3
bayigiriza 3
bbanka 3
binnyambye 3
bonna 3
bubi 3
bukambwe 3
bumu 3
bwaffe 3
bwakabaka 3
byankwatako 3
canada 3
costa 3
ddoola 3
ebiseera 3
ebyali 3
ebyokulabirakoabasirikale 3
egimu 3
egiwera 3
ekiro 3
ekiruubirirwa 3
ekisa 3
ekisuubizo 3
emirimu 3
empya 3
ensimbi 3
essaawa 3
estonia 3
ezo 3
ffembi 3
gaffe 3
gu 3
gwali 3
gwokka 3
isaaya 3
josephlugandaabasirikale 3
kampuni 3
kari 3
katono 3
kintu 3
kiraabu 3
kirala 3
kizimbe 3
kubba 3
kukozesa 3
kumpi 3
kusoma 3
kusooka 3
kuvuga 3
kuzannya 3
kyalo 3
kyawandiikibwa 3
lottery 3
lugar 3
luggi 3
magezi 3
makulu 3
makya 3
mazima 3
mba 3
mpangula 3
mpeereza 3
muliro 3
munnange 3
museegu 3
mutima 3
muvubuka 3
mwaka 3
mwennyamivu 3
ndaba 3
ndisasula 3
njize 3
nkula 3
nkumi 3
nnabagamba 3
nnafunanga 3
nnagambanga 3
nnakkiriza 3
nnakubanga 3
nnakwatibwako 3
nnalimu 3
nnamala 3
nnamalanga 3
nnasanga 3
nnasobola 3
nnawereza 3
nnayitibwa 3
nneetaba 3
nnyamba 3
nsoma 3
ntya 3
ntyo 3
nzekka 3
obudde 3
obusungu 3
obutiini 3
obuvune 3
okubiri 3
okubuulirako 3
okufa 3
okugamba 3
okukumpanya 3
okukyusiza 3
okulekayo 3
okumpa 3
okumuyigiriza 3
okusabira 3
okusanyusa 3
okussa 3
okutandika 3
okutendeka 3
okutendekebwa 3
okuwangula 3
okuwoolera 3
okwemalira 3
okwetaba 3
okwonoona 3
olunyiriri 3
olusuku 3
olwali 3
omukisa 3
omusajja 3
rica 3
riga 3
saali 3
saddamu 3
sakkiriza 3
simanyi 3
ssaza 3
tekyali 3
tiimu 3
ttaka 3
tulina 3
twazaalibwa 3
wagamba 3
weereza 3
yabanga 3
yaddamu 3
yafa 3
yafiira 3
yafuna 3
yagamba 3
yakola 3
yakolanga 3
yatukuza 3
yitale 3
zeero 3
ababa 2
ababbanga 2
abagaba 2
abagoberezi 2
abajjanga 2
abakukusa 2
abakulira 2
abakulu 2
abaruumi 2
abatizibwa 2
abaweereza 2
abayisibwa 2
abazannyi 2
abeenyigira 2
adel 2
afuna 2
afuuse 2
agendanga 2
akaalimu 2
akabokisi 2
akabonero 2
akana 2
akantu 2
akataano 2
akatono 2
akaweereza 2
akonkona 2
aliko 2
alwana 2
amaduuka 2
amanene 2
amasannyalaze 2
amawanga 2
amazzi 2
ambuulira 2
anaatera 2
anjagala 2
anjigiriza 2
annyonnyola 2
anoonya 2
anza 2
asaba 2
asoma 2
australia 2
awali 2
awavvuunulirwa 2
ayiga 2
baamukyalira 2
babeera 2
babonaabona 2
bakatoliki 2
bakatuliki 2
bakozesa 2
bali 2
balwana 2
bambadde 2
bandibuulidde 2
banjagalanga 2
bankozesanga 2
bantumanga 2
bantya 2
bassa 2
batandika 2
baweereza 2
bazannyi 2
bazizza 2
beeyisa 2
beirut 2
belize 2
bibbe 2
bibuuzo 2
bikola 2
bimuwunza 2
biragalalagala 2
birowoozo 2
biseera 2
bitundu 2
bituufu 2
bivvulu 2
bizibu 2
bruce 2
budde 2
bufalansa 2
bugirimaani 2
bukiikaddyo 2
bulina 2
bulongoose 2
bupikipiki 2
buwa 2
buweereza 2
buzibu 2
bwalinnakulira 2
bwangemu 2
byaffe 2
byakasukibwanga 2
byange 2
byannyamba 2
byawandiikibwa 2
churchekisangibwa 2
dda 2
ebbiri 2
ebibiina 2
ebigambo 2
ebinene 2
ebirowoozo 2
ebirwanirira 2
ebitabo 2
ebizimbe 2
ebyamaguzi 2
ebyankwatako 2
ebyantwaliriza 2
eddembe 2
effujjo 2
ekibi 2
ekidiba 2
ekifo 2
ekikozesa 2
ekikuumirwamu 2
ekisangibwa 2
ekisinga 2
ekitendeka 2
ekitono 2
ekiyitibwamaronite 2
ekugira 2
ekyandeetera 2
ekyannyamba 2
ekyasinga 2
embeera 2
embi 2
embuuza 2
emenya 2
emingi 2
emizinga 2
empanvu 2
endeko 2
enkeera 2
enkolagana 2
enkulu 2
ennamba 2
ennyimba 2
ensalo 2
ensibuko 2
entambula 2
enteekateeka 2
enzaalwa 2
eremereddwa 2
erimu 2
eriri 2
erye 2
esinga 2
eskilstuna 2
ettutumu 2
eyatandika 2
ezitali 2
eŋŋanda 2
firimu 2
gamba 2
ggwanga 2
isira 2
jjajja 2
jjulaayi 2
jorge 2
josephebyokulabirakoabasirikale 2
kaaliko 2
kaasammeeme 2
kannyiiza 2
kaseera 2
kasobola 2
ki 2
kijja 2
kikola 2
kikumi 2
kimuleese 2
kino 2
kinsanyusa 2
kisaawe 2
kitusanyusa 2
kiwayi 2
kkanisa 2
kugenda 2
kukomya 2
kukyalira 2
kukyanga 2
kulya 2
kuyiga 2
kwa 2
kwebaka 2
kyakyusa 2
kyaleetawo 2
kyannewuunyisa 2
kyateekanga 2
lee 2
lithuania 2
london 2
lusuku 2
lwange 2
lwokka 2
lyange 2
lye 2
mateeka 2
mbabanjiza 2
mbadde 2
mbataasa 2
mbeerewo 2
mbuulira 2
mirembe 2
mitindo 2
mitwetwe 2
mmalayo 2
mmubbako 2
mmubuuza 2
montreal 2
mpangulula 2
mubbi 2
mukakafu 2
mukatuliki 2
mukeeka 2
mukisa 2
mukugu 2
mukujjukujju 2
mulamu 2
mumalirivu 2
mumenyi 2
mututumufu 2
muwendo 2
muyimbi 2
muzigo 2
mwo 2
mwonna 2
mwoyo 2
naawe 2
nammala 2
nayo 2
nfunye 2
nfuuke 2
ngalo 2
ngitwala 2
nicaragua 2
njala 2
njegoyego 2
njogereza 2
nkiraba 2
nkolagana 2
nkuguka 2
nkulembeza 2
nkyanyumirwa 2
nkyukakyuka 2
nnaaba 2
nnabuulirako 2
nnaferanga 2
nnagezaako 2
nnagobebwa 2
nnajjukira 2
nnakiriza 2
nnakoppa 2
nnakyalirako 2
nnalekayo 2
nnalowooza 2
nnamuleka 2
nnamuwanga 2
nnandibadde 2
nnantameggwa 2
nnanywa 2
nnasalako 2
nnasangayo 2
nnasanyuka 2
nnasibibwanga 2
nnasigala 2
nnasoma 2
nnasulanga 2
nnatambulanga 2
nnatamiira 2
nnatanzibwanga 2
nnategeera 2
nnatendekebwa 2
nnatendekebwanga 2
nnateranga 2
nnatundanga 2
nnatya 2
nnavubuka 2
nnawangula 2
nnawona 2
nnayagala 2
nnazannyirangamubaseball 2
nnazuukuka 2
nnazuukukanga 2
nneebase 2
nneebuuza 2
nneegezaamu 2
nneekolera 2
nneenyigira 2
nneenyigiranga 2
nneeraliikirira 2
nneesuula 2
nneetamiddwa 2
nneetegekera 2
nneewuunya 2
nneeyisangamu 2
nneeyongere 2
nnoonya 2
nnwanyisaamu 2
nnyanja 2
nnyumba 2
nsonga 2
ntamiira 2
ntendeka 2
ntendekebwa 2
ntuuseemu 2
nzirise 2
obubonero 2
obugenda 2
obukodyo 2
obumanyirivu 2
obunene 2
obusawo 2
obuseegu 2
obutayosa 2
obuto 2
obwo 2
ofiisi 2
ogutazikira 2
ogwo 2
okubaawo 2
okubannali 2
okubatizibwa 2
okubikomya 2
okufaananako 2
okufaayo 2
okufuga 2
okufuula 2
okugatta 2
okugendanga 2
okujja 2
okujjuzaamu 2
okukanika 2
okukolagana 2
okukuguka 2
okukukusa 2
okulababaseball 2
okulaga 2
okulowooza 2
okulwana 2
okumbuulira 2
okupanga 2
okupangulula 2
okupangululapangulula 2
okusalawo 2
okusanga 2
okusengukira 2
okusiiba 2
okusiima 2
okutegeera 2
okutunda 2
okututwala 2
okutuuka 2
okutuusa 2
okuvuganya 2
okuweereza 2
okuyigirizibwa 2
okuzannyisa 2
okwa 2
okwebuuza 2
okwegatta 2
okwetta 2
okweyisa 2
okweyita 2
okwo 2
olulimi 2
olumu 2
oluwalabu 2
omucayina 2
omugabi 2
omugumiikiriza 2
omukulu 2
omulamu 2
omululu 2
omunda 2
omusono 2
omutwe 2
omuvubuka 2
omuwendo 2
omwami 2
omwo 2
otwalidde 2
quebec 2
rmaysh 2
rooma 2
saatwalibwanga 2
saawuliranga 2
sanna 2
sibitwala 2
sijjukira 2
sikirinaako 2
sinnagenda 2
siri 2
siryerabira 2
siseka 2
sisobola 2
ssaala 2
ssanyu 2
ssiri 2
ssomero 2
ssuubi 2
sweden 2
talibeerawo 2
tebaalekayo 2
tebyanga 2
tekyabasanyusa 2
tekyasoboka 2
tetulina 2
tubadde 2
tubutwale 2
tufuuka 2
tugitwala 2
tuzannya 2
twabatizibwa 2
twafumbiriganwa 2
twagendangayo 2
twasindikibwa 2
twaweerezaako 2
twetaaga 2
waffe 2
waka 2
wateekwa 2
wendi 2
yabeeranga 2
yafuba 2
yafubanga 2
yafuukira 2
yajjuzaamu 2
yakiraga 2
yaleekaanangamu 2
yalina 2
yampa 2
yandaga 2
yandeetera 2
yangulira 2
yankwantanga 2
yannoonyanga 2
yantwalanga 2
yatulekawo 2
zaabanga 2
zaabwatukanga 2
zaffe 2
zikutuddeko 2
zimu 2
zokka 2
zonna 2
zzaabu 2
